{
	"anumber": "A10017891",
	"id": "A10017891_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0009/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 1910, 1955, 2023, 1909]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 3 11 ALIEN REGISTRATION STATEMENT OF FACTS FOR PREPARATION Name LEE SHEY GIN SECTION OF LAW 316(a) (12) No. A 10-017-891 (1) My correct name full, true, and is SHEY GIN GINA WONG OI. (Full, true name. without abbreviations) (2) My present place of residence is D-PAUL BOSTON, SUFFOK MASS 02/18 PLACE, (Number and street) (City or town) (County) (State) (ZIP Code) (3) I was born on 9 20 1910 in CANTON, Toy SUN, CHINA (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) (4) I am MARRIED and have 2 living children. The first name of my husband or wife is (was) HARRY WONE oi (Single: married; divorced; widowed) we were married on / 10 1928 at CANTON Toysun CHiNA ; he or she was born (Month) (Day) (Year) (City or town) (State or country) at CANTON, Toy Sun, CHINA on 10 8 1909 ; (City or town) (County, district. province. or State) (Country) (Month) (Day) (Year) entered the United States at ALASKA on 2 13 1955 for permanent residence in (City or town) (State) (Month) (Day) Year) with me the United States and now resides apart from me at ; and was naturalized (Show full address if not living with you) on at Certificate No. (Month) (Day) (Year) (City or town) (State) or became a citizen by ; his or her Alien Registration No. is (5) I was lawfully admitted to the United States for permanent residence on 2 13 1955 (Day) (Year) Any ; (under the name (Month) of LEE SUEY GiN at BOSTON, MASS. on the 13 (Name of vessel of other means of conveyance) (6) I have resided continuously in the United States of America since 3/13/1955 (City) (State) and continuously in the State of MASS., where I now live since 1955 MASSA 5 years I have been physically present in the United States for an aggregate period of 60/100mls /months. 2/55 and during the past (7) I (have, have not) previously filed petition for naturalization No. on (Month) (Day) (Year) at in the (8) I wish the (City) naturalization court to change (State) my name to GiNA SaL of 17 make (Give full name desired or state \"None\" (9) Since such lawful admission, I have not been absent from the United States (for a period or periods of 6 months or longer) except as follows (if none, state \"None\") none DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT (Month, day, year) OF CONVEYANCE (Month. day, year) OF CONVEYANCE none none none None none 2-9 (10) I have children: Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), otherwise (No.) give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date 20 (f) Port of Entry (g) Alien (Country) Born of Entry Registration No. (h) Now Living At- 21 Rita Junny 22 M Born F 23 Broofline 24/no other"
}
