{
	"anumber": "A10001331",
	"id": "A10001331_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10001331_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form G-135, United States Department of Justice - Identification Division"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1956, 1890, 1878]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form G-135 Agency Name Check (Rev. 1-15-59) UNITED STATES DEPARTMENT OF JUSTICE 2278 District Immigration and Naturalization Service File No. BUFFALO Y. A10 001 331 Sub-office BANY Date Albany PM 2:23:961 MAR 13 AM 8.55 Feb. 23, 1961 DIRECTOR, FEDERAL BUREAUHOF INVESTIGATION, HILL DEPARTMENT OF JUSTICE, Albany New York 2278 Washington 25, D.C. Attention: IDENTIFICATION DIVISION MAY 10 1961 Please furnish a copy of any criminal record shown in the fingerprint records of your Bureau con- cerning the following person, whose fingerprints are (not) attached. NAME (Surname in CAPS, First, Middle) DATE OF BIRTH SEX COLOR MARITAL 00 STATUS April 23, 1878 M W LIVIN, Wladimir F. PLACE OF BIRTH (City, province or state PRESENT NATIONALITY S M & country) D W Vladivostock, Russia Stateless ALIASES (Identify maiden name or nicknames) 5.3057 PARENTS' NAMES (Include present address, if known) -- U HEIGHT WEIGHT EYES HAIR COMPLEXION IDENTIFYING MARKS OR SCARS 5-7 163 grey grey fair None by B RESIDENCE LAST FIVE YEARS (Street & No., RFD, etc.) (City, state and country) FROM 22 Forest Drive, Albany, NY 1956 piel And Present PRIOR RESIDENCES, IF AVAILABLE EMPLOYMENT LAST FIVE YEARS (Employer's name and address) OCCUPATION OR PROFESSION FPS NOT TO NONE MAR FROM 1961 NAME to 6 PRIOR OCCUPATIONS (Not included in above) To SPOUSE (Full name & any other names used, & present address, if not same as above) DATE OF BIRTH Anna W. Livin May 10, 1890 PLACE OF BIRTH (City, province or Vladivos , ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) NONE LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U.S.) NYC. 3/6/56; Perm. Res. PREVIOUS NUMBERS ASSIGNED (Milit. S/N; passport; social security; FBI; etc., identify each) PREVIOUS REPORTS FURNISHED BY FBI: NO YES If yes attach list of reports. REASON FOR REQUEST DEPORTATION BENEF. PB #: APPLICANT FOR: Other (Specify) PROCEEDINGS ADM. TO U.S. ADJ. OF STATUS SPONSOR PB #: FOR RELIEF, OF NATZ RETURN TO: DISTRICT DIRECTOR, (1) 2/21/61 fale noty zilly U.S. Immigration and Naturalization Service 312 Old Post Office Bldg., 12th & Penna. Ave., N.W. FBI-IDENTIFICATION DIVISION Assistant Commissioner Washington 25, D.C. Investigations"
}
