{
  "anumber": "A10017891",
  "id": "A10017891_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Naturalization, 10 017 891"
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023,
        1976
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "medium"
      },
      "marital_status": {
        "marital_status_llm_v1": "married"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1976
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "34D Paul Place, Boston, Mass. 02118"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "Screened by NARA, 9/6/2023 JUICE CA TO BE FORWARDED TO No. 10503082 IMMIGRATION AND NATURALIZATION SERVICE CATE 0 Pelilion No. 395297 DUPLICATE AlienRegistration Na 10 017 891 Personal description of holderas of date of naturalization: Date of birth September 20, 1910, sex female complexion medium coloroloyes brown weight 127 pounds; visible distinctive marks color of hair black height 5 feel 2 inches; none Maritalstatus married Country of formernationality Ghina I certify that the description above given is brue, and that the photography affixed hereto is a likeness of me. / Gina wong oi ( Complete and true signature of holder) UNITED STATES OF AMERICA DISTRICT OF MASSACHUSETTS } SS: Beitknown that at a termolthe District The United States Court of held pursuant, to law at Boston on July 5, 1976 Gina Wong oi the Court having found that then residing at 34D Paul Place, Boston, Mass. 02118 inlends loreside permanently in the United. States when sorrequired by the naturalization Laws of the United States), had in all other respects, complied with the applicable, provisions of such naturalization laws, and was entilled do be Seal admilled socilizenship, thereupon ordered that such person be and(s)hewas admilled as a cilixen of the United States of America. Intestimony whereoft thesealoft the courtis hereunto, affixed this 5th dayof July Seventy-six in the year of our. Lord nineleen hundred and GEORGE F. McGRATH IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Apna R. Collins Deputy Clerk. FOSUCE"
}