{
	"anumber": "A10001331",
	"id": "A10001331_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10001331_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "26-A, Military Personnel Security Questionnaire"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1916]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2 (6) Have you ever, in the United States or in any other country, committed any crime or offense; or been arrested, charged with violation of any law or ordinance, summoned into court as a defendant, convicted, fined, imprisoned, or placed on probation or parole; or forfeited collateral for any act involving a crime, misdemeanor, or breach of any law or ordinance? Yes No. If \"Yes\" give the following information for every case. WHEN WHERE (City) (State) (Country) OFFENSE INVOLVED OUTCOME OF CASE (a) (b) (c) (d) (e) (7) List each organization, club, or society in the United States or in any other country that you have been a member of at any time, and the dates of membership in each. (If none, write \"None.\") (a) NONE 19 to 19 (b) , 19 to 19 (c) 19 to 19 (d) , 19 to 19 (e) , 19 to 19 (f) 19 to 19 (g) , 19 to 19 (8) Have you at any time been a member of the Communist Party in the United States or any other country Yes No. If \"Yes\" give name of country and dates of membership: (9) If you have ever filed a declaration of intention, state when NO (10) Have you borne any hereditary title or have you been of any order of nobility in any foreign .state? Yes No. (11) Have you ever been a patient in a mental institution, or have you ever been treated for a mental illness Yes No. (12) Are deportation proceedings pending against you, or have you ever been deported or ordered deported, or have you ever applied for suspension of deportation or for preexamination Yes No. (13) Do you owe any taxes to the Government? Yes No. State last year you filed a Federal income tax return no (14) Have you ever represented yourself to be a United States citizen? Yes No. in (15) If male, did you ever register under United States Selective Service laws or draft laws ? Yes No. If \"Yes\" give date you registered Were you ever exempted from service because of conscientious objections, alienage, or other reasons? Yes No. If \"Yes,\" state reasons (16) If you ever served in the Armed Forces of the United States, state branch NO (Army, Navy, etc.) from , 19 to 19 ; Service No. ; type of separation ; reason for separation: alienage conscientious objections (Honorable, Dishonorable, etc.) other (If \"other\" state details) (17) If the law requires it, are you willing (a) to bear arms on behalf of the United States? Yes No; (b) to perform noncombatant services in the Armed Forces of the United States? Yes No; (c) to perform work of national importance under civilian direction? Yes No. (18) Have you ever deserted from the military, air, or naval forces of the United States while this country was at war? Yes No. Have you ever left the United States or the jurisdiction of the district where you registered for the draft to avoid being drafted into the military, air, or naval forces of the United States? Yes No. (19) Answer \"Yes\" or \"No\" to each of the following parts of this question. At any time during the last 5 years, (a) did most of your income come from illegal gambling? NO (b) have you committed adultery? NO (20) Answer \"Yes\" or \"No\" to each of the following parts of this question. (a) Have you ever been a prostitute or in any way connected with prostitution? NO (b) Have you ever been a narcotic drug addict or dealt in any way in narcotic drugs? NO (21) List here every name by which you have ever been known and which is not shown on page 1, including maiden name, if any: GOLDEN STEAD PETITIONED TO HAVE NAME CHANGED TO LIVIN ON 5-29-1916 The I the the it"
}
