{
  "anumber": "A10017891",
  "id": "A10017891_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/6/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        1929,
        1920,
        2023,
        1964,
        1927,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 Both children are married and both were born in China. He stated that his daughter was admitted to the United States as a citizen, and that his wife was admitted as the wife of a United States citizen. He also claimed three immigration sons: 1. OI Kwong Hing 2. OI Kwong Tai 3. OI Kwong Nam None of the above-mentioned three sons ever entered the United States as the sons of this SUBJECT. They are non-existent. (INVESTIGATOR'S NOTE: Investigation is being conducted regarding SUBJECT's daughter, WONG Mee Ling. Her file number is AFOIA (6), SUBJECT WONG Gim Lee first entered the United States at Boston, Massachusetts on October 4, 1920 as the son of a United States citizen, OI Jim Toy, and at that time he used the identity of OI Gim Lee. His second entry was at Boston in 1929 after a trip to China in 1927. His third entry was in 1939 at Boston after a trip to China in 1937. On his first entry he had in his possession an affidavit executed by his immigration father and on his other two trips he had in his possession a citizen's return certificate. On all entries he claimed to be a citizen of the United States. He now states that he entered the United States illegally on all occasions. His immigration father and immigration mother were also his true parents. His immigration brothers are as follows: 1. OI Gim Shang 2. OI Gim See 3. OI Gim Toon They are nonexistent and no one by these names ever entered the United States claiming to be the son of OI Jim Toy. In regard to his native village, he stated that all the inhabitants had the surname of WONG; that the village consists of a new and old village; that there were about 200 inhabitants in the old village and there were four or five houses in the new village, and that the village is located in Nor Gim Heung. He was then questioned as to why he made sworn statements under oath before this Investigator on February 18, 1964. He stated that his brother, GIM HEE's son, was attending West Point and he did not Boston, Mass., 8/10/66 -3- A-12 738 876; A-10 017 891"
}