{
	"anumber": "A10017891",
	"id": "A10017891_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT, I-215A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1910, 1955, 1953, 2023, 1927]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 Form I-215A (Rev. 3-25-65) UN ED STATES DEPARTMENT OF JL TICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM AFFIDAVIT LEE SUEY GIN A10 017 891 IN RE: FILE NO. EXECUTED AT JFK Federal Building, Boston, Mass. DATE August 4, 1966 Before the following officer of the U.S. Immigration and Naturalization Service: Charles J. casey, Investigator Wong, Interpreter Present: Jos. F. O'Neil, Esq., 100 State St. LEE SUEY GIN Boston, Mess. I, , acknowledge that the above-named officer has identified himself to me as an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement in the above matter pursuant to such authority. I am willing to make such a statement. He has told me that my statement must be made freely and voluntarily and may be used against me or any other person in Immigration and Naturalization Service proceedings. Being duly sworn, I make the following statement: I have also used the name GINA OI. I am a native and citizen of China, born September 20, 1910 at Yu A1 Hung Village, Wan On Heung, To: Shan, China, married, employed as a Packer at the Seiler Co., 110 Norway St., Boston, Mass. and I reside at 102 Norway St., Boston, Mass. My father was LEE SHEK LOY and my mother was HOM TOY SIU. They were both natives and citizens of China and never resided in the United States, both died in China. My parents had two children by their marriage, myself and a son, LEE LUNG FAY, who resides in China and never lived in the United States. I was merried once to WONG GIM LEE on January 10, 1927 at Gow Mize Leong Village, SND, China, this village is in Nox Gim Heung. I lived in my husband's village from the time of my marriage to 1953 when I left to go to Hong Kong. This village is inhabitated by WONGS. At my marriage, my husband's entire family attended, his father, WONG SAI CHEE; his mother, CHIN HO NUEY; his brothers, WONG GIM HEE and WONG GIM GOK and his sister, WONG SUEY OY. They had all returned to China from the United States for this occasion. My husband's brother, WONG GIM HEE also known as HENRY, was about 10 years old at that time and he remained in China to attend school in the village for about eight years and eas married when he was 17 years old to GEE WON FONG, and by this markiage one son was born in China and named WONG GONG soo. In China we were known as WONGS and in the United States we used the name OI. I have made only one entry into the United States on February 13, 1955 at Anchorage, Alaska where I was admitted as a spouse of a United States citizen. When I applied for an immigrant visa to come to the United States I was told by my husband to state that his name was OI GIM LEE and not WONG GIM LEE and to list two children, OI GONG HEN and OI GON NAM and I also listed my daughter, MEE LING as an OI and not as a WONG.,"
}
