{
  "anumber": "A10017891",
  "id": "A10017891_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/6/2023, NARA Form No. 14-785"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1921,
        1877,
        1955,
        2023,
        1909,
        1940,
        1950,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 DETAILS On August 1, 1966, WONG Gim Lee made a sworn statement in which he stated that he used the immigration name of OI Gim Lee, the marriage name of WONG Chun Bong, and the American name of HARRY OI; that he is a native and citizen of China, born October 8, 1909 at Gow Mee Leong Village, SND; married; employed as a chef at the South Seas Restaurant, Boston, Mass., and resides at 102 Norway Street, Boston. He stated that his father's name is WONG Jin Toy, marriage name WONG Sai Chee, and he used the immigration name of OI Jin Toy; that his father resided in the United States from the time that this SUBJECT was born; that he returned to China in 1940 and died there in 1950; that his father was born in Gow Mee Leong Village, Toi Shan District, China; that his father was born on October 21, 1877. His mother's name, he stated, is CHIN HO NUEY; that she is a native and citizen of China and she resides at the present time at 269 Tai Nam Street, 5th floor, Kowloon, Hong Kong, and by his parents' marriage they had four children, including this SUBJECT. They are: 1. GIM HEE, also known as HENRY, about 49 years of age, born in China; now living at 22 Mohawk Road, Canton, Mass. 2. SUEY OY aka RHODA, born in the United States, age 43, now living at 299 Medwood Avenue, Brooklyn, New York. 3. GIM KWOK, aka GEORGE, age 42 if living, died in Germany while serving in World War II. He was born in the United States. When SUBJECT WONG GIM LEE testified, he stated that his mother resided in the United States from 1921 to 1927. SUBJECT WONG Gim Lee stated that he married LEE Suey Gin, the other SUBJECT of this report, on January 10, 1927 in his native village, and that she entered the United States during 1955 at Alaska and is at the present time living with him, and that by this marriage they had two children: 1. WONG Kwong Sang, aka WONG Kwong Yim, school name; age 37; now living at 269 Tai Nam Street, Kowloon 2. WONG Mei Lin, daughter, age 27, now living at 28 Hemenway Street, Boston, Mass. She entered the United States in 1955 at Alaska. Boston, Mass., 8/9/66 -2- A-12 738 876; A-10 017 891"
}