{
	"anumber": "A10017891",
	"id": "A10017891_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support, NARA-102364"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 1954, 1938, 1953, 2023, 1909, 1920]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 AFFIDAVIT OF SUPPORT City of Boston County of Suffolk Commonwealth of Massachusetts I, Oi Gim Lee (Harry oi) of 102 Norway St., Apt. 3, Boston, Mass. being duly sworn, do depose and say: That I was born on October 8, 1909 at Kow Mei Leung Village, Canton, China That I came to the United States on Nov. 19, 1920 thru the port of Boston,Mass. on the S.S. ex Empress of RussiaThat I am married That my dependents aremy wife, Lee Suey Gin, my daughter, Oi Mei Ling, in Hong Kong I have three other children in Canton, China, but I cannot contact them due to conditions That I am a citizen of the United States by: thru my father, Oi Jim Toy, there. I was issued Certificate of Identity 33926, Boston File 2500/2396. That I am employed by Ye Olde Brown Jug, Inc. of 1178 Blue Hill Ave. Dorchester, Mass. hat my earnings are $400.00 per month. That I have xsavings no outstanding obligations. That I have no savings as I send money to my family regularly, for their support That I have personal propertyxas follows: X X X X X X That I shave real estate situated atx That I am attaching Affidavit of Support submitted by my brother, Henry Oi of the China House, Boston, Mass. Bhad neck www.xxxx X X K That evidence of my income and resources is attached hereto as follows: Statement in duplicate from my employer. I am also attaching statements of drafts I have been sending to my family at Hong Kong, regularly. That I hereby request the appropriate consular authorities at Hong Kong to grant a visa under the Immigration and Nationality Act, to: NAME ADDRESS DATE AND PLACE OF BIRTH RELATIONSHIP a Lee Suey Gin Born Sept. 18, 1910, at Canton, China my wife of 9 Wah Ye Yuen, Haun Ling, Diamond Hill, Kowloon, Hong Kong. Oi Mee Ling same address born Nov. 25,1938 in Canton, China my daughter. That petition in her behalf was approved by the U.S. Immigration and Natural ization Service, Boston on June 30, 1953, under their file VP2-7492. That my daughter, Oi Mee Ling, has a claim to citizenship, thru my citizenship. are That my wife, Lee Suey Gin and my daughter Oi Mee Ling XXX desirous of coming to the United States for permanent residence. That I per- sonally promise and agree that during my lifetime, I will save the United States and all States, Territories, Counties, Towns, Municipalities, and Districts there- of harmless against any losses or damages which may be suffered by the reason of the fact that any of the persons above mentioned during their alienage shall be- come a public charge in the United States, That in order to prevent the alien(s) above mentioned from becoming public charges after their arrival in the United States, I shall assume the responsibility for their support and I propose to dis- charge such responsibility in the following manner, if it shall become necessary. They will live with me in an apartment I am now furnishing for them, I assume full responsibility for their support and assure all authorities that they will be pro- vided for and will not become public charges in the U.S. That I have read and verified the accuracy of the fcregoing statements which I believe to be correct and that I hereby affix my signature and swear to this instrument without any mental reservation whatsoever. Subscribed and sworn to before me, this 12th day of Oiriin LeeHarryo (Seal) Lavor November in the year 1954 Notary Public; my commission expires 3/12/60."
}
