{
	"anumber": "A10017891",
	"id": "A10017891_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Investigation, G-166A ( Rev. 10-14-64"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 2023, 1924, 1920, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 TED STATES DEPARTMENT OF JUS CE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTICATION ADMINISTRATIVE PAGE TITLE FILE NUMBER (1) WONG Gim Lee aka OI Gim Lee. (1) A-12 738 876 (2) LEE Suey Gin (2) A-10 017 891 REPORT NUMBER DATE PLACE CENTRAL OFFICE AND REGIONAL REFERENCES 1 08-09-66 Boston - mm OFFICE IN CONTROL OF INVESTIGATION G-23 LINE TYPE OF INVESTIGATION Boston 511 Fraud DATE AND PLACE OF BIRTH NATIONALITY DATE.PLACE AND MANNER OF ENTRY (1) 10-8-09; China (1 & 2) China (1) 1939 Boston as U.S.C. 1st entry 1920, Bosto (2) 9-20-10; 11 (2) 2-13-55 Anchorage as M-1 DISTRIBUTION REVIEWED ANDJAPPROVED (SEE COMMENT) DATE 1 - File A-12 738 876 8/23/67 PLACE Boston SIGNATURE 1/- File A-10 017 891 NAME AND TITLE 1 - 2500-7161 OI Gim Hee PATRICK E COOMEY District Director for investigations Superv sorv. Investigator REVIEWED AND APPROVED (SEE.COMMENT) 1 - A- FOIA (b)(6) DATE PLACE SIGNATURE NAME AND TITLE APPROVED (REGIONAL OFFICE) DATE NAME AND ILTLE SIGNATURE STATUS OF INVESTIGATION PENDING PENDING INACTIVE X CLOSED REFERRED TO CONTROL OFFICE This investigation is predicated on SUBJECT WONG GIM LEE's request that he be given an opportunity to testify to his true identity and citizenship and, in doing so, implicated his wife, LEE Suey Gin. COMMENT SUBJECT WONG GIM LEE is a permanent resident of the United States since prior to July 1, 1924 and is eligible to apply for adjustment of his status under section 249 of the I&N Act. SUBJECT LEE Suey Gin may be adjusted if her husband's (the other SUBJECT of this report) status is changed to that of a permanent resident alidn. He may file a visa petition in her behalf and she can request change of status under section 245 of the I&N Act. August 9, 1966 Charles J. Casey, Investigator THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE FORM O-166A (Rev. 10-14-64) GPO 948-926"
}
