{
  "anumber": "A10017891",
  "id": "A10017891_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0046/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, 102"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1917,
        1921,
        1942,
        1910,
        1954,
        1938,
        1953,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 AFFIDAVIT OF SUPPORT City of Boston County of Suffolk Commonwealth of Massachusetts I, Henry oi of 102 Norway Street Boston, Mass. being duly sworn, do depose and say: Approx. Nov. 18. 1917 That I was born on Novr CR6-10-5/ at Canton, China That I came to the United States on or about 1921 thru the port of Boston, Mass. on the S.S. ex Empress of Russi hat I am married That my dependents are my wife and four children, here in the U.S. My other two children are in Canton, I cannot contact them. That I am a citizen of the United States by thru my father's citizenship. I was issued Certificate of Derivative Citizenship No. AA-11202 on April 5, 1942, under Application No. 0200-4461,0200-61705 That I am a Reserve Officer in the U.S. A.F.R #A0709959. My Commision is Indefinite. That I am employed by China House of 146 Boylston St. Boston, Mass. that my earnings are $280.00 monthly plus proceeds That I have savings Franklin Savings Bank of Boston, in the from amount profit of sharing plan. $14,63.38 That I have personal property as follows: Household furnishings valued at $2500.00 Value of shares in China House Stock, valued at approximately $5000.00 That I have real estate situated at 102 Norway St., Boston, Mass., a three family house, Assessed for $7500.00, Market Value $15,000.00, Mortgage $3,136.87 Equity $11,863.19 That my net worth is over $20,000.00 o That evidence of my income and resources is attached hereto as follows: Statement from employer; statement from bank in regard to savings; statement from bank in regard to a ssessed valuation of pro- perty and mortgage on same. That I hereby request the appropriate consular authorities at Hong Kong to grant a visa under the Immigration and Nationality Act, to: NAME ADDRESS DATE AND PLACE OF BIRTH RELATIONSHIP Lee Suey Gin Born Sept. 18kg 1910 at Canton, China KOLYWIXE my of 9 Wah Yuen, Haun Ling, Diamond Hill, Kowldon, Hong Kong brother's wife Oi Mee Ling same address Born Nov. 25, 1938 in Canton, China my brother's daughter. That my brother, Harry Oi, executed I-133 in behalf of his wife, this was approved by theu.s. Immigration Service, Boston, on June 30, 1953, their file VP2-7492. are. That b my brother's wife, Lee Suey Gin and his daughter, Oi Mee Ling desirous of coming to the United States for permanent residence. That I per- sonally promise and agree that during my lifetime, I will save the United States and all States, Territories, Counties, Towns, Municipalities, and Districts there- of harmless against any losses or damages which may be suffered by the reason of the fact that any of the persons above mentioned during their alienage shall be- come a public charge in the United States. That in order to prevent the alien(s) above mentioned from becoming public charges after their arrival in the United States, I shall assume the responsibility for their support and I propose to dis- charge such responsibility in the following manner, if it shall become necessary. That my brother, Harry Oi, is now living in one of my apartments, he will have a home for his wife and child when they arrive, I will help them in every way possible, charges and assure all authorities that they will be provided for and will not become public ,in the U.S. That I have read and verified the accuracy of the foregoing statements which I believe to be correct and that I hereby affix my signature and swear to this instrument without any mental reservation whatsoever (Seal) Clerabeth B Lausie Subscribed And sworn to, before me, this 12th day of November in the year 1954 Notary Public; my commission expires 3/12/60 Witnessed without objection: Diana Oi (Seal) (Spouse of Affiant)"
}