{
  "anumber": "A10017891",
  "id": "A10017891_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0041/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Form FS-5410"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023,
        1953
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 586 1 Form FS-256 FOREIGN SERVICE OF THE UNITED STATES OF AMERICA (Revised August ] I- 158792 Approved/Burea: Budget No. 47-R 08.1 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALEN REGISTRATION under the Immigration and Nationality Act to the American Vice Consul et Hong Kong 1. Family name Given name Initial 2. Place and date of birth Age LEE Suey Gin Toishan, Kwangtung, China; ST 2-8-17, September 20, 1910; 44; 3. Other names by which I have been known 4. Last permanent residence None; 9 Wah Yuen Road, Ground floor, Ha Un Lang, Diamond Hill, Kowloon, Hong Kong; 5. Address in the United States 6. Name and address of person to whom destined, if any 102 Norway Street, Apt. 3, Boston, OI Gim Lee aka Harry OI -husband- 102 Norway Street, Apt. 3, Massachusetts; Boston, Massachusetts; 7. Name and address of nearest relative in home country 8. Travel documents presented OI Gong Hen -son- Toishan, Kwangtung, China; None; 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Chinese; Chinese; M Married Single 14. Complexion 16. Ethnic Classification Black; Brown; 5 ft. 1 in. 1091 lbs. Yellow; Chinese; F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Housewife; Mole over right eyebrow; Chinese - Toishan dialect; 22. Intended United States port of entry 23. Final destination 24. I have (a) (no) 25. Purpose of going to the United States San Francisco, or; Boston, Mass. through ticket to destination To live with husband; 26. Places of previous residence 1910 - 1953 Toishan, Kwangtung, China; 1953 - date Hong Kong; 27. Names and places of residence of spouse and minor children OI Gim Lee aka Harry OI -husband- 102 Norway Street, Apt. 3, Boston, Massachusetts; OI Gong Nom -son- Toishan, Kwangtung, China; OI Mee Ling -daughter- 9 Wah Yuen Road, Ground floor, Ha Un Lang, Diamond Hill, Kowloon, Hong Kong; 28. Name and address of father 29. Name and address of mother LEE Sek Loy -deceased; HOM Toy Siu -deceased; 30. I claim to be a fnonquota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are preference quotaj filed herewith and made a part hereof, as follows (Sec. 222 (b)) following facts: Nonquota status has been authorized for me by the 1. Certificate of non availability of birth Secretary of State on the basis of my husband's marriage records and of no police record; petition VP No. 2-7492 approved by the Commissioner of Immigration and Naturalization Service dated June 30, 1953; 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: None ; 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: None; 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: None; 16-67444-1 (Application continued on reverse side)"
}