{
  "anumber": "A10017891",
  "id": "A10017891_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION, GPO 950-101"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023,
        1939,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTICATION TITLE FILE NUMBER WONG Mee Ling aka OI Mee Ling A- FOIA (b) (6) REPORT MADE AT DATE BY Boston August 10, 1966 Charles J. Casey INVESTIGATOR XXXXXXX DETAILS SYNOPSIS On August 4, 1966, this SUBJECT made a sworn statement stating that hername at birth was WONG Mee Ling; marriage name FONG WONG MEE LING; immigration name OI Mee Ling, and that she is a native and citizen of China, born February 22, 1939 at Gow Mee Leong Village, Toi Shan District; married; housewife, and resides at 128 Hemenway Street, Boston, Mass. A copy of SUBJECT's affidavit is attached to this file. The SUBJECT claims she made only one entry to the United States and that was on February 13, 1955 at Anchorage, Alaska; that she travelled on a United States passport and was admitted as a United States citizen. She claims she does not know or remember the circumstances regarding her application for United States passport at the American Consulate in Hong Kong. She knows that her father sent her some papers. She thinks that she signed some papers and that she used the surname of \"OI\" because she was told to do so by both her mother and her father. She said that she also received a certificate of citizenship which she will surrender to this Service. She stated while she knew her father was using a wrong surname, she thought he had a right to be and live in this country and that she had a right to have a United States passport even though she was using a name other than her own. She now states she realizes she entered the United States illegally and has no claim to United States citizenship. Form G-166 (Rev. 701-64) GPO 950-101"
}