{
  "anumber": "A10139321",
  "id": "A10139321_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Processing Sheet and Adjudicator's Memorandum in Connection with Examination of Applicants for Certificates of Citizenship under Section 341 of the Immigration and Nationality Act, File No. 10-139-321"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "3-56 REV. I 15-54 PROCESSING SHEET AND ADJUDICATOR'S MEMORANDUM IN CONNECTION WITH EXAMINATION OF APPLICANTS FOR CERTIFICATES OF CITIZENSHIP UNDER SECTION 341 OF THE IMMIGRATION AND NATIONALITY ACT DATE: 6/7/56 FILE No. 110-139-3211 NAME OF APPLICANTINNE Winner ADDRESS 35Echut ane Freedlander SIGNATURE AND ADDRESSES OF WITNESSES: newark 8.W.g. Louis wine ADDRESS: Newark REQUESTED RECEIVED EXH. No. 1. LAWFUL ENTRY FOR PERMANENT RESIDENCE YES No applicant asked to A) VISA FILE B) 1-404 2. APPLICANT'S BIRTH CERTIFICATE - OR SECONDARY EVIDENCE Jame 30/1906 3. MARRIAGE CERTIFICATE OF APPLICANT'S PARENTS - secondary OR SECONDARY EVIDENCE 4. PROOF OF TERMINATION OF ANY PRIOR MARRIAGES OF APPLICANT'S PARENTS - OR SECONDARY EVIDENCE 5. APPLICANT'S MARRIAGE CERTIFICATE - OR SECONDARY EVIDENCE 6. PROOF OF TERMINATION OF APPLICANT'S PRIOR MARRIAGES OR SECONDARY EVIDENCE 7. PROOF OF TERMINATION OF PRIOR MARRIAGE OF APPLICANT'S HUSBAND - OR SECONDARY EVIDENCE b. BLOOD TEST OF APPLICANT AND PARENTS 9. CITIZENSHIP OF PERSON THROUGH WHOM APPLICANT DERIVES OR ACQUIRES CITIZENSHIP A) BY BIRTH .. BIRTH CERTIFICATE -OR SECONDARY EVIDENCE B) BY INATURALIZATION (1) G-347 (2) OLD LAW (3) RELATIONSHIP OF RECORD - HOW DETERMINED c) BY DERIVATION OR ACQUISITION (1) CITIZENSHIP OF PARENT (A) BY BIRTH - BIRTH CERTIFICATE - OR SECONDARY EVIDENCE (B) BY NATURALIZATION (1) G-347 (2) OLD LAW (3) RELATIONSHIP OF RECORD -DETERMINED (2) LAWFUL ENTRY FOR PERMANENT RESIDENCE YES No (A) VISA FILE (B) 1.404 (3) BIRTH CERTIFICATE OF PERSON THROUGH WHOM - SECONDARY EVIDENCE (4) MARRIAGE CERTIFICATE OF PARENTS - OR SECONDARY EVIDENCE"
}