{
  "anumber": "A10139321",
  "id": "A10139321_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit and Naturalization Service for the examination on this application., 16—17953–13"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "NOTE CAREFULLY.-D not sign your name on this page until you appear before an officer of the Immigration and Naturalization Service for the examination on this application. AFFIDAVIT I, anne Wiener Freedlander am the (Full name, without abbreviation) applicant (Applicant, parent or guardian) and do swear (affirm) that the contents of the foregoing application comprising pages 1 to 3 inclusive, are true to the best of my knowledge and belief; that corrections numbered ) to ( were made by me or at my request; and that this application was signed by me with my full, true, and correct name: Incalander (Complete and true signature of applicant, parent, or guardian) Subscribed and sworn to, before me, at Newark n.g. this 7 day June of 1956 Elyabeth Scharfer U. S. NATURALIZATION EXAMINER (Title of officer) INSTRUCTIONS TO THE APPLICANT 1. Execution of this application, if applicant 18 years of age or over.-If you are 18 years of age or over, you must sign your full name in the space provided on page 3 of the application, but do not execute the affidavit on page 4. This affidavit will be executed for you when you appear before an officer of the Immigration and Naturalization Service at the hearing on the application. 2. Execution of this application, if applicant under 18 years of age.-If you are under 18 years of age, do not sign the application on page 3 or the affidavit on page 4. Your parent or guardian must sign his or her name in the space provided on page 3 and must later appear before an officer of the Immigration and Naturalization Service at the hearing on the application to execute the affidavit on page 4. 3. Fee.-A fee of five dollars ($5) must accompany this application. Remittances should be made payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" Do not send coins or postage stamps. 4. Photographs.-You are required to send with this application three photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 by 2 inches in size and the distance from top of head to point of chin should be approximately 1 1/4 inches; must not be pasted on a card or mounted in any other way; must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group, or full-length portraits will not be accepted. PHOTOGRAPHS SHOULD NOT BE SIGNED. 5. Facts concerning arrival in the United States.-Detailed information is necessary in relation to your arrival in the United States. If you do not know the exact date of arrival or name of the vessel or port and cannot obtain this information, give the facts of your arrival to the best of your ability. If you have an immigrant identification card, passport, ship's card, or baggage labels, they may help you to give this information. 6. Documents.-Send with this application any birth, marriage, divorce, death, or other document which will support your claim to citizenship. Do not send a Certificate of Naturalization or Certificate of Citizenship, and do not photostat or otherwise make copies of either of such documents. The Certificate of Naturalization or Certificate of Citizenship may be presented by you or your witnesses when they appear for examination before an officer of the Immigration and Naturalization Service. If you desire that the original documents which you send with this application be returned to you, they must be accompanied by photostatic or other copies of such documents. Describe in Statement 17, page 2, all the documents which you are sending with this application. 7. Race.-This item in Statement 3 must be filled in only if you are claiming citizenship through a husband. In such event, state whether you are of the white race or a person of African nativity or descent. If not of either of such races, state of what other race you are a member. (4) 16-17953-13 U. S. GOVERNMENT PRINTING OFFICE"
}