{
  "anumber": "A10139321",
  "id": "A10139321_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXAMINER'S REPORT—CERTIFICATE OF CITIZENSHIP, Form N-335"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Lithuania"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form N-635 U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE A356417. 4.19.57 WC No. A 10 139 321 (Rev. 5-31-55) A-2 January (Date of examiner's findings) 31,1959 EXAMINER'S REPORT-CERTIFICATE OF CITIZENSHIP (Section 341 of the Immigration and Nationality Act) DISTRICT DIRECTOR OR OFFICER IN CHARGE OF IMMIGRATION AND NATURALIZATION: I submit herewith the above file and the following findings made by me in the above-numbered proceeding based upon my investigation of the facts therein. I find that- anne Weener Friedlander 1. The name of applicant is 2. The applicant resides at 35 Eckert ave., hewark, n.j. 3. The applicant was born on 10-17-04 at Latskawa (Month) (Day) (Year) Lithuania (City) (County, District, Province, or State) (Country) - 4. The applicant did lawfully enter United States for permanent residence on 7-11-06 (Month) (Day) (Year) at new york (Port) 5. The applicant did - derive or acquire citizenship of the United States on 7-7-15 (Month) (Day) (Year) ah Kewark, u. of applicant being then a minor t having resided through the noty of her father, douis Weever, by the U.S. Districh Courh permanently - in the U.S. since 7-11-06 6. I am satisfied that the applicant, since deriving or acquiring citizenship as set forth in item 5 above, has not become expatriated in any manner and that the applicant is now a citizen of the United States. 7. The following named persons were examined by me under oath on the dates indicated: Name Address Relationship to Date testimony applicant heard anne Wiener Friedlander above Applicant 6-7-56; 1-31-57 Louis Wiever above Father 6-7-56 - 1-31-57 8. Attached to and made a part of the file are the following documents: Listed ou Form 3-56 and NE 132 attached 9. Recommendation that application be granted is HOT based primarily upon documentary evidence. 10. The application does 1 present a prima facie case of citizenship. 11. I recommend that the said application be 1 granted. (If an adverse recommendation is made a statement in support thereof should accompany the report.) 12. An A Certificate of Citizenship should be issued in the name of (A or AA) ANNE WIENER FRIEDLANDER (2) (Applicant's legal name acquired: (1) at birth, (2) through marriage, (3) by court order, (4) State law. Explain if (3) or (4) J. dorulaido (Signature of examining officer) I do - concur with the decision Date 1-31-57 W.J.Wyisch (Signature of District Director or officer in charge) IVL GPO 948421-18 STATISTICS"
}