{
  "anumber": "A10179278",
  "id": "A10179278_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATEMENT OF FACTSS FOR PREPARATION OF PETITION, NARA REGISTRATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1948,
        1955,
        1901,
        2023,
        1926,
        1902,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/28/2023 316 a) 3 EN REGISTRATION Name Yen Mei-Ling Tuan STATEMENT OF FACTS FOR PREPARATION OF PETITION No. AIO I79 278 (1) My full, true, and correct name is Yen Mei-Ling Tuan (Full, true name, without abbreviation) (2) My present place of residence is 446 W. Pierce St., Macomb, McDonough, Illinois (Number and street) (City or town) (County) (State) (3) My present occupation is House wife March 16, 1901 (4) I was born on in Ankiu, Shantung China (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) Female (5) My personal description is as follows: Sex ; complexion med ; color of eyes Brown ; color of Grey I I40 hair ; height feet inches; weight pounds; visible distinctive marks none far-sighted glasses ; country of which I am a citizen, subject, or national China (6) I (am, am not) married; the name of my wife or husband is Ren-Deh Dah San Tuan ; Jan. 14, 1926 we were married on at Ichang, Huh-Peh Province, China ; (Month) (Day) (Year) (City or town) (State or country) he or she was born at Ankiu, Shantung China (City or town) (County, district, province, or State) (Country) June 20 1902 on ; entered the United States at San Francisco, (Month) (Day) (Year) (City or town) California May 14, 1948 on for permanent residence in the United States and (State) (Month) (Day) (Year) with me; now resides at ; (Show full address if not living with you) and was naturalized on at (Month) (Day) (Year) (City or town) (State) Certificate No. or became a citizen by (7) I have five living children, as follows. (Complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise, give child's full address.) NAME SEX PLACE BORN DATE BORN Now LIVING AT- 2 Paul Lung Tuan Shanghai, China 12-15, 27 Detroit, Mich. Pao Shing Tuan Shanghai, China 02-23, 31 Shantung, China Pansy Tuan Shanghai, China 06-05, 34 AnHui, China Douglas Tuan Shanghai, China 02-21,. 38 Chicago, I11 macount w Ben Tuan Shanghai, China 10-13, 39 Macomb, Ill. (8) My lawful admission for permanent residence in the United States was at Honolulu, Hawaii ; (City or town) (State) under the name of Yen Mei-Ling Tuan on May 17, 1955 (Month) (Day) (Year) on the S. S. President Wilson (ship) (Name of vessel or other means of conveyance) (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows (if none, state \"None\") : DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE May 1955 (10a) I have resided continuously in the United States of America since Illinois and continuously in the State of where I now live since Since Sept. / 1959 and during the past 5 years I have been physically present in the United States for an aggregate period of 60 months. (OVER) (10b) Do you intend to reside permanently in the United States? Yes No. If \"No,\" explain:"
}