{
  "anumber": "A10139321",
  "id": "A10139321_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, Form N-600"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Lithuania"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1907,
        1956,
        1904
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form N-600 Form approved. U. S. DEPARTMENT OF JUSTICE Budget Bureau No. 43-R105.7. IMMIGRATION AND NATURALIZATION SERVICE (Rev. 6-1-55) APPLICATION FOR CERTIFICATE OF CITIZENSHIP UNDER SEC. 341 OF THE IMMIGRATION AND NATIONALITY ACT NR Take or mail this application to: IMMIGRATION AND NATURALIZATION SERVICE: 1004 Broad Street, Newark, New Jersey Print or Anne Friedlander Date January 25,1956 (Name) type TO THE APPLICANT: 35 Eckert Ave READ THE INSTRUCTIONS ON THE LAST PAGE OF Name and (Apartment number, Street address, and if appropriate, \"in care of\") THIS FORM: FOLLOW THEM EXACTLY. IF YOU DO NOT HAVE ENOUGH ROOM FOR ANY QUESTION, CON- Address Newark 8 N.J. TINUE IT ON ANOTHER SHEET OF PAPER THIS SIZE. (City) (State) (This form must be completely filled out-pref- erably on a typewriter) I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) a (If married woman) My maiden name was Anne B. Wiener (2) I was born in Lithuania on October 17 1904 (City) (State or country) (Month) (Day) (Year) (3) My personal description is: Age 50 female years; sex ; complexion dark ; color of brown eyes ; color of hair gray-brown ; height 5 feet 2 inches; weight 150 I pounds; white race ; visible distinctive marks pock mark on right side of chin. Marital status: Single; Married; Divorced; Widow(er) (4) I arrived in the United States at Ellis Island N. Y (City) (State) under the name of Annie Wiener May 1907 on ? (Month) (Day) (Year) by means of name of boat not known (Name of vessel or other means of arrival) (5) I have not been absent from the United States except as follows: Date departed Date returned Name of ship, or of airline, railroad company, bus company, or other Place or port of entry through which you returned to means used to return to the United States the United States (6) My last permanent foreign residence was (City) (Country) (7) The place where I took the ship or train to the United States was (City) (Country) Answer questions (8), (9), and (10) only if you arrived in United States before July 1, 1924. (8) The person in the United States to whom I was coming was Father at (2) The place in the United States to which I was going was New H aven, Conn. 7 (10) The names of some of the passengers or other persons I traveled with, including members of my family, and their relationship to me, if any, are Mother and brother, Rose and Alfred TO THE APPLICANT: DO NOT WRITE BETWEEN THE DOUBLE LINES BELOW. CONTINUE ON NEXT PAGE FOR USE IN SEARCHING RECORDS OF ARRIVAL: RECORDS EXAMINED RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status (Signature of person making search) 16-17953-14"
}