{
	"anumber": "A10139321",
	"id": "A10139321_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization, 2056348"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1900, 1908, 1910, 1905, 1906, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 2205 450920 U DEPARTMENT OF LABOR NATURALIZATION Hy DUPLICATE be forwarded to the Burown of Naturalisation UNITED PETITION STATES FOR NATURALIZATION OF ADDRESS RECEIVED BUREAU 7 91915 2056348 M OF EXAMINED To the Honorable the Court of The United States The potition of Whener hereby Aled respectfully sheweeth First. My place of residence is acen Rocane, newa \" New Jowe Second My occupation is shac niather (Give number street city down and State Third. I was born on the 10 day of February anno Domini 883 at Talachine Russia Fourth i emigrated to the United States from Nia on or about the / anno Domini 1906 and arrived in the United States at the port of Hear you day of may on the 15 day of May anno Domini igol on the measure Albria (If the alien arrived otherwise than by vensel, the character of company should but given.) Fifth I declared my intention to become a citizen of the United States on the 12 day of at New Haven Conseticut in the City September Court of new Havon anno Domini 1910 Sixth. I am married My wife's name is Rouce She was born in Latehore: Russia and now resides at 16 arou Avenue (Give minter street, Newark city Noco Jersey I have four children and the name, date and place of birth, and place of residence of each of said children is as follows afrahami, born Sept. 7,1906 in Russin reduire Newark. ny annie born Sept. 14,1905 in Russia, residencial Newarn ng oda. born Nov no.1908 in David, born Jee 101,1912 in newar, ng, wideo in newam xy. Seventh. / am not a disbeliever in or opposed to organized government or a member of or affiliated with any organization or body of persons teaching diabeties in or opposed to organized government / am not a polygamist nor a believer in the practice of polygamy / am attached to the principles of the Constitution of the United States, and it is my intention to become a citizen of the United States and to renounce absolutely and forever all allegiance and fidelity to any foreign prince. potentate, state, or sovereignty, and particularly to Nicholao H, Emprovefall the Russias of whom at this time / am a subject and it is my intention to reside permanently in the United States. Righth I am able to speak the English language Ninth / have resided continuously in the United States of America for the term of five years at least, immediately preceding the date of this petition to wit, since the 15 day of may anno Domini 1906 and in the State of newsperely continuously next preceding the date of this petition, since the 5 day of Septer he anno Domini 19th being a residence within this State of at least one year next preceding the date of this petition. Tenth. I have not heretofore made petition for citizenship to any court 1 for citizenship 10 th day - such denial has since been - or Attached hereto and made a part of this petition are my declaration of intention to become a citizen of the United States and the certificate from the Department of Labor, together with my affidarit and the affidarits of the two verifying witnesses thereto, required by law Wherefore your petitioner prays that he may be admitted . citizen of the United States of America Louis woney (Complete and true signature potitioner.) Declaration of Intention and Certificate of Arrival NOTE Department of filed this OF arrived and 17 day of Fibrary 1915 29. 1900 strike the words reading and of Arrival No. times Department of laws AFFIDAVITS OF PETITIONER AND WITNESSES United States of America District of New Jersey. The aforesaid petitioner being duly store. deposes and says that he is the petitioner in the home entitled proceedings that he has read the foregoing petition and knows the contents thereof that the said petition is signed with his full. true name that the same is true of his over knowledge except ** to matters therein stated to be alleged upon information and belief. and that ... to those in afters he believes it to the true Louis Wiener signature Mine occupation Muchaul residing at 166.Spince A Newark II and Harryatrom occupation Tanner residing at 179/1000 are neuaria, g. each being Merically radaly, and respectively eword. deposes and says that he is . citizen of the United States of America that he has personally \"known donie Wienes the petitioner above mentioned to have resided in the United States continuously immediately preceding the date of filing his patition since the is day of may anno Domini got and in the State in which se above entitled petition is made continuously since a 5 day of September ARRO Demini 911 and that he has personal knowledge that the said petitioner is . person of foct mural examples attached to the principles of the Constitution of the United States and that the petitioner is in every way qualified in his opinion to be admitted a citizing of the United States Benjamin Krim Harry kim Subscribed seges to by the and witnesses IN the office of the Clerk of (court this 19 day of Flowar W-BReee Deports Clark Department other Ni 463984"
}
