{
  "anumber": "A10179278",
  "id": "A10179278_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 6/28/2023, Form Number: 1459-1"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1953,
        2023,
        1890
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/28/2023 PAGE 2 (c) I am giving this assurance of employment as a personal obligation in my capacity as the alien's prospective employer as the personnel or other responsible officer of the organization which is to employ such alien (d) I further assure that the alien listed under (1) and the member of his family listed above will be housed at Tougaloo College, Tougaloo, Hinds County, Mississippi (State specific address) in a raculty bungalow with 3 bedrooms, path, living room, dining room, (State type of housing available including number of rooms and facil lities) Kitchen. (e) I assure that such housing will be available at the time of arrival of the alien in the United States if such arrival takes place not later than at any time , and that I have made these housing arrangements, being the owner thereof having made rental arrange- ments with Tougaloo College, Tougaloo, Mississippi. (Name and Address of landlord) (5) I am a citizen of the United States. I was born at Lansdowne, Pennsylvania on (City, Town and State) December 9, 1890 (Month, Day and Year) My net income is $ 6,500.00 I have on deposit at banks in the United States $ 900.00 I own real estate valued at $ 15,000.00 with mortgages or other encumbrances thereon amounting to $ 9,000.00 I am self employed /and my net income during the last year by Tougaloo College was $ 6,500.00 The following persons are dependent on me for support: NAME: (First) (Middle) (Last) (Date of Birth) (Relationship to me) Josephine Fox Warren, November 3,1890. Wife (6) I have within the last five years sponsored the immigration into the United States of None persons. (State number) (7) I have previously submitted an assurance under the Refugee Relief Act of 1953 for the following persons: None NAME: Relationship to me Date submitted (8) ADDITIONAL OR SUPPLEMENTAL INFORMATION Husband of alien listed under (1) is employed as professor at Tougaloo College at salary of $ 4,500.00."
}