{
	"anumber": "A10179278",
	"id": "A10179278_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form G-135b., Screened by NARA, 6/28/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 2023, 1902]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/28/2023 Form G-135b. Agency Name Check MR5-4 (Rev. 8-1-60) MAY UNITED STATES DEPARTMENT OF JUSTICE District Chicago Immigration and Naturalization Service File No. A10 179 278 Sub-office Date 4/29/61 DIRECTOR, FEDERAL BUREAU OF INVESTIGATION, dbp DEPARTMENT OF JUSTICE, Washington 25, D.C. Attention: NAME CHECK SECTION, DOMESTIC INTELLIGENCE DIVISION Please furnish any derogatory information contained in any file - other than fingerprint records - which your Bureau may have concerning the following person: NAME (Surname in CAPS, First, Middle) DATE OF BIRTH SEX COLOR MARITAL 55 March 16,1901 F STATUS TUAN Mei-LING Yen PLACE OF BIRTH (City, province or state PRESENT NATIONALITY S M Ankiu Shantung ,& China China D W ALIASES (Identify maiden name or nicknames) PARENTS' NAMES (Include present address, if known) HEIGHI WEIGHT 5'1\" 140 Brown EYES Gray HAIR COMPLEXION medium IDENTIFYING MARKS OR SCARS RESIDENCE LAST FIVE YEARS (Street & No., RFD, etc.) Tougaloo College, Tougaloo, Miss. (City, state and country) FROM5/55 TO 5/57 1131 Summit St., Ft. Wayne, Ind. 9/57 8/58 1134 Summit St., Ft. Wayne, Ind. 8/58 8/59 446 West Pierce St., Macomb, Ill. 9/59 Present PRIOR RESIDENCES, IF AVAILABLE EMPLOYMENT LAST FIVE YEARS (Employer's name and address) OCCUPATION OR PROFESSION FROM TO Good Samaritan Home, Knoxville, Ill. Bible work 1/60 2/60 Housewife Present PRIOR OCCUPATIONS (Not included in above) SPOUSE (Full name & any other names used, & present address, if not same as above) DATE OF BIRTHO 69/20/1902 Ren-Deh Dah San Tuan PLACE OF BIRTH (City, province or Ankiu, China state & country) ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) None LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U.S.) No Investigation PREVIOUS NUMBERS ASSIGNED (Milit. S/N; passport; social security; FBI, etc., Conducted by FBI Per identify @ach) PREVIOUS REPORTS FURNISHED BY FBI: This is the result or NO a request YES for an If yes attach list of reports. REASON FOR REQUEST APPLICANT FOR: DEPORTATION ee BENEF PB-#: and is not to ba Other (Specify) PROCEEDINGS. ADM. TO U.S. ADJ. OF STATUS considerer FOR RELIEF OF NATZ RETURN TO: DISTRICT DIRECTOR, (2) U.S. Immigration and Naturalization Service 312 Old Post Office Bldg., 12th & Penna. Ave., N.W. FBI-DOMESTIC INTELLIGENCE Assistant Commissioner Washington 25, D.C. DIVISION Investigations"
}
