{
	"anumber": "A10179278",
	"id": "A10179278_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1958, 1955, 2023, 1957, 1961, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/28/2023 Form approved. Budget Bureau No. 43-R079.7 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE ALIEN GISTRATION (Show the exact spelling of name as it appears on your alien reg- Mail or take to: istration receipt card, and number of your card. If you did not IMMIGRATION AND NATURALIZATION SERVICE register, so state.) Name Yen Mei-Ling Tuan gep No. A10 179 278 APPLICATION TO FILE PETITION FOR NATURALIZATION (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) I desire to file a petition for naturalization in the 734 Date: March 4, 1961 Southern Court at Peoria Illinois (Name of Court) (City) (State) Yen Mei-Ling Tuan (Print or type your present name) 446 West Pierce Street jour (Print or type apartment number, street address, and if appropriate 'in care of\") Macomb, McDonough Denn Illinois (City) (County) (State) (la) Was your father or mother ever a citizen of the United States Yes No. If \"Yes\" give full information (1b) Can you read and write English? Yes No. Speak English? Yes No. Sign your name in English ? Yes/ No. (2) In what places in the United States have you lived during the last 5 years FROM- To- STREET ADDRESS CITY AND STATE (a) May , 1955 May, 1957 Tougaloo College Tougaloo, Miss. , (b) June, 19 57 Sept. 1957 1113 East Wayne St. Sept. 57 57 Et. Wayne, Ind. (c) Aug. 58 1131 Summit St. Ft. Wayne, Ind. (d) Aug., 1958 Aug., 19 1134 Summit St. Ft. Wayne, Ind. (e) Sept., l, 1959 Present 1961 446 W. Pierce &702,8. Campbell, Macomb, Ill. (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years ? (If none, write \"None.\") FROM To EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 19 19 (b) 19 , 19 (c) 19 19 (d) Jan. 19 60 Feb. 19 60 Good Samaritan Home knoxvill, III, Bible worker. (e) , 19 19 (4) Have you been out of the United States since you first arrived? Yes No. If 'Yes' fill in the following informa- tion for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES (5) How many times have you been married? once How many times has your husband or wife been married? once If either of you has been married more than once, fill in the following information for each previous marriage. (Check one) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE ENDED CITIZEN ALIEN (a) (b) (c) (d) Form N-400 (Rev. 10-20-59) (1) (OVER)"
}
