{
  "anumber": "A10179278",
  "id": "A10179278_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0040/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        1923,
        1928,
        1954,
        1955,
        1901,
        1953,
        1913,
        1922,
        1924,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1 gust 1952) FOREIGN SERVICE OF THE UNITED STATES OF AMERICA NP Approved Bureau Budget I- 022327 No. 47-R108.1 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION A- 10 179 278 a special nonquota I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application Or/ane IMMIGRANT VISA and Refugee Relief Act of 1953 and the ALIEN REGISTRATION under the Immigration and Nationality Act to the American Vice Consul at Hong Kong 1. Family name Given name Initial 2. Place and date of birth Age TUAN Yen Mei-Ling; An Chiu, Shangtung, China; March 16, 1901; 54; 3. Other names by which I have been known 4. Last permanent residence None; 245 Sai Yee Street, 3rd Floor, Kowloon, Hong Kong; 5. Address in the United States 6. Name and address of person to whom destined, if any Tougaloo College, Tougaloo, Hinds County, Mr. TUAN, Render - husband - Tougaloo College, Tougaloo, Mississippi; Hinds County, Mississippi; 7. Name and address of nearest relative in home country 8. Travel documents presented TUAN, Pansy - daughter - Shanghai, China; Form of Affidavit in lieu of a Passport No. 37413 issued at Hong Kong; 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Chinese; Chinese; M Married Single 14. Complexion 16. Ethnic Classification Black-Gray; Brown; 5 ft. 2 in. 130 lbs. Yellow; F Chinese; Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Kindergarten Teacher & Christian Worker; None; Chinese - speak Mandarin only; 22. Intended United States port of entry 23. Final destination 24. I have (a) (x() 25. Purpose of going to the United States San Francisco, Calif.; Tougaloo, Miss.; through ticket to destination To join husband in the States; 26. Places of previous residence 1901-1913 An Chiu, Shangtung, China; 1913-1921 Wei Hsien, Shangtung, China; 1921- 1922 Peking, China; 1922-1923 Chang Chia Kou, Hupeh, China; 1923-1924 Tsinan, Shangtung, China; 1924- 1927 Ichang, Hupeh, China; 1927-1928 Ting Hai, Chekiang, China; 1928-1953 Shanghai, China; 1953-1954 27. Names and places of residence of spouse and minor children Macau; 1954-date Hong Kong; TUAN, Render - husband - Tougaloo College, Tougaloo, Hinds County, Mississippi; TUAN Pao Shing - son - Shangtung, China; TUAN, Pansy - daughter - Shanghai, China; TUAN, Douglas - son - 245 Sai Yee Street, 3rd Floor, Kowloon, Hong Kong; TUAN, Ben - son - - do - 28. Name and address of father 29. Name and address of mother YEN, Y.K. - deceased; YEN Chao-shih - deceased; under the Refugee Relief Act of 1953 Refugee Relie Act of 1953 and the 30. I claim to be a (nonquota (preference. quotaj immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: 1. I am an eligible refugee as prescribed by Section Certificate of non availability of birth, 2(a) of the Act, and am the beneficiary of Verified marriage records and of no police record; Assurance No. 10236 dated September 7, 1954; 2. Verified Assurance No. 10236 dated September 7, 1954; 3. Certificate of Readmission dated May 3, 1955; 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: Never; 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: Never; 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: Never; -8/11-1 (Application continued on reverse side) to etsb MOSA"
}