{
	"anumber": "A10179278",
	"id": "A10179278_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0027/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice, FBI—Identification Division, Form G-135b"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1968, 1901, 2023, 1902, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form G-135b Screened by NARA, 6/28/2023 Agency Name Check (Rev. 8-1-60) UNITED STATES DEPARTMENT OF JUSTICE 734 District Immigration and Naturalization Service File No. Chicago A10 179 278 Sub-office Date 4/29/61 DIRECTOR, FEDERAL BUREAU OF INVESTIGATION, dbp DEPARTMENT OF JUSTICE, Washington 25, D.C. Attention: IDENTIFICATION DIVISION Please furnish a copy of any criminal record shown in the fingerprint records of your Bureau con- cerning the following person. Fingerprints Attached Unavailable NAME (Surname in CAPS, First, Middle) DATE OF BIRTH SEX COLOR MARITAL 0 3-7459 March 16,1901 F W STATUS TUAN Mei-LING Yen PLACE OF BIRTH (City, province or state PRESENT NATIONALITY S M 5-39-653 ALIASES (Identify maiden name or nicknames) pel Ankiu Shantung & China China D W PARENTS' NAMES (Include present address, if known) HEIGHT WEIGHT EYES HAIR COMPLEXION 140 Gray IDENTIFYING MARKS OR SCARS 5'1\" Brown medium Glasses RECORDED RESIDENCE LAST FIVE YEARS (Street & No., RFD, etc.) (City, state and country) Tougaloo College, Tougaloo, Misso FROM5/55 TO 5/57 1131 Summit St., Ft. Wayne, Ind. IDE/57 1968/58 1134 Summit St., Ft. Wayne, Ind. 8/58 DIV 8/59 446 West Pierce St., Macomb, Ill. 9/59 Present PRIOR RESIDENCES, IF AVAILABLE EMPLOYMENT LAST FIVE YEARS (Employer's name and address) OCCUPATION OR PROFESSION FROM TO Good Samaritan Home, Knoxville, I. Bible work 1/60 2/60 Housewife Present PRIOR OCCUPATIONS (Not included in above) SPOUSE (Full name & any other names used, & present address, if not same as above) DATE OF BIRTH 6/20/1902 Ren-Deh Dah San Tuan PLACE OF BIRTH (City, province or Ankiu China state & country) ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) None NO ARREST RECORD LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years MAY4 1961 when previously in U.S.) PREVIOUS NUMBERS ASSIGNED (Milit. S/N; passport; social security; FBI; etc., identify each) PREVIOUS REPORTS FURNISHED BY FBITTON NO YES If yes attach list of POTTESION REASON FOR REQUEST APPLICANT FOR: DEPORTATION BENEF. PB #: Other (Specify) ADM. TO U.S. ADJ. OF STATUS PROCEEDINGS SPONSOR PB #: FOR RELIEF OF NATZ RETURN TO: DISTRICT DIRECTOR, (1) U.S. Immigration and Naturalization Service 312 Old Post Office Bldg., 12th & Penna. Ave., N.W. Assistant Commissioner Washington 25, D.C. FBI-IDENTIFICATION DIVISION Investigations"
}
