{
  "anumber": "A10179278",
  "id": "A10179278_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 10-20-59)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        2023,
        1957,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/28/2023 Form approved. Budget Bureau No. 43-R079.7. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE ALIEN GISTRATION (Show the exact spelling of name as It appears on your alien reg- Mail or take to: istration receipt card, and number of your card. If you did not IMMIGRATION AND NATURALIZATION SERVICE register, so state.) Name Yen Mei-Ling Tuan No. A10 179 278 gep APPLICATION TO FILE PETITION FOR NATURALIZATION (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) I desire to file a petition for naturalization in the- 734 Date: March 4, 1961 Southern Court at Peoria Illinois (Name of Court) (City) (State) Yen Mei-Ling Tuan (Print or type your present name) 446 West Pierce Street (Print or type apartment number, street address, and if appropriate \"in care of\") Macomb, McDonough Disney jour Illinois (City) (County) (State) (la) Was your father or mother ever a citizen of the United States? Yes No. If \"Yes\" give full information (1b) Can you read and write English ? Yes No. Speak English? Yes No. Sign your name in English ? Yes, No. (2) In what places in the United States have you lived during the last 5 years FROM- STREET ADDRESS CITY AND STATE (a) May 1955 May, 1957 Tougaloo College Tougaloo, Miss. (b) June, 57 19 Sept., 1957 1113 East Wayne St. Ft. Wayne, Ind. Sept. 57 57 (c) 19 Aug., 19 58 1131 Summit St. Ft. wayne, Ind. (d) Aug., 58 19 Aug., 59 19 1134 Summit St. Ft. Wayne, Ind. (e) Sept., 1, 19 59 Present' 19 446 W. Pierce &702,8. Campbell, Macomb, Ill. (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years ? (If none, write \"None.\") FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 19 19 (b) 19 19 (c) 19 19 (d) Jan. 19 60 Feb. 19 60 Good Samaritan Home noxvill, III. Bible worker. (e) , 19 19 Port (4) Have you been out of the United States since you first arrived? Yes No. If Yes' fill inc the following informa- tion for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus omc DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF UNITED STATES RETURNED T you Mei Ling Turn (5) How many times have you been married? once How many times has your husband or wi If either of you has been married more than once, fill in the following information for each previous (Che DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON 3 CITIZEN (a) (b) (c) (d) Form N-400 (Rev. 10-20-59) (1) (OVER)"
}