{
	"anumber": "A10179278",
	"id": "A10179278_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR INFORMATION FROM OR COPIES OF IMMIGRATION AND NATURALIZATION RECORDS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 2023, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/28/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVILE Budget Bureau No. 43-R104.5. APPLICATION FOR INFORMATION File No. Buf 76/16.3-C RAIS FROM OR COPIES OF IMMIGRATION FEE STAMP AND NATURALIZATION RECORDS. (See instructions on reverse) $ 3. 00 FEE PAID No. 178-18 Immigration and Naturalization Service Take or mail to- Buffalo, N. Y. RAIS Date 3-17-66 and IMMIGRATION AND NATURALIZATION SERVICE, Verified by (Fill in with typewriter or print in block letters in ink) It is requested that information from or copies of your records (File No., if known ) regarding the person named below be furnished solely for the purpose hereafter specified: 1. Data for identification (answer as completely as possible): 1. Family Name Given Name Middle Name 2. Allen Registration Number TUAN YEN MEI LING A 10 179 278 3. Other names used 11 any 4. Name used at time of entry Yen Mei-ling Tuan 5. Place of birth 6. Date of birth or age at entry: Ankiu, Shantung, China March 16, 1901 7. Port of entry 8. Port abroad from which left for United States 9. Date of Entry Honolulu San Francisco Hong Kong May 20, 1955 10. Name of vessel or other means of entry By S. S. President Wilson of 11. Names of accompanying passengers Douglas Tuan & Ben Tuan DD 12. Name and address of person to whom destined Dr. Ren-deh Tuan, Tougaloo, Miss. Like of NN 13. The information or copy of record requested 1e: Birthday Conformation or age records. NR 14. The particular purpose for which needed is: Send to Social Security Administration for Medical Care registration 15. Send information to Buffalo 2 Social Security Administration, 120 West Mohawk St., N. Y. 16. The information should be in the form of (letter, exact copy. or certified copy) Certified copy or letter If the Subject is or was a naturalized citizen of the United States, give the following information: 17. Name on Naturalization Certificate 18. Certificate Number 19. Naturalization Date Yen Mei-Ling Tuan 8125455 Sent. 20. Address at time of naturalization 21. Name and location of Naturalization Court 446 W. Pierce St. Peoria, Illinois Macomb, Illinois Mei-Ling I consent to the furnishing of the above information Mei-Ling & Ren-deh Tuan (see Instruction 3). (Name of person requesting Information) 245 Gorton St. (Address) (Address) Buffalo, New York 14207 Form N-585 (Rev. 10-10-61)"
}
