{
  "anumber": "A10139321",
  "id": "A10139321_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR VERIFICATION OF ARRIVAL, I-423"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Lithuania"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1906,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form I-423 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND INATURALIZATION SERVICE (Rev. 5-5-53) REQUEST FOR VERIFICATION OF Newark, N. J. Office of origin. A10 0 139 321 N-600 AP ARRIVAL MAIL 1901 1956 FROM -10 File number. Alien number. APR6 - 4/4/56 IMMIGRATION AND Date. NATURALIZATIO 1-77) SERVICE TO: Records Unit NEW YORK NY New York Index Book shows: It is requested that a search be made for a record of the entry into the United States of the person named below. If arrival is verified, please indicate by the following action: Wiener ROCHEL -FM XXIX Forward 2 copies of Form I-404 or I-404-A. SCHEINE - F S Check the data below. Indicate discrepancies, if any. ASIE - F F / Anne W. Friedlander (1) Present name. Annie Wiener (2) Name used at time of entry. Ellis Island, N. Y. (3) Port of entry. May, 1907 (4) Date of entry. unknown (5) Name of vessel or other means of conveyance. Lithuania (6) Place of birth. (City or town) (State) (Country) 11/2 yrs. old (7) Age at time of entry. mother and brother: Rose and Alfred Wiener (8) Names of accompanying passen- gers. Bather: Louis Wiener, New Haven, Conn (9) Name and address of person to unknown the all UNITED (10) Only whom destined. Port of embarkation. REMARKS 160 W J of 71319 Acting Officer in Charge (Name of official) (Title) REPORT OF SEARCH New york, Nise Port of entry. Remarks Date. psych (18) WORDEL Arrival verified as requested. CIV. NO. CLASS PLACE AND DATE OF ISSUE / R. NO. CHARGE TO QUOTA HEAD TAX STATUS Unable to verify on basis of above information. ma The following records have been searched: SX 1906-1908 Card index. name Index books. none Manifests. conques 1/ 011 OL CPS COTTON Shave (Signature Z of searcher) Ghey LIVERS Verification Clerk LO: Records Unit (Name of official) (Title) SEE REVERSE SIDE 12-9-1601- FOR INSTRUCTIONS ON USE - OF mf FORM - IIR (Relate, may W-V60(A)"
}