{
	"anumber": "A10294862",
	"id": "A10294862_0105",
	"page_index": 105,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0105/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 1955, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "I-217 Form Approved. UNITED STATES DEPARTMENT OF JUST Budget Bureau No. 43-R056.4 Immigration and Naturalization Service (Rev. 4-5-56) que opper BIGS psa UO£ peer IOI STRE YOU 9 flow or bavaboxf RECORD OF SWORN STATEMENT AR No. or File No. District New York, N.Y. 35 INSIDE Testimony taken at New York, NOYEL EXEBBOM on September 25, 1956 in the Chinese (Toyshan) language. If interpreter is used, give name SI' Hei&pe Szeto - U.S.P.N.S. BLOME 1-Q. I am an Immigration Officer of the United States Immigration and Naturalization Service and desire to question you under oath concerning your status under the immigration laws of the United States. Any statements which you make must be voluntary and may be used by the Government as evidence in any deportation or criminal proceeding. Are you willing to make such a statement freely and voluntarily under oath? A. Yeso 2-Q. Do you solemnly swear that the statements you are about to make will be the truth, the whole truth, and nothing but the truth, 80 help you God? A. Yes. MPGN MSB KING or If MSB! sing pe- a UOC USAG BAGJ gochingue GAGE TO 3-Q. What is your name? A. MAR DOO a.K.a. MAR AU SANG 4-Q. When and where were you born? A. K.S. 34-7-15 (1908) Lung Deng, Toy Shan, Kwangtung, hine GSCU China OILO 5-Q. Of what country are you a citizen? A. US? breaboto 6-Q. Was either parent ever a citizen or resident of the United States? A. Max My father used to live If so, give details in the United States and died in California when I was an infant. 7-Q. Are you or were you ever married? A. Yes, If so, give name, nationality, and address of present spouse OI and children Wong Lai Yung China Jon Sin 14 Gan Sin 12 yrs; Ma Bick Sam 24 yr Me Sheet Jin 20 yrsa Ma Shiao Won 18 VIS wife and childre were born and live in China. except Ma Bick Sam who lives in Hong Kongo 8-Q. Where, when (give hour and date), and how did you last enter the United States? A. Boston, Massachusetts April 30, 1955 as a crew member SS BRONXVILLE. 9-Q. Were you in possession of an unexpired immigration visa, border crossing card, or re-entry permit (specify) A. Chinese Passport and landing permit. grops seq C10 Q What was your destination, for what purpose did you enter, and how long did you intend to stay? A. I intended to continue sailing with mv. ship but I missed it. FOLL SNA COGUELAS you 11-Q. Where, when, and how did you first enter the United States? This is my first entry. TO page 12-Q. Have you been absent from the United States since first arrival? A. No. If so, where and L6G0Lq OI ONA LOUISION GELGINONA; during what periods? A. one 13-Q Were you ever refused admission to or deported from the United States? A. No. If so, when and where, and have you secured permission to reapply for admission? A. now 14 Q Have you ever been arrested anywhere No. ALE If 30, give details 15-Q. Have you complied with the registration and address report requirements of the Immigration and Nationality Act? No, 1 didn't know about it. sprosq 16-Q. Are you now or have you ever been a member of any organization? A. Chinese Seaman Union our Social Security account number? A. I don. have one. CUTUR - gecesseg le and willing to depart from the United States at your own expense? A. Yeso regoing or had dtread to me, and salemnly\\xwean that true and correct record of the statement made by it all the statements are true and correct. 8 Mar Do to bysco or Propp from CUTUS R bjucs or procp sing OABUSIL® orn to before me at New York, Noto on September 25, 1956 polor GPO 949753 Frank Go ayden LOK LEVAET Immigration Officer."
}
