{
  "anumber": "A10294862",
  "id": "A10294862_0192",
  "page_index": 192,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0192/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECEIPT OF OBLIGOR ON RETURN OF BONDS OR NOTES, Form I-303"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1957,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 F orm I-303 8203 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Account No. (Rev. 1-30-56) RECEIPT OF OBLIGOR ON RETURN OF BONDS OR NOTES JUL 28 1957 A10 294 862 New.York (City) New York (State) (Date) The undersigned hereby acknowledges receipt of the United States bonds/notes hereinafter described, deposited with Dist. Dir. IMS, New York, NY. , as security in lieu of surety or sureties (Name of officer and title) on bond dated Sept.26, 1956 , filed with Dist. Dir DANS New York, NY. , (Name and official title of officer) for the alien MAR. DOO aka MAR AD SAEG 48 years of age, (Name of alien) native of China Said United States bonds/notes are assigned (State form of assignment, if registered) TITLE OF BONDS/NOTES COUPON OR REGISTERED TOTAL FACE AMOUNT DENOMINATION SERIAL No. INTEREST DATES US Treas. Bond of 1967-72 due 6/15/72 32 eps $500 23% 10165₺ 12/15/56 s sea # 32 eps 8500 23% 852711 12/15/56 &sea (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely affix same hereto) I HEREBY CERTIFY THAT THE ABOVE BOND TO HAVE NEVER BY ME BEEN ASSIGNED ANY THAT I AM STILL THE LEGAL OWNER THEREOF COUPONS OTHER PERSON, CORPORATION, ETC., AND ng (Signature of obligor) Lim GPO 949752"
}