{
	"anumber": "A10294862",
	"id": "A10294862_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DECISION OF THE SPECIAL INQUIRY OFFICER"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form I-39 (Rev. 10-11-55) File No/ A-10294862 UNITED STATES OF AMERICA: UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE In matter of In Deportation Proceedings Under Section 242 Mar Doo of the Immigration and Nationality Act aka Mar av Sang DECISION OF THE Respondent. SPECIAL INQUIRY OFFICER The above-named respondent having appeared before me for hearing on OCT. 2 1956 pursuant to the annexed Order To Show Cause, and having admitted that the factual allegations con- tained therein are true, and having further admitted that he is deportable from the United States on the charges set forth therein, I have concluded that his deportability has been thereby established (8 CFR 242.16 (b)). Respondent has made application for voluntary departure in lieu of deportation. Respondent be directed has in specified the event his deportation as the country to which his deportation should is required by law. ORDER : It is ordered that the respondent be granted voluntary departure at his own expense in lieu of deportation within such period of time or authorized extensions thereof and under such con- ditions as the district director or officer in charge having administrative jurisdiction of the office in which the case is pending shall direct. IT Is FURTHER ORDERED That if the respondent fails to depart when and as required the privilege of voluntary departure shall be withdrawn without further notice or proceedings and the respondent deported from the United States in the manner provided by law on the charge (s) contained in the Order To Show Cause. OCT 2/1956 Date: (Special Inquiry Officer) Copy of this decision has been served upon the respondent. Appeal : Waived reserved the (Special Inquiry Officer) GPO 949656"
}
