{
  "anumber": "A10294862",
  "id": "A10294862_0251",
  "page_index": 251,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0251/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ORDER TO SHC USE AND PROCESSING SHEET, I-265"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 ESE Form I-265 UNITED STATES DEPARTMENT OF JUSTI Immigration and Naturalization Service (Rev. 3-20-56) APPLICATION FOR ORDER TO SHC USE AND PROCESSING SHEET MAR DOO A.K.A MAR AV SANG Name Office New York, N.Y. File A10294862 Address Soon Hing Farms, Green Lawn, LI NY TD country Validity SC iss. Requested of Date OSC serv. W/A serv. Det. ; Rel. ; Prison ; Hospital To Adjud. VD prior hearing to Ext. Supporting evidence (briefly itemize) I-213 I-217 The undersigned recommends That the above-named alien be granted voluntary departure without order to show Likely to That an order to show cause be issued and served on the above-named alien on the charges indicated. abscond. That a warrant be issued for the arrest of the above-named alien for the following reasons: Signature of Investigator Above recommendation approved Office Signature Suga Title 9-25-56 Date Apprehension data: Hearing Line 551 Case (Mexican) Line 552 Case (Other) (Check one) Date Place Hour DETENTION Place RELEASE Bond (amount) DATA Expense of DATA Parole Since Since PROCESSING DATA m Check column # 1 (when applicable) for action to be taken; column # 2 when action is taken # 1 # 2 1 # 2 Prepare order to show cause Obtain or other evidence of nationality from alien Prepare docket form Notify consulate Send index card (Form G-362) to MF & I Apply for Canadian consent Send \"corrected\" Form G-600 to Inv. index Apply for Mexican Certificate of Nationality Type and mail Agency Checks Complete passport data Form I-217 FBI (Identif.) FBI (Inv) Report property arrangements (if detained) CIA G-2 Other Notify FBI of selective service violation Two fingerprint sets: one to the FBI, other to file Notify FBI of entry as stowaway `ingerprints to Notify re apprehension: Photograph. Number quired District Office Regional Office CO Verify arrival Lodge detainer with civil authority at Record check Local police (Earliest possible release date is Prepare letter granting days to VD XX I-530 to CO Possible prosecution Will be represented at hearing Examining Officer recommended Interpreter necessary at hearing (language) CHINESE (TOY SHAN) (Over) GPO 949754 Approximate time hearing will take:"
}