{
  "anumber": "A10294862",
  "id": "A10294862_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER TO SHOW CAUSE AND NOTICE OF HEARING, I-221"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 I-221 (Rev. 3-23-56) File No. A10 294 862 38A UOY UNITED STATES OF AMERICA: of UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service In the Matter of ) noitbennes benebis ) In Deportation Proceedings under Section 242 Isnight MAR DOO; aka., MAR AU ) of the Immigration and Nationality Act SANG. ni ) aimed oils ORDER TO SHOW CAUSE ) UOV bas siti limbe and ) NOTICE OF HEARING Respondent. ) To: MAR DOO; aka. MAR AU SANG (name) of Soon Hing Farms, Green Lawn, Long Island, N. Y. (address) IT APPEARING, That you are in the United States in violation of law in that: 1. You are not a citizen or national of the United States; 2. You are a native of: China and a national of China 3. You last entered the United States at Boston, Mass. on April 30, 1955 ; 4. You were admitted as a nonimmigrant, to wit: a crewman, authorized to remain in the (date) U. S. in that status not to exceed 29 days. 5. You have remained in the United States thereafter without authority. and that you are subject to be taken into custody and deported pursuant to the following provision(s) of law: Sec. 241 (a) (2) of the Immigration and Nationality Act, in that, after admission as a nonimmigrant under Sec. 101 (a) (15) of said yes act you have remained in the United S tates for a longer time than permitted. IT IS ORDERED, That you appear before a Special Inquiry Officer of the Immigration and Naturalization Service of the United States Department of Justice at new York my on October 2,1956 at 9 A m. and show cause why you should not be deported from the United States on the charge(s) set forth above soiton IMMIGRATION AND DNATURALIZATION SERVICE EXHIEIT HIH ,855 (signature and title of issuing officer) DISTRICT CHIEF OF INVESTIGATIONS (City and State) Dated: September 25. 1956 egister NEW YO RK 23 Noi Yed under 686 (over) Immigration and Nationality Act at im York on 9-25-56 GPO 949754"
}