{
  "anumber": "A10294862",
  "id": "A10294862_0120",
  "page_index": 120,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0120/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit in Support of Application for Stay of Deportation Under Section 243h of the Immigration and Nationality Act, A10 294 862"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1958,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 AFFIDAVIT IN SUPPORT OF APPLICATION FOR STAY OF DEPORTATION UNDER Section 243h of the IMMIGRATION AND NATIONALITY ACT MAR DOO File No. A10 294 862 $2500 PAID No 84-46 STATE OF NEW YORK ) Immigration and Natural tion Service ) SS. : New York, N. Y. MAIL UNIT COUNTY OF NEW YORK ) Date/09-29-56 Accepted by gen MAR DOO, being duly sworn, deposes and says: My address is care of Soon Hing Farm, Box 54, Green Lawn, Long Island, New York. I am a native and citizen of China and have never acquired the citizenship of any other country. I entered the United States as a seaman on December 23, 1955 and by reason of the fact that I remained longer than authorized, I was made the subject of deportation proceedings. Although I was gtanted voluntary departure, the outstanding order to such effect provided that such departure from the United States be effected on or before November 3, 1956. Since I am not in a position to depart from the United States and since the Immigration and Naturalization Service has been advised accordingly, I assume that an order of deportation is now outstanding against me. This application is made for a stay of deporta- tion pursuant to the provisions of Section 243h of the Immigration and Nationality Act on the ground that if I were deported to China at this time, I would be subjected to physical persecution by rea- son of the fact that I am opposed to Communism. Sworn to before me this 22 day of October, 1956. #7 MAR DOO (In Chinese) Have Brus Mar Doo Notary Public MAR DOO (In English) HASKELL R. BARST Notary Public, State of New York No. 30-5200500 Qualified in Nassau County Commission Expires March 30, 1958"
}