{
	"anumber": "A10294862",
	"id": "A10294862_0199",
	"page_index": 199,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0199/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ORDER OF SUPERVISION, I-220-B Form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form I-220-B (Rev. 5-6-55) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 70 Columbus Avenue New York 23, NY DISTRICT FILE NO. A 10 294 862 PAR A. R. NO. (gige) DATE July 5, 1957 ORDER OF SUPERVISION In the case of MAR DOO also known as MAR AU SANNose deportation in accordance with law was ordered on November 5, 1956 Section 242(d) of the Immigration and Nationality Act provides: Any alien, against whom a final order of deportation was defined in subsection (c) heretofore or hereafter issued has been outstanding for more than six months, shall, pending eventual deportation be subject to supervision under regulations prescribed by the Attorney General. Such regulations shall include provisions which will require any alien subject to supervision (1) to appear from time to time before an immigration offi- cer for identification; (2) to submit, if necessary, to medical and psychiatric examination at the expense of the United States; (3) to give information under oath as to his nationality, circumstances, habits, associa- tions, and activities, and such other information, whether or not related to the foregoing, as the Attorney General may deem fit and proper; and (4) to conform to such reasonable written restrictions on his conduct or activities as are prescribed by the Attorney General in his case. Any alien who shall willfully fail to comply with such regulations, or willfully fail to appear or to give information or submit to medical or psychiatric examination if required, or knowingly give false information in relation to the requirements of such regula- tions, or knowingly violate a reasonable restriction imposed upon his conduct or activity, shall upon convic- tion be guilty of a felony, and shall be fined not more than $1,000 or shall be imprisoned not more than 1 year, or both.\" THEREFORE, it is hereby ordered that such alien shall be placed under supervision and permitted to be and to remain at large upon the following terms: (1) That said alien shall produce himself, at time and place designated, for deportation pursuant to the order of deportation. (2) That said alien shall upon request produce himself at a time and place designated for the purpose of sub- mitting to medical and psychiatric examination and/ or to furnish such information as may be deemed fit and proper. (3-a) That said alien shall not change (his) (bee) place of residence from New York (Immigration district, State or city) (8) without first securing written permission of the Officer in Charge of the Immigration and Naturalization Serv- ice at the address shown in (4) at least 48 hours prior to such contemplated change. (3-b) That said alien shall notify the Officer in Charge of the Immigration d Naturalization Service at the address shown in (4) of any change in residence or employment within 48 hours after change is made. (4) That said alien shall report in (WRITING) on the 1st day of eech MAY EACH YEAR (Week) at (a.m.) (p.m.) to the Officer in Charge of the Immigration and Naturali- (Month) zation Service at 70 Columbus Avenue, New"
}
