{
  "anumber": "A10294862",
  "id": "A10294862_0126",
  "page_index": 126,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0126/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Central Intelligence Agency, Form G-135a"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1908,
        1958,
        1962,
        2023,
        1909,
        1926,
        1963,
        1964,
        1927,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 Form G-135a Agency Name Check (Rev. 10-1-65) Office Boston, Mass. UNITED STATES DEPARTMENT OF JUSTICE File No. Immigration and Naturalization Service A-10 294 862(IB)AQM 150 Tremont St., Boston, Mass. 02111 DIRECTOR, CENTRAL INTELLIGENCE AGENCY Date May 10, 1966 2430 E Street, N.W., Washington, D. C. 20505 Attention: DEPUTY DIRECTOR, PLANS Please furnish any derogatory information that may be contained in your files concerning the following person. FBI Ident. Number (LAST NAME) (FIRST NAME) (MIDDLE NAME) DATE OF BIRTH PRESENT NATIONALITY July 15, 1908 China MAR Doo PLACE OF BIRTH MARITAL STATUS OTHER NAMES USED (Maiden name, names by former marriages, former names changed legally Kwangtung, China SINGLE WIDOW(ER) or otherwise, aliases, nicknames, etc. Specify which, and show dates used.) MALE FEMALE MARRIED DIVORCED MAR Au-Sang; MAR Gong-Doo HEIGHT WEIGHT COLOR COLOR IDENTIFYING MARKS EYES HAIR 5'4\" 125 brown black - IF MARRIED, WIDOWED,ORDIVORCED,GIVEFULLNAMEAND DATEANDPLACEOF BIRTH OF SPOUSE OR FORMER SPOUSE. INCLUDE WIFE'S MAIDEN NAME. GIVE DATES AND PLACES OF ALL MARRIAGES OR DIVORCES. WONG Lai Yung, born October 1909 in Tung Hing Village, Toyshan, China, married subject on December 27, 1927 in Lung Shing Village, China. PARENTS NAMES (Last name) (First name) DATE AND PLACE OF BIRTH (If known) ADDRESS Father MA Gwoon Gwoon China deceased WONG Shee \" \" Mother ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) Kuomintang since 1926 (the Nationalist Party) RESIDENCE LAST (5) (7) YEARS (Street & No., RFD, etc.) (City, state and country) FROM TO 2 Warrenton St. (3rd floor), Boston, Mass. (will soon move to 2/1966 Date 69 Mott St., New York, N.Y. (Apt. 11) 32 Oxford St. Boston) 10/1958 2/1966 EMPLOYMENT LAST (5) (7) YEARS (Employer's name) (Number, street, city, state) FROM TO Bamboo Hut, Lexington, Mass. 3/8/66 Date Four K Laundry, 9 Foxhurst Rd., Baldwin, N.Y. 1965 Broadway Pressing Co., 5060 Broadway, New York, N.Y. ) 1963 1964 Asia Shirt Pressing Corp., 509 46th St., Brooklyn, N.Y.) Quon Bing Tom (restaurant), 157 Belmont Ave., Newark, N.J. 1962 LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U.S.) 4/30/55, Boston, Mass. crewman U.S. PASSPORT NO. (If known) SOCIAL SECURITY # REASON FOR REQUEST ARMED FORCES SERIAL # DEPORTATION AND BRANCH OF SERVICE ADM. TO U.S. BENEF. PB #: NATURALIZATION ADJ. OF STATUS SPONSOR PB #: APPLICANT FOR CONDITIONAL ENTRY FOR RELIEF OF RETURN TO U. S. Immigration and Naturalization Service 119 D St., N.E. Assistant Commissioner Washington, D. C. 20536 Investigations FOR AGENCY REPLY group NO PERTINENT IDENTIFIABLE INFORMATION NOT TO BE SHOWN TO MAY 24 1966 FOREIGN NATIONALS REQUEST SEARCHED W/OUT BENEFIT OF SPELLING CENTRAL VARIANTS INTELLIGENCE AGENCY (3)"
}