{
	"anumber": "A10294862",
	"id": "A10294862_0246",
	"page_index": 246,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0246/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT, Form L-217"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023, 1955, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form I-217 Form Approved. UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R056.4 Immigration and Naturalization Service (Rev. 4-5-56) CPS orger. sige pse DJC peeu ru 8 or RECORD OF SWORN STATEMENT AR No. or File No. 35 District New York, N.Y. WELKE Testimony taken New York, N.Y. at on September 25. 1956 in the Chinoso (Toyshan) language. If interpreter is used, give name SI Szeto USTINS. 1-Q. I am an Immigration Officer of the United States Immigration and Naturalization Service and desire to question you under oath concerning your status under the immigration laws of the United States. Any statements which you make must be voluntary and may be used by the Government as evidence in any deportation or criminal proceeding. Are you willing to make such a statement freely and voluntarily under oath? A. 2-Q. Do you solemnly swear that the statements you are about to make will be the truth, the whole truth, and nothing but the truth, so help you God? sing MJGLG If MAS MUST RING or If MSB: sug MUST pe- rd S-Q. What is your name? cora UOS USAG CLEAST DOO bazaborr SEC CLUB not psas S DOM gig UG GAGI A. 4-Q. When and where were you born? A. KS. 34-7-15 (1908) Lumg Dong. Toy Shan, Kwangtung, Uhina OI THE 680p 5-Q. Of what country are you a citizen? A. China 18\" 6-Q. Was either parent ever a citizen or resident of the United States? A. father used to live If so, give details in the United States and died in California when I was an infant. G-Q. Are you or were you ever married? or A. Xesa If so, give name, nationality, and address of present spouse and children Lad Yung China side dom Sim 14 Gan Sin 12 yrs, Ma Bick Sam 24 yrs; 20 Ma Shino Non 18 1816 born and live in who 8Q Where, when (give hour and date), and how did you last enter the United States? A. Boston, Musanchusetts April 30, 1955 as a orew member SS BRQNXVILLE. 9 Q. Were you in possession of an unexpired immigration visa, border crossing card, or re-entry permit (specify) ? A. Chipese Passport and landing permite gays sing brace oz suq numper of N RITOJAN c10-Q. What was your destination, for what purpose did you enter, and how long did you intend to stay? A. I intended to with my ship but I dissed it. or sur mauced NON 11-Q. Where, when, and how did you first enter the United States? This is my first entry. 10 psyc sqq.622 IIJ USTIAG CONDILA No. Date 12-Q. Have you been absent from the United States since first arrival? A. If so, where and L6COLQ OI SUA LGTI&rosa during what periods? A. 13-Q. Were you ever refused admission to or deported from the United States? A. No. If so, when and where, and have you secured permission to reapply for admission? A. 14-Q Have you ever been arrested where If so, give details 15-Q. Have you complied with the registration and address report requirements of the Immigration and Nationality Act? A. sprosq 16-Q. Are you now or have you ever been a member of any organization A. Chinese Seaman Union 17-Q What is your Social Security account number? A. don have one. 18-Q. Are you able and willing to depart from the United States at your own expense? A. Yes. I have read the foregoing or had it read to me, and solemnly swear that it is a true and correct record of the statement made by me on this day and that all the statements are true and correct. bjacc or Mar Do 77 blues of suq JELSE CIFA po bjsce of PILIP direction Subscribed and sworn to before me at New York, elo September 25, 1956 GPO 949753 break OF \"yyen on Immigration Officer. LOK LIVATE DOCONEL"
}
