{
  "anumber": "A10294862",
  "id": "A10294862_0278",
  "page_index": 278,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0278/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/18/2023, Form G-139"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form G-139 (Rev. 5/23/55) Immigration & Naturalization Service 70 Columbus Avenue Requesting Office Number File No. New York 23, N.Y. 0300 A10 090 167 G-JS (Address of requesting office) AR No. (If different than File No.) AGENCY ADDRESS CHECK REQUEST Date TO: April 16, 1956 SOCIAL SECURITY ADMINISTRATION THROUGH OFFICER IN CHARGE CHIEF, RECORDS ADMINISTRATION BRANCH CENTRAL OFFICE BALTIMORE, MD. The whereabouts of the alien named herein are being sought by this Service. It is requested that, in accordance with the provisions of section 290 of the Immigration and Nationality Act, all available information be furnished from your records which may be of assistancein establishing his location and identity. Indicate discrepancies, if any, and insert missing or more recent information, if available, on the face or reverse of this form. (1) IDENTIFYING INFORMATION NAME (Last (CAPS), first, middle) DATE OF BIRTH (OR AGE) SOCIAL SECURITY ACCOUNT NUMBER July 15, 1908 MOM, DOH SANG CITY & COUNTRY OF BIRTH STATE & DATE S.S. NO. ASSIGNED ALIASES (include nicknames & maiden name) Shanghai, China SEX COLOR NATIONALITY M Y Chinese FATHER'S FULL NAME MOTHER'S FULL MAIDEN NAME (2) RESIDENCE (List last three - Latest first) AS OF (Date) NUMBER & STREET CITY OR TOWN & STATE (1) (2) (3) LATEST ADDRESS IN SS-5 FILE (FOR SOCIAL SECURITY ADMINISTRATION USE ONLY) (3) EMPLOYMENT (List last three - Latest first) AS OF (Date) EMPLOYER'S NAME EMPLOYER'S ADDRESS (1) (2) (3) W. T. FLAGG H.T.Flagge REPORT OF SEARCH Name of requesting officer USE REVERSE FOR REMARKS NOT INSERTED IN ABOVE SPACES AND FOR SOCIAL SECURITY District Chief of Investigations ADMINISTRATION EMPLOYMENT INFORMATION Title RECORD HAS BEEN LOCATED WHICH APPEARS TO RELATE. ISCREPANCIES NOTED. FOR SEARCHER'S USE ONLY UNABLE TO IDENTIFY RECORD ON BASIS OF ABOVE INFOR- MATION. 9.02 Number or 8 ignature of searcher DATE OF FINAL SEARCH 4/24/06"
}