{
  "anumber": "A10294862",
  "id": "A10294862_0201",
  "page_index": 201,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0201/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1957,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 I-241 (4-1-56) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 70 Columbus Avenue New York 23, N. Y. FILE: A10 294 862 PAR British Visa Office DATE: June 25, 1957 630 Fifth Avenue New York, N. Y. Dear Sir: RE: MAR DOO also known as MAR AU SANG The above-named subject has been ordered deported from the United States in accordance with Section 243 of the Immigrati on and Nationality Act. Any person ordered deported from the United States may designate the country to which he may be sent provided such country is willing to accept him. The above-named person has designated HONG KONG as the country to which he wishes to be deported. There follows biographical data relating to this person and it would be appreciated if you will advise this office whether you will grant permission for entry into your country. Date and place of birth: K.S. 34-7-15 (1908) Lung Deng, Kwangtung, China Present nationality Chinese Occupation laborer Res idence in U. S c/o Soon Hing Farm, Green Lawn, LI, N. Y. Grounds for deportation After admission as seaman, remained longer Prior residence into : Last foreign address Hong Kong. Was member of Hong Kong Seaman Union Relatives or friends in : Son - Ma Bick Sam resides Hong Kong (address unknown) Name and address of closest relative: Wife - Wong Lai Yung and 4 children residing in Kwangtung, China Criminal Record : none Will you kindly return the duplicate of this letter, submitting your decision to our request. The enclosed self-addressed envelope, requiring no postage, may be used for your reply. Your cooperation in this matter is greatly appreciated. Attached are Application Form, Very truly yours, in duplicate, warrant of deportation, 3 photographs fingerprint chart A. J. Salturelli Chief, Parole Section Officer in Charge Date: Immigration and Naturalization Service The case of has been considered, and it has been determined that he or she will (not) be permitted to enter as a deportee from the United States. CONSUL OF Encl. GPO 907098"
}