{
	"anumber": "A10294862",
	"id": "A10294862_0229",
	"page_index": 229,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0229/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY, 94827"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1967, 2023, 1935]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 34 himself or herself or for such other purpose as delivery of the alien may be requested, or by virtue of which issuance 35 or execution of an order of deportation is or may be deferred, or by virtue of which the said alien is or may be 36 permitted to depart voluntarily from the United States, shall be in any manner construed to impair or render void 37 this obligation or any part thereof. 38 39 40 41 42 43 orper 44 45 46 47 48 In line #1 \"we\" changed to \"I! in line #5 \"are\" changed to \"am\" 49 prior to execution of bond pouq SIGNED AND SEALED IN THE PRESENCE OF- Name Evelyn 2. Frame Address 70 Columbus Avenue, New York 23,NY Name Address Paylein 70 Columbus Avenue, Hailey New X My York 23, NY Name Address AFFIX SEAL Name Address VTO SST ses FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States bonds/notes described in the annexed schedule are hereby pledged as security for the performance and fulfillment of the foregoing undertaking in accordance with section 15 of title 6, United States Code and Treasury Department Circular 154 (revised), dated February 6, 1935. (31 CFR, part 225.) My Lim TITLE OF BONDS/NOTES COUPONS FACE INTEREST ATTACHED VALUE RATE SERIAL NO. INTEREST DATES US Treas. Bond of 1967-72 due 6/15/72 32 cps $500 21% 10165E 12/15/56 & sca II 11 32 cps $500 21% 8527H 12/15/56 & ca GPO 948927"
}
