{
	"anumber": "A10294862",
	"id": "A10294862_0247",
	"page_index": 247,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0247/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT, CLO 2037"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT Office CLO 840523 1. Sex: Male Female 2. Occupation Laborer gopecupeg sug BAOLIN to pejole 100 on 3. Nearest large city to place of birth Toyalian, China Distance and direction from place of birth use ON sug concept 4. Father's name, place of birth, and present address Max thos GOLLEGE LOGOLO or cue wage TO yrs Aon appe aug in gabric ILOM sua 218162 of Aoat OAL Y 5. Mother's maiden name, place of birth, and present address Wong hoo born China - deceased re VIS Aon 1104 OL psas Aon GAGL peen 8 LOCUPSI of SIDA OLESUNSUCION 6. Names, addresses, and relationship of relatives abroad TO (TAG Aon MIPP que sug 7. Names. locations, and dates (years) of attendance of foreign schools 7 8. Names, locations, and dates (years) of attendance of foreign churches V None 13 MOLO Aom GAGE toymage to or gebox.peq FLOXD fjue nutfeg MADE betroge 9. Was a record made of any religious ceremony? IS Haas Aom peex speeds from fue anice gref ELLIABIS V 80 MUGGLE sign 10. Last address in native country Toyahan, China 11. Date left native country 1950 appear Aon Last foreign address Nong 13. Date left last foreign address 1335 If naturalized citizen of any country, how was citizenship acquired? TOL MUST harbone gig sea suces and JOU8 gig Aoa supers so (Show date and place of naturalization and number of certificate, if known) y' 15. If citizenship is different from country of birth, explain: polger CLOBBINE OL LG-GIFIL beling (abecità) punc (9976)* FING pum 919 Aun Just 16. Last entry into the United States was from (Give name of last foreign port and country) 17. In possession of travel document or passport at time of entry Yes No BTOK Describe nature of document(s) oz suq aggiesa OI abones 16 so &IAG gersija OL 18. State whether subject has passport, birth certificate, baptismal certificate, certificate of military service, or any document to QI MUSE COMUSID BLS Aon establish nationality and/or identity. List each: Mpco sug MPGLE MGLS polus 19. AO/IL If subject not have travel document or passport at time of entry, or does not have such a document now, did he ever profobtain one Yes N09 VState how, when, and where it was obtained; what kind of document it was; and what be- came of hon RMSTL fust the Aom so MITT pe CP6 the MJJOJG flocp sug ancp 8 [LOGTA suq muger 20. pc gug USA pe p2 CPS 88 TO SUA OL CLINING VIG MIJUNE fo WSKS If deportable to Canada, give date and port of arrival in Canada and name of vessel: you MUCH Aon make moar SIN SII or fue nuge suq sig 968116 fo Aon 21. Personal description: Height Weight 140v 086q KYAG Demo Eyes Brown Hair Black Face Nose TERRITONA COKEN of Mouth UII Distinctive marks MOTE OVER EYEBROW se 22. Remarks: DIRELICE OX no VB no If the other side has not been executed, the information should be inserted for use in securing a travel document or passport. QUILED SIVLES DEBVKINEWI OK Indica BOLGEN no 43-3020' LOLW yobioaeq"
}
