{
	"anumber": "A10294862",
	"id": "A10294862_0108",
	"page_index": 108,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0108/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT, Form 1-217"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023, 1955, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form I-217 UNITED STATES DEPARTMENT OF JUSTICE Form Approved. Immigration and Naturalization Service Budget Bureau No. 43-R056.4 (Rev. 4-5-56) BIGS pea peen IN BOCALINE E [ISAG] or boweborf\" RECORD OF SWORN STATEMENT AR No. or File No. 35 : District New York, N.Y. New York, N.Y. Testimony taken at September 25, 1956 on Chinese (Toyshan) in the language. If interpreter is used, give name 31 LELEOUS] genclib Szeto BLOMM 1-Q. I am an Immigration Officer of the United States Immigration and Naturalization Service and desire to question you under oath concerning your status under the immigration laws of the United States, Any statements which you make must be voluntary and may be used by the Government as evidence in any deportation or criminal proceeding. Are you willing to make such a statement freely and voluntarily under oath? A. 2-Q. Do you solemnly swear that the statements you are about to make will be the truth, the whole truth, and nothing but the truth, so help you God? A. Yes, sug MPGLG use MUST KIUG of MSB! pe- 3-Q. What is your name? A. 110g USAG gocnut MAR DOO OMAR AU SANG psas ancif 4-Q. When and where were you born? A. K.S. 34-7-15 (1908) Lung Deng, Toy Shan, Kwangtung, hine SSCU 5-Q. Of what country are you a citizen? A. China 18 6-Q. Was either parent ever a citizen or resident of the United States? A. Max My father used to live If so, give details in the United States and died in California when I was an infant. 7-Q. Are you or were you ever married? A. or Yes. and children Lai If so, give name, nationality, and address of present spouse org Yung China Ma Jon Sink 14 yes Gan Sin 12 yrs; Ma Bick Sam 24 yrs China, who lives in Sh ot Jin. 20 yrs; Ma Shiao Won 18 yrs; and childre were born and live in 8-Q. Where, when (give hour and date), and how did you last enter the United States? A. Boston, Massachusetts April 30, 1955 as a crew member SS BRONXVILLE. 9-Q. Were you in possession of an unexpired immigration visa, border crossing card, or re-entry permit (specify) ? A. Chinese Passport and landing permit. (apon soq DJSCG or and 10 What was your destination; for what purpose did you enter, and how long did you intend to stay? A. I intended to continue sailing with my ship but I missed it. or sua COUNCIAS HOM 11-Q Where, when, and how did you first enter the United States? A. This is my first entry. 3020 10 aggi622 III DEFINE COMBILA 2-Q. Have you been absent from the United States since first arrival? A. No. or LOGOLQ USOS OI SUA If so, where and during what periods? A. 13-Q. Were you ever refused admission to or deported from the United States? A. No. If so, when and where, and have you secured permission to reapply for admission? A. 14 Q. Have you ever been arrested anywhere? A. No. If 80, give details A. No, 15-Q. Have didn you complied know with the registration and address report requirements of the Immigration and Nationality Act? 16-Q. Are you now or have you ever been a member of any organization? A. Chinese Seaman Union 174Q What is your Social Security account number? A. I don have one. 18-Q. Are you able and willing to depart from the United States at your own expense? A. Yes. have read the foregoing or had it read to me, and solemnly swear that it is a true and correct record of the statement made by me on this day and that all the statements are true and correct. Mar Do [8186 CITA to byree of PILIP Subscribed and sworn to before me at New York, N.Y. September 25, 1956 on spotsz GPO 949753 Frank ayden LOK LEVAET DOCOMENT Immigration Officer."
}
