{
  "anumber": "A10294862",
  "id": "A10294862_0253",
  "page_index": 253,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0253/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT, Form L-217"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1955,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 Form I-217 Form Approved. UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R056.4 Immigration and Naturalization Service (Rev. 4-5-56) It gue offer BIGG pre DOS peen executed IS {LEAG] or beenborf RECORD OF SWORN STATEMENT AR No. or File No. 35 : District New York, NY, WELKE Testimony taken at New York, N.Y. September 25, 1956 on in the Chinese (Toyshan) Womp language. If interpreter is used, give name SI' a Syeto - 1-Q. I am an Immigration Officer of the United States Immigration and Naturalization Service and desire to question you under oath concerning your status under the immigration laws of the United States. Any statements which you make must be voluntary and may be used by the Government as evidence in any deportation or criminal proceeding. Are you willing to make such a statement freely and voluntarily under oath? A. 2-Q. Do you solemnly swear that the statements you are about to make will be the truth, the whole truth, and nothing but the truth, so help you God? A. 911q MUGLS If MBB MPS lgug or If MS sing pe- id UOS USAS CLEAGE DOO reaborr 4.6 VOC pase encp S gocmuguf UOM pe GAGI 8-Q. What is your name? A. 4-Q. When and where were you born? A. K.S. 34-7-15 (1908) Lung Deng, Toy Shan, Kwangtung, hina OL THE GSCJ: 5-Q Of what country are you a citizen? A. China 18' 6-Q. Was either parent ever a citizen or CGL resident of the United States? A. Has My father used to live If so, give details in the United States and died in California when I was an infant. 7-Q. Are you or were you ever married? A. Yes, If so, give name, nationality, and address of present spouse and children ong Lai Tamg China Jon Sin 14 Gan Sin 12 yrs; Ma Bick Sam 24 yrs 20 Shino Non 18 and live in who TIVES in 8-Q. Where, when (give hour and date), and how did you last enter the United States? A. Boston, Massachusetts April 30, 1955 as a crew member ss BRONXVILLE. Q. Were you in possession of an unexpired immigration visa, border crossing card, or re-entry permit (specify) ? A. Chirinna Passport and landing permite (apos gape sug bjorce or sug or 16 c10-Q. What was your destination, for what purpose did you enter, and how long did you intend to stay? A. I intended continue smiling with my ship but I gissed it. CINISCIL SUN courses pan 11-Q. Where, when, and how did you first enter the United States? This is my first entry. 3820 10 r'saf III USTIAG COMUSLA 12-Q. Have you been absent from the United States since first arrival? A. No. If so, where and LEGOLO USSE or SDA 18.10.12 during what periods? A. 13-Q. Were you ever refused admission to or deported from the United States? A. No. If so, when and where, and have you secured permission to reapply for admission? A. 14-Q Have you ever been wwere? If so, give details 15-Q. Have you complied with the registration and address report requirements of the Immigration and Nationality Act? A. didn sprosq 16-Q. Are you now or have you ever been a member of any organization? A. Chinese Seaman Union 17-Q What is your Social Security account number? A. I don one. 18-Q. Are you able and willing to depart from the United States at your own expense? A. Yes. read the foregoing or had it read to me, and solemnly swear that it is a true and correct record of the statement made by me on this day and that all the statements are true and correct. or Mar Do propp sug 3\" JEL&S cifi so bysce or Subscribed and sworn to before me at New York, September 25, 1956 GPO 949753 ayden on alfaylen LOK LIVATI OB Immigration Officer."
}