{
	"anumber": "A10294862",
	"id": "A10294862_0218",
	"page_index": 218,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0218/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/18/2023, 3-2677"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 3-2677 UNITED STATES DEPARTMENT OF JUSTICE Rev. 12/19/55 Immigration and Naturalization Service studon 70 Columbus Avenue New York 23, N. Y. October 3. 1956 Please refer to this file number: Mr. Mar Doo A10 294 862 DDPB or Mar Au Sang Soon Hing Farms Green Lawn, Long Island, New York Dear Sir: You are hereby informed that a final order has been entered in your case directing that an order of deportation be not entered at this time, but that you be required to depart from the United States, without expense to the Service, to any country of your choice, within such time and under such conditions as the Officer in Charge of this district deems appropriate. It was further directed that should you fail to avail your- self of such privilege that you be deported from the United States pursuant to law. In view of the foregoing, you should arrange to depart from the United States on or before November 3. 1956, advising this office by telephone, CIrcle 6-4165, Extension 368, at least five days in advance of the date, port and manner in which you intend to leave, so that your departure may be verified by an officer of this Service and your case closed. You are also directed to appear at this office on October 17, 1956 with satisfactory evidence of booked transportation and have valid passport showing that you have completed arrangements for your departure from the United States. Should you fail to appear on this date with satisfactory evidence of your intention to depart from the United States, it will be assumed by this office that you do not intend to avail yourself of the privilege of departing from the United States voluntarily. Very truly yours, EDW. J. SHAUGHNESSY CC: Mr. Ng Lim District Director 40 Division Street New York District New York, N. Y. By: A. a.g J. Salturelli faltmells Chief of Parole Section"
}
