{
	"anumber": "A10294862",
	"id": "A10294862_0183",
	"page_index": 183,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0183/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BARBER Steamship Lines, Inc."
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Uruguay",
				"Indonesia",
				"Norway",
				"China",
				"United States",
				"Singapore",
				"Brazil",
				"Philippines",
				"Japan"
			]
		},
		"years": {
			"ms_years_nlp_v1": [1955, 2023, 1883, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 CABLE: \"PYCBRIDA\" NEW YORK ESTABLISHED 1883 TELEPHONE WHITEHALL 4-1300 USE BOE'S AND BENTLEY'S CODES TELEX: N. Y. 2373 AND M. N. Y. 0067 STEAMSHIP LINES BRANCH OFFICES UNITED STATES TO DETROIT, MICH. CLEVELAND, OHIO PHILIPPINES. CHINA, JAPAN EUROPEAN AGENTS COLONY OF SINGAPORE BARBER STEAMSHIP LINES. LIMITED THAILAND, SOUTH VIET NAM 51 BISHOPSGATE. AND INDONESIA LONDON, E.C. 2, ENGLAND 1 SOUTH AND EAST AFRICA BRAZIL AGENTS FOR URUGUAY AND ARGENTINE AZORES, MADEIRA, CANARY, THE UNION-CASTLE MAIL STEAMSHIP CO., LTD. SHERATON - WHITEHALL BUILDING CAPE VERDE ISLANDS AND CAYZER, IRVINE & CO., LTD., (CLAN LINE) HOUSTON LINE LTD. WEST AFRICA WILH. WILHELMSEN 17 BATTERY PLACE SCANDINAVIA FEARNLEY & EGER MIDDLE EAST A. F. KLAVENESS & CO.,A/S NEW YORK 4, N. Y. MEDITERRANEAN February 18, 1959 Your File: A10 294 862 ddp U. S. Department of Justice Imm&gration And Naturalization Service 1060 Broad Street Newark 2, New Jersey Att: Deportation Section Dear Sirs: MAR DOO, aka MAR AU SANG We have your letter of the 16th instant advising us of proceedings to deport subject crewmember alleged to be deserted from the M/S \"BRONXVILLE\" which is managed by Messrs. A. F. Klaveness & Co., A/S, Lysaker, Norway, for whom we act as agents. We have checked our crew lists for the date of proposed desertion (April 30, 1955) but have found no record of subject crewmember ever being employed on aforementioned vessel. Very truly yours, BARBER STEAMSHIP LINES, INC. JPD John Operating P Department Countriety 17:01 WV 6T 833 6561 03113038"
}
