{
  "anumber": "A10294862",
  "id": "A10294862_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0043/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "1957 ADDRESS REPORT CARD (PRINT OR TYPE), FORM 1-53"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1908,
        1956,
        1955,
        2023,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 1957 ADDRESS REPORT CARD (PRINT OR TYPE) INSTRUCT ONS (1) MY NAME IS FILLING OUT THIS CARD. (LAST) Mar Doo (2) ALIEN REGISTRATION LETTER AND NUMBER READ CAREFULLY BEFORE (FIRST) (MIDDLE) COMPLET ALL NUMBERED BLOCKS. (3) I REPORTED UNDER THE NAME OF ITEMC2 LOOK AT THE NUMBER ON YOUR Doo SOUNDEX CODE (DO HOT WRITE in THIS SPACE) ALIEN RECEIPT. THE NUMBER MAY HAVE (LAST) mar (FIRST) (NIDDLE) A LETTER SUCHAS A'. 'V'. 'r'. 'L'. OR (4) MY ADDRESSIN THE UNITED STATES IS 's', BEFORE COPY THE LETTER AND NUMBER EXACTLY AS IT APPEARS ON YOUR RECEIPT. 40 (STREET ADDRESS Division St. (s) I WAS BORN LN (6) : WAS BORN ON ITEM 3 - USE THE SAME NAME YOU USED China (CITY) new York (COUNTY) R.Y. PAM IN THE UNITED (STATE) (7) STATES AS (CHECK ONE) IN FILING THE 1956 REPORT. IF YOU DID NOT REPORT IN 1956 USE THE NAME YOU July (MORTH 15 (DAY) (YEA) PERMANENT RESIDENT REGISTERED UNDER AS AN ALIEN. (8) 1 ENTERED THE UNITED STATES AT (H) I ENTERED THE UNITED STATES o 1908 VISITOR ITEM 4 - IF YOU ARE A PERMANENT RESI- DENT OF THE U. S. GIVE YOUR PERMANENT ADDRESS. ALL OTHERS GIVE ADDRESSES ITEM 12 - SIGN YOUR NAME AND THE new York may (NORTH) 8 1955 (YEAR) STUDENT PLACE OF ENTRY (10) I AM A CITIZEN OF (11) SEX (CHECK ONE) AS OF THE DATE OF THIS REPORT. OTHER MALE FEMALE 2 COUNTRY) (SPECIFY) DATE ON WHICH YOU FILLED OUT THIS CARD. (12) 1 CERTIFY THAT THE ABOVE STATEMENTS ARE TRUE TO THE REST OF MY KNOWLEDGE WHEN COMPLETED RAND CARD TO CLERK IN ANY U. S. POST OFFICE. DO NOT MAIL IT U.S. DEPT. OF JUSTICE - INMIGRATION AND NATURALIZATION SIGNATURE OF ALIEN. (IF UNDER 14 YEARS OF SERVICE. FORM 1.53 (REV. 1-1-67) DO NOT FOLD OR TEAR CARD AGE SIGNATURE OF PARENT OR GUARDIAN) 1/14/87 BATK BUBGET BUREAU APPROVAL No. 43-A-3058"
}