{
  "anumber": "A10294862",
  "id": "A10294862_0069",
  "page_index": 69,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0069/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1953,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 camp at a farming unit. He stated that be escaped from the Communists in 1953 but that they confiscated all of his property in China and assessed a fine of five million Chinese dollars against him. He stated be was forced to sell everything that he, his wife and his children owned to try to pay the fine but that he was unable to pay it in full and was therefore sent to a labor camp. He stated that because of his escape from the labor camp, be believes he would be killed if he returned to China. The respondent states that most of the members of his family are now in the western hemisphere and he has no home to which he could return in the Far East. He further stated that he does not know how he would make a living if he were returned to Hong Kong from whence he came. The respondent's only relative in the United States is a daughter who is a permanent resident of this country. He is not entitled to any preference under the quota of China. He could not, therefore, obtain a visa with which to reenter for permanent residence in the foreseeable future if he were to depart from this country. Upon consideration of this fact and the hardship elements cited by the respondent, it is concluded that his deportation would result in extreme hardship to him. He is statutorily eligible for the privilege of suspension of deportation. Upon consideration of his residence of eleven years in the United States, his good moral character and the difficulties he would encounter if he returned to China, it is concluded that suspension of deportation should be granted as a matter of discretion in this case. .4."
}