{
  "anumber": "A10294862",
  "id": "A10294862_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0038/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "1959 ADDRESS REPORT CARD (PRINT OR TYPE), FORM 1-53"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1955,
        2023,
        1908,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 1959 ADDRESS REPORT CARD (PRINT OR TYPE) INSTRUCTIONS (1) MY NAME IS READ CAREFULLY BEFORE (FIRST) Doo (2) ALIEN REGISTRATION LETTER AND NUMBER FILLING OUT THIS CARD. (LAST) mar (MIDDLE) COMPLETE ALL NUMBERED BLOCKS. (3) (CHECK ONE) SOUNDEX CODE (DO NOT WRITE IN THIS SPACE I HAVE APPLIED FOR U.S. CITIZENSHIP ITEM 2 - LOOK AT THE NUMBER ON YOUR HAVE NOT ALIEN RECEIPT. THE NUMBER MAY HAVE A LETTER SUCH AS 'A', 'T', OR 'L', (4) MY ADDRESS IN THE UNITED STATES IS BEFORE IT. COPY THE LETTER AND NUMBER EXACTLY AS IT APPEARS ON YOUR RECEIPT. (5) 69 (STREET WAS BORN ADDRESS Matte IN OR RURAL ROUTE) St. new (6) LWAS BORN York ON (CITY) Manhattan (COUNTY) (7) I AM IN ITEM 4 - IF YOU ARE A PERMANENT RESI- THE UNITED STATES AS DENT OF THE U. S. GIVE YOUR PERMANENT (9) I (MONTH) ENTERED THE (DAY) UNITED 15 STATES 1908 (YEAR) ON Justy Ry (STAYE) ADDRESS. ALL OTHERS GIVE ADDRESSES China (CHECK ONE) PERMANENT RESIDENT AS OF THE DATE OF THIS REPORT. (8) I ENTERED THE UNITED STATES AT VISITOR ITEM 12 - SIGN YOUR NAME AND THE DATE ON WHICH YOU FILLED OUT THIS CARD. (10) I AM A-CITIZEN OF OF ENTRY) City may 8 (MONTH) (DAY) 1955 (YEAR) STUDENT (11) SEX (CHECK ONE) WHEN COMPLETED HAND CARD TO China OTHER MALE 1 FEMALE 2 CLERK IN ANY U. S. POST OFFICE. (SPECIFY) (12) I CERTIFY THAT THE ABOVE STATEMENTS ARE TRUE TO THE BEST OF MY KNOWLEDGE: DO NOT MAIL IT mar Doo DO NOT FOLD OR TEAR U. S. DEPT. OF JUSTICE - IMMIGRATION AND NATURALIZATION SIGNATURE OF ALIEN. (IF UNDER 14 YEARS OF DATE CARD SERVICE. FORM 1-53 (REV. 1-1-59) AGE SIGNATURE OF PARENT OR GUARDIAN) BUDGET BUREAU APPROVAL No. 43-R-306.7"
}