{
  "anumber": "A10294862",
  "id": "A10294862_0255",
  "page_index": 255,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0255/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1956,
        1955,
        2023,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 3-1990 File No.: Rev 3-53(50) Date: September 25, 1956 RECORD OF SWORN STATEMENT 17-Q. Do you want to apply for the privilege of voluntary departure at your own expense? A Yes. 18-Q. How soon would you be able to leave? A. Assom as X cana 19-Q. In what manner would you depart? A As a - 20-Q. To what country would you go? A Anywhere with ship 21-Q. What assurance do you have that you would be admitted to that country? Mena, I am a native of China but X left my papers on the ship. 22-Q. What efforts, if any, have you made to leave the United States? A None. 23-Q. Have you enough money or means to leave the United States at your own expense? A No. Did you submit notice of address for the current year? No. Why dian' e you studiet your address? 1 didn to da about it. 26-0. Were you discharged and paid off the BRONXVILLE? A,No. 27-9. Didyou haver permission from Immigration to change ships in US.? A.No. 28-0. Did you ever belong to the Hong Kong Seaman Union or obtain a ship through the Hong Kong Seaman Union? A. I got a ship through a Union in Hong Kong but I don't know the exact name of the Union. I joined the Union in Macao in 1950. 29-0. When did you start to work ashore in the United States. A. Since May 1955 I helped in various launderies in Brooklyn, N.Y. and the ownerse gave me food and lodging. 30-0. Have you ever been under Immigration proceedings before? A.Ne. 31-0. Do you have any court ation pending? A.N.O. 32-Q. If you are ordered deported, to what country will you go? A. Hong Kong. I have read the foregoing or had it read to me, and solemnly swear that it is the true and correct record of the statement made by me on this day and that all of the statements are true and correct. Mar Do it 17 Subscribed and sworn to before me at New York, N.Y. onSeptember 25, 1956 Frank G. Hayden"
}