{
	"anumber": "A10294862",
	"id": "A10294862_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/18/2023, NARA Form No. 4-1567"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 IF THIS APPLICATION IS BASED ON HARDSHIP TO A PARENT OR PARENTS, QUESTIONS 29 TO 32 MUST BE ANSWERED. (29) As to such parent who is not a citizen of the United States, give date and place of arrival in the United States including full details as to manner and terms of admission to this country (30) My father is is not employed. If employed, give salary and place of employment (31) My mother is is not employed. If employed, give salary and place of employment (32) The assets of my parents (not including clothing and household necessities) are: Assets of father consist of the following: Assets of mother consist of the following: Cash, Stocks and Bonds $ Cash, Stocks and Bonds $ Real Estate $ Real Estate $ Other (Describe) $ Other (Describe) $ Total $ Total $ (33) The following certificates or other documents are attached hereto as a part of this application: (Refer to instruction 2, page 5, for documents which must be attached.) Nature of Document (APPLICATION NOT TO BE SIGNED BELOW UNTIL APPLICANT APPEARS BEFORE A SPECIAL INQUIRY OFFICER) I, , do swear (affirm) that the contents of the above application, with corrections numbered ( ) to ( and including the documents attached hereto, are true to the best of my knowledge, and that this application is now signed by me with my full, true name: So Help Me God. X Mar Doo 3.13 (Complete and true signature of applicant or parent or guardian) Subscribed and sworn to before me by the above-named at day of 66 Moston mars this 2nd they , Special Inquiry Officer. (4)"
}
