{
  "anumber": "A10294862",
  "id": "A10294862_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR SUSPENSION OF DEPORTATION, Form I-256A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1908,
        1956,
        1955,
        2023,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R324.4 APPLICATION FOR SUSPENSION OF FEE STAMP DEPORTATION (Under Section 244 of the Immigration and Nationality Act) (PLEASE READ ADVICE AND INSTRUCTIONS ON PAGE 5 BEFORE File A=10 294 862 FILLING IN FORM) (1) I, the undersigned, hereby request that my deportation be suspended under the provisions of section 244 of the Immigration and Nationality Act. I believe that I am eligible for suspension of deportation because such deportation would result in extreme hardship to myself and/or to my (Husband, wife, father, mother, child, children) { citizen (s) who is/are lawful permanent resident of the United States; and I have been physically present in the United States without any absence since May 8, 1955 (2a) My present true name is: (First, Middle, Last) (2b) My name given at birth was: Gong-Doo Mar Mar Gong-Doo (3) I have been known by the additional names: My sex is (Height) (Color of eyes) (Color of hair) (Complexion) Mar Au-Sang Male 50 4\" brown black medium (4) I was born at (Place and country) on (Month) (Day) (Year) My nationality is (Country of which citizen or subject) Lung Shing Village, China July 15, 1908 China (5) I now reside at (Apt. number and/or in care of) (Number and street) (City or town) (State) 32 Oxford St., (c/o George L. Yee) Boston, Mass. (6) I first entered the United States under the name of on (Month) (Day) (Year) At (seaport, airport, or land border port) (First) (Middle) (Last) Doo Mar May 8, 1955 a pier at Staten Island, N.Y. Name of vessel or other means of conveyance I was admitted as a (Insert visitor, crewman, transient, student, permanent resident, or other) SS Boxvell crewman For a period of time to expire (Insert date of period for which admitted) My last extension of stay in the United States expired on (date) If not inspected or if entry occurred at other than a regular port, describe the circumstances as accurately as possible a fellow worker of the SS Boxvell accompanied me from the ship to N. Y. Chinatown. Since the date of my first entry I departed from and returned to the United States at the following places and on the following dates: (If you have never departed from the United States since your original date of entry, insert \"no departures.\") DEPARTED RETURNED INSPECTED AND ADMITTED DATE DATE (Answer PORT PORT (Month-Day-Year) (Month-Day-Year) Yes or No) No departures (7) During the last 10 years, I have been in the United States as follows: (If less than 10 years, set forth the information for the period you have been in the United States.) List present address FIRST, and work back. STREET AND NUMBER-CITY OR TOWN-STATE FROM- To- (Include number of hotel room, furnished room or apartment in present address.) Month Year Month Year 665 E. 156th St., New York, N. Y. May 1955 October 1955 831 E. 163rd St., New York, N. Y. October 1955 March 1956 a laundry shop in Brooklyn, N. Y. March 1956 May 1956 (Soon Hing Farms) Green Lawn, L. I., N. Y. May 1956 September 1956 (Soon Hing Farms) RFD #1, Cranbury, N. J. Sept. 1956 May 1957 40 Division St., New York, N.Y. May 1957 October 1957 Form I-256A (Use a separate sheet for additional entries.) CONTINDED (Rev. 12-1-65)"
}