{
  "anumber": "A10294862",
  "id": "A10294862_0178",
  "page_index": 178,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0178/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA 9/18/22023, Form Number: L-5-1-3468"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/18/2023 15th (5) That said alien shall report in (writing) (person) on the day of July each the Inmigration and/Naturalization year to the of Service at: unless that Officer grants him written permission to report on another date. Written reports shall contain said alien's n ame, alien registration number, current address and place of employment. or to cps (SDAG) suq fu (2) or byeces For the District Director By spirità (Place) brober Title ancp I, , hereby acknowledge that I have (read) (had interpreted and explained to me in the language) and understand the contents of this order, a copy of which I have received. I further understand that failure to comply with the terms of this order will subject me to prosecution. CTU or publicouse daysusupa pleasurem ot Mar Doo It OL or OI (Immigration officer) (Alien's signature) or 816 VIROLIGA ang brobert 6.9. mutt st Get 9 XYC (Address) (Address) mages of tie The acknowledgment below is to be used only where a Parole Supervisor has been designated: two broat I, hereby acknowledge that I understand the con- tents of this Order of Supervision and hereby agree to maintain contact with the subject of this order and that I will promptly report to the of the Immigration and Naturalization Service at the address shown in (5) any change in the alien's address or place of employment, any violation of this order and any information coming to my attention of the alien's intention to abscond or otherwise vio- late this order. (Parole supervisor) (Date) (Address) DVLE DIRIBICI BILLED 102.11CE"
}