{
  "anumber": "A10294862",
  "id": "A10294862_0171",
  "page_index": 171,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0171/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Office Memorandum, STANDARD FORM NO. 64"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1960,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 STANDARD FORM NO. 64 Office Memorandum UNITED STATES GOVERNMENT TO : U.S. Immigration Officer DATE: March 29, 1960 United States Immigration and Naturalization Service c/o American Consulate General Hong Kong, British Crown Colony FROM : Supervisory Deportation Officer New York, N.Y. 7. SUBJECT: Information Submitted to Facilitate Issuance of Hong Kong Travel Document MAR DOO; aka: MAR AU SANG - A10 294 862 Dep. To substantiate a formal presentation for the above-named alien's entry into Hong Kong, it is necessary that he be identified appropriately and his connections in that Colony verified. Your assistance is requested based on the following available information: (1) Date and place of birth: about 7/15/1908; Kwangtung, China (2) Father's name and residence: MA GWOON GOON, China, deceased (3) Mother's name and residence: WONG SHEE, China, deceased (4) Wife's name and residence: WONG LAI YUNG (adien has submitted two addresses in Hong Kong) 351 Lai Chee Kok Road, 1/F; and: 197 Hoy Ton Street, 3/f, both in Kowloon, Hong Kong. (5) Children's names, residence: MA JON SIN, about 20; MA GAN SIN, about 16 MA BICK SAM, about 30. reside with mother at above address. (6) Dates, addresses of alien's prior Hong Kong residence: see above. (7) Hong Kong Government documents issued to subject: Discharge book 28570 issued to alien under name of MOH DOH SANG (8) Date of alien's last entry into the United States, ship and line: 4/30/55 at Boston, Mass., via SS \"Bronxville\"., as crewman. (9) Length of sea service, date and port of first employment: first and only entry. (10) REMARKS: C.T.C. NO. IS: 7456/6670/3932 and: 7456/2737. Photostat of denial letter att. Attachments: 11 \" If Discharge Book att. Photos (2) Fingerprint Chart HSK/rw Signature Specimen Form I-267 (2-20-59)"
}