{
	"anumber": "A10294862",
	"id": "A10294862_0254",
	"page_index": 254,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0254/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2011, 2023, 1950, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT Offices. CBO MAI? 1. Sex: Male Female 2. Occupation Laborer sang SMOLE to pejois ON 3. Nearest large city to place of birth Toyshen, Kwangtung, China Distance and direction from place of birth 4. Father's name, place of birth, and 1770 on SLIVE present address Chica GOLLEGS Legolq or cue mage TO s yrs Aoa QABRER ILON spe 217768 BE Don's DMV exbsuses 5. Mother's maiden name, place of birth, and present address Wong Shee - born China - deceased 10 yis Aon BOM OL psae Aon PASL poor 8 or WDA OLESMINSTION INJOI 6. Names, addresses, and relationship of relatives abroad \"ife and children in oyshan, China 12 HUAG los combjgeg eye sing squeer LODOLF of fpe 7. Names, locations, and dates (years) of attendance of foreign schools 7 year school Teyroben, China 8. Names, locations, and dates (years) of attendance of foreign churches Y None 13 Mexe Aon GAGL Legneeq PO OL geboxpeg ILOIN fps V 80' MUSS Was a record made of any religious ceremony? None 9. IS 6 Aoa peen spacuf FLOW OHIES BJUCG glef ELLIABIS v 202 MAIG sug 10. Last address in native country Toyshan, 11. Date left native country 1950 12 Last foreign address expens Aun Nong Kong pum yig 13. Date left last foreign address 1955 14: If naturalized citizen of any country, how was citizenshipnacquired? for MUST you JOUR gig Aom moning (Show date and place of naturalization and number of certificate, if known) V 15. If citizenship is different from country of birth, explain? polger GLORRINE GSIq OL DOLIUIC (abecita); 4876)* eng pum 919 sun jost pps 16. Last entry into the United States was from (Give name of last foreign port and country) 17. In possession of travel document or passport at time of entry: Yes No IS Describe nature of document( V Chindad Presport \" sug of It 80' State GAGI g or 18. whether subject has passport, birth certificate, baptismal certificate, certificate of military service, or any document to MUBL comuera SLG Aoa is A establish nationality and/or identity. List each: None o MUGG sug MUGGLE MGLG Aoa POLUS (7809) AOAL 19. If subject did not have travel document or passport at time of entry, or does not have such a document now, did he ever patobta one Yes No VState how, when, and where it was obtained; what kind of document it was; and what be- came of it: 2011 ROJEINUJA BAGSL cust CUG Aon pe fue propp spe suq to sug mugel DG USA ps pA CUS SR III SUA OL CLINING bioceequus. VIG Aon to wake 20. If deportable to Canada. give date and port of arrival in Canada and name of vessel: msks maac I-d I SIN 8'13 or gue Quifeg sug SCLAICE sug QGBILG fo Aon 21. Personal description: Height Weight 1404 Eyes Brown 18 maeq' 8JAG USING Hair Black Face Nose Mouth payen of Distinctive marks MOTE RIGHT EYEBROW gebcomper Jane 22. Remarks: OL VB If the other side has not been executed, the information should be inserted for use in securing a travel document or passport. QUILED SIVLES Bnq6es BOLOUN no - LOLW"
}
