{
	"anumber": "A10294862",
	"id": "A10294862_0248",
	"page_index": 248,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0248/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ORDER TO SHOW CAUSE and NOTICE OF HEARING"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 I-221 (Rev. 3-23-56) EDITON File No. 38 3RA UNITED STATES OF AMERICA: of besinorius modifiw ad UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service In the Matter of ) dilew nolfosanco ni beiabia ) In Deportation Proceedings under Section 242 bms lenight MAR 000g aka.. EAS AD ) of the Immigration and Nationality Act SAMO. ) lla 9d litw BOY doo? Laimed sill ORDER TO SHOW CAUSE ) bos sdi timbs dsoqab and ) revisw NOTICE OF HEARING Respondent. ) adi To: EAS Dogg site., MAR AU SANG (name) Soon line Farms, Green Lung, Long Island, H. To (address) IT APPEARING, That you are in the United States in violation of law in that: 1. You are not a citizen or national of the United States; 2. You are a native off China and a national of China ; 3. You last entered the United States at Boston, on April 30g 1955 ; 4. You were (datelled as a nonimigrant, to with a oreman, to reinsin in the is S. in that status not a exceed 29 days. 5. You have remained in the United States thereafter without authority. and that you are subject to be taken into custody and deported pursuant to the following provision(s) of law: Sec. 241(a) (2) of the Instigration and titionality Act, in that, after admission as a noninsignant under Sec. 101(a)(25) of said High you not you have resolved in the limited lantes for e longer time than permitted. IT IS ORDERED, That you appear before a Special Inquiry Officer of the Immigration and Naturalization Service of the United States Department of Justice at new your my on at m. and show cause why you should not be deported from the United States on the charge(s) set forth above 919₩ solton IMMIGRATION AND NATURALIZATION SERVICE Without (signature and title of issuing officer) DISTRICT OSEER (City and State) Dated: 28, reprinted under September 25, 1956 (over) Immigration and Nationality Act at New York on 9-25-56 GPO 949754 10"
}
