{
  "anumber": "A10294862",
  "id": "A10294862_0103",
  "page_index": 103,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0103/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IN DEPORTATION PROCEEDINGS UNDER SECTION 2 OF THE IMMIGRATION AND NATIONALITY ACT ORDER TO SHOW CAUSE and NOTICE OF HEARING"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 I-221 (Rev. 3-23-56) File No. 410 294 862 38 T1 TAHT UOY UNITED STATES OF AMERICA: of beshortus radio 30 generals trodition ad UNITED STATES DEPARTMENT OF JUSTICE of to ativebills Immigration and Naturalization Service In the Matter of inemuroob yas divin nottognnoo ni beisbia MAR DOO: aka., MAS AO ) In Deportation Proceedings under Section 242 lanes bee Isnigho SANG. it benisinoo ) of the Immigration and Nationality Act ) lla ad like BOY dog? inisiadi ( hol jee ad) ORDER TO SHOW CAUSE ) BOY ted: his 19b10 and for ) hoqel and YOB lo review noissimbo NOTICE OF HEARING Respondent. ) niftiw sid banisinos anoitagelle add snimexs of Herled MAR DOO: aka., MAR AU SANG To: anolisgolie edit timbs moy 100 (name) of vigge gansar ed Soon Hing Farms, Green Lawn, Long Island, H. Y. (address) IT APPEARING, That you are in the United States in violation of law in that: 1. You are not a citizen or national of the United States; 2. You are a native of: Chine China and a national of ; 3. You last entered the United States at Boston, Mass. on April 30g 1955 ; 4. You were (date)ted as a nonimigrent, to wit: a crowman, authorised to remain in the U. S. in that status not to exceed 29 days. 5. You have remained in the United States thereafter without authority. and that you are subject to be taken into custody and deported pursuant to the following provision(s) of law: Sec. 241(a)(2) of the Insigration and Nationality Act, in that, after admission as a noninsigrant under Sec. 101(a)(15) of said High you sview not you have remined in the United States for longer time than permitted. bebasixe grom of Omebriegses (sigh) IT IS ORDERED, That you appear before a Special Inquiry Officer of the Immigration and Naturalization Service of the United States Department of Justice at new york my on Oct.2. 1956 at 9A. m. and show cause why you should not be deported from the United States on the charge(s) set forth above 919W epiton (sish) IMMIGRATION AND NATURALIZATION SERVICE Wilber 5. (signature and title of issuing officer) DISTRICT CHIER OR INVESTIGATIONS (City and State) Dated: NET YORK 25. 4 7. September 25, 1956 registered and fingerprinted under (over) Immigration and Nationality Actore 949754 to eliti bess New York on 9-25-56"
}