{
	"anumber": "A10294862",
	"id": "A10294862_0175",
	"page_index": 175,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0175/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BARBER Steamship Lines, Inc."
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Thailand",
				"Uruguay",
				"Indonesia",
				"China",
				"United States",
				"Singapore",
				"Brazil",
				"Philippines",
				"Japan"
			]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1883, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 ESTABLISHED 1883 CABLE: \"PYCBRIDA\" NEW YORK TELEPHONE WHITEHALL 4-1300 USE BOE'S AND BENTLEY'S CODES TELEX: N. Y. 2373 AND M. N. Y. 0067 BARRIOR STEAMSHIP LINES.ING BRANCH OFFICES UNITED STATES TO DETROIT, MICH. PHILIPPINES CHINA, JAPAN CLEVELAND. OHIO COLONY OF SINGAPORE EUROPEAN AGENTS BARBER STEAMSHIP LINES. LIMITED THAILAND, SOUTH VIET NAM AND INDONESIA 51 BISHOPSGATE LONDON. E.C. 2. ENGLAND SOUTH AND EAST AFRICA BRAZIL URUGUAY AND ARGENTINE AGENTS FOR AZORES, MADEIRA, CANARY, THE UNION-CASTLE MAIL STEAMSHIP CO.,LTD. SHERATON-WHITEHALL BUILDING CAPE VERDE ISLANDS AND CAYZER, IRVINE & CO.,LTD., (CLAN LINE) WEST AFRICA HOUSTON LINE LTD. 17 BATTERY PLACE SCANDINAVIA WILH. WILHELMSEN FEARNLEY & EGER MIDDLE EAST A. F. KLAVENESS & CO.,A/S NEW YORK 4, N. Y. MEDITERRANEAN May 21, 1959 United States Department of Justice Immigration and Naturalization Service 70 Colombus Avenue New York 23, New York Attention: Inspector Klegman, Deportation Dear Sirs: Pursuant to telephone conversation of this morning, we are enclosing Identification Card, Chinese Passport and Government of Hongkong Seaman's Discharge Book, for Chinese crew member, Moh Doh Sang ex- M/V \"HOPEVILLE, and M/V \"BRONXVILLE\". Very truly yours, BARBER STEAMSHIP LINES, INC. JPD:dt John Operating Department Encl."
}
