{
  "anumber": "A10294862",
  "id": "A10294862_0123",
  "page_index": 123,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0123/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Report of Investigation, A10 2944 862"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 TED STATES DEPARTMENT OF JUS CE IMMIGRATION AND NATURALIZATION SERVICE RECEIVED REPORT OF INVESTICATION I&HS. BOSTON, MASS ADMINISTRATIVE PAGE JUL 5 10 17 PM '66 TITLE FILE NUMBER MAR, Doo A1O 294 862 REPORT NUMBER DATE 6/20/66 PLACE CENTRAL OFFICE AND REGIONAL REFERENCES AUX 1 (5/26/66fa New York OFFICE IN CONTROL OF INVESTIGATION G-23 LINE TYPE OF INVESTIGATION Boston, Mass. 528 Auxiliary - Gen. DATE AND PLACE OF BIRTH NATIONALITY DATE,PLACE AND MANNER OF ENTRY about 7/15/08; China China 4/30/55; Boston, Mass. DISTRIBUTION REVIEWED AND APPROVED (SEE COMMENT) 1 - DD Boston DATE 6/29/16 PLACE New York, N.Y. SIGNATURE RECEIVED Mark Meter NAME AND TITLE Assistant Chief General Investigations JUL 6 1966 REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE I in 150 and Branch Street Service SIGNATURE fiemant Easten, Mass. NAME AND TITLE APPROVED (REGIONAL OFFICE) DATE NAME AND TITLE SIGNATURE STATUS OF INVESTIGATION PENDING PENDING INACTIVE CLOSED XX REFERRED TO CONTROL OFFICE Investigation conducted pursuant to Undeveloped Lead #2 contained in Boston report #1 dated May 9, 1966 which requests that a neighborhood investigation and police check covering the SUBJECT's residence in New York be conducted. COMMENT The indices of the Chinese Hand Laundry Association at New York contain no reference to the Subject. 6-20-66 Investigator THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE M G-166A (Rev. 10-14-64) GPO 948-926"
}