{
  "anumber": "A10294862",
  "id": "A10294862_0121",
  "page_index": 121,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0121/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Investigation, G-166A ( (Rev. 10-14-64)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTICATION ADMINISTRATIVE PAGE TITLE FILE NUMBER MAR Doo A-10 294 862 REPORT NUMBER DATE PLACE CENTRAL OFFICE AND REGIONAL REFERENCES 2 07-25-66 mm Boston - OFFICE IN CONTROL OF INVESTIGATION G-23 LINE TYPE OF INVESTIGATION Boston 522 Character Inv. - Other DATE AND PLACE OF BIRTH NATIONALITY DATE.PLACE AND MANNER OF ENTRY About 7/15/08; China 4/30/55, Boston, Mass., U.S.C. China DISTRIBUTION REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE 1 - Special Inquiry Officer, Boston Boston SIGNATURE 1 - File NAME AND TITLE CHARLES J. CASEY, Supervisory Investigator REVIEWED AND APPROVED (SEE COMMENT DATE PLACE SIGNATURE NAME AND TITLE APPROVED (REGIONAL OFFICE) DATE NAME AND TITLE SIGNATURE STATUS OF INVESTIGATION PENDING PENDING INACTIVE CLOSED REFERRED TO CONTROL OFFICE Investigation is predicated on receipt of memorandum dated 4/22/66 from Special Inquiry Officer requesting character investigation of SUBJECT, an applicant for suspension of deportation. FBI Name Check dated May 23, 1966 and CIA check dated May 27, 1966 reveal no record of arrests and derogatory information. THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE FORM G-166A (Rev. 10.14.64) GPO 948-926"
}