{
	"anumber": "A10294862",
	"id": "A10294862_0230",
	"page_index": 230,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0230/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Receipt of Officer of the Immigration and Naturalization Service for United States Bonds or Notes Accepted as Security, Form I-300"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form I-300 U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (Rev. 8-15-45) RECEIPT OF OFFICER OF THE IMMIGRATION AND NATURALIZATION SERVICE FOR UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY (This receipt is to be given to the owner of the bonds or notes deposited with the officer of the Immigration and Naturalization Service and a copy must be attached to the bond) A10 294 862 New York New York Sept. 26, 1956 (City) (State) (Date) The undersigned hereby acknowledges receipt from 80 LIM of the (Name of owner of bonds) United States bonds/notes hereinafter described, deposited as security on bond dated Sept. 26, 1956 filed with the undersigned on behalf of the alien MAR DOO alsa MAR All SANG (Name of alien) Said United States bonds/notes are assigned (State form of assignment, if registered) COUPON OR TITLE OF BONDS/NOTES REGISTERED TOTAL FACE AMOUNT DENOMINATION SERIAL NUMBER INTEREST DATES us Tress Bond of 3967-72 due 6/35/72 32 one 8500 2)% 101658 12/15/56 a sea 32 epa $500 as 85878 12/15/56 4 a es (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely affix same hereto) quinto This receipt is executed in duplicate, and THE ORIGINAL MUST BE SURRENDERED BY THE OBLIGOR BEFORE THE BONDS OR NOTES DEPOSITED ARE RETURNED TO HIM. This receipt is not assignable. for the dist. director 8203 (Signature and official Authory title of the officer of the Immigration Recences and Naturalization Service) GPO 949680 Fiscal Acotg.Clink"
}
