{
	"anumber": "A10294862",
	"id": "A10294862_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 1955, 2023, 1957, 1909, 1927, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 (8) During my residence at the places in the United States named above I was employed by the following-named persons or firms: (Begin with present employment and proceed backwards. Any periods of unemployment or school attendance should be specified. EARNINGS ADDRESS OF EMPLOYER TYPE OF WORK FROM- To- FULL NAME OF EMPLOYER PER WEEK (Approximately) PERFORMED Month Year Month Year MAR Gong Guey 665 E. 156 St. NYC $10.00 laundry May 1955 Oct. 1955 Ah TAU 831 E. 163 St. NYC $10.00 laundry Oct. 1955 Mar. 1956 Laundry Brooklyn, N.Y. $12.00 laundry Mar. 1956 May 1956 Soon Hing Farms Green Lawn, L.I., N. Y. 15.00 farm work May 1956 Sept. 1956 Soon Hing Farms Cranbury, N. J. 15.00 farm work Sept. 1956 May 1957 CONTINUED (Use a separate sheet for additional entries.) (9) If self-employed, describe nature of business, name under which business is conducted, and net income derived therefrom (10) I AM MARRIED If married, the name of my We were married on at (City or town) (State or country) spouse is (Month) (Day) (Year) AM NOT WONG Lai Yung Dec. 27, 1927 Lung Shing Vill. China She or he was born at (City or town) (State or country) on Month) (Day) (Year) and is a citizen of (Country) Tung Hing Vill., Toyshan Dist., China foll?9. 1909 China (11) (If your spouse is other than a native born United States citizen, answer the following.) She or he arrived in the United States at (City or town) on (Month) (Day) (Year) was admitted for permanent residence. was not was naturalized on (Month) (Day) (Year) (Place naturalized) (12) I have have not been previously married: (If previously married, give facts relative to name of each prior spouse, and manner, date, and place of termination of each prior marriage) (13) My present spouse has has not been previously married. (If spouse previously married, give facts relative to name of each prior spouse and manner, date, and place of termination of each prior marriage) (14) My spouse is is not employed. If employed, give salary and place of employment (15) The assets of myself (and my spouse), not including clothing and household necessities, are: Self (or jointly owned with spouse): Cash, Stocks and Bonds $ 500.00 Cash, Stocks and Bonds $ Real Estate $ Real Estate $ Other (Describe) $ Other (Describe) $ Total $ 500.00 Total $ (16) I have six children. Give information requested in each column: LAWFUL PERMANENT NAME AGE PLACE OF BIRTH Now RESIDING AT- CITIZEN OF RESIDENT OF U.S. (MA) Bik Sim (F) 35 China 32 Oxford St., Boston China Yes (MA) Shuet Ching (F) 30 China Kowloon, Hong Kong China (MA) Siu Wan (F) 28 China Kowloon, Hong Kong China (MA) Wing Fong (F) 24 China Vancouver, B.C. Canada China (MA) Chong Sun (M) 22 China Vancouver, B.C. Canada China (MA) Kin Sun (M) 18 China Vancouver, B.C. Canada China (MA) Bik Sim (admitted The names, assets, and earnings of my children in the United States who have separate incomes are: into U.S.A. September 1965) now averages $35. weekly income. (2)"
}
