{
  "anumber": "A10294862",
  "id": "A10294862_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 was granted the privilege of voluntary departure with an alternative order that he be deported to Hong Kong in the event he failed to depart voluntarily within the time and under the conditions set by the District Director. The respondent failed to depart voluntarily from the United States in accordance with the grant of that privilege. A warrant for his deportation wasissued on November 5, 1956 but it has never been executed. After Section 244(a)(1) of the Immigration and Nationality Act was amended by Public Law 89-236 so as to enable aliens who entered the United States as crewman prior to June 30, 1964 to apply for suspension of deportation, the respondent moved that these proceedings be reopened. The motion was not opposed by the Immigration and Naturalization Service and it was granted. Deportability as previously determined was not in issue at the reopened hearing. DISCUSSION AS TO ELIGIBILITY FOR SUSPENSION OF DEPORTATION: The respondent applied for suspension of deportation under the provisions of Section 244(a)(1) of the Immigration and Nationality Act, as amended. He testified that he has never been arrested, that he has never been a member of a subversive organization, that he has been physically present in the United States for a continuous period of more than seven years and his deportation would result in extreme hardship to him. - 2 -"
}