{
	"anumber": "A10294862",
	"id": "A10294862_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 1958, 1948, 1918, 1953, 2023, 1957, 1940, 1951, 1926, 1950, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 (17) I have have not after entry into the United States acquired the status of an exchange alien. (18) I have have not submitted yearly address reports as required by the amendment to the Alien Registration Act effective September 23, 1950, and the Immigration and Nationality Act. (19) I have have not been the recipient of public or private relief or assistance. If you have, give full details including date, place, and amount received I was hit by an automobile in Brooklyn, N.Y. on December 25, 1957. Hospitalized from December 25, 1957 to October 8, 1958. The City of New York placed me on relief, October 10, 1958 to April 1, 1959. The total amount of relief received was $531.10. (20) If you have served in the Armed Forces of the United States, state branch (Army, Navy, & service number, etc.) Date and place of entry on duty Date of discharge Type of discharge (honorable, dishonorable, etc.) I served in active duty status from to (21) If male, did you register under the Selective Service (Draft) Law of 1917, 1918, 1940, 1948, 1951, or later Draft Laws? Yes No If \"Yes,\" give date, Selective Service number & local draft board number. Were you ever exempted from service because of conscientious objection, alienage, or any other reason? Yes No (22) Have you ever deserted from the military or naval forces of the United States while this country was at war? Yes No (23) Have you ever left the United States or the jurisidiction of the district where you registered for the draft to avoid being drafted into the military or naval forces of the United States? Yes No (24) List membership, past or present, in all organizations, societies, clubs, unions, and associations, whether in the United States or a foreign country, and the periods and places of such membership. Include membership in any Communist Party or organization or in any section, subsidiary, branch, affiliate. or subdivision of any such party or organization: Kuomintang since 1926 (the Nationalist Party) (25) I have have never (either in the United States or any other country) been arrested, summoned into court as a defendant, convicted, fined, imprisoned, or placed on probation, or forfeited collateral for an act involving a felony, misdemeanor, or breach of any public law or ordinance. If answer is in the affirmative in any particular, give complete information in the space immediately following Because of my Kuomintang membership and because that I was once chairman of the area police unit the Communists arrested me after they took control of China. I was first placed on house-confinement then sent to laborcamp then into a farming unit. The Communists (Use a separate sheet for additional entries.) (continued on separatesheet) (26) I can return to my country of Birth Nationality Last Residence without fear of persecution. If unable to return to any (Check the appropriate block or blocks) of these countries, give reasons I escaped from the Communists farming camp in 1953. I escaped from the camp into Macau. From Macau I went to Hong Kong. (27) I would would not be able to arrange a trip outside the United States to obtain an immigrant visa. If not, explain: Not allowed to beyond Massachusetts, New Hampshire and Rhode Island. (28) Give the requested information about your parents, brothers, and sisters. As to residence, show street address, city, and state, if in the United States; otherwise show only country. LAWFUL NAME RELATIONSHIP Now RESIDING AT: BIRTHPLACE CITIZEN OF PERMANENT To ME RESIDENT OF U.S.? MA Gwoon Gwoon father deceased China China yes WONG Shee mother deceased China China no MA Wing Kee brother deceased China China no (3)"
}
