{
	"anumber": "A10294862",
	"id": "A10294862_0109",
	"page_index": 109,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0109/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT, C-105"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States", "Singapore"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1950, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT O'ILCEL Laborer 1. Sex: Male Female 2. Occupation 8379 SMOLE to pefole on Toyshan', Kwangtung, China obcouper TAPE 3. Nearest large city to place of birth Distance and direction from place of birth 4. Father's name, place of birth, and 270 on 81/9 COLLECT Garoon Goon born Chira deceased address GOLLEGS Legolg or mage ph present 18 VIS Aort Omeog 247769 as AOML OMI GXBGUEGI V. 5. Mother's maiden name, place of birth, and present address Wong Shee - born China - deceased 70 o yes Aon UOM OL pas Aon GAGL peen 8 momper of work Options OUTON \"ife and children in oyshan, China 6. Names, addresses, and relationship of relatives abroad TP cpe sing Eggless Leholf of the 7. Names, locations, and dates (years) of attendance of foreign schools 7 yrs. school Toyshan, China 8. Names, locations, and dates (years) of attendance of foreign churches V' None 13 MGLG Aon GAGE to OL gebox.eq FLOW error propers V upsf None 9. Was a record made of any religious ceremony? IS o Aon peen spacify Toyshan, China RJUGG gref V It 80° MJGLG 9119 10. Last address in native country 11. Date left 1950 native country Last foreign address Nong Kong proze 919 TO ITLEF 13. Date left last foreign address 1955 14. If naturalized citizen of any country, how was sprb prsf I citizenship acquired? TOL barbons our Aon SUCOL kug youR gig Aon month fo apos y (Show date and place of naturalization and number of certificate, if known) V' 15. citizenship is from country explain: If different of birth, polger CLOBBINE OL LG-GDFLA belivif (abeci[A) you 20 7822 68 to OLOM moupes 32 2637617 (8TAE pons 9876) any 974 outst THE 16. Last entry into the United States was from Singapor (Give name of last foreign port and country) 17. In possession of travel- document or passport at time of entry Yes No CHILL 2TH IS BTOK OL Describe nature of document(s) Chinese Passport 809 sqgr628 of bleaguf abonee It 20° BIAG gerarja I MSB on OL 18. State whether subject has passport, birth certificate, baptismal certificate, certificate of military service, or any document to COMUELA SLG Aom V establish nationality and/or identity. List each: CHILE Passportx None MUGH suq AUGLE MSLG Son polu 3V-A-J2 (J308) DONE* JOA 19. If subject did not have travel document or passport at time of entry, or does not have such a document now, did he ever priobtain one? Yes No State how, when, and where it was obtained; what kind of document it was; and what be- son cust fre Aom None pe fpe from fue propp\" sug came of it ancj y [LOGJA sug mugel osepa V' pc AQIQUEBLA suq was pe pA fpe sa satgence IN our OI. VIG Aon MILLING to majes 20 If deportable to Canada, give date and port of arrival in Canada and name of vessel: your Aon useaf I-e SIN or the nutfeg suq DELATOS sug 968116 to hon 21. Personal description: Height 5'6\" Weight 140# Eyes Brown Heeq' KYAG Date Hair Black Face Nose Mouth MOLE OVER RIGHT EYEBROW gebrewper se rage Distinctive marks 22. Remarks: DIRELIEF or EYE VB RECORD If the other side has not been executed, the information should be inserted for use in securing a travel document or passport. suq NALLED SIVLES DEBVKINEWI Ok Inalice Bream no 43-8020'4 LOLU"
}
