{
	"anumber": "A10294862",
	"id": "A10294862_0234",
	"page_index": 234,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0234/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY, GPO 94827"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1967, 2023, 1935]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 34 himself or herself or for such other purpose as delivery of the alien may be requested, or by virtue of which issuance 35 or execution of an order of deportation is or may be deferred, or by virtue of which the said alien is or may be 36 permitted to depart voluntarily from the United States, shall be in any manner construed to impair or render void 37 this obligation or any part thereof. 38 39 40 41 pÀ 42 43 44 45 46 47 48 In line n \"we\" changed to \"If in 1 ine #5 \"are\" changed to 49 prior to execution of bond pouq SIGNED AND SEALED IN THE PRESENCE OF- Name Evelyn L. France Address 70 Columbus Avenue, How York 23,NY Name Address Phyllis Harley X Lim 70 Columbus Avenue, New York 23,NY Name Address [ AFFIX SEAL Name Address FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States bonds/notes described in the annexed schedule are hereby pledged as security for the performance and fulfillment of the foregoing undertaking in accordance with section 15 of title 6, United States Code and Treasury Department Circular 154 (revised), dated February 6, 1935. (31 CFR, part 225.) ng firm TITLE OF BONDS/NOTES COUPONS FACE INTEREST SERIAL NO. INTEREST DATES ATTACHED VALUE RATE US Tress. Bond of 1967-72 due 6/15/72 32 eps $500 23% 10165B 12/15/56 & sea # 11 32 ops $500 23% 8527H 12/15/56 & ca GPO 948927"
}
