{
  "anumber": "A10294862",
  "id": "A10294862_0159",
  "page_index": 159,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0159/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, Form G-28"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 Form G-28 UNITED STATES DEPARTMENT OF JU Board of Immigration Appeals and Immigration and Naturalization Service (Rev. 3-20-56) NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY CR REPRESENTATIVE Note: Attorney to show below complete address of subject * NEW YORK, NEW YORK (City) (State) In re: September 26, , 19 56 MAR DOO (Date) FILE NO. Address Apartment No. * City State . I hereby enter my appearance as attorney for (or representative of): MAR DOO or as associated with the attorney of record, and my appearance is at his request. (Check appropriate item, if applicable): 1. I have been admitted to practice before the Board of Immigration Appeals and the Immigration and Naturalization Service and on this date I am not suspended or disbarred from practice before any court or governmental agency, Federal, State, territorial, or insular: X Attorney, or Representative of , or Nonattorney authorized to practice under 8 CFR 292 7. 2. My application for admission to practice before the Board of Immigration Appeals and the Immigra- tion and Naturalization Service was filed at and is presently pending. (Place) 3 I have not applied for admission to practice before the Board of Immigration Appeals and the Im- migration and Naturalization Service. My appearance, however, is ** ** Friend, relatives, etc., and without monetary consideration. Explain fully. HASKELL R. BARST (Signature) 60 Broad Street, New York 4, N.Y. Haz-over (Address) GPO 949575 Telephone No."
}