{
  "anumber": "A10294862",
  "id": "A10294862_0200",
  "page_index": 200,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0200/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 The written report shall contain (a) the name, (b) alien registration number, (c) date, (d) current address, (e) place of employment, (f) (5) law-abiding manner. (6) (7) (8) John Mark JOHN L. MURFF J. Acting District Direct New York, N. Y. (Place) (Officer in Charge, Immigration and Naturalization Service) serBusing for I, MAR DOO also known as Mar Au Sang , hereby acknowledge that I have (read) (had interpreted and explained in the English language) and understand the terms of this order, a copy of which I have received. I further understand that failure to comply with the terms of this order or with any of the conditions of 242(d) of the Immigration and Nationality Act, will subject me to prosecution. Jack of stills Mar Doo (Immigration officer) (Alien's signature) OL 70 Columbus Avenue Soon Hing Farms Green Lawn, NY (Address) (Address) ou The acknowledgment below is to be used only where a Parole Supervisor has been designated: hereby acknowledge that I understand the terms set forth above and hereby agree to furnish a written report each month to the Officer in Charge concerning the alien's name, registration number, current address, place of employment, associates, and organizational activities, and that I will immediately report any failure on the part of the alien to comply with the terms of the order or information coming to my attention which might indicate that the alien intends to abscond or otherwise violate this order. (Parole supervisor) OBDER OE (Date) DVLE (Address) REMAICE"
}