{
  "anumber": "A10294862",
  "id": "A10294862_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR SOCIAL SECURITY ACCOUNT NUMBER, 10-5528"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 RETURN COMPLETED APPLICATION APPLICATION FOR SOCIAL SECURITY ACCOUNT NUMBER TO NEAREST SOCIAL SECURITY REQUIRED UNDER THE FEDERAL INSURANCE CONTRIBUTIONS ACT ADMINISTRATION DISTRICT OFFICE READ INSTRUCTIONS ON BACK BEFORE FILLING IN FORM DO NOT WRITE IN THE ABOVE SPACE FILL IN EACH ITEM. PRINT IN BLACK OR DARK BLUE INK OR USE TYPEWRITER FOR ALL ITEMS EXCEPT SIGNATURE. IF THE INFORMATION CALLED FOR IN ANY ITEM IS NOT KNOWN, WRITE \"UNKNOWN. PRINT NAME YOU GAVE YOUR PRESENT FIRST NAME MIDDLE NAME. (IF YOU USE NO MIDDLE NAME OR INITIAL, DRAW A LINE ) LAST NAME 1 EMPLOYER, OR, IF UNEMPLOYED, THE MAR Doo aka Mar NAME YOU WILL USE WHEN EMPLOYED ou SANG MAILING ADDRESS (NO. AND ST., P. O. BOX, OR RFD) (CITY) (ZONE) (STATE) PRINT FULL NAME GIVEN YOU AT BIRTH 2 % SOON Hing Farm 40 Division Street N.Y. X 3 same AGE ON LAST BIRTHDAY DATE OF BIRTH (MONTH) (DAY) (YEAR) PLACE OF BIRTH (CITY) (COUNTY) (STATE) 4 48 5 15 1908 6 7 CHINA FATHER'S FULL NAME, REGARDLESS OF WHETHER LIVING OR DEAD MOTHER'S FULL NAME BEFORE EVER MARRIED, REGARDLESS OF WHETHER LIVING OR DEAD 7 MAR GWOON GWOON 8 WONG SHEE (MARK (x) WHICH) COLOR (MARK (x) WHICH) (IF OTHER, SPECIFY) HAVE YOU EVER BEFORE APPLIED (MARK (x) WHICH) 9 MALE FEMALE 10 OR WHITE NEGRO OTHER FOR OR HAD A SOCIAL SECURITY OR YES NO DON'T KNOW SEX: RACE CHINESE RAILROAD RETIREMENT NUMBER? BUSINESS NAME OF EMPLOYER. IF UNEMPLOYED, WRITE \"UNEMPLOYED\" IF ANSWER IS \"YES\". PRINT THE STATE DATE 11 STATE IN WHICH YOU FIRST SOON HING FARM APPLIED AND WHEN 12 EMPLOYER'S ADDRESS (NO. AND STREET) (CITY) (ZONE) (STATE) ALSO PRINT YOUR ACCOUNT ACCOUNT NUMBER RFD # Cranbury New Jersey NUMBER IF YOU KNOW IT TODAY'S DATE WRITE YOUR NAME AS USUALLY WRITTEN (DO NOT PRINT) 13 Oct. 8 th 1956 14 Form SS-5 TREASURY DEPARTMENT INTERNAL REVENUE Mar SERVICE Doo (Revised 7-55) Mar ou Sang 16-5528-2 M"
}