{
	"anumber": "A10294862",
	"id": "A10294862_0252",
	"page_index": 252,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10294862_0252/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Alien Registration Form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Jamaica", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1908, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 1. You are not a citizen or national of the United States; 2. You are a native of China and a national of China ; 3. You (last) entered the United States at Boston, Maws, on April 30, 1955 ; (Date) 4. You were admitted as a nonimmigrant, to wit: a crewman, authorized to remain in the United States in that status not to exceed 29 days. 5. You have remained in the United States thereafter without authority. CHARGE: (Code) SEMIB. PLACE OF BIRTH DATE OF BIRTH COLOR MARITAL STATUS LUNG DENE TOYSHAN AWANETY SEX CITINA 1908 Yellow S M D Sep W M F OTHER NUMBERS (Soc. Sec.; Armed Forces; FBI; Iden.) PARENTS' NAMES AND ADDRESSES (if known) Ma Gwoon Goon - deceased Wong Shee - deceased HEIGHT WEIGHT HAIR COMPLEXION VE IDENTIFYING MARKS AND SCARS 5'6\" 140# Black Yellow MOLE LEFT EYEBROW RIGHT RESIDENCE LAST 5 YEARS (Street & Number, RFD, etc.) City, State, Country FROM TO Soon Hing Farm, Green Lawn, L.I.N.Y. 9/10/56 Date 665 East 156 St. Bronx, N.Y. 4/56 9/56 831 East 153 St. Bronx, N.Y. 1/56 4/56 EMPLOYMENT LAST 5 YEARS (EMPLOYER'S NAME AND ADDRESS) OCCUPATION OR FROM TO Soon Hing Farm, Green Lawn, L.I.N.Y. PROFESSION Laborer 9/10/56 Date Ying Lee Shirt Pressing, Jamaica, L.I.N.Y. Presser 4/56 9/56 PRIOR OCCUPATION (not included in above) Crewman SPOUSE (aliases, present address) Spouse's date and place of birth Wong Lai Yung - Toyshan, China 46 yrs., Toyshan, Kwangtun, China ORGANIZATIONS (Name of, including Societies, Clubs, etc., past or present) LAST ENTRY PRIOR ENTRIES AND DEPARTURES (Date, port) 04-30-55 Boston, Mass. D-1 crewman None SELECTIVE SERVICE NO., Address of Board; Classification; ordered to report for induction"
}
