{
	"anumber": "A10394732",
	"id": "A10394732_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATE OF OHIO IN THE COURT OF COMMON PLEAS CUYAHOGA COUNTY, NO. 504-095"
		},
		"years": {
			"ms_years_nlp_v1": [1941]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "STATE OF OHIO ) ) SS IN THE COURT OF COMMON PLEAS CUYAHOGA COUNTY) NO. 504-095 SARAH MILSTEIN ) 10003 Ostend Avenue ) Clevel nd, Ohio ) PLAINTIFF ) -VS- ) Moses Milstein address unknown ) ) Morris Plan Bank of Cleveland ) JOURNAL ENTRY, DECREE FOR Huron Road ) DIVORCE AND EQUITABLE Cleveland, Ohio ) RELIEF. ) DEFENDANTS ) June 10, 1941 This cause came on to be heard on the 5th day of June, 1941, on the amended petition of the plaintiff, the answer of the Morris Plan Bank of Cleveland, defendant herein, and the evidence, the defendant MOSES MILSTEIN, being in default of answer or other pleading, although duly served with summons by publication, according to law. Upon due consideration thereof, the Court finds that the allegations contained in the amended petition are true; that the plaintiff was a resident of t the State of Ohio for more than one year next preceding the filing of the amended petition, and thatat the time plaintiff was a bona fide resident of the County of Cuyahoga and State of Ohio; that the parties were married as stated in the petition. The court further finds that the funds now on deposit with the Morris Plan Bank of Cleveland, under savings account #20547, in the names of \"Sarah Milstein and Moses Milstein\", are the funds of the plaintiff herein, SARAH MILSTEIN, and that the restraining order heretofore issued against MOSES MILSTEIN, enjoining said MOSES MILSTEIN, from withdrawal, transfer, or assignment, of said funds, or any part of it, or interferring with plaintiff's rights to said account, is hereby made permanent, and said entire account #20547 and the funds therein, in the amount of $2420.70 together with any interest thereon, is hereby transferred and set over to the plaintiff, SARAH MILSTEIN, and the Morris Plan Bank of Cleveland, is hereby ordered"
}
