{
  "anumber": "A10394732",
  "id": "A10394732_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE—Revised Statutes of the United States, Page 171, Section 905, Second Edition., CC-57-SM-2024-R"
    },
    "years": {
      "ms_years_nlp_v1": [
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CERTIFICATE-Revised Statutes of the U States, Page 171, Section 905, Second Edition. The State of Ohio, SS. 8th CUYAHOGA COUNTY Be it Remembered, That on the day of September in the year of our Lord One Thousand nine Hundred and thirty six the COURT OF COMMON PLEAS within and for the County of Cuyahoga and state of , Ohio, convened at the Court House, in the City of Cleveland, pursuant to law. Present: David Ralph Hertz Hon. Hon. George Kerr Alva R. Corlett Walter McMahon Hon. Hon. Lee E. Skeel Samuel E. Kramer Hon. Hon. , John P. Dempsey Hon. Samuel H. Silbert Hon. , Hon. Harrison W. Ewing Hon. George P. Baer , Hon. A. J. Pearson Hon. Joy Seth Hurd , Hon. Frederick P. Walther Hon. Frank S. Day Hon. Homer G. Powell C. J. JUDGES, also present JOHN J. BUSHER CLERK of said Court, and JOHN M. SULZMANN SHERIFF of said County: His Honor, Judge JOY SETH HURD presiding for the trial of Divorce causes, at said term, Court being open according to law, the Divorce business is disposed of as follows, to-wit: The State of Ohio, SS. IN THE COURT OF COMMON PLEAS CUYAHOGA COUNTY No. 453328 Sarah Edelman Plaintiff, DIVORCE vs. George Edelman Defendant On the 16th day of December 936 A.D. 1 , being a day in said Sept ember Term of said Court. This cause came on to be heard on the 14th day of December, 1936, on the petition and evidence, the defendant in default of answer or other pleading, although service of process was had on defendant by publication according to law and service by publication on defendant is approved by this court. Upon due consideration thereof, the court finds that the allegations contained in the petition are true; that the plaintiff was a resident of the State of Ohio for one year next preceding the filing of the petition and at that time was a bona fide resident of the County of Cuyahoga and State of Ohio; and that the parties were married as stated in the petition and that no children were born as issue of said marriage. The court further finds that the defendant has been guilty of gross neglect of duty and extreme cruelty as averred in said petition and that by reason thereof the plaintiff is entitled to a divorce as prayed for. IT IS THEREFORE ORDERED ADJUDGED AND DECREED that the marriage contract heretofore existing between the parties hereto be and the same hereby is, dissolved and both parties are released therefrom. IT IS FURTHER ORDERED ADJUDGED AND DECREED THAT the defendant be and hereby is barred from any dower interest in the real estate of the CC-57-5M-2024-34"
}