{
	"anumber": "A10394732",
	"id": "A10394732_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0002/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXAMINER'S REPORT—CERTIFICATE OF CITIZENSHIP, Form No. 6-353"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1956, 1898, 1906, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form N-635 U. S. DEPARTMENT OF JUSTICE No. A10 394 732 IMMIGRATION AND NATURALIZATION SERVICE (Rev. 6-25-53) August 7. 1956 (Date of examiner's findings) EXAMINER'S REPORT-CERTIFICATE OF CITIZENSHIP (Section 341 of the Immigration and Nationality Act) DISTRICT DIRECTOR OF IMMIGRATION AND NATURALIZATION: I submit herewith the above file and the following findings made by me in the above-numbered proceeding based upon my investigation of the facts therein. I find that 1. The name of applicant is SARAH KUMIN 2. The applicant resides at 2803 Avondale Rd., Cleveland Heights, Ohio 3. The applicant was born on June 17, 1898 at Rogola, (Month) (Day) (Year) (City) Lithuania (County, District, Province, or State) (Country) 4. The applicant did - lawfully enter United States for permanent residence on March 28, 1906 (Month) (Day) (Year) at New York, N. Y. (Port) 5. The applicant did derive or acquire citizenship of the United States on Nov. 20, 1912 (Month) (Day) (Year) through the naturalization of her father, Lipman Kumin, on Nov. 20, 1912 by the Cuyahoga County Common Pleas Court at Cleveland, Ohio, applicant being then a minor and having resided permanently in the U. S. since Mar. 28, 1906. 6. I am satisfied that the applicant, since deriving or acquiring citizenship as set forth in item 5 above, has not become expatriated in any manner and that the applicant is now a citizen of the United States. 7. The following named persons were examined by me under oath on the dates indicated: Name Address Relationship to Date testimony applicant heard Sarah Kumin Same as line 2 Applicant 8-6-56 Anna R. Kumin Same as line 2 Sister 8-5-56 8. Attached to and made a part of the file are the following documents: N-600 and applicant's auto- graphed photograph's; I-404-A establishing applicant's adm for perm residence and as secondary evidence of marriage of parents; G-347 and attachment establishing father's naturalization; Ex. A - Doc. No. 508 in Probate Court in matter of will of applicant's father naming (OVER) 9. Recommendation that application be granted is based primarily upon documentary evidence. and 10. The application does present a prima facie case of citizenship. OVER) 11. recommend that the said application be granted. (If an adverse recommendation is made a statement in support thereof should accompany the report.) 12. An Certificate of Citizenship should be issued in the name of (A or AA) SARAH KUMIN (1) & (3) Court Order restores maiden name. (Applicant's legal name acquired: (1) at birth, (2) through marriage, (3) by court order, (4) State law. Explain if (3) or (4) (Signature of examining officer) I do concur with the decision of the U.S S. Naturalization Examiner Examining Officer AUG 2 1950 Reviewing Officer Record forwarded to Commissioner for decision U. S. GOVERNMENT PRINTING OFFICE Date gilm 68973-1 m. (Signature of District Leliman Director) STATISTICS"
}
