{
	"anumber": "A10394732",
	"id": "A10394732_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0022/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF DEATH, 1803"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "Israel", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1877, 1954, 1956, 1928]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OHIO DEPARTMENT OF HEALTH 1803 DIVISION OF VITAL STA TICS State File No. Reg. Diet. No Primary Reg. Dist. No. 1803 CERTIFICATE OF DEATH Registrar's No. 256 1. PLACE OF DEATH 2. USUAL RESIDENCE (Where deceased lived. If institution: rest- ohio dence before adastast e. COUNTY Cuyahopa e. STATE b. write COUNTY RURM give township (If outside corporate limits. Chychoge CITY (If outside corporate limits, write FURM c. LENGTH OF STAY c. CITY b. VILLAGE OR and Fouland Hts (in this place) OR VILLAGE Cauland HH. d. FULL NAME OF (If NOT in hospital give street address d. STREET (If rural. HOSPITAL OR 2803 Avondale R ADDRESS INSTITUTION 2803 give location wondale Rd. s. NAME OF a. (First) b, (Middle) a. (Last) 4. DATE (Month) (Day) (Year) DECEASED Lipinan 7. MARRIED. (Louis) NEVER Kumin OF (TYPE OR PRINT) DEATH 7-29-54 5. SEX 6. COLOR a RACE MARRIED, 8. DATE OF BIRTH Under Year W Under 24 Mr. 9. AGE (In years WIDOWED, DIVORCED (Specify) Inst birthday Months Days Neurs Min. MALe white widowed 1877 77 10a. USUAL OCCUPATION 10b. KIND OF BUSINESS OR IN. 11. BIRTHPLACE (State or foreign country) 12. CITIZEN OF WHAT DUSTRY COUNTRY (Give kind of work done dering most of working life even # retired) Retired Lithuania Russia U.S.G. 13. FATHER'S NAME 14. MOTHER'S MAIDEN NAME Israel Kumin DeBoroh Krishov 13. WAS DECEASED EVER IN 16. SOCIAL SECURITY NO. 17. INFORMANTS SIGNATURE U. s. ARMED PORCES? No. 300-14-2896 18. CAUSE OF DEATH MEDICAL CERTIFICATION INTERVAL BETWEEN OHOST AND DEATH Enter only one 1. DISEASE OR CONDITION cause per line for DIRECTLY LEADING TO DEATH (a) (a), (b). and (e) Carcinoma of Prostate 6 years ANTECEDENT CAUSES \"This does not moon Morbid conditions, if my, giving DUE TO (b) the mode of dying, rise so the above cause (a) stating such as heart fasture, the underlying cause lass. asshemia, asc. It momes the disease, DUE TO (c) injury, or complice 11. OTHER SIGNIFICANT CONDITIONS lion which caused Conditions contributing 10 the deash but not relased death. to the disease or condition camsing death. 19a. DATE OF OPERA- 19b. MAJOR FINDINGS OF OPERATION 20. AUTOPSY? TION 1954 Carcinoma of Prostate Yes No (Specify) 21b. PLACE OF INJURY (e.g., in 21e. ACCIDENT 21c. (CITY, VILLAGE, OR TOWNSMIP) (COUNTY) (STATE) or about home. farta, factory. SUICIDE street. office building. forest. HOMICIDE etc.) 21d. TIME (Month) (Day) (Year) (Hour) 21e. INJURY OCCURRED 21f. HOW DID INJURY OCCUR? OF While of Net While INJURY m. Work of Work 22. I hereby certify that I attended the deceased from 1928 to July 29 1954 and that death occurred at 4:00P from the causes and on the date stated above. 23a. SIGNATURE (Degree or title) 23b. ADDRESS 23c. DATE SIGNED Harry Junin M.P. 10616 Encled ave. 7/29/5 24a CURIAL. CREMA Mr. DATE 24c. NAME OF CEMETERY OR CREMATORY 24d. LOCATION (City, jowa, Quenty) REMOVAL (See 1-30-54 Januing timelary NAME/OF Chineland Ohio EMBALMER (LIG. NO.) Sub-Registrar's Signature DATE MCD BY LOCAL REGISTRAR'S SIGNATURE 25. PUNERAL RSG Darky 30,1954 Martin Saul Rumin DIRECTOR'S SIGNATURE DIF ILIC. NOJ CITY OF CLEVELAND HEIGHTS COUNTY OF CUYAHOGA STATE OF OHIO I, Ray Martin, Registrar of Registration District 1803, do hereby certin that the within copy is taken and copied from the records of this office and that the same is a correct transcript thereof. In testimony whereof. J have subscribed my name at Cleveland Heights. Ohio. this 25 Ray Martin Registrar. day of June, 1956"
}
