{
  "anumber": "A10394732",
  "id": "A10394732_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, Form approved. Budget Bureau No. 43-R105.7."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Belgium",
        "United States",
        "Lithuania"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1908,
        1495,
        1898,
        1937,
        1956,
        1905,
        1938,
        1955,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form N-600 Form approved. U.S. DEPARTMENT OF JUSTICE Budget Bureau No. 43-R105.7. IMMIGRATION AND NATURALIZATION SERVICE (Rev. 2-3-53) 10394732 APPLICATION FOR CERTIFICATE OF CITIZENSHIP UNDER SEC. 341 OF THE IMMIGRATION AND NATIONALITY ACT NR 13rd $ 5.00 Take or mail this application to: FEE PAID IMMIGRATION AND NATURALIZATION SERVICE: IMMIGRATION AND NATURALIZATION 108-7 Print or Sarah Kumin DATE 1-6-56-HELAND, OHIO ACCEPTED BY TO THE APPLICANT: have FS&Date Dec 14, 1955 (Name) type 2803 Avondale Rd READ THE INSTRUCTIONS ON THE LAST PAGE OF Name and (Street address) THIS FORM: FOLLOW THEM EXACTLY. IF YOU DO NOT HAVE ENOUGH ROOM FOR ANY QUESTION, CON- Address Cleveland Heights, Ohio TINUE IT ON ANOTHER SHEET OF PAPER THIS SIZE. (City) IB-28-28 (State) (This form must be completely filled out-pref- erably on a typewriter) I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the 1495 United States of America. (1) (If a married woman) My maiden name was same has (2) I was born in Rogola Lithuania on JUNE 19 1898 (City) (State or country) (Month) (Day) (Year) (3) My personal description is: Age years; sex female ; complexion light ; color of eyes grav color of hair brown ; height 4 ; feet 11 inches; weight 116 pounds; white race ; visible distinctive marks Marital status: Single ; Married ; Divorced ; Widow (er) Manifest 28 line 20 ! (4) I arrived in the United States at New York, N. Y. 3-26-06 A (City) March (State) under the name of Sarel Kumin SS Tinland on THE 07 1908 (Month) (Day) (Year) by means of boat (Name of vessel or other means of arrival) KS (5) I have not been absent from the United States except as follows: Date departed Date returned Name of ship, or of airline, railroad company, bus company, or other Place or port of entry through which you returned to means used to return to the United States the United States 1937 1938 JUN11 1956 ID New 5 1956 now JUL CIT RECORDS UNIT 28th (6) My last permanent foreign residence was Rogola adidance 767718 Lithuania (City) (Country) (7) The place where I took the ship or train to the United States was Antwerp (City) Belgium (Country) Answer questions (8), (9), and (10) only if you arrived in United States before July 1, 1924. 31 (8) The person in the United States to whom I was coming was my father, Lipman Kumin 3/247 (9) The place in the United States to which I was going was Cleveland, Ohio 22 Service (10) The names of some of the passengers or other persons I traveled with, including members of my family, (and their relationship to me, if any, are my mother, Baila Kumin, my sister, Anna Kumin, my brother, E Harry Kumin TO THE APPLICANT: DO NOT WRITE BETWEEN THE DOUBLE LINES BELOW. CONTINUE ON NEXT PAGE FOR USE IN SEARCHING RECORDS OF ARRIVAL: RECORDS EXAMINED RECORD FOUND Card index 1905-1907 age Place UNABLE T Date VERIFY Index books Jinland = 3-21-06 Name Manifests - Manner no ship no defARR date Marital status C.M.,Lacey (Signature of person making search) 6-19-16 K-VVO 3546299 Records 16-17953-10"
}