{
	"anumber": "A10394732",
	"id": "A10394732_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IN THE PROBATE COURT, PC-183 10M 223-54"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Sect 2113.01, 2113.02, 2113.05 and 2113.07 Revised Code THE STATE OF OHIO, SS. Cuyahoga County IN THE PROBATE COURT APPLICATION FOR LETTERS TESTAMENTARY IN RE ESTATE OF Lipman Kumin also known as Louis Kumin deceased. Anna R Kumin 9 being duly sworn, says that Lipman Kumin also known as Louis Kumin 9 late a resident of Cleveland Heights in said County, died testate on or about the 29 day of July , 19..54 ,5 at Cleveland Heights, Ohio ; that the last Will of said decedent has been duly admitted to probate and record in the Probate Court of said County; that said decedent died leaving 9 xxh.no surviving spouse, years whose post office address is xxxxxx , and the following persons h..is know next of kin: Name Kinship Age Address Sarah Kumin daughter dult 2803 Avondale Rd Cleveland Hts Anna R Kumin daughter adult 2803 Avondale Rd Cleveland Hts Dr Harry J Kumin son adult 2666 Endicott Rd Shaker Heights Ohio The following are the only legatees and devisees of said testat or named in h..is will Estimated Name Address Value of Estimated Value of Age Legacy Real Property Devised Sarah Kumin 2803 Avondale Rd Clevealnd adult Heights, Ohio Anna R Kumin 2803 Avondale Rd Cleveland adult Dr Harry J Kumin Heights Ohio 2666 Endicott Rd Shaker Hts adult \" Ruth Kumin adult Saul Kumin \" 11 \" 19 Ra Anniel Kumin 825 E 9 St Brooklyn, N. Y. adult $500. The undersigned asks to be appointed executrix of the Will of said decedent and on her oath aforesaid says that the estate consists of : Personal property of the probable value of $ 2000.00 Real estate of the probable value of $ 45000.00 Annual real estate rentals which will come into hands of the probable value of $ Total $ 47000.00 The amount of all indebtedness the deceased had against the undersigned is $ none included in the amount of personal property above stated. The undersigned further states that the decedent at the time of his death was engaged in the business of retired under the name of located at Applicant , Anna R Kumin Address 2803...Avondule Rd Gleveland. Heights Sworn to before me and signed in my presence, this 11 day of August , 19..54 By 9314 Harry Room L 5 Bras Probate Judge Deputy Clerk The name of Anna R Kumin, Kinsman Rd , Attorney, who will represent her in matters relating to this trust is hereby filed in said court. PC-183 10M 223-54"
}
