{
  "anumber": "A10394732",
  "id": "A10394732_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization, Form 860"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "Germany",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1898,
        1904,
        1902,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form 9908 Department of Commerce and Caker NATURALIZATION SERVICE No. 3839 DUPLICATE in to Summer UNITED STATES OF ABSERION (To Insignation and 1222303 PETITION FOR NATURALIZATION To the Honorable the Ciramon Court of 6948 The position of Lipman Kumin, hereby Aled, respect Vally shower First, My place of residence is 2529 E. 39 St Cleveland Ohio Second, My occupation is Merchant, (Give number street, city es town and State Third , was born on the 1 day of Dec anno Domini I 875 at Dalialitz, Runsia. Fourth. I emigrated to the United States from Bremen Germany, on OF about the 2 day of Nov anno Domini 1. 904 and arrived in the United States, at the port of New York N. Y. on the 15 day of Nov anno Domini 1 904 on the vessel Main (If the allen arrived otherwise than by Total the chamator of conveyance or name of transportation company should to gives rifth. 1 de clared my intention to become a citizen of the United States on the 27 day of Feb anno Domini , 906 at Cleveland Ohio. in the Common Pleas Court of Cuyahoga County, Ohio SI dh. I am married. My w/f'a's name is Baila Kunin, She 1003 born in Russia. and now resides at 2529 E. 39 Cleveland, Ohio I ha 4 children, and the name, date and place of birth, and place of residence of each of sold children is as follows (Give number, street, city or town, and State.) Sarah, Born July 5 1898 Anna, # Dec 1 1900 Rebecca a June 10 1902 Harry, Apr 15 1904 Born at Rogoly Russia & reside at Cleveland Ohio. Seventh. I am not believer in or opposed to organized government or a member of or affiliated with any organization or body of peradia touching disbelief in or opposed to organized government. 4 not a polygamist nor a believer in the printing of mulydomy. , am attached to the principles of the Constitution of the United States, and is is my intention to become . dii of the United States and to renounce absolutely and forever all all-giance and Adolts to any foreign prince. potentate, state, or sovereignity, and particularly to Nj oias 11. Emperor of all the Russias of whom at this time I am a subject, and it is my intention to reside permanently is , . United States. Righth. I am able to speak the English language. Ninth. I have resided continuously in the United States of America for the term of Ave years at least, immediately proceding the date of this petition. to use, since the 15 any of Nov anno Domini 1. 904 and in the State of Ohio, continuously next proceding the date of this petition. since the 17 day of Nov anno Domins 1 904 being a residence within this State of at least one year next preceding the date of this petition. Tenth. I have not heretofore made petition for citizenship to any court. (I made position for elbinonahip as the Court of / at an the day of anno Dondal and the said entition was dealed by the said Court for the following reasons and caused to set cause danigh hug alace been and Attached hereto and made a part of this petition are my declaration of intention to become d citizen of the United States and / Daponiment of - and Labor, together with my affidavit and the affidaults of the two verifying witnesses thereto, required by law. # herefore your petitioner proys that he may be admitted . citizen of the United States of America. Lypman (Complete Kumin and true of signature putlioner.) Declaration of Intention and Certificate of Arrival from Department of Commerce and fasher filed this 19 June day of 191.2 AFFIDAVITS OF PETITIONER AND WITNESSES. State of Ohio Cuyahoga County The storwald petitioner being duly sworn. deposes and says that he is the petitioner in the above- tled proceedings / that he has need the foregoing potition and Inome the contants thereof: that the said petition is signed with his full. true name: that the same is true of his - knowledge except as to matters therein stated to a stanged upon information and bellet, and that as to those matters he believes it to be true Lipman Kumin S. Talisman, occupation Rabbi residing at 2509 E. 40 St Other and H. Cohn, occupation Collector, residing at 2500 E. 38 St. Cleveland Old each being severally. duly, and respectively sworn. deposes and says that he is a citizen of the United States of America that he his personally Anown Lipman Kumin, the petitioner above tioned to have resided in the Unived States condinuously immediately preceding the date of Aling his petition, since the 1 day of March anno Domini 1 902 and in the State in which the above entitled petition is made continuously since the 1 day of March anno Domini , 907 and that he has personal Amountedga that the said petitioner is a person of good moral character attached to the principles of the Constitution of the United States and that the politioner is in every any qualified is Mis epinion, to be admitted a citizen of the United States. Ree Smoon Valiamon of without).) (Heal.) Hyman Cohn of - Subscribed and aware to before the by the above named petitioner and ultnesses this 19 day of June anno Domini 19 n CHARLES S HORNER clerk N& 295241 Lad Kryer Paperpy Clark"
}