{
	"anumber": "A10343151",
	"id": "A10343151_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10343151_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Form PS-256A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "Georgia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 1944, 1887]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1 Form FS-256a FOREIGN SERVICE OF THE UNITED STATES OF AMERICA (Revised August 1952) Approved Bureau Budget No. 47-R108.2 APPLICATION FOR IMMIGRANT VISA I- 935458 mk AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul ate General at Munich Germany 1. Family name 5-216 Given name Initial 2. Place and date of birth Age SCHAEFFER Else M. J. July 12, 1887 at Berlin Germany 68 3. Other names by which I have been known 4. Last permanent residence nee SCHAEFFER div. STERNBERG Adelheidweg 23, Schwaebisch Hall Germany 5. Address in the United States 6. Name and address of person to whom destined, if any Battey State Hospital Rome Georgia Mr. and Mrs. Ingrid STERGUS, see No. 5 7. Name and address of nearest relative in home country 8. Travel documents presented sister: Kaethe RIESS, Berlin/Tegel, Marzahnstr. 23, Ger. German Passport 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status German German M Married Single blond gr/brown 5 ft. 612 in. 14. Complexion 16. Ethnic Classification 148 lbs. F Widowed Divorced med. 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written housewife none German, English 22. Intended United States port of entry 23. Final destination 24. I have (a) 25. Purpose of going to the United States through ticket to New York see No. 5 destination to reside 26. Places of previous residence 1944 Berlin Ger; -1952 Munsterlager Ger; up to date Schwaeb. Hall Germany 27. Names and places of residence of spouse and minor children 40. Name and address of father 29. Name and address of mother Richard SCHAEFFER, deceased Klara nee SCHERLER, deceased 30. I claim to be a preference quota] 2nd immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: U Mother of US Citizen Birth Certificate Marriage with Divorce Certificate Police Record 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: XXX 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: XXX 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: XXX 16-67444-2 (Application continued on reverse side)"
}
