{
	"anumber": "A10394732",
	"id": "A10394732_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificate of Citizenship, Form N-560 ( (REV. 5-25-55)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1898]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form N-560 (REV. 5-25-55) THE CA No. A-352757 CATE application No. A10 394 732 DUPLICATE Personal.description of holder's ofdate afissuance of n this certificate; Sex Female date of birth June 17, 1898 ; country of birth Lithuania complexion Light colorofeyes Grey coloryfhair Brown ; height 4 feet 11 inches; weight 116 hounds; visible edistinctive marks None Maritalstatus Divorced I certify that the description, above given is true. and that photography affixed hereto, is a likeness of me. Sarah Kumin Complete and true signature of holder) Beil known, that SARAH KUMIN , now residingal 2803 Avondale Road, Cleveland Heights, Ohio having appliedstophe Commissioner, of Immigration,and' naturalizationfor sacertificate of the the Commission ofthe United States of America.,became Section. 341/of the Immigration, Immigration, andnationality Acthavingproved.lo a November 20, 1912 andismowing the United States: Sarah Kumi now Therefore infursuance, Section 341 of the Immigration and nationality (Col. this certificate Twenty-Ninth Seal day/of August intheyearsfour. Londmineleonhundred and Fifty-six ,and of our Independence.the onehundredund Eighty-first , and the isealofthe Department of IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Jacousing COMMISS TONER"
}
