{
	"anumber": "A10394732",
	"id": "A10394732_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10394732_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Application,, N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1897, 1954, 1876, 1934, 1904, 1906, 1870]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CONTINUE HERE: (11) I claim United States citizenship through my (check whichever applicable) father stepfather ; mother ; husband ; as a British Columbia/Indian having resided in Alaska continuously since (12) My father's name is/was Lipman Kumin Russia on Dec 1, 1870 and now resides in ; he was born at Daliality (City) (State or country) (Month) (Day) (Year) (City) deceased 17-29-54 ; he did did not become a citizen of the (If deceased, show \"deceased\" only) (State) United States at birth ; naturalization X on November 20, 1912 in the Common Pleas (Month) (Day) (Year) (Name of court) Court of Cuyahoga County at Cleveland, Ohio ; (City or town) (State) Certificate of Naturalization No. 301908 ; he was last a citizen of United States ; he resided in the United States from 1904 to 1954 when from he died to ; from to ; from to (13) My mother's maiden (Year) name is/was (Year) Bailshapiro (Year) (Year) (Year) (Year) (Year) (Year) 3 ; she was born at Rogola (City) Lithuania on 1876 and now resides in (State or country) (Month) (Day) (Year) (City) deceased ; she did did not become a citizen of the (If deceased, show \"deceased\" only) (State) United States at birth ; naturalization X; on November 20, 1912 in the Common Pleas (Month) (Day) (Year) (Name of court) Court of Cuyahoga County at Cleveland, Ohio ; (City or town) (State) Certificate of Naturalization No. 301908 ; she was last a citizen of United States ; she resided in when she died the United States from 1906 to 1934 ;from to ; from to from to (Year) (Year) (Y (Year) (Year) (Year) (Year) (Year) 4 She and my father were married on June 1897 at Rogola Lithuania (Month) (Day) (Year) (City) (State or country) My mother has been married once times, and my father has been married once times. (14) I have have not filed a declaration of intention or petition for naturalization (If so, give name and location of court in which filed, and date and number of papers) (15) I have have not lost my United States citizenship in any manner. To the best of my knowledge the person(s) through whom I claim citizenship have have not lost United States citizenship. (If citizenship lost, give date and manner) (16) Should a certificate of citizenship be issued to me, I desire it to be issued in the name of: Sarah Kumin (17) I submit the following documents with this application: Nature of Document Names of Persons Concerned Certified DIVORCE DECREE SARAH MILSTEIN US MOSES MIRSTEIN U.S. P.P. # 809998 issued To applicant returned. MAIL OH JUL 5 1956 60 YORK TOT (2) 16-17953-10"
}
