{
	"anumber": "A10430675",
	"id": "A10430675_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0019/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR PREEXAMINATION, Form I-63"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1908, 1937, 1934, 1948, 1955, 1952, 1904, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form I-63 UNITED STATES DEP ARTMENT OF JUST Immigration and Naturalization Service A 6 699 884 (5-11-55) APPLICATION FOR PREEXAMINATION Take or mail to - IMMIGRATION AND NATURALIZATION SERVICE $5.00 FEE PAID No 13-22 Immigration & Naturalization Service St. Paul, Minnesota Date 8/16/55 Accepted by amm (Read carefully and follow instructions on reverse hereof) 1. I, MAOLING LIU , an alien, hereby apply for preexamination. 2. My visa to the at Canada. to a application I will for be immigration able obtain prompt will be issuance submitted of visa. United States Consul man 3. I intend to enter Canada at the port of port of nayu Them nayes, Mim , and to reenter the United States at the 4. My name given at birth was MAOLING LIU . 5. I have been known by the following additional names 6. I was born at SHOU-KUANG-USIEN, SHANTUNG, CHINDON APRIL 13, 1904 My nationality is CHINESE 7. My sex is MALL My personal description is as follows: Height 5'8\" Complexion dark Color of eyes BROWN Color of hair BLACK 8. I now reside at 630 LINCOLN ST. N.E. MINNEAPOLIS, MINN. 9. My occupation is TEACHER 10. My father's name is SZE-WEN LIU (DESEASED) . He was born in SHANTUNG, CHINA He is a citizen of CHINA 11. My mother's name is MEN-CHEN ZENG Lrd.,DECEASED) She was born in SHANTUNG, CHINA She is a citizen of CHINA 12. I first entered the United States under the name of MAOLING LIU on AUG. wight at the port of SANFRANCISCO, CALL. by means of JUNSOLN 2-21-19 (name of vessel other I WAS inspected and admitted by an immigration officer. Since conveyance) (was or was not) the entry mentioned above I HAVE been absent from the United States. (If absent furnish below the port and (have or have not) date covering each departure from and return to the United States) LEFT U.S. Nov. 1934 SEATTLE, WASHINGTON Gene RETURN JO. U.S FEB21947 SAN FRANCISCO , CALIFORNIA Gordon 13. During the past five years I have lived at the following addresses: Street or Number City of Town State From To Month Year Month Year 630 LINCOLN ST. N.E MPLS 13 MINN MAY 1948 AUD P209 17. 14. During the past five years I have been employed by the following named persons or firms: (If self-employed, give na- ture of business) Name of Employer Type of Work From To om Month Year Month [ ] Year UNIV. OF MINNESOTA TEACHING FEB 1947 PRESENT GENERAL MILLS, INS. SCIENTIST SUMMERS, 1952-1955 15. I AM married. The name of my wife or husband is THELMA JUNE BOSLAND (am) (am not) . We were married on JAN 22, 1937 at PEIPING CHINA . My wife or husband was born at WAVBAY SOUTH DAKOTA on JUNE 13, 1908 and is now a citizen of THE UNITED STATE'S DID (name of country) 16. I (did) (did not) register under the Alien Registration Act of 1940 or Section 262 of the Immigration and Nationality Act. My Alien Registration Number is A6699884"
}
