{
  "anumber": "A10430675",
  "id": "A10430675_0085",
  "page_index": 85,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0085/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service, Form 9-132-St.Paul 9-19-47"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form 9-132-St. Paul 9-19-47 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 1014 New Post Office Building Saint Paul 1, Minnesota July 18, 1950 Mr. Mao-Ling Liu File No. 0900/33210 630 Lincoln St. N. E. Minneapolis 13. Minn. Dear Sir The records of this Service show that the time for which you were admitted to the United States temporarily as a non-quota student will expire August 7, 1950 If you intend to continue your studies beyond that period, the enclosed application for extension of stay (Form I-535) should be completed in every detail, after which you should bring it personally to Room 1014, New Post Office Building, St. Paul, Minnesota, any week day except Saturday or a holiday between 8:30 a.m. and 3:30 p.m. You should also bring the record of admission which you received at the time of entry (Form I-94), and passport or other travel document valid at least sixty days beyond the date to which you seek an extension. If you have completed your studies or expect to do so before the period of your present stay expires and you plan to leave the United States, it is requested that this letter be delivered to an officer of the Immigration and Naturalizatien Service at the port of departure. Very truly yours, Irvin F. Shrode Officer in Charge Assistant Officer in Charge By: Weighton D. Perfetto P. S. If you intend to make application for an extension of stay, you must also submit a letter from the school you are now attending which certifies that you are either enrolled there at the present time or will be accepted there for the fall term of 1950. RMG/RFS $7.50"
}