{
  "anumber": "A10430675",
  "id": "A10430675_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0075/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Questionnaire"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "- 2 - Q Have you ever been excluded or deported, or allowed to depart voluntarily from the United States by the Immigration Service? A No. Q Have you ever been arrested in the United States or in any other country? (If so, when, where, and for what offense.) A No. Q Please name your father, mother, sisters and brothers, and give their present addresses and occupations. A My father and mother are dead. I have a sister and brother Sister: Shu-Ying Liu, Shoukuanghsien, Shantung, China, housewife, Brother: Hung-Ling Liu, 11 11 farming Q Do you belong to or are you affiliated with any organization, society, or group? (If so, please identify all such organizations, societies, or groups.) A American Society for Engineering Education, U of M Minneapolis Tau Beta Pi, U of M Mpls, honorary fraternity Eta Kappa Nu U of M 11: 11 Cosmopolitan Cqub, U of M Mpls, P.T A. Pieroe*School, Mpls, Minn. Q Have you ever belonged to or have you ever been associated with any other organization, society, or group? A Christian Fellowship, Yenghing Univ. Peking, China. Q Are you now or have you ever been a member of the Communist Party or an organ- ization affiliated with that party? A No. Q Has any member of your family, including your brothers and sisters, ever been members of the Communist Party or an organization affiliated with that party? A No. Not that I know of. Q Do you believe in the private ownership of property? A Yes."
}