{
  "anumber": "A10430675",
  "id": "A10430675_0102",
  "page_index": 102,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0102/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF ELECTRICAL ENGINEERING, 09.01/33210"
    },
    "years": {
      "ms_years_nlp_v1": [
        1949
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNIVERSITY OF MINNESOTA and got INSTITUTE OF TECHNOLOGY MINNEAPOLIS 14 0900/33210 DEPARTMENT OF ELECTRICAL ENGINEERING February 23. 1949 Professor Forrest Moore 402 Eddy Hall Dear Professor Moore: I am writing concerning one of our Electrical Engineering instructors, Mr. Maoling Liu. If you think it appropriate, the statement could be used, or the letter could be forwarded to the St. Paul immigration office directed to the attention of Mr. Klingberg with whom Mr. Liu has recently had conversa- tions concerning his status under the immigration laws. The question which arises is whether Mr. Liu is carrying a full-time graduate program and if he is, how this can be reconciled with the simultaneous discharge of the duties of a full-time instructor in the Department of Electrical Engineering. In this connection I should like to state that Mr. Liu is making satisfactory progress toward the M. S. degree, and that his work as an instructor in the Electrical Engineering Department if anything is a help rather than a hind- rance to his educational progress. I do not wish to say that a person can not get the M. S. degree in Electrical Engineering in less than two years, but many of our very best graduates do take that long and in so doing lay a founda- tion for a more thorough understanding of their field which may lead to the decision to go on for the Ph. D. degree. Putting in part of his time as an instructor in the work of his major field, should in no wise be compared with, say, working in a factory, or in a res- taurant, or any such employment. One does not learn completely or profoundly by a single exposure to a lecture course and by following the thoughts of the lecturer. It is by independent thinking, as well as long continued thinking about a matter, that brings understanding and depth of knowledge. The oppor- tunity to teach is a privilege, from this point of view, and an opportunity to learn. It is true teachers are paid for their work for if they do not have independent means, they can not pursue the profession. However, there are in- stances, for example Willard Gibbs of Yale University, an outstanding thinker, who for years held a professorship from the Yale Corporation without benefit of salary. This should establish the point I am trying to make; that receiv- ing a salary for the work of teaching is not a measure of disability to pursue graduate work successfully and with whole energy and power of mind. I recognize that the question of whether a given person is, or is not, progress- ing successfully in a program of learning is a matter of judgment. I am willing to go on record, stating my reputation for good judgment, that Mr. Liu is pro- gressing satisfactorily. Sincerely yours, Henry E. Hartig Professor and Head Dep't. of Elec. Eng'g. HEH:ms"
}