{
	"anumber": "A10430675",
	"id": "A10430675_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATEMENT OF F.S. FOR PREPARATION OF PETITION, No. 4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1937, 1904, 1958, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "3 ALIF EGISTRATION STATEMENT OF F. IS FOR PREPARATION OF PETITION Name MA LING LIU No. A 10 430 675 (1) My full, true, and correct name is MAOLING Liu (Full. true name. without aboreviation. and any other name which has been used must appear here) (2) My present place of residence is 322 SUNSET DRIVE PULLMAN WHITMAN WASH (Number and street) (City or town) (County) (State) (3) My present occupation is TEACHING (4) I was born on APR. 13 1904 in SHOUKUANGHSIEN SHANTUNG CHINA (Month) (Day) (Year) (City or town) (County. district. province. or State) (Country) (5) My personal description is as follows: Sex M ; complexion DARK ; color of eyes Br. ; color of hair GRAY&BL: height 5 feet 8 inches; weight 142 pounds; visible distinctive marks NONE ; country of which I am a citizen, subject, or national CHINA ; (6) I (am, am not) married; the name of my wife OF husband is THELMA JUNE BOSLAND ; we were married on JAN. 22 1937 at PEIPING CHINA ; (Month) WAUBAY (Day) (Year) DAY COUNTY So, DAK, (City or town) (State or country) he-or she was born at 7 S.A on JUNE (City or town) (County. district. province, or State) 1908 ; entered the United States at NOVES (Country) 13 (Month) (Day) /(Year) (City or town) MINN on for permanent residence in the (State) (Month) (Day) (Year) United States and now resides at 322 SUNSET Dr. PULLMAN, WASH ; (City or town) (State or country) and was naturalized on at (Month) (Day) (Year) (City or Town) (State) certificate No. or became a citizen by BIRTH (2) I have 2 children; and the name, sex, place and date of birth, and present place of residence of each of said children who is living, are as follows: NAME SEX PLACE BORN DATE BORN Now LIVING AT- CHELCIE BOSLAND Liv M PEIPING CHINA. 12/30/40 322 SUNSET Dr. PULLMAN ELAINE MAY Liu F in 11/19/43 (8) My lawful admission for permanent residence in the United States was at NOYES MINN ; MAOLING Liu (City or town) (State) under the name of on 9 (Month) (Day) 7 55 (Year) on the A TRAIN sprey / (Name of vessel or other means of conveyance) (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows: DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES PORT DATE VESSEL OR OTHER MEANS of CONVEYANCE PORT DATE VESSEL OR OTHER MEANS (Month, day, year) (Month, day, year) or CONVEYANCE I (10a) I have resided continuously in the United States of America since 9/7/55 and continuously in the State of WASH. where I now live since AUG. 11, 1958 and during the past 5 years I have been physically present in the United States for an aggregate period 060 months. (10b) Do you intend to reside permanently in the United States? Yes No. If \"No,\" explain (11) I (have, have not) heretofore made petition for naturalization No. on at (Month) (Day) (Year) (City) (State) in the Court, which was denied because (12) I wish the naturalization court to change my name to none (Give full name desired) TO THE APPLICANT: DO NOT WRITE BELOW THIS LINE. SWITH (1st witness) CAROL SWITZER United Statos 0647 58: (Name) State - residing 1507 (Number and street) chifford (Occupation) miam, Physical presence 7 mos. WILLIAM BAND (City or (State) Examiner (Name) V.S.D.Shok. Tradem cubation) residing at 1609 FISK St, Rullivary (Number and street) (City or town) wn (State) ang1958 (OVER) almort daily"
}
