{
	"anumber": "A10430675",
	"id": "A10430675_0142",
	"page_index": 142,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0142/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit for Persons 14 Years of Age and Older, 9-20-47"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OFFICE None USE 11. My military or naval service has been (COUNTRY) From to (BRANCH OF SERVICE) (DATE) (DATE) 12. have not applied for first citizenship papers in the United States. Date of application (HAVE. HAVE NOT) First citizenship papers received , , (DATE) (NUMBER) (CITY) (STATE) Filed petition for naturalization , , (DATE) (CITY) (STATE) 13. *I have the following specified relatives living in the United States: Parent(s) no Husband or wife yes Children yes (NONE. OR ONE. OR BOTH) (YES OR NO) (NUMBER) 14. I have not been arrested or indicted for, or convicted of any offense (or offenses). These offenses are: (HAVE, HAVE NOT) Nature of offense Date of arrest Place of arrest Disposition of case 15. Within the past 5 years I have not been affiliated with or active in (a member of, official of, a (HAVE. HAVE NOT) worker for) organizations, devoted in whole or in part to influencing or furthering in the United States, the political activities, public relations, or public policy of any other government. AFFIDAVIT FOR PERSONS 14 YEARS OF AGE AND OLDER Subscribed and sworn to (or I have read or have had read to me the above statements, and affirmed) before me this 11th day do hereby swear (or affirm) that these statements are true and complete to the best of my knowledge and belief. of. October Oat the place designated by the official seal below. / (SIGNATURE OF REGISTRANT) Fulton Freeman (REGISTERING OFFICIAL) AFFIDAVIT FOR PARENT OR GUARDIAN ONLY PRINT NAME, ADDRESS, AND BUSINESS OF PERSON SIGNING THIS AFFIDAVITIN 9 (c), I am the ABOVE. (PARENT OF. OR GUARDIAN OF OR PERSON RESPONSIBLE FOR) Unit u Subscribed and sworn to (or the above-named alien, who is (UNDER 14 YEARS OF AGE. OR INSANE) affirmed) before me this day and have made the above allegations for him (or her). I have of 194 , at the place Canada of the laber read or have had the same read to me, and do hereby swear designated by the official seal at the (or affirm) that they are true and complete to the best of my right. knowledge, information, and belief. PETPING, CHINA (SIGNATURE OF PARENT OF. OR GUARDIAN OF. OR PERSON RESPONSIBLE FOR THE ALIEN) (REGISTERING OFFICIAL) 16-16440-2 the S. S. Gen. Gordon I certify that the within named registrant arrived in the United States on 2-7-47 at the port of San Francisco on and was inspected by me and duly { admitted. (DATE) (rejected. 4(a) au Hanguan (IMMIGRATION OFFICER)"
}
