{
  "anumber": "A10430675",
  "id": "A10430675_0123",
  "page_index": 123,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0123/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Student Information Form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1927,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Q Do both your children claim United States citizenship? A Yes. Q Have you ever been in the United States before? A Yes. Q Between what dates? A August 1927 and November 1934. Q On what ship did you arrive? A On the \"President Lincoln\" at San Francisco. Q How were you admitted at that time? A As a student. Q What school did you attend while in the United States? A The University of Minnesoto. Q Did you graduate and obtain a degree? A Yes. A B.E.E. Q Did you ever do any instruction work when you were in the United States the first time? A Yes. Q How much time did you devote to your studies and how much to your instruction? A I devoted full time to my studies, and six hours a week for instruction. Q Do you mean that you carried a full course of study in excess of teaching? A Yes. Q To what school are you destined at this time? A The University of Minnesoto. Q Will you carry a full course of study in the University of Minnesoto? A Yes. Q Will you receive any salary for instruction? A Yes. Q How much time will be devoted to instruction? A Six hours a week. Q Did you inform the American Consul at the time of the application for your student visa that you intended to teach part time? A Yes. Q Do you have a home in the United States? A No. Q With whom is your wife staying at the present time? A With her parents. 2/1/47 -4- 1300-47068"
}