{
	"anumber": "A10430675",
	"id": "A10430675_0078",
	"page_index": 78,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0078/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form 9-116A-St.Paul"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 9-116A-St. Paul 2-28-49 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 1014 New Post Office Building OT FOITOW Saint Paul 1, Minnesota Mr. Maoling Liu November 7, 1950 A6 699 884 630 Lincoln St. N. E. to Minneapolis, Minnesota Dear Sir: between ed term Referring to your entry into the United States as a Section 4(e) student, will you kindly answer the questions listed below, sign your youte name and then request the Registrar of the school you are attending to certify that the information given by you is true and correct. A franked addressed envelope is enclosed for your convenience in making reply. Very truly yours, Irvin F. Shrode Officer in Charge B 10, REC NOV 21 BENNOR THE By: J! D. Porfetto Assistant Officer in Charge TITTE - RMG/RFS 1. Are you attending the UNIVERSITY OF MINN. (school)? A. YES 2. How many semester hours of work do you carry? A. F2 3 credits plus Thesis** 3. Is this a full course of study in day classes? A. YES 4. Are you making passing grades in all of your subjects? A. Yes 5. Are you employed? A. YES If you are employed, please give full particulars on the reverse of this page. Date: novem ber 13, 1950 mashing Signature of Student Lin A6 699 884 Note: The Registrar will please add his comments in the space below, and mail to U. S. Immigration and Naturalization Service, 1014 New Post Office Building, St. Paul 1, Minnesota. **Certified a full load by adviser and the Graduate School. 1-2-51 m h Davis Date: November 20, 1950 s. Registrary Assistant to the Dean Graduate School, University of Minnesota Encl. SEE INSTRUCTIONS ON THE REVERSE HEREOF"
}
