{
	"anumber": "A10430675",
	"id": "A10430675_0107",
	"page_index": 107,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0107/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service Form 9-116A-Chicago"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "st Paul Form 9-116A- Chicago 12-10-47 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service New Post Office Building Mao-Ling Liu Chicago 7, Illinois 5052 Cedar Ave. Minneapolis, Minn. 11-4-4-4 0900-33210 ok 630 LINCOLN STNE MPLS., MINN Dear Sir: Referring to your entry into the United States as a Section 4(e) student. will you kindly answer the questions listed below. sign your name and then request the Registrar of the school you are attending to certify that the information given by you is true and cor- rect. A franked addressed envelope is enclosed for your convenience in making reply. Very truly yours, Andrew Jordan District Director UCDanis Chicago District By: C.C. Davis Chief, Entry, Departure and Expulsion Section 1. Are you attending the UNIVERSITY OF MINN. (school) A. Yes 2. How many semester hours of work do you carfy? A. 6 hrs & THESIS 3. Is this a full course of study in day classés? A. Yes 4. Are you making passing grades in all of your subjects?A. Ye SEC 28 5. Are you employed?A. Yes 1948 If you are employed, please give full particulars on the reverse of this page. Date: Dec. 1, 1948 Mashing Signature of Student Lin 0900-33210 File No. Note: The Registrar will please add his comments in the space below, and mail to U. S. Immigration and Naturalization Service, Room 929, Post Office Bldg., Chicago 7, Illinois. Cu 1-10-49 Needs epit hou about M.L.Davic assistant to Dean 12/20/48 Graduate second peen"
}
