{
	"anumber": "A10430675",
	"id": "A10430675_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service Application for Alien Registration,, Form I-582."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1924, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2 - 17. There are listed below the names of all organizations, societies, clubs and associations in which I have held member- ship, past or present, whether in the United States or a foreign country and the periods and places of such membership: YENTA CHRISTIAN FELLOWSHIP 1924-26 AIEE A.S.Et. CHINESE STUDENT CLUB, UNIV OF MINN, COSMOPOLLIAN (LUB, UNIV OF MINN JAV BEIA Pl, ETA KAPPA NU 18. I HAVE NEVER (either in the United States or any other country) been arrested, summoned into court as a (have) (have never) defendant; convicted, fined, imprisoned, or placed on probation, or forfeited collateral for an act involving a felony, misdemeanor, or breach of any public law or ordinance. If answer is in the affirmative in any particular, give complete information the space immediately following 19. The following certificates or other documents are attached herewith as a part of this application: Nature of Document (Sign here) Mashing (Signature of applicant parent Loie guardian) or or (APPLICATION MUST BE SWORN TO BEFORE A NOTARY PUBLIC OR OTHER PERSON AUTHORIZED TO ADMIN- ISTER OATHS FOR GENERAL PURPOSES OR BEFORE AN IMMIGRATION OFFICER) I, , do swear (affirm) that I know the contents of this application subscribed by me, that the same including the documents appended hereto are true to the best of my knowledge, and that this ap- plication was signed by me with my full, true name: So Help Me God. (Complete and true signature of applicant) Subscribed and sworn to before me by the above-named applicant at this day of 19 (Title of officer) INSTRUCTIONS TO THE APPLICANT 1. PREPARATION OF APPLICATION.- separate application, in duplicate, must be executed for each person apply- ing for preexamination. However, all applications from a family unit may be mailed together and may be supported by the same documentary evidence, if practicable. An application in behalf of a child under 14 years of age shall be executed by the parent or guardian. 2. FEE.-A fee of $25 must accompany each application. All remittances should be made payable to \"Immigration and Naturalization Service, Department of Justice\" except that in Guam they should be made payable to \"Treasurer of Guam' and in the Virgin Islands to \"Commissioner of Finance, Virgin Islands.\" No fee is required if fee was previously submitted with an application for suspension of deportation which is still pending. 3. DOCUMENTS.-- You should submit any temporary entry permit (Form 257 a or I=94) issued at the time of your entry. Documentary evidence of your residence in the United States prior to January 1, 1955 must be submitted. This may con- sist of bank books, leases, deeds, licenses, receipts, letters, birth records, church records, school records, employment records, affidavits, etc. You must prove that you have been a person of good moral character during the past five years, and must submit police records covering such period. You must also submit the affidavits of two witnesses, preferably citizens of the United States, and if employed, one from your employer, who can vouch for your good moral character during such period. 4. PHOTOGRAPHS.-You must submit with this application two photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 X 2 inches in size, and the distance from top of head to point of chin should be approximately 1 1/4 inches. They must not be pasted on cards or mounted in any way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group or full-length portraits will not be accepted. All of these photographs must be signed by you on the margin and not on the face or the clothing. 5. PENALTIES.--Your attention is called to section 1546 of title 18, United States Code, which provides that whoever knowingly makes under oath any false statements in any application, affidavit, or other document required by the immigration laws or regulations prescribed thereunder, shall, upon conviction thereof, be fined not more than $2,000 or imprisoned for not more than 5 years, or both. Your answers to any of the questions in this form may be used as evidence in any proceed- ings to determine your right to enter, reenter, pass through or reside in the United States. False answers to any of the questions may result in the denial of your application."
}
