{
	"anumber": "A10430675",
	"id": "A10430675_0088",
	"page_index": 88,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0088/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service Form 9-116A-St.Paul"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 9-116A-St. Paul Certified as a 2-28-49 UNITED STATES DEPARTMENT OF JUSTICE full load by Immigration and Naturalization Service adviser and 1014 New Post Office Building Graduate school. Saint Paul 1, Minnesota Mr. Mao-Ling Liu January 25, 1950 0900/33210 630 Lincoln St. N. E. Minneapolis 13, Minn. Dear Sir: Referring to your entry into the United States as a Section 4(e) student, will you kindly answer the questions listed below, sign your name and then request the Registrar of the school you are attending to certify that the information given by you is true and correct. A franked addressed envelope is enclosed for your convenience in making reply. Very truly yours, Irvin F. Shrode Officer in Charge FEE the you By: J. D. Perfetto Assistant Officer in Charge RMG/RFS 1. Are you attending the University of minn. (school)? A. yes 2. How many semester hours of work do you carry? A. 6 + Thesis 3. Is this a full course of study in day classes? A. yes 4. Are you making passing grades in all of your subjects? A. yes 5. Are you employed? A. yes If you are employed, please give full particulars on the reverse of this page. Date: Juf 1, 1950 Mashing Signature of Student Lin Note: The Registrar will please add his comments in the space below, and mail to U. S. Immigration and Naturalization Service, 1014 New Post Office Building, St. Paul, 1, Minnesota. state m. L. Davis asst to Dean Date: 2-9-1950 - Registrar, of Graduate School Encl. Sc SEE INSTRUCTIONS ON THE REVERSE HEREOF"
}
