{
  "anumber": "A10430675",
  "id": "A10430675_0125",
  "page_index": 125,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0125/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certification of Admission to Graduate School, Form 6-10478"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1947,
        1908
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "\"This is to certify that Mr. Maoling Liu has been accepted for admission to the Graduate School at the University of Minnesota he will be studying for an advanced degree and teaching lab courses in physics. Signe J. W. Buchta Chairman Department of Pjysics University of Minnesota.\" NOTE BY CHAIRMAN HARGREAVES: Applicant examined by U. S. Public Health, January 25, 1947. Medical certificate shows no certifiable disease. Under no certifiable disease Note:\"Had pulmonary tuberculosis 15 years ago involving right lung. Underwent a 3 stage thoracoplasty at that time. No evidence of activity for the past 13 years. Periodic X-ray and sputum studies have been carried out by local M.D.\" CHAIRMAN TO APPLICANT: Q Is there anything further you wish to say at this time? A I come as a student and I shall remain as a student and I shall go back to China in two and a half years. Q Have you fully understood all the questions asked? A Yes. Q Have your answers been the truth? A Yes. APPLICANT EXCUSED. APPLICANT'S WIFE CALLED. Q What is your name? A Thelma Liu, Bosland is my maiden name. Q You are called at this time to testify in behalf of your husband, Maoling Liu are you able to speak and understand the English language? A Yes. Q Please state your fubl and correct name? A Thelma Bosland Liu. Q Where and when were you born? A Waubay, South Dakota, June 13, 1908. Q Are you an American citizen? A I am. Q Do you have any documents to present in proof of your citizenship? A Yes. Presents - United States passport No. 20 issued Peiping, China, May 18, 1946 to Thelma Bosland Liu showing place of birth Waubay, South Dakota, June 13, 2/1/47 -6- 1300-47068"
}