{
  "anumber": "A10430675",
  "id": "A10430675_0127",
  "page_index": 127,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0127/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration Hearing Transcript, 1300-47068"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        1946,
        1937,
        1934,
        1947,
        1904,
        1922,
        1924,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Q Have you fully understood all the questions asked and have your answers been the truth? A I have fully understood them and my answers have been the truth. XXTNXXXS XEXCUSEN. APPLICANT RECALLED. Q Are there any questions? MEMBER CARSON: No. MEMBER WHITELEY: No. DISCUSSION OF THE EVIDENCE BY THE CHAIRMAN: The applicant LIU, Maoling, testifies that he is a native and subject of China born April 14, 1904 at Shantung, China. He presents Chinese passport in proof of such citizenship. He has testified he has no claim to United States citizen- ship (p.3). He testifies that he vias married to Miss Jung Liu, July 1921, this marriage having terminated in 1922 through death. He was married the second time to Thelma Bosland Liu, a United States citizen, at Peiping, China, January 22, 1937 (p.3). The applicant was admitted to the United States in August 1927 and remained until November 1934, during that time he attended the University of Minnesota and obtained the degree B.E.E. (p.4). The applicant is now returning to the United States in possession of a valid nonquota immigration visa issued under Section 4(e) of the Immigration Act of 1924 (p.1). Both the applicant and his wife testify that he will return to China at the expiration of his studies in the United States (p.5 and p.7). He is entering an approved school and has been accepted as shown by a letter and telegram from the University of Minnesota (p.5) FINDINGS OF FACT: 1. That the applicant is an alien, native and subject of China, 2. That the applicant entered the United States at the port of San Francisco, C California, August 1927 on the \"President Lincoln\", and was admitted as a 4(E) student. 3. That the applicant departed from the United States, November 1934, to resume his residence in China. 4. That the applicant was issued XXX nonquota immigration visa under Section 4(E) of the Immigration Act of 1924 at Peiping, China, on October 14, 1946, which is valid until February 14, 1947. 5. That the applicant is a student as defined in the Immigration Act of 1924. CONCLUSIONS OF LAW: That under Section 4(E) of the Immigration Act of May 26, 1924 the applicant is admissible to the United States as a student. CHAIRMAN TO MEMBERS OF BOARD: 2/1/47 -8- 1300-47068"
}