{
  "anumber": "A10430675",
  "id": "A10430675_0145",
  "page_index": 145,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0145/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRATION VISA (NONQUOTA), 16-1947"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1943,
        1929,
        1918,
        1904,
        1940,
        1920,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "For o. 256 AMERICAN FOREIGN SERVICE American Consulate (Revised January 1936) No. 16-1947 AT Peiping, China APPLICATION FOR IMMIGRATION VISA (NONQUOTA) I, the undersigned APPLICANT FOR AN IMMIGRATION VISA, being duly sworn, state that my full and true name is Maoling LIU ; that I am 42 years of age, of the male sex and Chinese race; that I was born on the 14th day of April 1904 at Shoukuanghsien, Shantung, China ; that for 5 years immediately preceding this application I have resided at the following places, during the periods stated, to wit: Peiping, China That I 'married] am and the name of my is Thelma Bosland Liu who was born S (wife at Waubay, South Dakota, U.S.A. ; and resides at Waubay, South Dakota, U. S. A. That the names, dates of birth, and places of residence of my minor children are: Chelcie B. Liu, December 30, 1940, Waubay, South Dakota; Elaine May Liu, November 19, 1943, Waubay, South Dakota That my calling or occupation is Engineer ; that my height is 5 feet and 8 inches; my complexion medium color of hair, black color of eyes, brown ; and that I bear the following marks of identification: None ; that I fable am poorable to speak English & Chineseable to read same languages and boxable fable to write the same languages ; that the names and addresses of my parents are as follows: (Name of language or dialect) Mother, Deceased ; address, Father, Deceased ; address, That neither of my parents is living, and that the name of my nearest relative in the country from which I come is Hungling Liu whose relationship is brother and whose address is Shoukuanghsien, Shantung, China That my port of embarkation is probably Shanghai that I shall enter the United States at the port of San Francisco ; that my final destination beyond such port is Minneapolis, Minnesota ; and that I do not ylate a ticket through to such destination; that my passage was paid for by myself whose address is ; that I intend to join [relative] (frient my wife whose address is Waubay, South Dakota (City, state, street, and number) That my purpose in going to the United States is study and I intend to remain three years (Permanently or \"length of time) that I have not been in prison or almshouse; that I have not been in an institution or hospital for the care and treatment of the insane; that my father {mother] 1 (have) SX not been in an institution or hospital for the care and treatment of the insane; that I have never been refused an immigration or passport visa at any American consulate. That, except as hereafter noted, I am not a member of any one of the .ollowing classes of individuals excluded from admission to the United States under the immigration laws: (1) Idiots; (2) imbeciles; (3) feeble-minded; (4) epileptics; (5) insane persons; (6) persons having had previous attacks of insanity; (7) persons with constitutional psychopathic inferiority; (8) persons with chronic alcoholism; (9) paupers; (10) professional beggars; (11) vagrants; (12) persons afflicted with tuberculosis; (13) persons afflicted with a loathsome or dangerous contagious disease; (14) criminals; (15) polygamists; (16) anarchists; (17) persons who believe in or advocate the overthrow by force or violence of the Government of the United States; (18) persons inadmissible under the provisions of section 3 of the act of February 5, 1917; (19) persons inadmissible under the provisions of the act entitled, 'An Act to Exclude and Expel from the United States Aliens who are Members of the Anarchistic and Similar Classes\", approved October 16, 1918, as amended by the act approved June 5, 1920; (20) prostitutes; (21) procurers; (22) contract laborers; (23) persons likely to become public charges; (24) persons previously deported or ordered deported and permitted to leave the United States voluntarily in lieu of deporta- tion; (25) persons previously excluded from admission to the United States at a port of entry; (26) persons whose passage paid by another; (27) unaccompanied children; (28) natives of Asiatic barred zone; (29) illiterates; or (30) aliens ineligible to citizenship That I claim to be exempt from exclusion on account of the class or classes noted above, for the reasons following, to wit: Because I am not a member of any of the classes excluded above. That I claim to be a nonquota immigrant, as defined by section 4 of the Immigration Act of 1924, as amended, and the facts on which such claim is based are as follows, to wit: Bona fide student as contemplated by the provisions of Section 4(e) of the Immigration Act That I am aware that the Deportation Act of March 4, 1929, provides in part that an alien who enters the United States in an illegal man- ner, or who eludes examination or inspection by immigration officials, or who obtains entry to the United States by a willfully false or misleading representation or wilful concealment of a material fact shall be punishable by fine or imprisonment, or both; and that the Immigration Act of 1924 provides in part that a person who knowingly makes under oath any false statement in any application, affidavit, or other document requi red by the immigration laws or regulations issued thereunder shall be punishable by fine or imprisonment, or both. Available documents required by the Immigration Act of 1924, as amended, are filed herewith and made part hereof, as follows: Certificate of nonavailability of documents. SERVICE WHEREFORE, I apply for an Immigration Visa as a nonquota immigrant pursuant to the provisions of the Immigration Act of 1924, as amended. knowledge Lice (Signature of applicant) [SEAL] Subscribed and sworn to before me this 14th day of October Fee No. 961 AMERIC Fulton 1946 Freman Fee $1. Fulton Freeman Consul 1-1097 MINING OFFICE of the United States of America. FEE STATE ("
}