{
  "anumber": "A10430675",
  "id": "A10430675_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1958,
        1956,
        1934,
        1948,
        1955,
        1906,
        1947,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 4C-R079.7. IMMIGRATION AND NATURALIZATION SERVICE ALIEN REG RATION Mail or take to: (Show the exact spelling of your name as ears on your alien registration receipt IMMIGRATION AND NATURALIZATION SERVICE, card, and the number of your card. If you aid not register, so state.) 210 Hutton Bldg. Name Spokane 4, Wash. MAOLING LIU No. 10 430 675 APPLICATION TO FILE PETITION FOR NATURALIZATION I desire to file a petition for naturalization in the U.S. DISTRICT COURT Court at SPOKANE WASH (Name of court) MAOLING Liu (City) (State) 322 SUNSET DRIVE (Print or type your name) PULLMAN (Print or type apartment number. street address and if appropriate \"in care of' WHITMAN WASHINGTON (City) (County) (State) INSTRUCTIONS TO THE APPLICANT IMPORTANT.-Under the naturalization laws, citizenship may be revoked for concealment of a material fact or for willful misrepresentation in connection with the naturalization proceedings. It is important therefore that you fill out pages 1, 2, 3, and 4 of this form completely and as accurately as possible, using ink or a typewriter. If you do not have enough room to answer a question, continue your answer on another sheet of paper and show the number of the question you are continuing. PHOTOGRAPHS.-You must send with this application three identical photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 by 2 inches in size, and distance from top of head to point of chin should be approximately 11/4 inches, must not be pasted on a card or mounted in any other way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. DO NOT SIGN YOUR PHOTOGRAPHS. DATE OF YOUR ARRIVAL.-I you do not know the exact date of your arrival in the United States, or the name of the vessel or port, give the facts as you remember them. If the date of your arrival in the United States was on or before June 29, 1906, you should submit with this application documentary evidence of your residence in the United States prior to that date. Such documents may be family Bible entries, deeds of record, wills or other authentic legal documents, life insurance policies, bankbooks and records, employment records or other documents showing that you were in the United States on or before June 29, 1906. Do not submit such documents if your arrival in the United States was after June 29, 1906. ALIEN REGISTRATION RECEIPT CARD. DO NOT SEND your alien registration receipt card with this application. FINGERPRINT CARD. This application must be accompanied by a record of your fingerprints. Fingerprint cards, with instructions for recording your fingerprints, are available at any office of the Immigration and Naturalization Service. (1) In what places in the United States have you lived during the last 5 years? From- To- STREET ADDRESS CITY AND STATE (a) JUNE 1948 JULY 23 1956 630 LINCOLN ST. N.E. MPLS. 13, MINN (b) JULY 23 1956 AUG 8 1958 1326 aND ST BROOKINGS, So. DAK, (c) AUG 11 1958 JAN 7 1959 806 LINDEN ST. APT. A PULLMAN, WASH. (d) JAN 7 1959 PRESEN Z19 322 SUNSET DRIVE PULLMAN, WASH (e) 19 19 S 19 19 (g) 19 19 (h) 19 19 (i) 19 19 (j) 19 19 (2) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If necessary, use an additional sheet) FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) APR. 1947 JUNE 1956 UNIV. OF MINN MPLS., MINN TEACHER (b) JUNE 1956 AUG 1958 SOUTH DAK. STATE COLLEGE BROOKINGS, S.D. \" (c) SEPT 1958 PRESEN T19 WASH STATE COLLEGE PULLMAN WASH gy (d) 19. 19 (e) 19 19 (f) 19 19 (g) 19 19 (h) 19 19 (3) Have you been out of the United States since you first arrived? Yes or No If \"Yes\" fill in the following information for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You RETURNED UNITED STATES TO THE UNITED STATES Nov, 1934 FEB. 1. PRESIDENT LINEGEN. GORDON SAN FRANCISCO SEPT 8, 1955 SEPT.9, 55 ON A TRAIN (PRE-EXAM.) NOYES, MINN Form N-400 (Rev. 10-15-57)"
}