{
	"anumber": "A10430675",
	"id": "A10430675_0143",
	"page_index": 143,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0143/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration Visa, 6699834"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1946, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "412.8 669988 PORT OF American Consulate San Francisco, Calif. at Peiping, China I certify that the within-named immigrant masling Lin NONQUOTA IMMIGRATION VISA No. 16-1947 arrived in the United States at this port on the S. S. Date OCT 14 1946 GENERAL GORDON on 1-21-47 SEEN: The bearer, fadmitted and was inspected by me and duly (held for BSIS Maoling LIU who is of Chinese M.O. Ragneby (Citizen or subject) Immagration Officer. nationality, having been seen and examined, is classified as a nonquota immigrant under subdivision ( e ) of section 4 of the Immigration Act of 1924, as amended, and is granted this Immigration Visa pursuant to the provisions of said act. RECORD OF BSI The validity of this Immigration Visa expires on admitted The within-named immigrant was excluded and appeal FEB 14 1947 granted fulton freeman 1947 ao a sec 4(e) Fulton Freeman Date FEB1 OCT Consul of the studnet 2yr. Chairman BSI. United States of America. RECORD OF APPEAL Fco $9. Admitted Excluded FEE STAMP Fee No. 962 Date Immigrant identification card No. issued. (0019) Passport No. 356119 or other travel document y (Describe) Issued to Mao-ling LIU Issued by Office of the Commissioner Foreign Affairs for Peiping and Tientsin Date October 8, 1946 Valid until October 7, 1949 NOTE.-This Immigration Visa will not entitle the STATE person to whom issued to enter the United States if, upon arrival in the United States, he is found to be inadmissible to the United States under the Immigra- tion Laws. (Subdivision (g), sec. 2, Immigration Act of 1924.) GOVERNMENT PRINTING OFFICE 1-1097 NR LEALERTEA 13 6-30-47"
}
