{
  "anumber": "A10430675",
  "id": "A10430675_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service, Form 9-116A-St. Paul"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form 9-116A-St. Paul 2-28-49 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 1014 New Post Office Building Mr. Maoling Liu Saint Paul 1, Minnosota 630 Lincoln Street NE April 15, 1952 A-6 699 Minneapolis 13, Minnesota Doar Sir: Reforring to your entry into the United States as a Section 4(a) student, will you kindly answer the quostions listed below, sign your name and then roquest the Registrar of the school you are attending to certify that the informa- tion given by you is true and correct. A frankod addressed envelope is enclosed for your convenience in making reply. Very truly yours. Irvin F. Shrodo Officer in Charge 7-7 Bye J. of Porfetto Assistant Officer in Charge 1. Are you attending the UNIV. OF MINN (school)1 A. Yes 2. How many semester hours of work do you carry? A.4 credits & THESIS quarter 3. Is this a full course of study in day classos? A. Yes 4. Are you making passing grades in all of your subjects? A. Yes 5. Are you employed? A. Yes If you are employed, please givo full particulars on the reverse of this page. Date: APRIL 18 Mading Signature of Student Lin Noto: The Registrar will please add his comments in the space below, and mail to U. S. Immigration and Naturalization Servico, 1014 New Post Office Building, St. Paul 1, Minnosota R a Rogi you thur trar A-6 699 884 M.L.Davis Data: April 22, 1952 Margaret L. Davis Assistant to the Dean Encl. Graduate School University of Minnesota fight SEE INSTRUCTIONS ON THE REVERSE HEREOF"
}