{
  "anumber": "A10430675",
  "id": "A10430675_0067",
  "page_index": 67,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0067/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Form,, 10-53706-2"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1951,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "{ have been 13. I have not been employed or engaged in business in the United States since admission. State nature of employment or business INSTRUCTOR, DEPARTMENT OF ELECTRICAL ENGINEERING UNIV. OF MINN., MPLS., MINN My employment or business (Name of employer) (Address) began FEB 15 1947 My monthly earnings are (or were) $79-330 (Month) (Day) (Year) My employment or business ceased (Month) (Day) (Year) (or PLEASE BE SURE TO SIGN AND SWEAR TO APPLICATION AND TO OBTAIN CERTIFICATION FROM OFFICER OF SCHOOL 14. The sources and amount of my support (other than above furnished) are 15. I desire to secure an extension of to my present temporary period of admission (Months) (Years) fpe to continue my studies at UNIV. OF MINN MPLS., MINN (Name of approved school) (Post-office address) Additional reasons To SUPPORT MY WIFE AND CHILDREN (THE ABOVE STATEMENTS MAY BE SWORN TO BEFORE ANY OFFICER IN THE STATE AUTHORIZED TO ADMINISTER OATHS. ANY IMMIGRA- TION OR NATURALIZATION OFFICER WILL ADMINISTER THE OATH WITHOUT COST) poudnocs STATE OF Minnesota Insuling (Signature of Lin alien) COUNTY OF Ramary SS: (greep unsuper.) Subscribed and sworn to before me this, the PP sans retch 23 day January of possur) (agres) 1951 [SEAL] (grape) My commission expires (Official title) THE FOLLOWING CERTIFICATION IS TO BE OBTAINED BY THE APPLICANT FROM AN OFFICER OF THE SCHOOL I, Margaret L. Davis , hereby certify that I am Assistant to the Dean, (Name) (Title) of the Graduate School, University of Minnesota and that the information furnished (Name of school) in item 12 of the within application is true and correct, and that the information furnished in item 13 hereof is true and correct to the best of my knowledge, information, and belief. January 19, 1951 (Date) Managarit (Signature of officer R. of school) Davis U. S. GOVERNMENT PRINTING OFFICE 16-53706-2"
}