{
	"anumber": "A10430675",
	"id": "A10430675_0120",
	"page_index": 120,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0120/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF HEARING before a BOARD of SPECIAL INQUIRY, Form I-111"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1946, 1947, 1934]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form I-111 U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (Rev. 9-15-44) RECORD OF HEARING NAMES OF ALIENS before a BOARD OF SPECIAL INQUIRY held at LIU, Maoling or Appraisers Building San Francisco, California MAO, Ling Liu Date: February 1, 1947 10:00 a.m. PRESENT: Insp. Harlin Hargreaves, Chairman H. H. Carson, Member Secretary Cornelia A. Whiteley, Member Int. None 16-21872-2 B.S.I. No. 1300-47068 Arrived (date and manner): January 21, 1947 SS \"General W. H. Gordon\" Held by: Insp. Rogneby Cause: Potential Immigrant Manifest data: Name Liu Maoling, age 42, male, married, occupation Engineer, reads and writes the English language, Nationality, China; Race Chinese; place of birth Shantung, China, Immigration Visa, etc., NQIV 16 4fe) issued at Peiping, 10/14/46; last permanent residence, Peiping, China; nearest relative in country whence alien came, Aunt: Lee Lan Chich, 32 Chia Yun Fang, Sinza Rd., Shanghai, China; final destination Minneapolis, Minnesota; passage paid by self; in possession of over $50.00,; was in U. S. before for 71/20 years at Minneapolis, Minnesota, depart- ed 1934; going to wife, Madling Liu, Waubay, So. Dakota; intends to return to country from whence he came; intends to remain 3 yrs; does not intend to become a citizen of the Documents presentedex U. S.; never in prison, almshouse or institution for the care and treatment, of the insane, or supported by charity; not a polygamist nor anar- chist; condition of health good, not deformed or crippled, height 5'8\"; complexion yellow; black hair; brown eyes, marks of identification freckles. Documents presented: Chinese passport issued October 8, 1946 at Peiping, China, by the office of the Commissioner of Foreign Affairs, valid to October 7, 1949 No. 356119 valid to travel to the United States of America and all the necessary countries en route; contains good photographic likeness of the applicant and is stamped to show the nonquota visa mentioned heretofore which was issued by American Consul at Peiping, China, October 14, 1946. -1-"
}
