{
	"anumber": "A10430675",
	"id": "A10430675_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service Application"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1924, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "4 (13) My father's full name is/was SSU-WEN Liu (14) My mother's maiden name was MEI-CHEN Ting (15) My last place of foreign residence was PEIPIN (City) G CHINA (Country) (16) I migrated to the United States from the port of (City) (Country) (Answer questions 17, 18, 19, only if you arrived in the United States before July 1, 1924.) (17) The person in the United States to whom I was coming was (18) The place in the United States to which I was going was (19) The names of some of the passengers or other persons I traveled with, including members of my own family and their relationship to me, if any, are Masling fin Date: FEB. 12, 1959 322 SUNSET DRIVE (Signature of applicant) PULLMAN, WASH (Address at which applicant receives mail) TO APPLICANT: DO NOT FILL IN BLANKS BELOW THIS LINE NOTE CAREFULLY -This application must be sworn to before an officer of the Immigration and Naturalization Service at the time you appear before such officer for examination on this application. I, washing Lim AFFIDAVIT , do swear (affirm) that I know the contents of this application comprising pages 1 to 4, inclusive, and the supplements thereto, Forms No. , subscribed to by me; that the same are true to the best of my knowledge and belief; that corrections numbered ) to were made by me or at my request; and that this application was signed by me with my full, true, and correct name. Mashing Line ) (Complete and true signature of applicant Subscribed and sworn to (affirmed) before me by the above-mentioned applicant at the preliminary interrogation (examination) at spokand wash this 3rd day of march , 1959 I certify that before verification the above applicant stated in my presence that he had (heard) read the foregoing application and understood the contents thereof. Manhin narx (Title of officer) For use in searching Records of Arrival RECORDS EXAMINED RECORDS FOUND Card index Place Index books Name Manifests in Date you Manner Marital status (Signature of person making search) For sale by the Superintendent of Documents, U. S. Government Printing Office Washington 25, D. C. U. S. GOVERNMENT PRINTING OFFICE 1957-O-446078"
}
