{
	"anumber": "A10430675",
	"id": "A10430675_0073",
	"page_index": 73,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0073/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service Form G-59, Form G-59"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1951, 1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form G-59 (7-15-46) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE km 3/6 File No. AG 699 884 ST. PAUL MINN Date (Address of requesting office) Januery 23, 1951. DIRECTOR, FEDERAL BUREAU OF INVESTIGATION, DEPARTMENT OF JUSTICE, Washington 25, D. C. Attention: Security Division Please furnish a report as to the nature of any derogatory information contained in any file-other than fingerprint records-which your Bureau may have concerning the following person: Name LIU MAO LING (Surname) (Given name) (Middle and other names) Aliases none Alien Registration No. FBI No. or Visa Application No. 16-1947 Date of birth April 13, 1904 Birthplace Shoulzungghsion, Shantung Crim. (Month) (Day) (Year) (Town) (Country) Marital status married Name of spouse Thelma Bosland Liu Race Chinese Color yellow Sex male Occupation student Complexion fair Eyes brown Hair black Height 5'8\" Weight 157 Visible marks none Places of residence last 5 years (include street and number) : Methodist Mission, Peking, China; Dormitory of No. China Power Co., Peking, China 1946 27 Oak St., Hinneapolis; P 71 Univ. Village, Minnoapolis; 5052 Cedar Ave., Mpls, 630 Lincoln St. N.E., Minneapolis, Minn. Places of employment last 5 years: No Investigation conducted by FBI North China Power co., Peking, China, Pritin Univ. of Minn. Minneapolis, Minn. BILISI 1016 for an Under deportation proceedings. consider. The subject is An applicant for naturalization. An applicant for a certificate of lawful entry. Applicant for extension of stay 1010 RECEIVED MAR as 9 1951 SERVICE to E 12 be ST. If the subject has a common name, the names of all relatives given in the subject's application filed with the Immigration and Naturalization Service will be shown on the back of this form, with the relation- ship indicated. Please mail the attached copy of this request with your reply to the address shown below. (Name of officer requesting report) OFFICER DEFCHARGEN CHARGE (In duplicate) (Title) MINN. (For use by Federal Bureau of Investigation) Mailto DISTRICT DIRECTOR, NEW POST OFFICE BUILDING IMMIGRATION AND NATURALIZATION SERVICE. 7, ILLINOIS"
}
