{
	"anumber": "A10430675",
	"id": "A10430675_0126",
	"page_index": 126,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0126/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Passport Interview Transcript, 1300-47068"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1943, 1908, 1937, 1940, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1908. Passport also contains the names of two minor children, Chelcie Bosland and Elaine May Liu. There is also a good photographic likeness of the witness with her two children. Contains a stamp showing admitted port of San Francisco, 7/18/46. Passport returned. Q How long have you resided in the United States? A I resided here from the time of my birth up until the time I went to China in 1936. Q When and where were you XUXMY Married? A at Peiping, China, Yen Ching University, January 22, 1937. Q Have you ever been married before? A No. Q Do you have any children? A I have two children, a son Chelcie Bosland Liu, born December 30, 1940 and a daughter, Elaine May Liu, born November 19, 1943. Q Did you know your husband prior to the time you went to China? A Yes. Q Do you have a home in the United States at the present time? A I live with my parents in Waubay, South Dakota. Q How long do you expect your husband to remain in the United States? A The rest of this school year and the next school year at least. Q Will you return to China with your husband at the end of the school? A I will. Q Do you know if your husband has any intention to remain in the United States permanently? A I am sure he does not have. Q Has your husband ever spoken to you in regard to becoming an American citizen? A We have talked about it. Q Do you know if it is his desire to become a citizen of the United States? A He has never definitely stated that he wished to become an American citizen although we both realize that if he were one it would make things easier for all of us. Q Do you believe it is his intention to remain in the United States and attempt to obtain American citizenship? A I don't believe so. Not as far as I know. Q Are you ready and willing to return to China with him at the expiration of his schooling in the United States? A I am. 2/1/47 -7- 1300-47068"
}
