{
	"anumber": "A10430675",
	"id": "A10430675_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR PREEXAMINATION, A 6 699 884"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1908, 1937, 1934, 1948, 1947, 1952, 1955, 1904, 1927]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form I-63 UNITED STATES DEPARTMENT OF JUST Immigration and Naturalization Service A 6 699 884 (5-11-55) APPLICATION FOR PREEXAMINATION Take or mail to IMMIGRATION AND NATURALIZATION SERVICE (Read carefully and follow instructions on reverse hereof) 1. I, MAOLING Liu , an alien, hereby apply for preexamination. 2. My application for immigration visa will be submitted to the United States Consul at Canada. I will be able to obtain prompt issuance of a visa. Winnery man 3. I intend port of 4. My name given at was to enter Mayie Canada at the port minnayes of O. Liu mum and to reenter the United States at the birth MAOLING 5. I have been known by the following additional names -CHINA 6. I was born at SHOU-KUANG-HSLEN, SHANTUNG, on APRIL 13, 1904 My nationality is CHINESE 7. My sex is MALE My personal description is as follows: Height 5'8\" Complexion dark Color of eyes BROWN Color of hair BLACK 8. I now reside at 630 LINCOLN ST., N.E MINNEAPOLIS MINN 9. My occupation is TEACHER 10. My father's name is SZE-WEN Liv He was born in SHANTUNG, CHINA He is a citizen of CHINA 11. My mother's name is MEI-CHEN TENG LIU She was born in SHANTUNG CHINA She is a citizen of CHINA 12. I first entered the United States under the name of MAOLING LIU , , on AUG 1927 at the port of SAN FRANCISCO by means of 5.5 LINCOLN (date) (name of vessel or other I WAS inspected and admitted by an immigration officer. Since conveyance) (was or was not) the entry mentioned above I HAVE been absent from the United States. (If absent furnish below the port and (have or have not) date covering each departure from and return to the United States) LEFT U.S. Nov. 1934 SEATTLE WASHINGTON RETURN TO U.S. FEB 1947 SANFRANCISCO, CALIFORNIA 13. During the past five years I have lived at the following addresses: Street or Number City of Town State From To Month Year Month Year 630 LINCOLN SINE MPLS 13, MINN. MAY 1948 PRESENT 14. During the past five years I have been employed by the following named persons or firms: (If self-employed, give na- ture of business) Name of Employer Type of Work From To Month Year Month Year UNIV. OF MINNESOTA TEACHING FEB. 1947 PRESENT GENERAL MILLS, INC SCIENTIST SUMMERS, 1952-1955 15. I AM married. The name of my wife or husband is THELMA JUNE BOSLAND (am) (am not) We were married on JAN. 22, 1937 at PEIPING, CHINA . My wife or husband was born at WAVBAY, SOUTH DAKOJA on JUNE 13, 1908 and is now a citizen of THE UNITED STATES (name of country) 16. I DID (did) (did not) register under the Alien Registration Act of 1940 or Section 262 of the Immigration and Nationality Act. My Alien Registration Number is 16699884"
}
