{
  "anumber": "A10534184",
  "id": "A10534184_0104",
  "page_index": 104,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0104/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE DURANGO, Vale Cuatro Peso(s)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Cutura SECURITY STATE Vida ESTADO DE DURANGO Registro Cwil El Secretario General de Gobierno, El Gobernador Constitucional, REGISTRO DEL DE ESTIMATE 1day LIMITED Lic. Guillermo Sariñana Natera. Lic. Enrique Torres Sanchez. ISNACIO En nombre de la Republica de Mexico y como Juez dei Estado Civil de este lugar hago saber a los que la presente vieren y certifica ser cierto que en el libro C2s. DOS, del Ree. gistra Civil que et a me cargo a faja (9) FRENTE y VUELTA. se encuentra asentada un acta del tenor siguiente: AL MARGEN. (62) Acta numero secenta y dos, referente al matrimonto de Vocente de la Hoya y Maria Gua- dalupe Salas, AL CENTRO. En Villa Igmacio Ramirez Municipio de Gudadlupe Victoria Estado de Durango, siendo las (23) veintitres horas del dia (6) seis de notiembre de (1936) mil novecientos treinta tseis, ante mi Elias Herrera, encargado del Re-- gistro del Estado civil de este lugar y en la casa particular del ciuradano Fe-- lipe Salas comparecieron con el objeto de celebrar su matrimonio el ciudadadno Vicente de la Hoya y la Señorita Guadalupe Salas. El primero dijo: ser natural y- vecino de este lugar de (25) veinticinco años de edad, jornalero católico de nam cionalidade mexicana hije legitimo del ciudadano Enrique de la Hoya y de ba fi- nada Conztansa Sanchez lla Señorita Guadalupe Salas dijo: ser natural y vecina - de este lugar de (19) diez y nueve años de edad, celibe católica ocupada en que- haceres de su casa de nacionalida mexicana, hija begitima del ciudadano Felipe- Salas y de la señora Juana Morales con domicilio en este lugar, ambos contaa-="
}