{
	"anumber": "A10551867",
	"id": "A10551867_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10551867_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Alien Registration, 1-1190446"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "MMNONANT VISA 1st 1190496 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul at CIUDAD JIIAREZ CHIHUAHUA MEXICO : 1. Family name Given name Initial 2. Place and date of birth Age GARCIA Juliana de Leon Vda. de Hda. de Cedros -Jan. 27, 1915 41 3. Other names by which I have been known 4. Last permanent residence A Serdan 1552 Cd. uarez, Juliana de Leon Delgadillo 5. Address in the United States 6. Name and address of person to whom destined, if any 5120 Timberwolf Paso, Tex. employer- William Woodrow Kearney-add as 5 7. Name and address of nearest relative in home country 8. Travel documents presented Mex. p. daughter-Marts Garcia -add as 4 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status MIS \"hite M Married Single brn. brn. 123 14. Complexion 16. Ethnic Classification 5. ft. 7 in. lbs. Med. Mex. F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written domestic duties none Spanish 22. Intended United States port of entry 23. Final destination 24. I have (a) (no) 25. Purpose of going to the United States 41 Faso, Tex. see item 5 through ticket to destination no reside-work 26. Places of previous residence Torreon, Coah. Ca. Juarez, Chih. 27. Names and places of residence of spouse and minor children child Marta Garcia-add as 4 28. Name and address of father 29. Name and address of mother deceased-Anastacio de Leon deceased-Ester Delgadillo 30. I claim to be a nonquota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: Med. Certf. Birth \" husband's death Certf. Police Certf. Born in Mexico aff. of support 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: I have never been arrested Nunca he sido arrestado 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: Probably VR in 1950 16-67444 2 (Application continued on revere side)"
}
