{
	"anumber": "A10534184",
	"id": "A10534184_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0037/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['labor', ' watch men']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "MEXICANA"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice FORM G-325A OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION Approval expires 4-30-85 (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY / FILE NUMBER De IA HOYA Vicente SANches FEMALE 5-12-12 MEXICANA 410-534-184 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH DuraNGO MEXICO SOCIAL SECURITY NO. (If any) 457-40-4959 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE. FATHER De IA HOYA ENrique Durango MEXICO (D) MOTHER (Maiden name) SANChe's CONSTANZA Durango MEXICO ( D ) HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE DelA HOYA Torres DoLores 3-15-40 NAYATIT MEX Lurs-B.S 10-26-72 SONOTA FORMER HUSBANDS OR WIVES(if none,s state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE SALAS Guadelupe 12-8-20 Duranco MEX 7-15-60 APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR ChihuahuA #139 MEXICAL B- CALIF MEXICO 3 65 PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR E. and L. AVILA Trucking LAbor 6 83 PRESENT TIME Browley CAL. watch MEN 8-15 85 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT OTHER (SPECIFY): Vicente dela Hogas 3-31-88 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) De LA HOYA ViceNTe SANChes A10-534-184 OFFICE: SND N-400 Form G-325 A (Rev. 10-1-82) DATE: (1) IDENT. MAY 03 1988"
}
