{
	"anumber": "A10551867",
	"id": "A10551867_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10551867_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ESTA SOLIBRE Y SOBERANO DE ZACATECAS, VALOR UN PESO"
		},
		"years": {
			"ms_years_nlp_v1": [1915, 1887]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "EST LIBRE UNIDOS DE VALOR DEPARTMENT VALOR UN PESO UN PESO PAPEL ESPECIAL PARA CERTIFICADOS DE LAS ACTAS DEL REGISTRO CIVIL DE Ano de milnovecientos CINQUENTS SECURITY REBILLE Y D 0 S. En nombre de la Republica de Mexicoy como Inoz del Estado civil decete lugar hago saber alos que la presente vieren,y certifico ser cierto, queenel libro DEL número 1. del registro civil que es amicargoala DO Rr. foja 67 frente.- Original Nacimientos año de 1915.- o se encuentra asentada una Reta del tenor siguiente. AL MARGEN.- 114.-Acta Numero ciento catorce - EAC Nacimi ento de Juliana de Leon.-Natural.- AL CENTRO.- En la Ciudad de Mazapil, a los 8 ocho dias del mes - de Marzo de 1,915 mil novecientosqquince se recibió- en este Juzgado el acta que sigue: En la Hacienda de Cedros a las 3 tres de la mañana del dia 19 diecinue ve de Febrero de 1,915 mil novecientos quince ante - m1, Urbano Ribera, Agente del Registro civil en esta 1887-18 Demarcacion, compareció el Ciudadano Anastasio de -- Leon, soltero jornalero de 29 veintinueve años de -- edad y vecino de este lugar y presents una niña viva nacida en su domicilio a las 11 once de la mañana -- del dia 27 veintisiete del pasado a quien puso por - nombre \"JULIANA Dil LEON\": hija natural del exponente y de su esposa Esther Delgadillo, cuyo nombre se ha- ce constar en esta acta por haberlo solicitado de -- conformid d con 10 dispuesto del articulo 75 setenta y cinco del Codigo Civil.. Presents por testigos de- este acto a los Ciudadanos Refugio Bustamante y Albi no Flores casados mayores de edad y de esta vecindad. Leida la presente acta al compareciente y testigos,- fueron conformes y firms el que supo hacerlo.-Urbano Rivera.- A. de Leon.- RUBRICAS.- P. Pinales.-RUBRICA Es copia fielmente sacada de su original, que se expide a solicitud de la señora Juliana de Leon, para los usos legales que a sus intereses convengan, a los a la vuel ta"
}
