{
  "anumber": "A10534184",
  "id": "A10534184_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0054/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 4/25/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1955,
        1948
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "19. The persons in whose behalf such info ion is requested are as follows: Full name Rolationship FOIA (b)(6) FOIA (b)(6) Place of birth Date of birth FOIA (b)(6) FOIA (b)(6) Present address FOIA (b)(6) Full name Relationship Vicente de la Hoya Salas. Son. Place of birth Date of birth Villa Ignacio Ramirez, Durango, Mexico. July 24,th 1948. Present address Ignacio Ramirez, Durango Mexico. Calle Hidalgo # 22. Full name Relationship Place of birth Date of birth Present address Full name Relationship Place of birth Date of birth Present address Full signature of applicant as now used Viecrile de la ntoya INSTRUCTIONS TO THE APPLICANT Application should be executed and SIGNED in duplicate and submitted to the Immigration and Naturaliza- tion office shown on the reverse hereof. A fee of three dollars ($3) must accompany the application. Remittances should be made payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" Do not send coins or postage stamps. A postal, express, or bank money order or equivalent is preferred. Show your Alien Registration Number in the block in the upper right-hand corner on the reverse hereof. [NOT TO BE FILLED OUT BY APPLICANT] Immigration and Naturalization Service at Calexico, California Date 2-2-68 Considered, and the Secretary of State is hereby respectfully informed that entry has been verified as follows: Vicente DE LA HOYA-Sanchez Name E1 Paso, Texas Port of entry August 18, 1955 Date Manner of arrival El Paso City Lines, Inc. Was lawfully admitted for permanent residence. REMARKS: (Show \"Symbol\" or \"Section\" of admission for entries after 6-30-24). Admitted 0-1 Verification 3 yuite Clerk ta"
}