{
	"anumber": "A10517306",
	"id": "A10517306_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1970, 2023, 1967, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 Form approved. Budget Bureau No. 43-R079.9 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registra- tion receipt card, and the number of your card. If you did not register, so state.) Mail or take to: Name TAK CHEONG LEE IMMIGRATION AND NATURALIZATION SERVICE No. A-10-517-306 APPLICATION TO FILE PETITION FOR NATURALIZATION WEDNESDAY SEP 9 1970 (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) 9A I desire to file a petition for naturalization in the- Date: USDC SUPERIOR Poword Court at 19476 (Name of Court) (City) (State) My name is: TAK CHEONG LEE (Print or type here your present full name only) I live at: 10- C CASTLE COURT CASTLE SQUARE (Print or type present apartment number, street address, and if appropriate 'in care of BOSTON SUFFOLK MASS. 02118 (City) (County) (State) (ZIP Code) Other names I have used are: Pre (Print Yin here B hivey See Mood N.2 or type any other name you have ever used, including maiden name) My present occupation is cook Sex: Male Female (1a) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No (1b) Can you read and write English? Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? Yes No (2) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM: To- STREET ADDRESS CITY AND STATE (a) JANUARY , 1967 PRESENT TIME 10-C CASTLE COURT BOSTON MASS (b) DEC 30. 19 62 JANUARY 1967 83 TYLER STREET BOSTON, MASS (e) , 19 19 (d) 19 19 (e) 19 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM To EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) JANUARY 1965 PRESENT TIME CATHAY GARDEN INC. 325 FIRST ST. Cook (b) , 19 , 19 LOWELL MASS (c) 19 19 (d) 19 19 (4) Have you been out of the United States since you first arrived? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES 7-11-1959 7-6-1960 NORTHWEAST HIRLINES ANCHORAGE, ALASKA Nave- (5) How many times have you been married? ONE How many times has your husband or wife been married? ONE If either of you has been married more than once, fill in the following information for each previous marriage. Check one) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX How MARRIAGE PERSON MARRIED WAS CITIZEN ENDED ALIEN (a) (b) (c) (d) Form N-400 (Rev. 10-15-69) (1) (OVER)"
}
