{
	"anumber": "A10517306",
	"id": "A10517306_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS"
		},
		"years": {
			"ms_years_nlp_v1": [1953, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 PAGE 4 INSTRUCTIONS This form should be prepared in quadruplicate. Wherever questions are asked in the alter- native, the applicable answer should be checked. The original and two signed copies of the assurance should be submitted to the Director, Visa Office, Department of State, Washington 25, D. C. The fourth copy may be retained by the person executing the assurance. In addition, the following evidence is to be submitted: 1. If the assurer is employed, a statement in single copy by his employer, preferably on his business stationary, showing date and nature of employment, salary paid, whether position is temporary, indefinite or permanent. If assurer is self-employed, certified copy of last income tax return filed or report of commercial rating concern in single copy. 2. A statement in single copy from an officer of the bank, or other financial institution in which the assurer has deposits, stating the date account was opened, total of amount deposited for past year and present balance. 3. A statement in single copy from a state or local public agency verifying the avail- ability of housing, or, in the absence of such agency, a statement from a recognized voluntary agency, or letters from at least three disinterested citizens in the com- munity in which housing is to be provided concerning the availability of such housing. 4. Finding and recommendation in duplicate from the local office of the State Employment Service serving the area of proposed employment concerning the authenticity and bona fides of the employment assurance. Section 14 (c) of the Refugee Relief Act of 1953 provides that any person who knowingly violates any provision of this Act is guilty of a felony and may be fined not more than $10,000 or may be imprisoned not more than ten years, or both. *U. S. GOVERNMENT PRINTING OFFICE: 1953 o - 282468"
}
