{
  "anumber": "A10534406",
  "id": "A10534406_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534406_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "hombre"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form 1-90 ( (Spanish) ( (Rev. 9-27-75)N, FORM 1-90 ( (Spanish) ( (Rev. 9-27-75)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS Form approved SERVICIO DE INMIGRACION Y NATURALIZACIÓN OMB No. 43-R0040 Applicant: Do Not Fill In This Block Nationality FILE NO. SOLICITUD POR UN EXTRANJERO CON Code RESIDENCIA LEGAL PERMANENTE PARA Fee Required Fee Not Required OBTENER UNA TARJETA DE REGISTRO DE Fee Stamp EXTRANJEROS - TARJETA I-151 (Tenga la bondad de leer las instrucciones adjuntas) 1. Por la presente solicito una Tarjeta de Registro de Extranjeros (Alien Registration Receipt Card) debido a las razones que expongo a continuación (marque la casilla apropiada): (a) Mi tarjeta de registro de extranjeros se ha extraviado, ha sido destruida el (FECHA) o aproximadamente en esa fecha, bajo las siguientes circunstancias: NO RECORD LOS (SI RECOBRO MI DOCUMENTO, SE LO ENTREGARÉ AL SERVICIO DE INMIGRACIÓN Y NATURALIZACIÓN) Files #3C7 (b) Mi nombre ha cambiado. (c) Mi tarjeta I-151 está dañada. (d) Mi prueba de registro de extranjero está en (e) Nunca recibí la tarjeta I.151. Index forma distinta a la Tarjeta I-151. (g) La Sección 262 (b) de lep miaración y (f) Mi actual tarjeta I-151 se encuentra en mal Naturalización exige que se me insent y tomen estado debido a una laminación defectuosa. las huellas dactilares despues de cumplir los 14 (h) Recibí una tarjeta I-151 incorrecta. años de edad. (i) Soy un extranjero que viaja constantemente, entrando y saliendo de los EE.UU., y tomaré residencia permanente en lós EE.UU. Adjunta a los presentes, entrego mi tarjeta de viaje \"Form I-151\". (Si marcó una de las casillas (a), (b), (c) ó (e) que anteceden vea la Instrucción número 7, sobre el pago del derecho requerido) 2. Nombre y Apellido (en mayusculas) Nombres Segundo nombre 4. Nacionalidad apellido MALDONADO RUBEN MALDONADO MEXICANA 3. Dirección postal Numero y calle (Apr. No.) en los Estados 2119 SHERIDAN ST. 5. Núm. del Registro de 6. Sexo Unidos Ciudad Extranjeros Varón Hembra Estado Número ZIP LOS ANGELES CALIFORNIA 90033 110 534 406 7. Admitido a los EE.UU. (Ciudad) (Estado) 8. Fecha de admision (Mes) (Dia) (Año) 9. Fecha de nacimiento (Mes Dia - Año) EV PASO TEXAS (08-24-55) 12-31-14 10. Forma de transporte (Nombre del buque, 11. Destino en los EE.UU. cuando fue admitido 12. Lugar de nacimiento (Ciudad) (Provincia o Estado) linea, aérea, número de vuelo, etc.) (Pais) REDESTRIAN EL PASO , TEXAS VALLE DE ALLENDE, CHIH., MEXICO 13. Nombre que usó cuando se inscribió como extranjero (Si es el mismo que tiene ahora, 14. Nombre que usó cuando fue admitido legalmente como residente permanente (Si es el escriba ''same'') mismo que tiene ahora, escriba \"same\") SAME SAME 15. Dirección fuera de los EE.UU. si reside temporalmente en el extranjero (Calle, Ciudad, País) 16. Fecha de la última salida de los EE.UU. NON G-360 SENT 23 AUG 1977 NONE 5/17/98 17. Fechas durante las que permaneció ausente de los EE.UU. por un ano 0 más, desde que fue admitido legalmente como residente permanente NONE 18. (Si usted tiene la intención de usar la Tarjeta I-151 como documento de viaje en las próximas seis semanas, indique la fecha en que tiene intención de salir del país, el nombre de cada país que piensa visitar y este seguro de leer la Instrucción 8 en cuanto a las limitaciones del uso de la Tarjeta I-151 para viajar a ciertos países o a través de ellos.) a. Fecha en la que se propone salir del país b. Países que va a visitar HAVO 12 , 1977 CD. JUAREZ, CHIHUAHUA. MEXICO 19 Firma de la persona que ha preparado el formulario, si no es el solicitante mismo. 20. Firma del solicitante. DECLARO que prepare esta solicitud a petición del solicitante y que todo lo CERTIFICO que la información anterior es correcta y cierta a mi real saber y indicado se basa en toda la información que se me proporcionó al respecto. entender. Prinn Maldanady (FIRMA) (FIRMA) 2810 E. FOLSOM ABRIL 25, 1977 ABRIL 25, 1977 (DIRECCION) L.A. CALIF. (FECHA DE LA FIRMA) (FECHA DE LA FIRMA) RECEIVED TRANS. IN RET'D-TRANS OUT COMPLETED FORM 1-90 (Spanish) (Rev. 9-27-75) HP"
}