{
  "anumber": "A10534406",
  "id": "A10534406_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534406_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATE OF TEXAS, COUNTY OF EL PASO"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "* STATE OF TEXAS * * COUNTY OF EL PASO * BEFORE ME, the undersigned authority, on this date personally appeared Mr. and Mrs. Amadeo Elizalde who after being duly sworb upon their oath, depose and say; That, they are both citizens of Mexico, and legal residents of the United States of America, 43 and 42 years of age, residing at 1416 2nd, St. apt. 16, ET Paso, Texas, that Mr. Elizalde is employed by Ramon Montes and erans $60.00 per week. That Mrs. Elizalde by the Leo's Finer Foods and earns $29.00 per week. That Mr. Elizalde is a plastere and Mrs. Elizalde is emplo- yed as a server.That, they have only one dependent; Mrs. Elizalde's mother. That, have on daugther Miss Mericia Maldonado a citizen of Mexico, and also a legal resident of this country, that their daugther is employed by Mrs. Ruby Sims, her earnings being $15.00 per week. That, their total income per week is around $104.00 per week. They further pray the Honorable American Consul in Cd. Juarez Mex. will permit their brother Mr. Ruben Maldonado and wife Lydia Yabarra Maldonado and their children Leticia Maldonado and Guadalupe Maldonado, all citizens of Mexico, entry into the United States of America, so that, they can come and join them legally in this country. They also state, that in the event that their brother Mr. Ruben Mal- donado and family are permitted to legally enter this country to join them , they will at all times see that they never become a public charge to any agency of the United States of America. Affiants further deposes not. amadeo Elizable AMADEO ELIZALDE Jesus an. Elizalae JESUS M. ELIZALDE Mexicia Maldonado MARICIA MALDONADO SUBSCRIBED AND SWORN, to before me, this the 14th. day of March, 1955, by Mr. and Mrs. Amadeo Elizalde. NOTARY State of PUBLIC, Texas, in County and for of the KL Paso."
}