{
	"anumber": "A10534184",
	"id": "A10534184_0077",
	"page_index": 77,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0077/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Vicente de la Hoya-Sanchez, G166-B (1- 1-54)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 1956, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DE LA HOYA-Sanchez, Vicente A10 534 184 Los Angeles, California August 27, 1956 Byron A. Stein, Investigator, Acting Spanish interpreter VICENTE DE LA HOYA-Sanchez Wy Correct name is VICENTE DE LA HOTA-Sanchez. I am a citizen and subject of Mexico. I immigrated to the United States at E1 Paso, Texas on August 18, 1955 and I have shown you my passport. (Reference is to Form I-1519 Before August 18, 1955 I had been in the United States under contract three times, the first time at Harlingen, Texas, the other two times at E1 Centro, California. I returned to Mexico each time when my contract was terminated. I departed from the United States at the end of my last contract November 18, 1952 at Calexico, California. I remained in Mexico, working in Cd. Juarez and going to visit my family in Villa Ignacio Ramirez, Dgo., Mexico until I immigrated in 1955. In about June, 1955 I went to the American Consulate in Cd. Juarez to find out what documents were necessary to immigrate to the United States and to get the application. I was told to get a copy of my birth certificate, a Mexican passport, Police letters of good conduct from Cd. Juarez and Villa Ignacio Ramirez, an X-ray and an employment let or from the United States. I myself secured all but the last letter listed and filled out my application. I then went to the office of CEFERINO ANCHANDO because his office was near the Consulate in Cd. Juares for the purpose of having him write to my former employer in California for an employment letter. I went to him because I could not write in English. He told me that he could arrange employment for me in E1 Paso and because that was closer to my family in Mexico, I accepted. I paid him 400 Pesos, 200 when I first went to him and about a month later 200 when I received the letter. I did not know the man who signed the letter. I took all of the documents to the Consul, paid for the visa and entered the United States. I returned then to the office of Caferino Anchondo to learn the address of my employer and he told me that there would be no work until September and that picking cotton. I returned to the United States and looked for work near El Paso and could not find any and then I went to Bakersfield, California where I found work in the country. Since then I have worked in various places in California, Nevada and New Mexico. I now work as a mechanic for the L. A. MOTORS, 1011 E. 7th Street, Los Angeles, California. I have worked there about two months. I now live at 639 Stanford St., Los Angeles. I have lived there since I came to Los Angeles June 4. 1956. I do not remember the name of the employer who signed the letter in my visa and I never met him. I did not know that the letter given me by Ceferino Anehando was fraudulent. The foregoing has been read to me in Spanish and, is true and correct. Veseuh Subscribed to before me at Los Angeles, California, August 27, 1956 Bastern EXHIBIT \"A\" Los Angeles, Cal., Aux report, 8/28/56 El Paso, Texas - file A10 534 184"
}
