{
	"anumber": "A10534184",
	"id": "A10534184_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Request That Applicant For Naturalization Appear For Interview"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice D02. Request That Applicant For Naturalization Immigration and Naturalization Service Appear For Inter 880 Front Street OMB NO. 1115-0064 San Diego, California 92188 Approval Expires 4-85 Alien Registration No. A10 534 184 N400 A10534184 Petition No. Vicente Sanchez DELA HOYA Avenue Chihuahua #139 Mexicali Baja, CA 92248 Date MAY 11 1988 ABSOLUTELY NO PERSONAL CHECKS CAN BE ACCEPTED BY THE CLERK OF THE COURT ! CASH OR MONEY ORDER ONLY EXACT AMOUNT ONLY Your application has been received and arrangements have been made to help you in the next step toward naturalization. Please come to: on/date) County Clerk's Office, Imperial County JUN 16 1988 Courthouse, El Centro, California at (time) 9:45 am The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. If you are applying for citizenship for yourself, you will be tested on your knowledge of the government of the United States and its history. You will also be tested on reading, writing, and speaking English, unless on the day of your appoint- ment, you have been living in the United States for a total of at least 20 years as a lawful permanent resident and are over 50 years old, or unless you are physically unable to read, write, or speak. YOU MUST BRING WITH YOU: 1. This letter SI usted no entiende el Idioma Ingles. 2. $50 filing fee (cash or a money order made payable to \"Clerk of Court\") 3. Alien Registration Receipt Card favor de traer un interprete 4. Any draft cards 5. Your passports and/or any other documents you have which you used in connection with any entries in the United States 6. The Personal Description Form on the back, completely filled in 7. Those items checked on the back side of this letter PLEASE KEEP THIS APPOINTMENT EVEN IF YOU DO NOT HAVE ALL THE ITEMS NUMBERED ABOVE OR THOSE CHECKED BELOW AND ON THE BACK. HOWEVER, YOU MUST BRING THE $50 FILING FEE. YOU MUST ALSO BRING WITH YOU WHAT IS CHECKED BELOW: Enclosed form(s) properly and completely filled out. FAILURE TO KEEP THIS APPOINTMENT Your marriage certificate. WILL RESULT IN SUBSTANTIAL DELAY Proof of death or divorce for each prior marriage of yourself or spouse. Your birth certificate. Your spouse's birth or naturalization certificate or certificate for citizenship. The child (children) for whom you filed application for naturalization. Birth certificate(s) for the child (children). Adoption decree(s), and a summary translation(s) in English if in a foreign language. A summary translation is a condensation or abstract of the text. Form N-430 (Rev. 5-5-83)N FPI LOM"
}
