{
	"anumber": "A10534184",
	"id": "A10534184_0045",
	"page_index": 45,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0045/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CONTINUATION OF I-4 OF P ALVARADO-Gonzalez, Leopoldo & DE LA HOYA-Sanchez,, A10 534 184."
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CONTINUATION OF I-44 OF ALVARADO-Gonzalez, Leopoldo FOIA (b)(6) & DE LA HOYA-Sanchez, Vicente A10 534 184. the illegal driverV GONZALEZ in the suburban vehicle.Subject's #1 & 2 along with the vehicle containing the load were then taken to the USBP station in El Centro for processing. Interrogation of the driver GONZALEZ revealed the following : GONZALEZ recruted the illegal aliens in Mexicali, B.Co, housed them at the Palenque Motel at Blvd. Lopez Mateos#1398 Esquina Fuerza aerea in Mexicali, The illegal aliens were to pay GONZALEZ $450.00 apiece for transportation to the Los Angeles area. Payment was to be made upon arrival to Los Angeles by relatives of the illegal àliens. GONZALEZ guided the group into the U.S. through the Mt.Signal area. They were then picked up by an unidentified person and hidden in the Westmoreland area. They were then headed toward the Los Angeles area in the suburban which was vehicle that was driven by unidentified male at pick-up. GONZALEZ claims that he was given keyes and tol which route to take. At interrogation at ELC in was discovered that Subject#1 ALVARADO has been app'd twice with illegal aliens in vehicle. ALVARADO was app'd on 09/22/80 with 3 illegal ali ns.ALVARADO was also app'd on 06/24/79 with nine(9) illegal aliens. On both occasions prosecution was declined. ALVARADO was also app'd on 04/07/81 nr.Calexico, Calif. after having entered without inspection. (See attached I-44 dated 04/07/81). At questioning ALVARADO denied any knowledge of the smuggling operation, ALVARADO denied having been arrested by B.P. Agents prior to this occasion, However ALVARADO had in possesion a key holder from the aforementioned PALENQUE MOTEL.This was dis- covered after ALVARADO denied having been in Mexicoin at least 2 months. ALVARADO also denied having keyholder in possesion, Four of the illegal load including the driver GONZALEZ stated that they had stayed in the motel. DE LA HOYA at questioning also denied any involvement in the smuggling load. DE LA HOYA claimed he had never seen ALVARADO, claimed to have nothing to do with load. Subject # 2 DE LA HOYA was found to have in his possesion during questioning DMV documents pertaining to the Suburban load vehicle. PROSECUTION ON SUBJECT's #1 & 2:ACCEPTED FOR 8 USC 1324 BY ASA ENCINAS 10:36 on Vehicle:Negative 10:36SubjectHI:Positive;70:36 on Subject//2:Negative Hand Ph JOHNNY P. ROJAS, BORDER PATROL AGENT"
}
