{
	"anumber": "A10534184",
	"id": "A10534184_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BORDER PATROL REPORT OF APPREHENSION OR SEIZURE, I-44"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "BORDER PATROL REPORT OF APPREHENSION OR SEIZURE Office or Agency File(7) FOIA (b) (6) Chief Patrol Agent (2) A10 534 184 E1 Centro, Calif. Sector: El Centro, Calif. Date: 07/27/81 Patrol Agents Sandoval, Ro jas, Wolstenholme, Dinior, Soto, of the E1 Centro station assisted the Burnham (Agency) (City and State) in the apprehension and seizure of the following: Name (Surname in CAPS) First Middle Date and Place of Birth FOIA (b)(6) (1) AlvARADO-Gonzalez,Leopoldo (I=151) (1) Compostela, Nayo Mexico (2) DE LA HOYA-Sanchez, Vicente (I-151) Durango, Dgo. Mexico Address of person apprehended/interviewed 05/12/12 (1) 1203 Middle Road, Heber, Calif. 92249 Nationality (2) P.O.Box 1174 Patterson, Calif. 95363 (1) Mexico (2)Mexico and seized/recovered VESSEL, VEHICLE OR AIRCRAFT Description (Year, Make Model, Color) Motor or Serial No. Registry or License No. Value (Est.) (1) 1972 Ford LTD Drk Brn 2056H117086 Cal#691 GVJ (2) 1972 Olds brn/creme 3N57TZX116435 Cal#486 FFX CONTRABAND, MERCHANDISE OR OTHER Quantity Description Value (Eat.) SEE ATACHED MEMO FOR LIST OF ILLEGAL ALIENS SUBJECT'S #1 and #2 ADVISED MIRANDA RIGHTS AT TIME OF ARREST BY AGENT J.ROJAS Place of Apprehension or Seizure Date and Hour Offense Nr. Salton City,Calif. 07/27/81 0940 8 USC 1324 (ALIEN SMUGGLING) NARRATIVE (Include circumstances of apprehension and seizure and facts to which apprehending officers can testify) Subject's #1and #2 advised Miranda rights at time of arrest by Agent Rojas. Subject's both Immigrated aliens were app'd on Barth Road on Hwy 86 approx. miles south of 86 checkpoint guiding a load of ten (10) illegal aliens including driver (See I-213 of driver, GONZALEZ-Hernandez, Arturo; (FOIA (b)(6)) At approx.0700 Agents Soto and Burnham first encountered ALVARADO. Agents noticed as they were stopping a seperate vehicle that ALVARADO in aforementioned was tailgating their marked USBP unit dangerously close. (see attached sheet) Johnny Rojag/BPA Received above persons and items: Details regarding \"HOLD\" placed Subjects#1 &2:TO ICJ FOR PROS Vehicles: Deized Signature and Title Illegal Aliens:To ECC for MAT WITT Office or Agency Date Form 1-44 (Rev. 2-1-72) N UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}
