{
	"anumber": "A10517306",
	"id": "A10517306_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Assurance of Employment"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1942, 1953, 2023, 1922, 1944, 1920]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 PAGE 2 (c) I am giving this assurance of employment as a personal obligation in my capacity as the alien's prospective employer as the personnel or other responsible officer of the organization which is to employ such alien (d) I further assure that the alien listed under (1) and the member of his family listed above will be housed at 200 East Myrtle Street, San Antonio, Texas (State specific address) in bedroom with utilities shared in 8-room house (State type of housing available including number of rooms and facilities) (e) I assure that such housing will be available at the time of arrival of the alien in the United States if such arrival takes place not later than whenever he gets here , and that I have made these housing arrangements, being the owner thereof having made rental arrange- ments with Ng Lin Jong (Name and. Address of landlord) 200 East Myrtle St , San Antonio, Texas (5) I am a citizen of the United States. I was born at San Antonio, Texas on (City, Town and State) December 23, 1920 (Month, Day and Year) My net income is $ 6,616.62 I have on deposit at banks in the United States $ 321.76 I own real estate valued at $ 140,000, with mortgages or other encumbrances thereon amounting to $15,567.16 I am self-employed and my net income during the last year was 6,616.62 The following persons are dependent on me for support: NAME: (First) (Middle) (Last) (Date of Birth) - (Relationship to me) Mary Muy Ng. April 27, 1922 Wife 3823 Janice Elaine Ng Nov. 24, 1942 muges Daughter Ronald Lee Ng Aug. 17,1944 Son (6) I have within the last five years sponsored the immigration into the United States of None persons. (State number) (7) I have previously submitted an assurance under the Refugee Relief Act of 1953 for the following persons: NAME: Relationship to me Date submitted NONE (8) ADDITIONAL OR SUPPLEMENTAL INFORMATION Graduate of Kuo Wah University, Shanghai, China Teacher and Manager of Cafe Manager of Textile Mill Family in interior of China"
}
