{
	"anumber": "A10534184",
	"id": "A10534184_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CONTINUATION OF I-4 4 OF ALVARADO-Gonzalez, Leopoldo; FOIA ((b)(6) & DE LA HOYA-Sanchez, Vicente A10 534 184."
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CONTINUATION OF I-44 OF ALVARADO-Gonzalez,Leopoldo; FOIA (b)(6) & DE LA HOYA-Sanchez, Vicente A10 534 184. Agents observed that although the marked unit was still in motion ALVARADO'S vehicle was less than afoot from their rear bumper.Agents then observed vehicle pass them and increase speed of vehicle very quickly.As Agents noticed only one occupant in vehicle they proceeded south after leaving other vehicle.Agents then informed BPA Pilot R.Dinior of suspicious manner of vehicle. BPA Dinior, B.P.airplane then took up survelence of vehicle,Agent Dinior observed vehicle proceed to Salton City.Agent noticed that upon reaching Salton City the vehicle made a wide sweep of area around S-22 and the intersection of Hwy 86 appar- antly looking for someone or something. This is a favorite ploy of smugglers to see if their are any .P.units in the area.Agent Dinior observed ALVARADO get off vehicle and make a telephone call at a telephone booth.Agent then observed ALVARADO get back in vehicle, make another sweep of the area and head south on Hwy 86 at a high rate of speed. Agent Dinior noticed that vehicle continued traveling at a high rate of speed until it reached Garvey road where ALVARADO got off vehicle and once again made a phone call. ALVARADO then proceeded south on Hwy 86 until it reached a road approx.2 miles west of Westmoreland, Calif. The vehicle turned into the road and park near a large tree where Subject#2(DE LA HOYA) was parked in vehicle #2. Agent observed DE LA HOYA get off vehicle and talk to ALVARADO who remained in vehicle/1. After a few minutes of conversation Agent observed DE LA HOYA get back into his vehicl and followed by ALVARADO proceed north on Hwy 86 towards Salton Cityo At this point Agents R.Sandoval, Ro jas, and J.Wolstenholme of the 8am to 4pm unit were informed of the situation by Agents Soto and Pilot Dinior,Agents took the back road to Hwy 86 to await further instructions from Pilot Dinior,As Agents waited on Bannister Road Pilot Dinior informed them that ALVARADO had pulled of the side of the road and was parked beneath a stree,Agt.Dinior informed Agts, that vehicle#2 was less than a mile south of where Agts.were waiting. After vehicle#2 passed Bannister road, Agts.stopped vehicle and I.D.'d the driver as DE LA HOYA.A search of vehicle proved negative and after I.D.ing DE LA HOYA Agts.proceeded north on Hwy 86.Agts. relayed this information to Pilot Dinior who was keeping survelance on vehicle/1. As Agts. proceeded north they observed vehiole/2 starting to gradually slow down.Agts. lost sight of vehicle#2 and informed Dinior to keep a watch for vehicle. During time Agts.were stopping DE LA HOYA ,Agent Dinior noticed that a suberban type vehicle had slowed down near tree where ALVARADO had parked vehicle/1.Agent observed ALVARADO then pull in front of the suberban vehicle (wht/blue Chevy Vin//EE168F112874; no other record on file) and P roceed northbound on Hwy 86. Agt,Dinior then observed vehicle #2 parked on Barth Road on the northbound lane. He observed as vehicle#1 with ALVARADO pull up parrallel with vehicle#2, apparently speak to DE LA HOYA, and then pull to the side of the road in front of vehicle#2. Agt.Dinior then observed the surburben vehivle pull even to vehicle/1 and then suddenly make a U-turn of the Hwy. and head south at an extremelly high rate of speed. Agts.on ground units who were hiding on Kane Springs were then informed of this by Agt.Dinior.Agts.then took of south in attempt to catch load vehicle.At Barth Road Agt, Sandoval and Rojas observed both vehicles #1 & #2 with Subject's ALVARADO and DE LA HOYA parked on the side of the road,Agent Rojas was then left off to apprehend Sub- ject's #1 then took off in pursuit of the load vehicle. Sandoval finally managed to stop the load vehicle approx.5 miles west of estmoreland, Calif. Agt. Sandoval found 2 Mexican, Guatamalan, and 6 El Salvadoran illegal aliens along SEE OF"
}
