{
	"anumber": "A10534184",
	"id": "A10534184_0041",
	"page_index": 41,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0041/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DISTRICT COURT OF CALIFORNIA, JUL 29181"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1968, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DISTRICT COURT THERN DISTRICT OF CALIFORNIA DGEP CEIVED DOA: 7/27/81 JIII 291981 UNITED STATES OF AMERICA, Magist rate' Docket No V. GLENN, U.S. DISINIC COURT Arturo GONZALEZ Hernandez, Age: 31, Mexico ) SOUTHERN DISTRICT OF CALIFORNIA Vicente DE LA HOYA Sanchez, Age:69, Immi, ated BY DEPUTY Leopoldo ALVARADO Gonzalez, Age:29, Immi ed COMPLAINT FOR VIOLATION OF 81-628711 Three defendants are citizens of Mexico 8 U.S.C. 1324; 18 U.S.C. 371 8 U.S.C. 1325; 18 U.S.C. 2 BEFORE Joseph Schmitt El Centro, California U. S. Magistrate Address of Magistrate The undersigned complainant being duly sworn states: COUNT ONE That beginning at a date unknown and continuing up to and including the 27th day of July, 1981 in the Southern District of California, DEFENDANT(S )Arturo GONZALEZ Hernandez, Vicente DE LA HOYA Sanchez, Leopoldo ALVARADO Gonzalez and others unlawfully, willfully, and knowingly did combine, conspire, and agree together and with each other, and with divers other persons unknown to the complainant to violate certain laws of the United States, to wit, to violate Title 8, United States Code, Section 1324. It was a part of the Said Conspiracy that the defendant and others would willfully and knowingly encourage and induce, and attempt to encourage and induce, directly and indirectly, the entry into the United States of aliens not lawfully en- titled to enter or reside within the United States, in violation of Title 18, United States Code, Section 371. COUNT TWO That on or about July 27, 1981 within the Southern District of California Defendant, (see attached) did knowingly and willfully aid, abet, and and assist alien (see attached) in entering the United States at a time or place other than as designated by Immigration Officers, a misdemeanor in violation of Title 18, United States Code, Section 2; and Title 8, United States Code, Section 1325. COUNT THREE That on or about July 27,1981 within the Southern District of California Defendant (see attached) did knowingly and willfully aid, abet, and assist olien (see attached) obtain entry into the United States by a willfully false or misleading representation or willful concealment of a material fact, a misdemeanor in violation of Title 18, United States Code, Section 21 and Title 8, United States Code, Section 1325. AND THE COMPLAINANT STATES THAT THIS COMPLAINT IS BASED ON statements of arresting officers that at time of arrest Defendant was driving a 1968 Chevrolet Suburban(no plates) which contained Nine undocumented aliens, Seven(7) were from El Salvador and the other TWO(2) were from Mexico, that Defendant Gonzalez, who was driving the Chevrolet Suburban stated that he had made arrangements in Mexico with the undocumented aliens, that he guided them into the United States, that he was going to charge the aliens FOUR HUNDRED DOLLARS except the TWO Mexican aliens, to be taken to the Los Angeles, California area, that he drove from the point of the illegal entry to the place of apprehension, that Defendants DE LA HOYA and ALVARADO scouted the highways, that DE LA HOYA had the Suburban's registratio on him, that Alvarado had the Hotel Key where the aliens had stayed in Mexico AND THE COMPLATHANT FURTHER STATES THAT HE BELIEVES THAT are material witnesses in relation to this charge factor Sicketter of Encihagnant Criminal Investigator Border Patrol Official Title Sworn to before me, and subscribed in my presence, July, 29 , 19 81 Def't arraigned: Date 7-24-81 Prelim Date 8-7-81 Waived United State Magistrate Joseph Sohmitt Indictment Not Waived Speaks Span. only Bail set at #2000 casha e/s Bail Review/Appt. Counsel Date 8-3-8 U.S. Marshal Temp. Commit. San Drige"
}
