{
  "anumber": "A10534184",
  "id": "A10534184_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: U.S. Department of Justice Immigration and Naturalization Service\\nForm Number: N-400 ( (12/05/86) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "04 14 88 U.S. Department of Justice Application to File OMB #1115-0009 Immigration and Naturalization Service commo TER Petition for Naturalization This block for government use only. Please read the instructions before filling out this form. 2 26 PH or Section of Law De LA NOYA SANChez VicenTe SAN DIEGO (316a) 50/20 1. Your name (Exactly as it appears on your Alien Registration Receipt CHERLCT OFFICE 4. Place you were admitted for permanent residency (City and State) A10-534-184 457-60-4959 EL. PASO TEX. 2. Your Alien Registration number 3. Your Social Security Number 15. Date your continuous residency began in the U.S. (Month/Day/Year) A- 8-18-55 4. Your name (Full true and correct name, if different from above) 16. How long have you continuously resided in the State where you now live? (Number of Months) MEXICALL B. CAL MEXICO 23 YEARS 5. Any other names you have used (Including maiden) 17. Do you intend to reside permanently in the United States? (If No, explain fully) Yes No 6. Your date of birth (Month/Day/Year) 7. Your Sex 5-12-12 Male Female 8. Your place of birth (City or Town) Duranco D60 Mexico (County, Province or State) (Country) Duranco MEXICO 9. Was your father or mother ever a United States citizen? 18. Have you served in the United States Armed Forces? (If Yes, explain fully) Yes No (If Yes, complete all of #18.) Yes No Branch of Service (Indicate if Reserve or National Guard) Inducted Enlisted Location where you entered (City and State) EL. PASO TEXAS. Service began (Month/Day/Year) NONE Service ended (Month/Day/Year) 10. Can you read and write English? Service number Yes No 11. Can you speak English? Rank at discharge Yes No 12. Can you sign your name in English? Type of discharge (Honorable, Dishonorable etc.) Yes No 13. Date you were admitted for permanent residency (Month/Day/Year) Reason for discharge (Alienage, conscientious objector. other) 8-18-55 19. At what addresses in the United States have you lived during the last 5 years? List present address first. Street Address City county and State From (Month/Day/Year) To (Month/Day/Year) EL and ih AVILA BROWLEY CAL 6-10-83- TRUCKING Present 8-15-85 20. What employment have you held during the last 5 years? List present or most recent employment first. (If none, write \"None\".) Name and Address of Employer Occupation or Type of Business From (Month/Day/Year) To (Month/Day/Year) Form N-400 (12/05/86) N"
}