{
  "anumber": "A10534184",
  "id": "A10534184_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application by Lawful Permanent Resident for New Alien Registration Receipt Card, WAC-92-251-51152"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Application by Lawful Permanent sident 6.15 OMB#1115-0004 immigration and Naturalization Service (INS) for New Alien Registration Recen ard DO NOT WRITE IN THIS BLOCK. Case ID# Action Stamp A# WAC-92-251-51152 BXG001 08/28/92 G-28 or Volag# Status Verified CIS A File F/P to FBI I-151/I-551 Other (Date) (Specify) I-89 to TFC (Date) By on Class OIM Initials Date 1. Name (Family name in CAPS) (First) (Middle) 12. The city you lived in when you applied for your immigrant visa or for DE LA HOYA-SANCHEZ, VICENTE adjustment of status DURANGO, MEXICO 2. Address (Number and Street) (Apartment Number.) 13. Your destination (city and state) in the U.S. at the time of your 445 S. MCDONNELL AVE. original admission. (Town or City) (State/Country) (ZIP/Postal Code) BAKERSFIELD, CA. LOS ANGELES, CA. 90022 3. Place of Birth (Town or City) (State/Country) 14. The consulate where your immigrant visa was issued or the INS DURANGO MEXICO office where your status was adjusted to permanent resident. 4 Date of Birth (Mo/Day/Yr) 5. Sex CIUDAD JUAREZ MEXICO 5-12-12 Male Female 6. Name used when admitted as permanent resident (if different from 1.) 15. Your port of admission to the U.S. if you entered with an immigrant SAME AS # 1 visa. ELP TX 7. Social Security Number 8. Alien Registration Number (if any) 16. The date you were admitted or adjusted to permanent resident status. 457-60-4959 A 10 534 184 8-18-55 9. Country of Citizenship 17. List the date of all your absences from the U.S. lasting one year or MEXICO longer since you became a permanent resident. 10. Your Mother's First Name 11. Your Father's First Name NONE CONSTANZA ENRIQUE 18. Reason for new card (if you check a or b, you must pay $35.00 to file this form.) a. My alien registration receipt card was lost, stolen, destroyed, or mutilated. Explain how the card was lost stolen destroyed. or mutilated. (Attach the remainder of the card, if it exists.) IT WAS LOST WITH ALL MY PERSONAL DOCUMENTS. b. My name has been changed. (Attach the decree of the court or the marriage certificate and your old card.) C. I am required to be registered and fingerprinted after my 14th birthday. (Attach your old card. You MUST use the fingerprint card Form FD- 258, which you can get from any U.S. Consular or INS office.) d. I am an alien commuter taking up permanent residence in the U.S. (Attach your old card.) e. I received an incorrect card. (Attach your old card and explain what is wrong with it.) f. I never received my card. g. Other (Explain) Penalties: You may, by law, be fined up to $10,000 or imprisoned up to five years, or both, for knowingly and willfully falsifying or concealing a material fact or using any false document in submitting this application. Your Certification: I certify, under penalty of perjury of the law of the United Sates of America, that the above information is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine if I am eligible for the benefit that I am seeking. Signature Vicente dela Hoya 7-13-92 213-261-9353 Date Phone Number Signature of Person Preparing Form is Other than Above I declare that I prepared this document at the request of the person Boveland that it is based on/all information of which have any knowledge. ODILIA SMITH 124 WEST 2nd STREET Olilia Soulc 13/92 (Print Name) LOS (Address) ANGELES, CA 90012 (Signature) (Date) G-28 ID Number (213) 687 4381 INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Volag Number 13 JUL 1992 Rec'd Sent Denied Approved Returned Form I-90 (Rev. 4/11/91) Y U.S. G.P.O. 1991 282-065/44263"
}