{
	"anumber": "A10517306",
	"id": "A10517306_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 022832"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1949, 1907, 1923, 1925, 1943, 1954, 1939, 1935, 1938, 1955, 1952, 1953, 2023, 1926, 1951,
				1944, 1924, 1936
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 1 FS-256a sed August 1952) FOREIGN SERVICE OF THE UNITED STATES OF AMERICA I- 022832 Approved Bureau Budget No.47-R108.1 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION a special nonquota I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for/son IMMIGRANT VISA and Refugee Relief Act of 1953 and the ALIEN REGISTRATION under the/Immigration and Nationality Act to the American Vice Consul at Hongkong 1. Family name --000 Given name Initial 2. Place and date of birth Age LEE Tak Cheong; Toyshun, Kwangtung; 49 February 24, 1907; 3. Other names by which I have been known 4. Last permanent residence LEE Ying Yu or LEE Yun Ng; 90 Boham Strand East, 2nd fl., Hongkong; 55 Address in the United States 6. Name and address of person to whom destined, if any NG Yin Toy (Arthur) - friend and sponsor; 153 Schreiner Place, San Antonio, Bexar County, Texas; 153 Schreiner Place, San Antonio Bexar County, Texas; 7. Name and address of nearest relative in home country 8. Travel documents presented NG Choy Fong - wife; Tsung Moy Village, Ke Ling Town, 1st Form of Affidavit in Lieu of a Passport Division, Toyshun, Kwangtung, China; issued at Hongkong; 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Slightly Dark Chinese Chinese 137 M Married Single Grey; Brown 14. Complexion 16. Ethnic Classification 5 ft. 6 in. lbs. Yellow Chinese F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Salesman; A mole on the side of right ear; Chinese (Toyshun dialect and Cnatonese); 22. Intended United States port of entry 23. Final destination 24. I have (a) (xa) 25. Purpose of going to the United States San Antonio, Bexar through ticket to Honolulu, Hawaii; destination Take up employment; County, Texas; 26. Places of previous residence 1907-1923 Toyshun, 1924-1925 Shanghai, 1926-1935 Toyshun, Kwangtung, 1936-1938 Canton. 1939-1943 Toyshun, 1944-1949, Canton, 1949-9th Sept. 1951 Hongkong, 10th Sept. 1951 -30th Sept Canton, Oct. 1, 1951-date Hongkong; 27. Names and places of residence of spouse and minor children NG Choy Fong - wife; Tsung Moy Village, Ke Ling Town, 1st Division, Toyshun, Kwangtung, China; LEE Bak Sim - daughter; ditto LEE Yiu Bong - son; ditto FOIA (b) (6) 28. Name and address of father 29. Name and address of mother LEE Wan Yen - deceased; NG Shau Ying; Song Mai Village, Chi Ling County under the Refugee Relief Act of 1953 Refugee Relief Act 1st. Division Toyshun, Kwangtung, China of and the 30. I claim to be a nonquota immigrant/ and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: 1. Certificate of non availability of birth and I am an eligible refugee as prescribed by Section marriage records and of no police record; 2(a) of the Act, and am the beneficiary of Verified 2. Verified Assurance document No. 3207 dated Assurance No. 3207 dated July 6, 1954; July 6, 1954; 3. Certificate of Readmission dated 13th July 1955; 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: Never; 38. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: Never; 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: Never; 10-07-144-1 (Application continued on reverse side)"
}
