{
  "anumber": "A10551867",
  "id": "A10551867_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10551867_0028/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO REGISTRAL, 127"
    },
    "years": {
      "ms_years_nlp_v1": [
        1939,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "a los que la presente uterrn if Certifico arr riertn que en pl libro número IV del Re- gistro Civil que P5 a mi rargo, a la foja(s) nume- rn(s) Frente 127 se pneuentra asentada una arta del LA tenor siguiente: AL MARGEN: Aota numero 45I cuatrocientos C incuenta y uno. - JOSE LUIS GARCIA. - Síncope Cardiaco. - AL CENTRO\"\"En la ciudad de Torreon, Coahuila a los 4 cuatro días del mes de Agosto de 1939, ante el Ofi cial Primero del Registro Civil Interino C. Licenciado Isidro Ortiz comparecio el señor Angel R. Martinez, agente de inhumaciones con su domicilio en la Calle Treviño y avenida Morelos y expuso: que de ayer a las 16 diez horas en la Calle del Panteon numero 24 veinti- cuatro falleció de Sincope Cardiaco segun certificado medico expedi_ do por el Doctor Luis Lopez Aranda el señor: JOSE LUIS GARCIA, de - 30 años deedad, mexicanoo, casado, comerciante, originario de Jerez, Zacatecas deja viuda a la señora Juliana L. el finado es hijo del - señor: Luis García y de la señora Jesus Sierra. Se levanto la pre - sente acta en presencia de los testigos J. Concepcion Valdes y A. - Fuentes, mayores de edad y de éste lugar. Se mando inhumar el ca- daver en el Panteon Torreon.-Doy. -Fe. - Lic. Isidro Ortiz. A. fuen - de tes.- Y a solicitud de parte interesada se expide la presente COPIA CERTI 33 FICADA, debidamente corregida y cotejada con la original en la ciu - de dad de Torreon, Coahuila a los 6 seis días del mes de Junio de 1955 mil novecientos cincuenta y cinco.- EL OFICIAL PRIMERO DEL REGISTRO CIVIL Para ANGEL M IARROQUIN PAMANES. Manafium Juzgado Iro. del Registro Civil TORREON, COAH"
}