{
  "anumber": "A10534406",
  "id": "A10534406_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534406_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, Forma 55"
    },
    "years": {
      "ms_years_nlp_v1": [
        1937
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Forma 55 Cert. Núm. Rec. de Cantidad $ Reducción según Oficio Núm ACTA No. 212928 ESTADO DE CHIHUAHUA En nombre de la República Mexicana y como Juez del Registro Civil de este lugar, hago saber a los que la presente vieren y certifico: Que en el libro Núm 22 de la Sección de Matrimonios del REGAUDACION DE RENT Registro Civil que es a mi cargo a fojas. 461 se encuentra una acta del tenor literal VILLA LOPEZ, CHIH siguiente:A márgen Al márgen: - Numer -Matrimonio del señor Ruben Maldonado y la señorita Lidia Ibarra.-Al centro Numero uno.-En Villa López, Chihuahua, siendo las 16 diez u seis ho- ras del d1a 23 veintrés de enero de 1937 mil novecientos tre treinta y siete, en el local de esta oficina, comparecieron ante m1, José Montoya, Juez del Registro Civil, los pretendien tes señor Ruben Maldonado y la señorita Lidia Ibarra y los - testigos propuestos por éstos,se mando se diera lectura al es crito de solicitud de fecha 22 veintidos del corriente mes y a las diligencias practicadas con motivo de dicha solicitud, de las que aparece que no hay impedim nto alguno legal para- verificar el matrimonio que pretenden y en esa virtud inter- pele'separada y suscesivamente a les contrayentes si es su - voluntad unirse en matrinonio, tomándose y entregándose mutua men te por marido y mujer ,habiendo contestado ambos afirma-- tivamente yo el Ciudadano José A.Montoya, Hice la siguiente - declaración:-E Nombre de la Ley y de la Sociedad, declaro uni dos en perfecto y legítimo matrimonio al señor Rubén Maldona- do y a la señorita Lidia Ibarra, con todos los derechos y pre- rrogativas que la Ley otorga y las obligaciones q ue la mis- ma impone.-Inmediatamente se procedió a lebantar la presente ta,haciéndose constar haberse cumplido con las fornalida-- des que la Ley establece y como antes se expresa no existe - impedimento alguno legal para verificar el matrinonio de que se trata y que las generales de los contrayentes y testigos, de que antes se ha hecho mérito, son como sigue:-Ruben Maldon nado,mexicano, soltero, agricultor, católico, de 22 veintidos üos de edad, originario del Publito y vecino del poblado de Sa laices,de esta jurisdicción,h ijo legítimo del selior Santiago Maldonado, ya finado y la señora Guadalupe Maldonado, Viuda de Maldonado y vive con su hijo y Lidia Ibarra, mexicana,céli be,católica, de 18 dieciocho años de edad, de Dorado Municipio de Valle de Allende y vecina del poblado de Salaices, hija le gítima del señor Rodrigo Ibarra y Jovita Gutierrez de Ibarra el primero agricultor de 55 vincuenta y cinco años de edad, y viven con su hija.-Fueron testigos de esta acta, seño- res Ingeniero Ignacio Bustillos y Leon L.Ortega, Pedro Solte- ro y Pedro Salazar, mayores de'edad, vecinos del poblado de Sa laices de esta lunicipalidad, los tres primeros casados y el último soltero, empleados los tres primeros y el último agri- cultor, los declararon bajo protesta de decir verdad, que cono cen a los contrayentes have más de tres años y saben y les - consta de vista y ciencia sierta que no tienen impediment alguno legal para verificar su concertada unión, habiendo es- tado presente en este acto el señor Rodrigo Ibarra, padre de- la pretensa quien otorga su concentimiento para que su hija- Lidia pudiera contraer matrimonio con el señor Rubén Maldo- nado, con lo que terminó la presente que leída que les fue a los que en ella intervinieron, la ratificaron y firmaron de- conformidad. Doy fe,-José 1.Montoya, Ruber Maldonado.-Lidia- Ibarra, Ing. Ignacio Bustillos.Ieón L.Ortega,edrboSoltero.. Pedro Salazar.-Rodrigo Ibarra.-Simón Núnez.-Rubrigas. vuelta. 20555 IEN 5A"
}