{
  "anumber": "A10534184",
  "id": "A10534184_0069",
  "page_index": 69,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0069/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Investigation, G-23 Report"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "THIS COPY OF REPORT FOR: DD, E1 Paso, Texas REPORT OF INVESTIGATION IMMIGRATION AND NATURALIZATION SERVICE FILE REPERVENCE UNITED STATES DEPARTMENT OF JUSTICE AUX TITLE OF CASE (If Individual, give last name (IN CAPS), first name, middle name) CASE FILE NOS. LINE NO. ON G-23 REPORT DE LA HOYA-Sanchez, Vicente A10 534 184 528 ALIASES CHARACTER OF CASE Document fraud DATE AND PLACE OF BIRTH NATIONALITY DATE PLACE, AND MANNER OF LAST ENTRY DISTRICT IN CONTROL OF INVESTIGATION SUBOFFICE (Only if in control) DATES ON WHICH INVESTIGATION CONDUCTED DURING PERIOD COVERED BY THIS REPORT E1 Paso, Texas August 27, 1956 THIS REPORT MADE AT DATE OF THIS REPORT SIGNATURE OF REPORTING OFFICER Distem TITLE AND NAME OF REPORTING OFFICER Los Angeles, Cal. August 28, 1956 Investigator B. A. Stein mhq SYNOPSIS DETAILS Investigation conducted pursuant to El Paso Report No. 1 of August 13, 1956, requesting that SUBJECT'S knowledge of fraudulent document in visa be determined. SUBJECT, who resides at 639 Stanford Ave., Los Angeles, Cal., was interviewed at the Los Angeles District Office on August 27, 1956 and executed an affidavit attached as Ex \"A\". He stated that he had gone to the office of CEFERINO ANCHANDO, Cd. Juarez, Mexico to have a letter written to a former employer to get an employment letter. ANCHANDO offered to arrange for SUBJECT'S employment in the El Paso area and the offer was accepted by SUBJECT because he could then be closer to his family in Mexico. He stated that he did not know that the employment letter furnished by ANCHANDO was fraudulent. After he was lawfully admitted at El Paso he returned to Cd. Juarez and requested the address of his prospective employer of ANCHANDO and was told that employment was not available until the following month. He then returned to the United States and sought employment elsewhere. Ex \"A\" SHOW STATUS OF INVESTIGATION HERE AS OF CLOSE OF THIS REPORT (Check one) AX PENDING PENDING INACTIVE CLOSED REFERRED ON COMPLETION TO CONTROL OFFICE DISTRIBUTION (Show number of copies going to offices designated) (FOR SUBOFFICE USE) DATE 2 - DD, E1 Paso w/ex \"A\" REVIEWED AND REVIEWED AND APPROVED. REVIEWED BUT SEE ADMINIS- APPROVED BUT REFERRED FOR REFERRED FOR TRATIVE PAGE 1 - SWRO, Att'n: Reg. Chief NOTING APPROVAL FOR COMMENT of Investigations w/ex \"A\" SIGNATURE TITLE (FOR DISTRICT OFFICE USE) DATE 1 - file (retained at Los Angeles) w/ex \"A\" REVIEWED AND NOTED FORWARDED SEE ADMINIS- APPROVED TRATIVE PAGE Jorg FOR COMMENT SIGNATURE Daily Sup. Investigator TITLE FOR REGIONAL OFFICE USE) DATE REVIEWED AND NOTED FORWARDED SEE ADMINIS- APPROVED TRATIVE PAGE FOR COMMENT INVESTIGATIVE REPORT FACE SHEET F orm G-166(Rev.10-1-55) GPO 970632 SIGNATURE TITLE"
}