{
	"anumber": "A10551867",
	"id": "A10551867_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10551867_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Solicitud por un extranjero con residencia legal permanente para obtener una tarjeta de registro del extranjero - Tarjeta I-151, FORM 1-90 ( (Spanish) ( (Rev. 9-27-75)N"
		},
		"years": {
			"ms_years_nlp_v1": [1977, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS Form approved OMB No. 43-R0040 SERVICIO DE INMIGRACION Y NATURALIZACION of OCT 1977 Applicant: Do Not Fill In This Block Nationality FILE NO. SOLICITUD POR UN EXTRANJERO CON Code RESIDENCIA LEGAL PERMANENTE PARA Fee Required Fee Not Required OBTENER UNA TARJETA DE REGISTRO DE Fee Stamp EXTRANJEROS - TARJETA I-151 82 (Tenga la bondad de leer las instrucciones adjuntas) 1. Por la presente solicito una Tarjeta de Registro de Extranjeros (Alien Registration Receipt Card) debido a las razones que expongo a continuación (marque la casilla apropiada): (a) Mi tarjeta de registro de extranjeros se ha extraviado, ha sido destruida el 10-6-77 (FECHA) 00 aproximadamente en esa fecha, bajo las siguientes circunstancias; lose pecure (SI RECOBRO MI DOCUMENTO, SE LO ENTREGARÉ AL SERVICIO DE INMIGRACIÓN Y NATURALIZACIÓN) (b) Mi nombre ha cambiado. (c) Mi tarjeta I-151 está dañada. (d) Mi prueba de registro de extranjero está en (e) Nunca recibi la tarjeta I-151. forma distinta a la Tarjeta I-151. (g) La Sección 262 (b) de la Ley de Inmigración y (f) Mi actual tarjeta I-151 se encuentra en mal Naturalización exige que se me inscriba y tomen estado debido a una laminación defectuosa. las huellas dactilares después de cumplir los 14 (h) Recibí una tarjeta I-151 incorrecta. años de edad. (i) Soy un extranjero que viaja constantemente, entrando y saliendo de los EE. .UU., y tomaré residencia permanente en lós EE.UU. Adjunta a los presentes, entrego mi tarjeta de viaje \"Form I-151\". (Si marcó una de las casillas (a), (b), (c) ó (e) que anteceden vea la Instrucción número 7, sobre el pago del derecho requerido) 2. Nombre y Apellido (en mayusculas) Nombres Segundo nombre 4. Nacionalidad apellido DELEON JULIANA VDA DE GARCY MEXICANA 3. Dirección postal Número y calle (Apt. No.) 2960 the Mall after H en los Estados 5. Núm. del Registro de 6. Sexo Unidos Extrameros Estado calf A10551867 Varón Hembra Número ZIP Ciudad Los angeles 90023 7. Admitido a los EE.UU. (Ciudad) (Estado) 8. Fecha de admisión (Mes) (Dia) (Año) 9. Fecha de nacimiento (Mes Dia Año) El Paso TEXAS 5-8-56 1-27-15 10. Forma de transporte (Nombre del buque, 11. Destino en los EE.UU cuando fue admitido 12. Lugar de nacimiento (Ciudad) (Provincia o Estado) inea, aérea, número de vuelo, etc.) Walking El Pass Tex (Pais) Loyatican noe 13. Nombre que usó cuando se inscribió como extranjero (Si es el mismo que tiene ahora, 14. Nombre que usó cuando fue admitido egalmente como residente permanente (Si es el escriba same'') mismo que tiene ahora, escriba \"same\") Hda. de CEDROS 15 Dirección fuerande los EE.UU. si reside temporalmente en el extranjero (Calle, Ciudad, Pais) 16. Fecha de la última salida de los EE.UU. DEPLAEBED 6 17. Fechas durante las que permaneció ausente de los EE.UU. por un año o más, desde que fue admitido legalmente como residente permanente 18. (Si usted tiene la Intención de usar la Tarjeta I-151 como documento de viaje en las próximas seis semanas, indique la fecha en que tiene intención de salir del país, el nombre de cada pais que piensa visitar y esté seguro de leer la Instrucción 8 en cuanto a las limitaciones del uso de la Tarjeta I-151 para viajar a ciertos países o a través de ellos.) a. Fecha en la quelse propone salir del pais b. Paises que va a visitar 9. Firma de la persona que ha preparado el formulario, si no es el solicitante mismo. 20. Firma del solicitante DECLARO que preparé esta solicitud a petición del solicitante y que todo lo CERTIFICO que la información anterior es correcta y cierta a mi real saber y indicado se basa en toda la información que se me proporcionó al respecto. entender. Juliana (FIRMA) de Leon Vda de Gardia (FIRMA) 10-06-71 (DIRECCIÓN) (FECHA DE LA FIRMA) HECOBOT (FECHA DE LA FIRMA) MAY 01 1978 RECEIVED TRANS IN RET'D-TRANS OUT COMPLETED G-360 SENT. If FORM 1-90 (Spanish) (Rev. 9-27-75)N"
}
