{
  "anumber": "A10534184",
  "id": "A10534184_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151, Form 1-51"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1912,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SLB C FEB 1 7 1966 Form approved Budget Bureau No. 43-R040.7 Applicant: Do Not Fill in This Black FILE NO. APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151 Fee Required Fee Not Required (Please read instructions on the reverse) $ 500 Fee SPAID No 202-5 Immigration and Naturalization Service Calexico, California Data 2/17/66 Verified by Jahen I apply for an Alien Registration Receipt Card(Form I-151), and attach any previously issued Form I-151 or other evidence of registration now in my possession. My Alien Registration Number is A-10-534-184 NFAN 1. Reason for Application (Please check appropriate blocks.) NF (a) My alien registration receipt document was lost destroyed on or about Use ELP GEN. INCE under the following circumstances: (date) 2366 NR 5-16-66 my (If my document is recovered, I will surrender it to the Immigration and Naturalization Service.) (Date) (Initials) (b) My name has been changed. (c) My present Form 1-151 is mutilated. 272-61 fr. in (If you checked \"(a)\", \"(b)\", or \"(c)\" above, see Instruction Number 6 cone For Statistics Out (d) My evidence of alien registration (e) I never received Form 2-12-66 Completed is on a form other than Form I-151. (f) My present Form I-151 is in poor con- (g) I am required by Section 262(b) of the Immigration and dition because of improperlamination. Nationality Act to be registered and fingerprinted after my 14th birthday. 2.Name (Last) (First) (Middle) 3. Nationality DE LA HOYA VICENTE SANCHEZ MEXICO 4. Admitted to U.S. at (City) (State) 5. Date of Admission (Mo.)(Day)(Yra 6. Date of Birth (Mo.) (Day) (Year) El Paso Texas August 18-1955 May-12-1912 7. Means of Arrival (Name of Vensel, of Airline 8. Destination in U.S. nt Time of Admission 9. Place of Birth (City) (Province or State) and Flight No., etc.) (Country) foot Sacramento Calif. Durango Durango Mexico 10. Name Used When Registered R8 an Allen (If arme as present, write 11. Name Used When Lawfully Admitted for Permenent Residence (If \"name.\") VICENTE DE LA HOYA SANCHEZ same as present, write \"same.\") Same. 12. Present Address 13. Address in the U.S. (If same as present address, write \"name.\" AVB. SAN LIJIS #723 Mexicali B.Cfa.Nex. 726 S-Helbert Ave. Ies Angeles 33 Calif. 14. Dates of Absences From the U.S. For One Year or Longer, Since Lewful Admission for Permanent Rest 15. Date of Last Departure from dence N o ne. U.S.2-17-66 16. (If you intend to use Form 1-151 as a document for travel within the next six weeks, give the date of your expected departure, 11st each country to be visited, and be sure to read Instruction 7 in regard to the limitations on use of Form I-151 for travel in or through certain countries.) Never. a. Date of Proposed Departure b. Countries to be Visited 17. Signature of Person Preparing the Form If Other Than Applicant 18. Signature of Applicant I DECLARE that this application was prepared by me at the I CERTIFY that the Information above is true and correct to the request of the applicant and Is based on all information of which I best of my knowledge and belief. have knowledge. any x Vicente Signature de la stay a S. 2=17-1966 Viecrito do Signature la Naya S. 2-17-66 Address Date Signed Date Signed Form 1-90 UNITED STATES DEPARTMENT OF JUSTICE (Rev. 9-20-65) Immigration and Naturalization Service"
}