{
	"anumber": "A10534184",
	"id": "A10534184_0063",
	"page_index": 63,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0063/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1963, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "19. The persons in whose behalf such rmation is requested are as follows: Full name Relationship EDUARDO DE LA HOYA SALAS Son Place of birth Date of birth Ignacio Ramirez, Durango, Mexico NATURALIZATION SERVICE AND 09-11-43 Present address Ignacio Ramirez, Durango, Mexico JUN 20 2 59 PM 1963 Full name 510 St. VERMONT AVE Relationship LOS ANGELES 5. CALE Place of birth Date of birth Present address Full name Relationship Place of birth Date of birth Present address Full name Relationship Place of birth Date of birth Present address Full signature of applicant as now used Vicesta de la alaya INSTRUCTIONS TO THE APPLICANT Application should be executed and SIGNED in duplicate and submitted to the Immigration and Naturaliza- tion office shown on the reverse hereof A fee of three dollars ($3) must accompany the application. Remittances should be made payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Island,\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" Do not send coins or postage stamps. A postal, express, or bank money order or equivalent is preferred. Show your Alien Registration Number in the block in the upper right-hand corner on the reverse hereof. [NOT TO BE FILLED OUT BY APPLICANT] Los Angeles, Calif. 7-9-63 Immigration and Naturalization Service at Date Considered, and the Secretary of State is hereby respectfully informed that entry has been verified as follows: Vicente DE LA HOYA Sanchez Name Port of entry El Paso, Texas Date Aug. 18, 1955 Manner of arrival Was baccor wfully admitted for permanent residence, Wit-hot REMARKS: (Show \"Symbol\" or \"Section\" of admission American antr Contitut 6-30-24). 0-1 Visa Division Elton Lorbeer Monterey N.L. MEXICO Contact Representative"
}
