{
	"anumber": "A10534184",
	"id": "A10534184_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0038/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Investigation, G-168A ( (REV. 7-25-89)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UN D STATES DEPARTMENT OF JUSTIE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION ADMINISTRATIVE PAGE TITLE FILE 1. GONZALEZ, Hernandez, Arturo 1. FOIA (b)(6) 2. ALVARADO-Gonzalez, Leopoldo 2. 3. DE LA HOYA-Sanchez, Vicente 3. A10 534 184 REPORT NUMRER DATE PLACE CENTRAL OFFICE AND REGIONAL REFERENCES 1 10/23/81 El Centro, CA CONTROL OFFICE TRANSFLRRED TO: G-23 LINE TYPE OF INVESTIGATION Prosecution - ELC 505 REPORTABLE Alien Smuggling DATE NATIONALITY DATE PLACE AND MANNER OF ENTRY 1. 2. FOIA (b)(6) 1. Mexico 1.7-26-81 nr. Calexico, Ca., afoot. 2. I-151 2. N/A 3. 05/12/12; Durango, Dgo. Mex. 3. I-151 3. N/A DISTRIBUTION REVIEWED AND APPROVED (SEE COMMENT) 1. USAO, San Diego DATE PLACE 1. EPIC (NASP) 10/23/87 El Centro, California 1. ELC SECTOR SIGNATURE 1. ELC STATION Robert s.now 1. ELC VEHICLE SEIZURE OFFICER NAME ANDLITLE 1. FOIA (b)(6) Robert E. Novak, Acting Supervisor. ASU 1. REVIEWED AND APPROVED (SEE COMMENT) 1. A10 534 184 DATE PLACE 10/23/81 171 Contro, California SIGNATURE NAME Nill- AND TITLE H. William Ingersoll, Deputy CPX APPROVED (REGIONAL OFFICE) DATE NAME AND TITLE SIGNATURE STATUS OF INVESTIGATION: Completed CAT III A-1 SUBJECTS were arrested on 07/27/81 near Salton City, California while attempting to transport (9) undocumented aliens. OBJECT of investigation is to determine if SUBJECTS are amenable to prosecution for violation of 8 USC 1324, 18 USC 371, 8 USC 1325, and 18 USC 2. THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE FORM G-100A (REV. 7-25-00) A-31 4 FPI LC 7.73.38M.7285"
}
