{
	"anumber": "A10517306",
	"id": "A10517306_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Family Composition Affidavit, FOIA(b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1949, 1907, 1923, 1971, 1962, 1960, 1945, 1955, 1947, 2023, 1922, 1944, 1927, 1965
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 Family Composition Affidavit I, Tak Cheong LEE, of 10-C Castle Court(Housing Project), Boston, Mass., 02118 declare under oath: that I was born in Toyshun,Canton, China of Lee Wan Young (father) and NG Show Yen, on Feb. 24, 1907; my parents are deceased; father they died in Vancouver, P.C., Canada before I came to this country in 1955.I do not know the date of bis death; my mother died in Toyshun, Canton, China about 1960,after I came to U.S. 1 believe my father died in 1944,but I am not sure; Icame to U. from Hong Kong, B.C.C. Y-12, Oct.1, 1955 at SanFrancisco, Cal., file A10 517 306; were that in our family there three children; I have this date filed visa petitions for my two married sisters: Lam,Ly Yuet 01 (nee L1, Yuet oi) who was born April 8,1922; she is married to Lam,Chiu Yin, who was born in China 10/29/20: they have three children: Lam.Woon \"ing(m).b. 1945: FOIA (b)(6 FOIA (b)(6) all were born in China and reside in Hong Kong, B.C. C. My sisters(2) were born in the same place as I, Toyshun, \"anton,China; my other married sister is NG, Lee Chun 01 (nee Lee, Chun 01 ) born May 4, 1927; she is married to NG.Sze Kui. born KH In China Sept. 8,1923; they have a FOIA (b) (6) FOIA (b)(6)in China;they live an Hong Kong, B.C.C.; I came to Hong Kong, BCC in 1949 from mainland China and that is when I last saw my two sisters; they were already married: 1 then came to U.S.in 1955 and I haveletters from them d ated 1962; I had other letters from them from Hong Kong but my wife threw them away; I have my two sisters' family photographs. \"T own wife and three children came from Hong Kong, Bcc in 1962; when I sent my wife money and support when they were there, and she would help my married sisters;however now they arrived as residents, and I have not sent them funds; I wish to make these statement to support my visa petitions for my two married sisters as I have no other evidence. Yak Ghang Tak heong Lee firths Sworn to before me,this 19th of May 1971 Carolyn D. Jackym, NotaryPublic comm.expires 12/7/73 :cj Note: is Choi, Fong LEE, arrived 12/29/62, at Anchorage, Alaska,A13 144 29( she was born 12/23/10;my daughter is Chin, Bile sim FOIA (b)(6 born 5/20/37.a dusted 3-2. Boston. Masn. Feb. 11. 1965. FOIA (b) (6) another FOIA (b)(6) FOIA (b)(6) all were born in China My son, dward Yinbong LRE was naturalized S.District Boston, Mass. ,12/23/68 cort.9102749 fine pot. 373071-- he arrived with my wife, 12/29/62,born Mar.2,1947 in China. Two letters to me from Hong Kong, BCC attached, also."
}
