{
  "anumber": "A10534184",
  "id": "A10534184_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application by Lawful Permanent Resident for New Alien Registration Receipt Card, Form I-90 ( (Rev. 4/11/91) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Application by Lawful Permanent Resident Immigration and Naturalization Service (INS) for New Alien Registration Receipt Card Instructions Read the instructions carefully. If you do not follow the instructions, we may have to return your application, which may delay final action. 1. Who can file? 5. What is the fee? You may file this form only if If you check (a) or (b) of item 18 \"Reason for New Card\", you must pay seventy dollars ($70.00) to file you are a lawful permanent resident of the this form. The fee will not be refunded, whether the United States and application is approved or not. DO NOT MAIL CASH. you need a new card. All checks or money orders, whether U.S. or foreign, must be payable in U.S. currency at a financial 2. What documents do you need? institution in the United States. When a check is drawn on the account of a person other than A. If you have your old card, you must give it to INS yourself, write your name on the face of the check. If with this application. the check is not honored, INS will charge you $5.00. B. Give the INS two color photographs of yourself taken within 30 days of the date of this Pay by check or money order in the exact amount. application. These photos must have a white Make the check or money order payable to background. They must be glossy, un-retouched, \"Immigration and Naturalization Service\". However, and not mounted. The dimension of the facial A. If you live in Guam: Make the check or money image must be about 1 inch from the chin to the top of hair; your face should be in 3/4 frontal order payable to \"Treasurer, Guam\", or view, showing the right side of the face with the B. If you live in the U.S. Virgin Islands: Make the right ear visible. check or money order payable to \"Commission of Finance of the Virgin Islands\". Using pencil or felt pen, lightly print your name (and Alien Registration Number, if you know it) on the back of each photograph. 6. What are the penalties for submitting false information? 3. How should you prepare this form? Title 18, United States Code, Section 1001 states that A. Type or print legibly in ink. whoever willfully and knowingly falsifies a material fact, makes a false statement, or makes use of a false B. If you need extra space to complete any item, document will be fined up to $10,000 or imprisoned attach a continuation sheet, indicate the item up to five years, or both. number, and date and sign each sheet. C. Answer all questions fully and accurately. If any 7. What is our authority for collecting this information? item does not apply, write \"N/A.\" We request the information on this form to carry out the immigration laws contained in Title 8, United 4. Where should you file this form? States Code 1304(c). We need this information to A. If you are in the United States, take this determine whether a person is eligible for application form in person to the INS office immigration benefits. The information you provide having jurisdiction over your place of residence. may also be disclosed to other federal, state, local, and foreign law enforcement and regulatory B. If you are outside the United States, take this agencies during the course of the investigation application form in person to the United States required by this Service. You do not have to give this consulate or INS office that has jurisdiction over information. However, if you refuse to give some or the place where you are now living. all of it, your application may be denied. It is not possible to cover all the conditions for eligibility or give instructions for every situation. If you have carefully read all the instructions and still have questions, please contact your nearest INS office. Reporting Burden Public reporting burden for this collection of information is estimated to average 30 minutes per response, including the time for reviewing instructions, searching existing data sources, gathering and maintaining the data needed, and completing and reviewing the collection of information. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: U.S. Department of Justice, Immigration and Naturalization Service (Room 5304), Washington, D.C. 20536; and to the Office of Management and Budget, Paperwork Reduction Project, OMB No. 1115-1004, Washington, D.C. 20503. Form I-90 (Rev. 4/11/91) Y"
}