{
	"anumber": "A10517306",
	"id": "A10517306_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 8/25/2023, G-325B"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Samoa", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950, 1946, 1939, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "which (9) this petition is made for at least six months immediately preceding the date of this petition, and I have been physically present in (If petition filed under Section 316(a).) I have resided continuously in the United States for at least five years and continuously in the the State United in States for at least one-half of such five-year period. (a).) I have resided continuously in the United States in marital union with my present spouse for at least three (10) (If years petition immediately filed under preceding Section the date of this petition, during all of which period my said spouse has been a United the State States in citizen, which this and petition have been of three-year period. I have resided continuously in is physically present in the United States at least one-half such made at least six months immediately preceding the date of this petition. of United States, in the employment of the Government of the (11) (If petition is filed under Section 319 (b).) My present spouse is a citizen the institution of research recognized such by the Attorney General, or an American firm or corporation engaged in United States, or of an American as whole or in part in the development of foreign trade and commerce of the United States, or subsidiary thereof, or of a public international organiza- religious tion which United States participates by treaty statute, or is authorized to or perform the ministerial the or priestly functions of a in is engaged solely missionary by religious denomination or by an denomination having a bona fide organization within the United States, or as a a mission organization having a bona fide organization within the United States, and such spouse is regularly stationed abroad in interdenominational I intend in good faith upon naturalization to live abroad with my spouse and to resume my residence within the United States such employment. immediately upon termination of such employment abroad. aggregating is filed under Section 328.) I have served honorably in the Armed Forces of the United States for a period or periods three (12) (If years. petition I have never been separated from the Armed Forces of the United States under other than honorable conditions. If not still in service, terminated within six months of the filing of my petition. my (13) service (If petition is filed under Section 329.) While an alien or noncitizen national of the United States, I served honorably in an active-duty status in the military, air, or naval forces of the United States during either World War I or during a period beginning September 1, 1939, and ending December 31, 1946, or during a period beginning June 25, 1950, and ending June 1, 1955, or during a period beginning 19 or I was discharged after five years of service under the Act of June 30, 1950 (P.L. 597, 19 and ending honorable conditions. At the time of enlistment, reenlistment, induction 81st Congress). If separated from such service, I was separated under or I was in the United States, residence the subsequent Canal Zone, to enlistment or induction. I was never separated from such service on account of alienage. I was not a American Samoa, or Swains Island. If not in any of these places, I was lawfully admitted to the United States conscientious for permanent objector who performed no military, air, or naval duty whatever or refused to wear the uniform. I have not previously been naturalized on the basis of the same period of service. (14) the date of this petition, a member of or affiliated with any organization proscribed by such Act, or any section, subsidiary, branch, affiliate by such or Act. (15) I am not and have not been, within the meaning of the Immigration and Nationality Act, for a period of at least 10 years immediately preceding sub- division thereof, nor have I during such period believed in, advocated, engaged in, or performed any of the acts or activities prohibited character, attached the principles of the Constitution (16) 1 am, and have been during all the periods required by law, a person of good moral to States and well disposed to the good order and happiness of the United States. of the United (17) It is my intention the Immigration in good and faith Nationality to become a Act, citizen and of to the reside United permanently States and in to the take United States. qualification I am willing, when required by law. to bear without the oath of renunciation and allegiance prescribed arms on behalf by of the United States, to perform noncombatant service in the Armed Forces of the United States, and to perform work of national im- portance under civilian direction (unless exempted therefrom). language (unless exempted therefrom), and I have a knowledge and understanding of the funda- (18) I am able to read, write, and speak the English mentals of the history, and of the principles and form of government of the United States. (19) Attached hereto and made part of this, my petition for naturalization, are the affidavits of at least two verifying witnesses required by law, and supplemental affidavit on Form N for naturalization subscribed by me, and that the same are true to the best of my knowledge and belief, and that this petition is signed by me (20) Wherefore I pray that I may be admitted a citizen of the United States of America. I swear (affirm) that I know the contents of this petition with my full, true name so HELP ME GOD. Roken inkCheme (Full, petitioner, true, and without correct see abbreviations) signature of (27 Reduction 6I pun Reduction 61 6 das rap pur 134 (6) (i) ISITI ESI JO no (I) IOI rmant TNON JMV : TNON THON ovem n : runn T2 s AIN YMAE aeuis MM aquis -491 -77, ing's sb (2) 7/3 (I) 10s Paulog p.p. WOIL u! pug of WOIJ u! or WOIL u! of WOIL u! spunding OL : and 28 R CHINEC Y/G 7405 ON 410 4/8 1/8 e NOILOV NOILVNINVX3 LTASHH Kg"
}
