{
  "anumber": "A10534184",
  "id": "A10534184_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Form, I-170"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "MARITAL STATUS: S( M() D( SEX: MALE( FEMALE N() HEIGHT: ft. 5 in. 5 Sec. of Law COUNTRY OF FORMER NATIONALITY 316(a) ) 328 orlex ( ) 319(a) ) 319b File NC. A/O 534 184 ( ) 405 ( ) 329 JUL 15 FIKAL ACTION English: INITIAL INTERVIEW Speaks 5/20 Date/and Reads 1720 Initials Writed 1993 C 3 Denial: Date & Initials C , withdraval: Date c Initials Government: INS Test OK STAND. TEST C 1 Oath Taken: Certificate issued. REEXAM: Date and Initials ACTIOX OR DOCUMENTS STILL REQUIRED Documents presented: ARC: A/O 534184 SIR See accashed K-14 ( ) Reexamination Other ( Visa File DOB: 05-12-12 ( 3 Post audit POE/COE ELP-01m DOE 08-18-55 Review Vean tale APPROVED INJS DISTRICT DIRECTOR CID/CDL: RECORMEHDATION: Date and JUL Initials 15 1993 COMMENTS: NAZI NEG in JUL Like 20 MONTH RESIDENCE OKAY LOS 4388 NEG 40 Had Glien smugslening 1981 need no to Calif Review I 0. tile. or Diniers OATH Lican OF Q&A. ALLEGIANCE Space in Mexicos. Claims he Wow not propecant Approval (stamp) ( J Modified Oath. Delete part(s) Oath with INS C ] Promise to Bear Arrs. ( J Koncombat Duty none Oath with Court X Court No. 246 NAME CHANGE I HEREBY DECLARE, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity CO and foreign prince. pocentate, state, or sovereignty of whom or which I have heretofore been & subject or citizen: that I will support and defend the Constitution and the laws of the United States of America against all cacaies, foreign and domestic; that I will bear crue faith and allegiance to the same; that I will bear arms on behalf of the-United States when required by the law: that I will perform noncoabatant service in the Armed Forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely without any mental reservacion or purpose of evasion: so HELP KE COD. In acknovledgement whereof I have hereuato affixed my signature. X Viecsile de Signature la Hoya Sanchez may form Day be overminted or stamped to show instructions, items requested, items received, or other per tinent data which my assilitate processing. Keep this choose as top of all material in file undi Lattial decision Is sade = 1-100 EV. 23-2-70!"
}