{
	"anumber": "A10534184",
	"id": "A10534184_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534184_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, FORM 1-550 ( (REV. 7-1-70Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1940, 1972, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED. IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 APPLICATION FOR VERIFICATION OF FEE STAMP LAWFUL PERMANENT RESIDENCE OF AN ALIEN Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, In connection with immigrant visa application(s) of my relative(s) listed in item 15 below, I request that the American Consul at Tijuana, B. C. , Mexico be furnished a verification of my lawful admission into the United States for (City and Country abroad) permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: De la Foya, Vicente , Sanchez A 10 534 184. 3. MAILING ADDRESS U.S. (Nu nber and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) P.O. box 1523, Calexico, Calif. # 05 12 12 5. MY FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) Enni anrique de la Hoya. Durango, Dgo. Mex. 7. MY MOTHER'S FULL MAIDEN NAME: 8. 1 AM NOW A CITIZEN OF: (Country) Constanza Sanchez. Mexico INFORMATION IN THESE BLOCKS PERTAINS TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. MY U.S. PORT OF ARRIVAL WAS: De la Hoya, Vicente Sanchez El Paso, Texas. 11 MY DATE OF ARRIVAL WAS: (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS: (Show Name of Vessel or Airline and Flight No., etc.) 08 18 55 afoot. 12. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM LWAS DESTINED: E1 Paso, Texas. 08 17 55 Ciudad Juarez - 13 I first obtained an immigrant visa at a United States consular office abroad on at At that (date) Chabba Mex. time, I was was not married. (chez 14. Including my present marriage I have been married two times. The name of my present spouse is: Dolores Torres San whom I was married on Oct. 26,1972 Luis B. Sanchez If married more than one time, list below names of previous spouse(s) and (date) places and dates of marriage and explain how marriage(s) were terminated: Guadalupe Salas (location) de de la Hoya married on Nov. 6, 1936 at villa Ignacio Ra irez,Dgo., Mex. divorced on may ,1972. 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME ( la Hoya. DATE AND PLACE OF BIRTH Dolores Torres Sanchez. de de - March 15, 1940.-San Juan Peyotan, Nay. RELATIONSHIP ADDRESS Mex. wife. Ave. Tabasco No. 702.Col. Loma Linda, Mexicali, B.C., Mex. FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FEB 6 1973 16. FULL SIGNATURE OF APPLICANT AS NOW USED G-360 SENT Vicente dela nton a FORM I-550 (REV. 7-1-70)Y"
}
