{
	"anumber": "A10551867",
	"id": "A10551867_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10551867_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice OMB #1115-0009 de Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family 3 DELEON VDA. Given Name Juliana Middle Garcia Initial U.S. Mailing Address - Care of Resubmitted Street Number Name 4213 MICHIGAN Ave Apt. and # 007 001 R 4 06/14/94 7:16 N400 90.00 City Los ANGELES County State ZIP Code 90063 Reloc Sent CALIFORNIA Date (month/day/year) of Birth 01/27/15 Country of Birth MEXICO Social A Security # 460-62-1066 10 551 867 Reloc Rec'd Part 2. Basis for Eligibility (check one). a I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. FEB 15 995 and have attached completed Forms N-426 and G-325B e. Other. (Please specify section of law) Q At interview request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 05-08-56 ELP 0-1 Citizenship MEXICAN Name on alien registration card (if different than in Part 1) De Leon Uda. de Garcia Other names used since you became a permanent resident (including maiden name) De Leon Sex Male Height Marital Status: Single Divorced Female 14-11 Married Widowed 316(a) Can you speak, read and write English ? XNO Yes. Action Absences from the U.S.: I.N.S APPROVED DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate FEB 16 1995 paper. Did absence last Recommended New HR by: Date left U.S. Date returned 6 months or more? Destination Reason for trip LOS 4387 3/20 3/30/93 Yes No Mexico Vacation To Be Completed by 10/8/92 10/2/29 Yes No Mexico Vacation Attorney or Representative, if any 3/4/91 3/18-91 Yes No Mexico Vacation Fill in box if G-28 is attached to represent the applicant 10/8-90 10/22/90 Yes No Mexico Vacation VOLAG# 3/10-89 3/25-89 Yes No Mexico Vacation 3/4-88 Yes No Moxico Vacation ATTY State License # Form N-400 (Rev. 07/17/91)N (2) no the Continued on back. JUN 15 1994"
}
