{
	"anumber": "A10534406",
	"id": "A10534406_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10534406_0015/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR A GRANT VISA AND ALIEN REGISTRATION, Form FS-26aA"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 1952, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1 Form FS-256a (Revised August 1952) FOREIGN SERVICE OF THE UN ED STATES OF AMERICA Approved Bureau Budget No. 47-R108.2 APPLICATION FOR LIVE RANT VISA I- 962307 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul at CIUDAD JUAREZ, CHIHUAHUA, MEXICO. 1. Family name Given name Initial 2. Place and date of birth Age MALDONADO MALDONADO. RUBEN Pueblito de Allende, Chih., Mex. 31 Dec., 1914. 40 3. Other names by which I have been known 4. Last permanent residence NONE Ave. Cerveceria 1205, Juarez, Chih., Mex. 5. Address in the United States 6. Name and address of person to whom destined, if any 1416 2nd., St., .Apt 16, El aso,Tex. Maria de Jesus Maldonado de Grisalde-sister add. as it. 7. Name and address of nearest relative in home country 8. Travel documents presented Guadalupe Maldonado Vda. de aldonado- mother- Mex. ppt Calle Sanchez 925, Juarez, Chih. Mex. 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Mexi can white . blk. brn M Married Single 14. Complexion 16. Ethnic Classification 5 ft. 5 in. 150bs dk Mexi can F Widowed Divorced 19. Occupation 20. Distinguishing marks sm.scar under 121 Languages spoken, read, or written driver. none--mouth Spanish 22. Intended United States port of entry 23. Final destination 24. I have (a) (no) 25. Purpose of going to the United States through ticket to E1 Paso, Texas. add. as it. 5. destination no To work. 26. Places of previous residence Juarez, Chih., Mex. , Pueblito de Allende, hih. Mex. 27. Names and places of residence of spouse and minor children Lidia Ibarra de Maldonado- wife- Immigrating same date, Maria Leticia, Gaadalupe Maldonado Ibarra- Immigratin game date 28. Name and address of father 29. Name and address of mother Santiago Maldonado- deceased. Guadalupe \"aldonado Vda. de Maldenade add. as it. 7. 30. I claim to be a nonquota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)) following facts: Medical Cert. Birth Cert. Born in Mexico Marriage Cert. Police If Aff. of support. 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: I have never been arrested-Nunca he sido arrestada. 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: Probably V. R. on 1948. 16-67444-2 (Application continued on reverse side)"
}
