{
	"anumber": "A10643620",
	"id": "A10643620_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10643620_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Foreign Service of the United States, Form FS-260a (Revised August 1932)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 1956, 1911, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1 Form FS-256a (Revised August 1952) FOREIGN SERVICE OF THE UNITED STATES OF AMERICA Approved Bureau Budget No. 47-R108.2 APPLICATION FOR IMMIGRANT VISA I- 837190 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American VICE Consul at MANAGUA NICARAGUA : 1. Family name V-432 Given name Initial 2. Place and date of birth Rivas, Nicaragua. Age VALDEZ Martinez, Concepcion February 13, 1911. 45 3. Other names by which I have been known 4. Last permanent residence None Rivas, Nicaragua. 5. Address in the United States 6. Name and address of person to whom destined, if any 230 So. Indiana St., Los Angeles, Calif. Sister, Dolores Valdez M. See 5. 7. Name and address of nearest relative in home country father, 8. Travel documents presented Nic. ppt 5663 iss.by Antonio Valdez. Rivas, Nicaragua. THE MINISTRY OF EXTERNAL RELATIONS on March 22, 1956 AT MANAGUA, NICARAGUA valid March 22, 1957 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status NICARAGUAN Spanish-American M Married Single 135 14. Complexion 16. Ethnic Classification black brown 5 ft. 5 in. lbs. brown Spanish-American F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Dressmaker None SPANISH 22. Intended United States port of entry 23. Final destination 24. I have (a) (1XOX 25. Purpose of going to the United States through ticket to Los Angeles, Calif. Los Angeles Cal destination to resile and work 26. Places of previous residence 27. Names and places of residence of spouse and minor children 28. Name and address of father see 7 29. Name and address of mother Lola de Valdez, Rivas, Nicaragua. 30. I claim to be a fnonquota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)) : following facts: Sec. 101 (a) (27) (c) I was born in the Republic -of Nicaragua, a non-quota country. BIRTH CERTIFICATE HEALTH CERTIFICATE X-RAY GOOD CONDUCT CERTIFICATE 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty except xschepeinafter st 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, XSCNU 34. I have never been excluded, deported, or removed from the United States at Government expense, 16-67444-2 (Application continued on reverse side)"
}
