{
  "anumber": "A10706964",
  "id": "A10706964_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10706964_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "En nombre de la República de México y común Oficial, A"
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2008,
        1938
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "En nomber la Reprblica de México y como Oficial dei Regist Cibil de este lugar, hagn saber a loa que la presente vieren Certifico ser cierto que en pl libro número 1.9 Como del Re- gistro Cibil que is a mi cargo, a la foja[s] núme~ ae encuentra asentada una acta del tenor siguiente: Act No. 198 Mori- 7.1 R.fugio Hern-ndaz 9/16 27 -nos tuber- culosis pulmon-1 casado Concernina/ 11 Centro.-- Acts de Refuncion No. 198 en Concording Municipio go S-n P aro, co-h. A las 11 horos 21 dio 16 To Septiembre ae 1938 -nt mi Osiris Flor's Ofieia] Registro Civil comparecio el Sr. Albino Mote casodo ae 51 -ños oficio jorn-lero It compo origin-rio n In Hdo. 2.2 mezquit., 2008, y Vocino do Son Frencisco do Gurzo y express quo -1 dio 16 do Sept. Ins 3-30 horos follenio su aspos en Concordi- ae tuberculosis pulmon=r Mari- 2 1 R fugio Hernondez de 27 años hijo 202 SI. pedro Hernandez y go 1- Sra Ang-1 Martin-z que viven el comper ent oyo esto artn y S° conformó con su contanido on presincia is I-s SDS Arcadio Sanchez y cruz Sonchez y verinos go San From noisco ae Gurzo S mento inhumar al codever en I campo mortuorio ae Concordin : firman los qu supi ron 20y fo. Osiris Flores Rubricos. Albino Mota cruz Sanchez Arcadio Sanchez. Kis capio fisimente sacado as su origin-1 : pedininto do poste interes-do se atoriza 10 prent- Dorn los usos que hoys lugar. Concordio, cooh. to g Septi-mbre 20 1956. de SUFRAGIO EFECTIVO NO Restriction. Oficial 201 Registro Civil Sontingo R. st-ñeda DONCORDIA,"
}