{
	"anumber": "A10706964",
	"id": "A10706964_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10706964_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Intent to Join Step-Mother in the United States,, A8 795 331."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1954, 1956, 1947, 1953, 1957, 1927]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "TO the HONORABLE AMERICAN CONSUL, CIUDAD JUAREZ, CHIHUAHUA. MEXICO. STATE OF TEXAS COUNTY OF EL PASO 0 BEFORE ME, F. R. Cuellar, a Notary Public in and for the State of Texas, County of El Paso, on this date personally appeared Mr. Enrique Mota Hernandez, known by me to be the person whose name is signed to this Affidavit, and after being by me duly sworn, deposes and states as follows: I, Enrique Mota Hernandez, 29 years of age, resi- ding at 7421 Dale Rd., El Paso, Texas, do hereby certify that I am a citizen of the United States of America, born on September 14th, 1927 at El Paso, Texas; employed by Mr. John T. Bean at his farm, receiving $2.05 per 100 pounds picking 1517-C cotton and $3.00 per 100 pounds picking S-1 Pima Cotton; picking 400 pounds a day; wor- king 6 days per week, making an income of about $40.00 per week; I have personal property valued at about $500.00; I have a Ford 1947 valued at $245.00; I am single and with no dependents; I signed one affidavit of support before for my father Albino Mota Chariez on 1954 and another one for my brother-in-law Jesus Ferniza on 1953. That, is my intention and desire to have my step- mother Maria Filemon Soto Mota, 46 years of age, citizen of Mexico residing at Ciudad Juarez, Chihuahua. Mexico, enter the United Sta- tes of America legally to join my father Albino Mota Chairez, 69 years of age, citizen of Mexico lawfully admitted into the United States on December 16th, 1954 at El Paso, Texas, passport number A8 795 331; if the Honorable American Consul will issue the required Consular Visa to my step-mother, I am willing and able to see that she will not become a public charge or a burden of charity while she may be within the boundries of the United States of America. Further affiant, deposes not. Enrique mota Hemmandez ENRIQUE MOTA HERNANDEZ SUBSCRIBED AND SWORN, to before me by Mr. Enrique Mota Hernandez, this the 1st, day of October, 1956 MI or, eu NOTARY PUBLIC, in and for the State of Texas, County of E1 Paso. My commission expires June 1st. 1957."
}
