{
  "anumber": "A10706964",
  "id": "A10706964_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10706964_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Marriage License"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        1956
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CERTIFIED COPY O ECORD O No. 36457 RRIAGE NO. 11590 APPLICATION FOR MARRIAGE LICENSE STATE OF NEW MEXICO, ss. TO THE COUNTY CLERK: County of Dona Ana. I hereby make application for a license to unite in marriage with Maria Filimon Benitez Soto whose age is 45 I certify I was born at La Hacienda de Mescuite Zac. Mex. on the 16 day of Dec. 18869 ; that I am now a resident of El Paso, Texas that we are not related within the degree prohibited by the laws of this State; that neither of us is bound by marriage to another; that there exists no legal impediment to said marriage. S/ Albino Mota Subscribed and sworn to before me this 8 day of March A. D. ,56 , (SEAL) By Andres D. vedillo, J. P. County Clerk. I hereby make application for a license to unite in marriage with Albino Mota whose age is 69 I certify I was born at Guazamala Gro, Mexico on the 12th day of December 1910 ; that I am now a resident of Cd. Juarez, Mexico that we are not related within the degree prohibited by the laws of this State; that neither of us is bound by marriage to another; that there exists no legal impediment to said marriage. S/ Maria Filimon Benitez Soto Subscribed and sworn to before me this 8 day of March A. D. ,56 (SEAL) By Andres D. Cedillo Justice Deputy he eace County Clerk. CONSENT OF PARENT OR GUARDIAN No. (Where either party is under age) I, hereby consent to the granting of a license to marry, waiving the question of minority. CONSENT OF PARENT OR GUARDIAN No. (Where either party is under age) I, hereby consent to the granting of a license to marry, waiving the question of minority. Marriage License STATE OF NEW MEXICO COUNTY OF DONA ANA, SS. To any person Authorized by law to perform the Marriage Ceremony GREETING: YOU ARE HEREBY AUTHORIZED TO JOIN IN MARRIAGE Albino Mota of E1 Paso, Texas and Maria Filimon Benitez Soto of Cd. Juarez, Chih. Mexico and of this license you will make due return to my office within the time prescribed by law. WITNESS my hand and Seal of said Court at Las Cruces, this 9th day of March , 19 56 . (SEAL) Constance P. Chavez By Deputy. County Clerk. Recorded March 9th 1956 2150P M., in Marriage Record Book No. 80 Page 36457 Constance P. Chavez (SEAL) County Clerk. By Deputy. COOO wour VALLIANT PRINTING CO., ALBUQUERQUE-79791"
}