{
  "anumber": "A10706964",
  "id": "A10706964_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10706964_0012/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Form B-26a (Revised July 1947)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        1910
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1 Form FS-256a (Revised August 1952) FOREIG ERVICE OF THE UNITED STATES OF AMERICA Approved Bureau Budget No. 47-R108.2 APPLICATION FOR IMMIGRANT VISA I- 1504449 AND ALIEN REGISTRATION A -10706964 - I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul at CIUDAD JUAREZ, CHIHUAHUA MEXICO : 1. Family name Given name Initial 2. Place and date of birth Age MOTA, Maria Filemon Soto de Cutzamala, Guerrero Dec. 2,1910 46 3. Other names by which I have been known 4. Last permanent residence Benitez Maria Filemon Soto Mejia No. 159 Cd. Juarez, Chih. 5. Address in the United States 6. Name and address of person to whom destined, if any 7421 Dale Rd. El Paso, Texas US Res Husband- Albino Mota- Add. same as #5 7. Name and address of nearest relative in home country Cd. Juarez, Chih 8. Travel documents presented Uncle- Daniel Benitez- Cjon. Justo Sierra 760 WAIVED E 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Mex. White M Married Single Brown Brown 5 114 14. Complexion 16. Ethnic Classification ft. in. lbs. Med. Mex. F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Home duties none Spanish 22. Intended United States port of entry 23. Final destination 24. I have (a) (no) 25. Purpose of going to the United States El Pago, Texas see item #5 through ticket to destination no Reside join husband 26. Places of previous residence Cutzamala, Guerrero Mexico D. F. Cd. Juarez, Chih. 27. Names and places of residence of spouse and minor children Husband- Same. 28.#6 Mexico D. F. Colonia Children- Adolfo, Benitez Soto- Tacuballa Ave. Jalisco 62 28. Name and address of father 29. Name and address of mother UNKNOWN Deceased ariana Soto 30. I claim to be a nonquota \\preference quota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: Med. Certificate Certificate of Unavailability Aff. in lieu of Birth Cerf. Baptism Certificate Born in Mexico Marriage If Aff. of Support Police 11 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: I have neyer been arrested (nunca he sido arrestada). 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: ) 16-67444-2 (Application continued on reverse side)"
}