{
  "anumber": "A10891711",
  "id": "A10891711_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0042/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, I-1948085"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        1956,
        1905,
        1938
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SPACE FOR BURGER STATES OF AMERICA THIS PLICATION FOR IMMIGRANT VISA I- 1948085 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul at CONSULATE GENERAL TORONTO, CANADA 1. Family name Given name Initial 2. Place and date of birth Age STANGEL Herbert Oct 28, 1905 Vienna Austria 511 3. Other names by which I have been known 4. Last permanent residence 20 Gardenvale Rd.Toronto 18 Ont . Can. 5. Address in the United States 2600Ridgway Rd. 6. Name and address of person to whom destined, if any Aeronautical Division Minneapolis 13 Minnesota Minneapolis-Honeywell Regulator Co. 7. Name and address of nearest relative in home country 8. Travel documents presented Mrs. Stangel same as no 4 British PP 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status brn brn 61 210 British white M Married Single 14. Complexion 16. Ethnic Classification ft. in. lbs. fair Austrian F Widowed Divorced 19. Occupation 20. Distinguishing marks index and 21. Languages spoken, read, or written Electrical Engineer middle finger amp left hand nil English German 22. Intended United States port of entry 23. Final destination 24. I have (X) (no) 25. Purpose of going to the United States through ticket to destination somelegal port Minneapolis Minn. to reside 26. Places of previous residence at the age of 14 residing at Vienna Austria; 1938 Glasgow Scotland; 1952 Toronto Ont. .Can to date. 27. Names and places of residence of spouse and minor children Wife; Milada same as no 4 Child; Rosemary same as no 4 28. Name and address of father 29. Name and address of mother Hermann deceased Geminder Sofie deceased 30. I claim to be a \\preference quotaj immigrant and my claim is based on the noxquxtXX 31. Available documents required by the Immigration and Nationality Act are following facts: filed herewith and made a part hereof, as follows (Sec. 222 (b)) Selected Immigrant Birth Cert 1st preference Austrian 203 (a) (1) T-1 Police Cert from RCMP Pet. No. VP-10-I-250 App. Date. Dec 7, 1956 filed Date. Nov 23, 1956 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: nil 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: nil 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: nil 16-67444a-3 (Application continued on reverse side) Salo 18 it"
}