{
	"anumber": "A10891712",
	"id": "A10891712_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application to File Petition for Naturalization, N-400 ( (Rev. 3-1-61)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1958, 1962, 1938, 1957, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form approved. Budget Bureau No. 43-R079.7. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as It appears on your alien reg- Mail or take to: istration receipt card, and the number of your card. If you did not register, so state.) IMMIGRATION AND NATURALIZATION SERVICE SERVICE Name Milada A, STANGEL No. 10891712 APR 30 SAPPLICATION TO FILE PETITION FOR NATURALIZATION (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) I desire to file a petition for naturalization in the- Date: April 28,1962 FLURIDA Pinellas County Clearwater Florida Court at (Name of Court) (City) (State) Milada Antonia STANGEL (Print or type here your present full name only) 900 S.Highland Ave. Clearwater, Florida (Print or type present apartment number, street address, and if appropriate \"in care of\") Clearwater Pinellas Florida (City) (County) (State) Milada Antonia Benedik (Print or type here any other name you have ever used, including maiden name) (1a) Was your father or mother ever a United States citizen? Yes No. If \"Yes\" explain fully separately. (1b) Can you read and write English Yes No. Speak English? Yes No. Sign your name in English? Yes No. (2) In what places in the United States have you lived during the last 5 years List present address first. FROM To- STREET ADDRESS CITY AND STATE (a) March 19.1 PRESENT TIME 900 S.Highland Ave Clearwater Florida (b) December 19 60 March 1961 1575 Palmetto Street Clearwater Florida , (c) October 271958 December 1958 Glasshouse Motel Clearwater Beach, Florida (d) May 1957 October 19.58 3237 Girard Ave. S. Minneapolis, Minnesota (e) April 27 1957 May 15 1957 Oak Grove Hotel V Minneapolis, Minnesota (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment first. OCCUPATION OR TYPE FROM To- EMPLOYER'S NAME ADDRESS OF BUSINESS (a) 19 none PRESENT TIME (b) 19 , 19 (c) 19 19 Johnnewater T (d) 19 19 (e) 19 ,19 (4) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following informa- tion for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED COMPANY, ,OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You DATE RETURNED RETURNED TO THE UNITED STATES UNITED STATES Visited Nassau the time for much end 2 (5) How many times have you been married? once How many times has your husband or wife been married? twice If either of you has been married more than once, fill in the following information for each previous marriage. (Check one) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED Sex PERSON MARRIED WAS How MARRIAGE ENDED CITIZEN ALIEN (a) 1938 Pauline Stangel Divorce (b) (c) (d) Form N-400 (Rev. 3-1-61) (1) (OVER)"
}
