{
  "anumber": "A10891711",
  "id": "A10891711_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0007/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATEMENT OF FACTSS FOR PREPARATION OF PETITION, 10891711"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1958,
        1905,
        1931,
        1957,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "form 3 ALIEN REGISTRATION STATEMENT OF FACTS FOR PREPARATION OF PETITION Name Herbert STANGEL SECTION OF LAW 316() No. 10891711 (1) My full, true, and correct name is Herbert STANGEL (Full, true name, without abbreviation) (2) My present place of residence is 900 S.Highland Ave. Clearwater Pinellas Florida (Number and street) (City or town) (County) (State) (3) My present occupation is Senior Development Engineer 10 28 (4) I was born on 1905 in Vienna Austria (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) (5) My personal description is as follows: Sex male ; complexion fair ; color of eyes brown ; color of hair brown ; height 6 feet 2 inches; weight 185 pounds; visible distinctive marks missing joints fingers ; country of which I am a citizen, subject, or national Groat Britain ENglANd (6) I (am, am not) married; the name of my wife or husband is Milada Antonia HEF. we were married on March 30 1939 at Glasgow Scotland (Month) (Day) (Year) (City or town) (State or country) he or she was born at Vesely Moravia Czechoslovakia (City or town) (County, district, province, or State) (Country) on December 18 1905 ; entered the United States at Detroit (Month) (Day) (Year) (City or town) Michigan on April 27 1957 for permanent residence in the United States and (State) (Month) (Day) (Year) with me; now resides apart from me at ; (Show full address if not living with you) and was naturalized on Not at (Month) (Day) (Year) (City or town) (State) Certificate No. or became a citizen by (7) I have two living children, as follows. (Complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise, give child's full address.) NAME Sex PLACE BORN DATE BORN Now LIVING AT- Doris Johnson F Vienna 7-15-1931 Southampton, England Rosemary, Lillian Stangel F Glasgow, Scotland 1-10-1939 with me (8) My lawful admission for permanent residence in the United States was at Detroit Michigan ; (City or town) (State) under the name of Herbert STANGEL on April 27 1957 (Month) (Day) (Year) on the Ambassalou Bridge tryvelled in my own car H (Name of vessel or other means of conveyance) (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows (if none, state \"None\") : DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES PORT DATE VESSEL OR OTHER MEANS PORT DATE VESSEL OR OTHER MEANS (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE (10a) I have resided continuously in the United States of America since April 27,1957 and continuously in the State of Florida where I now live since October 27,1958 and during the past 5 years I have been physically present in the United States for an aggregate period of 60 months. (OVER) (10b) Do you intend to reside permanently in the United States? Yes No. If \"No,\" explain:"
}