{
  "anumber": "A10891711",
  "id": "A10891711_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS TO APPLICANT, I-151 Exhibited: Shows admission RECORDS EXAMINED FOUND"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS TO APPLICANT 1. A declaration of intention is not required for the purpose of filing a petition for naturalization or to become a citizen of the United States. 2. Show your Alien Registration number in the box at the top of page 1. 3 PHOTOGRAPHS.-You are required to send with this application three identical photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 by 2 inches in size, and the distance from top of head to point of chin should be approximately 11/4 inches. They must NOT be pasted on the cards or mounted in any other way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group or full-length portraits will not be accepted. All of these photographs must be signed by you on the margin and not on the face or the clothing. 4. DATE OF YOUR ARRIVAL.-If you do not know the exact date of your arrival in the United States, or the name of the vessel or port, and you cannot obtain this information by consulting your family or friends who came over with you, give the facts of your arrival as you remember them in the appropriate blank spaces on the first page of this form. Your Immigrant Identification Card or your passport, ship's card, or baggage labels, if you have them, may help you to answer these questions. If the date of your arrival in the United States was on or before June 29, 1906, you should submit with this application documentary evidence of your residence in the United States prior to that date. Such documents may be family Bible entries, deeds of record, wills or other authentic legal documents, life insurance policies, bank books and records, employment records or other documents showing that you entered the United States on or before June 29, 1906. Do not submit such documents if your arrival in the United States was after June 29, 1906. TO APPLICANT.-Do not write below this line. For use in searching Records of Arrival I-151 exhibited: Shows admission RECORDS EXAMINED RECORDS FOUND Card index Place Detroit, Michigan Index books Name Herbert STANGEL Manifests Date April 27, 1957 Manner auto Marital status married Slady (Signature of person making search) TO APPLICANT.-Do not write below this line. Contact Representative IMMIGRATION AND NATURALIZATION SERVICE, July 16 19.57 \" To CLERK OF COURT: Authorization is hereby granted for the issuance of a declaration of intention to the applicant named above, who has established that he is residing in the United States pursuant to a lawful admission for permanent residence, as alleged in the application. Polant (Signature) Way t h ROBERT L. WOYTYCH District By Contact Director Representative (This form should be attached to the duplicate declaration and returned at the end of the month with your report on Form N-4. The applicant has been directed to appear at your office within 90 days to make the declaration. If applicant does not appear within 90 days, return this form to this Service.) U. S. GOVERNMENT PRINTING OFFICE 16-11312-13"
}