{
	"anumber": "A10891712",
	"id": "A10891712_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0024/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Fingerprint Card"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Copied at the National the ON N Sex FEMALE Prisoner's No Name STANGEL, Milada (Mrs. Herbert) F.P. Code IIZ 13 Surname Given Names nee BENEDIK II 6 Aliases and Nicknames None Resident Address #20 Gardenvale Rd. Toronto 18, Ontario. Thumb Index Middle Ring Little 7 R 3 8 5 13 I G H T 7 7 12 6 L E F T T (IF ANY FINGERPRINT IS NOT RECORDED, GIVE REASON FOR OMISSION - IF AMPUTATED, GIVE DATE) a Left Thumb Right Thumb Four Fingers Taken Together Four Fingers Taken Together Signature of official taking fingerprints Signature of person fingerprinted (K.C. Brown/16829, Cst. Date 4-1-57 Milada Stangel Contributor R.C.M. Police, \"0\" Division, Toronto Town Station, Toronbo, ONT. (Please state name and address of Police Department, Gaol or Penitentiary. R.C.M.P., give Detachment, Sub-Division and Division.) Date Arrested Case Handled by N/A P.D. Date Rémanded to Citizenship British )] (State \"On Bail\" or In Custody\") Date Convicted Czechoslavakian ) Racial Origin Date Sentenced Birthdate 18th December 1905 Day Month Year Place Birthplace Veseli, Moravia, Czechoslava- City or Town Province or State Country -kia. Indicate if Juvenile Court Case If Foreign Born, Arrival Date in Canada 20-1-52 Day Month Year Offence(s) Apparent Age 51 Occupation housewife (State Section of Criminal Code) Height: Feet Ins Weight Build m Complexion Eyes Hair Sentence(s) Searc PECULIARITIES, MARKS, ETC. (More than one Charge state Concurrent or Consecutive) Fingery (Indicate abnormalities of features, amputations, scars, tattoos, deformities, etc.) Negative Results JAN 14.1957 R.P.B. HANSON Supt., Officer in Charge Identification Branch Ottawa Ont VISA m NOTE:-When this form is used for other than Criminal Purposes, state whether for Visa, Taxi or other Applicant FOR VISA PURPOSES ONLY IN CRIMINAL OFFENCES COMPLETE REVERSE SIDE - GIVE DATE PHOTOGRAPH TAKEN - CLIP HERETO, DO NOT PASTE"
}
