{
	"anumber": "A10891712",
	"id": "A10891712_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXTRACT OF AN ENTRY IN A REGISTER OF MARRIAGES, H 2174"
		},
		"years": {
			"ms_years_nlp_v1": [1922, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 1922. H 21747 EXTRACT OF AN ENTRY IN REGISTER OF MARRIAGES, kept in the undermentioned PARISH or DISTRICT, in terms of 17° & 18° VICTORIE, Cap. 80, §§ 56 & 58. (1) (2) (3) (4) (5) (6) (7) James (in full) of Parties, with Signatures. Name, Surname, and Rank or Profession If a Regular Marriage Signature and Designa- tion of Officiating Minister, and Signatures When and Where Registered, No. Usual Residence. of Father. When, Where, and How Married. Ran or Profession, and whether Bachelor, Spinster, Age. and Addresses of Witnesses. and Widower, Widow, or Divorced. If an Irregular Marriage, Date of Decree of Signature of Registrar. Name, and Maiden Surname of Mother: Declarator, or of Sheriff's Warrant. (Name in full) 1939 Herbert Stangel 33. 66 Hermannstangel WARRANT of 1939 On the Thirtieth brookston Drive Jeweller Sheriff-Substitute MARCH 31 00 day of MARCH (Signature) Herbert Stanger Sophie Stangel of Lanarkshire dated AT GLASGOW. at 124Se Nincent Scientificinotrumant GLASGOW. m.s. Geminder MARCH 30th Street GLASGOW. manufacturer 1939 (deceased (Signed) By Declaration, in presence of 736 (Divorced) DAVID RAMSAY Ronald Wilson Melada Benedik 33 (Name in full) 66 anton Benedik ASSIST. REGISTRAR. Boyd Morris Hillhead brookston Railway Ticket (!nitd.) J. G. L. Regr. House Kilbernie and milada (Signature) Benedik Drive Inspector John Hetcher White GLASGOW. (deceased) 23 Belmont Street anna Benedik Glasgow (Spinster.) m.S Stassny EXTRACTED from the REGISTER Book OF MARRIAGES for the DISTRICT of BLYTHSWOOD Registrar in the BURGH of GLASGOW , this 31° day of MARCH 1939 In terms of the 58th Section of the Act 17 & 18 Vict. c. 80, every Extract of an Entry in the Register Books kept by a Registrar under the provisions of the Registration of Births, Deaths and Marriages (Scotland) Acts, duly authenticated and signed by the Registrar, is admissible as evidence in all parts of His Majesty's dominions without any other or further proof of such Entry. Any person who falsifies any of the particulars on this Extract or makes use of such falsified Extract as true, knowing it to be false, is liable to prosecution."
}
