{
	"anumber": "A10891711",
	"id": "A10891711_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Character Investigation, I-108A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "881.0 ma9 smok (08-1-8 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service File No. (PLACE) Date MOITOJ8 avna as georlw toubroo 928919 REPORT OF CHARACTER INVESTIGATION betinU edj 03 bessimbe yllutw bewervising bedoes transaring TO asist? SUBJECT: JATIRAM 32 felobiM 2UTAT2 2 atola TO: inwond 2297000 Instance sbubnl) 23MAM (zomombin 10 emon nebium 232ALLA Pursuant to request on reverse hereof in the case of the above-named subject, the following sources have been checked to ascertain if the subject has any criminal record; has received public or private charity; has been other than loyal to the United States; has been law-abiding in his home and social activities; or is within any THOUGH of the classes enumerated in Section 101 (f) of the Immigration and Nationality Act. bno stole no Lots 078 on 8 ZRABY 3VR TEAJ Witnesses Interviewed: Period of time known applicant Date Name and address From- To- interviewed 3J8AJIAVA 91 90 MOITA9U000 brig empo mayolam3 BRABY 3VR TEAJ (evodo ni bebubni 10/1) HT918 RO levodo 20 emos ton fi inazong 8 been zemon hartte YAD 8 emon 1407) 320092 20-81-SI etoiz DO sonivora HT918 30 3DAJ9 alnota A abalim yloseV (betail/Ro 10 won dbidw diew oto edub Redepor you abulant) Records Searched: 2108Y teil choo bno 2910G) 2318T143 80199 (avioia bno hog eto() 2.U OT TEAJ 71 yleuoivanq nertw to w is Employment Verified: 189 Y8 2T90933 libes ritinabi strogen to tail dootto 29Y H 23Y on 807 No adverse information concerning the subject has been obtained from the above sources. THADIJ99A 201113330099 2UTAT2 90 LOA 2.U MAA 70 R31138 ROR Remarks: 008-11 zid to 5219191 edit no arti to hogan gdt efübexe 920819 benginebnu mo dtiw ti muter bno mot (hoqei to smont SIGNED INVESTIGATOR (a) (gMT) MOITO32 APPROVED TITLE"
}
