{
	"anumber": "A10891711",
	"id": "A10891711_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "National Archives at Kansas City, NARA Form 18F-203A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2 (6) Have you ever, in the United States or in any other place, (a) committed any crime, or broken any law, ordinance or regula- tion, for which you have not been anrested? Yes No; (b) been arrested, charged, convicted, fined, or imprisoned for breaking or violating any law, ordinance, or regulation? Yes No. If you answer \"Yes\" to (a) or (b), give the following information as to each incident: WHEN WHERE (City) (State) (Country) NATURE OF OFFENSE OUTCOME OF CASE (a) Traffic fine 4/3-00 (b) (c) go others D (d) (e) (7) List each organization, association, fund, foundation, club, or society in the United States or in any other place that you have been a member of at any time, and the dates of membership in each. (If none, write \"None.\") (a) none , 19 to 19 (b) , 19 to 19 (c) 19 to 19 (d) , 19 to 19 (e) 19 to 19 (f) 19 to 19 (g) , 19 to 19 (8) Have you ever, in the United States or in any other place, (a) been a member of, or in any other way connected with, or associated with the Communist Party either directly, or indirectly through another organization, group, or person? Yes No: (b) given anything of value to the Communist Party, or to another organization, group, or person cooperating with that Party? Yes No;Y(c) believed in, taught, or advocated communism? Yes No. (9) Do you believe in the U.S. Constitution and form of Government of the United States? Yes No. (10) Are you willing to take an unqualified oath of allegiance to the United States? Yes No. (11) Have you ever been a patient in a mental institution, or have you ever been treated for a mental illness? Yes No. (12) Are deportation proceedings pending against you, or have you ever been deported or ordered deported, or have you ever applied for suspension of deportation or for preexamination? Yes No. (13) Do you owe any Federal taxes? Yes No. State last year for which you filed a Federal income tax return 1961 (14) Have you ever represented yourself to be a United States citizen? Yes No. (15) If male, did you ever register under United States Selective Service laws or draft laws? Yes No. If \"Yes\" give date you registered Were you ever exempted from service because of conscientious objections, alienage, or other reasons? Yes No. If \"Yes,\" state reasons Omerage (16) If you ever served in the Armed Forces of the United States, state branch ; from , 19 to 19 ; Service No. ; type of separation ; reason for separation: alienage conscientious objections (Honorable, Dishonorable, etc.) other (If \"other\" state details) (17) If the law requires it, are you willing (a) to bear arms on behalf of the United States? Yes No; (b) to perform noncombatant services in the Armed Forces of the United States? Yes\\ No; (c) to perform work of national importance under civilian direction? Yes No. (18) Have you ever deserted from the military, air, or naval forces of the United States while this country was at war? Yes No. Have you ever left the United States or the jurisdiction of the district where you registered for the draft to avoid being drafted into the military, air, or naval forces of the United States? Yes No. (19) The law provides that an applicant for naturalization shall not be regarded as a person of good moral character who, at any time during the period of residence required for naturalization, advocated on practiced polygamy, got his or her income prin- cipally from illegal gambling activities; has committed adultery; has been a prostitute; has procured any person for the purposes of prostitution; has been a narcotic drug addict; or has dealt in narcotic drugs illegally in any way. Have you at any time, either within or outside the United States, ever been such a person or ever committed any of these acts? Yes No."
}
