{
	"anumber": "A10891711",
	"id": "A10891711_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0034/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE DECLARATION OF INTENTION, N-300"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Austria"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form approved. Budget Bureau No. 43-R075.6. Form N-300 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (Rev. 10-20-55) ALIEN REGISTRATION NO. 410891714 APPLICATION TO FILE DECLARATION OF INTENTION Take or Mail to- IMMIGRATION AND NATURALIZATION SERVICE, Date July 16 1957 (TO APPLICANT.-Read carefully and follow the instructions on page 2) (1) My full name is HERBERT STANGEL (2) My place of residence is 3237, Gi (Full. true name, without abbreviation and any other name which has been used. must appear here) ave Hinneapolis Minnesota (3) I am 51 years old. (4) I was born on October (Number and street) (City or town) 28 1905 (County) in (State) Vienna (Month) (Day) (Year) austria (5) My personal description (City or town) is as follows: Sex male (County. district. province or State) , Pain (Country) complexion color of brown color of hair brown height 6 feet inches weight eyes 210 pounds; visible distinctive marks 1st joints MISSING INDE country AND of MIDDLE which am a citizen, FGRS: subject, LFT. or HAND national Grient Britain (6) I am married, the name of my wife or husband is Milada Stangel (7) My lawful admission for permanent residence in the United States was at Detroit under the name of Xerbert Stangel april (City/or town) 27 Michigan 1957 (State) on (Month) (Day) (Year) on the m my over car (Name of vessel or other means of conveyance) (8) Since my lawful admission for permanent residence I have not been absent from the United States, for a period or periods of six months or longer except as follows: DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER DATE VESSEL OR OTHER PORT (Month, day, year) MEANS OF CONVEYANCE PORT (Month, day, year) MEANS OF CONVEYANCE (9) My last place of foreign residence was Torouto Outario Canada (City or town) (County. district. or province) (Country) (10) The place where I took the ship or train which landed me in the United States was Torouto Outario Canada (City or town) (11) My father's full name is/ was Hersugan (Country) Frangel (12) My mother's maiden name was Lophie Geminder (13) The person in the United States to whom I was coming was (14) The place in the United States to which I was going was Kinneapolis (15) The names of some of the passengers or other persons I traveled with including members of my own family, and their relationship to me, if any, are Milada Kangel wife Rosemary Stangel daughter (16) I desire to declare my intention to become a citizen of the United States in the u S Dist (Name of court) Court at Mpls MINN. (City or town) (State) I CERTIFY that the above statement of facts is true to the best of my knowledge and Herbert belief. Fampal (Signature of applicant) 3237, Girard (Address at which applicant Ave receives S. mail) (OVER) 16-11312-13"
}
