{
	"anumber": "A10891712",
	"id": "A10891712_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Petition,, N-4-1023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1962]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "4 (11) I (have, have not) heretofore made petition for naturalization No. on (Month) (Day) (Year) at in the Court, which was denied because (City) (State) (12) I wish the naturalization court to change my name to (Give full name desired) Toronto Canada (13) My last place of foreign residence was (City) (Country) Anton Benedik (14) My father's full name is (15) My mother's maiden name was Anna Stassny (16) I migrated to the United States from the port of Windsor Ontario, Canada (City) (Country) (17) The person in the United States to whom I was coming was (18) The place in the United States to which I was going was Minneapolis (19) The names of some of the passengers or other persons I traveled with, including members of my own family and their relationship to me, if any, are my husband Herbert Stangeld and my daughter Rosemary Stangel Milada (Signature of applicant) A. tanger 900, S.Highland Avenue Clearwater,Fla. (Address at which applicant receives mail) TO APPLICANT: DO NOT FILL IN BLANKS BELOW THIS LINE. NOTE CAREFULLY.--This application must be sworn to before an officer of the Immigration and Naturalization Service at the time you appear before such officer for examination on this application. AFFIDAVIT I do swear that I know the contents of this application Subscribed and sworn to before me by applicant at the comprising pages 1 to 4, inclusive, and the supplemental forms preliminary investigation ( ) at thereto, No(s) , subscribed to by me; that the same are true to the best of my knowledge and belief; that this 23. day of 1962 corrections numbered ( / ) to ( 6 ) were made by me or I certify that before verification the above applicant stated in my presence that he had (heard) read the foregoing appli- at my request; and that this application was signed by me with my full, true, and correct name, so HELP ME GOD. cation and supplemental form (s) and understood the contents thereof. Mulidada Antonio Stanger (Complete and true signature of applicant) (Naturalization examiner) XIn the United States are have many freedome (For demonstration of applicant's ability to write) (1st witness) Derothy BERlAgE Occupation Housenute residing at 1013 Oaknien One clearmater Flor (Street address, city or town, and State) (2d witness) Anne Keeler residing at 901 So San Remo (Street/address city or town, Clearmrates, and State) F/A Occupation Itime mahis U.S. 16-30-58 State some Physical presence 31 mos. HAM (Naturalization examiner) ARRIVAL RECORD FOUND ARRIVAL RECORDS EXAMINED Place Card index Name Index books Age Manifests Date Marital status Manner (Signature of person making search) Nonfiled (Dates, reasons, and examiner's initials)"
}
