{
  "anumber": "A10891711",
  "id": "A10891711_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice, Immigration and Naturalization Service, G-135a"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Austria"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form G-135a Agency Name Check V 8-1-60) UNITED STATES DEPARTMENT OF JUSTICE 432-P-17982 District Immigration and Naturalization Service File No. Miami, Fla. A10 891 711 Sub-Office nac 24,14558 Date 10/2/62 Another Agency advised that OSI, 4th (44-8374) OSI has information concerning subject. Please furnish any derogatory information that may be contained in your files concerning the following person. NAME (Surname in CAPS, First, Middle) DATE OF BIRTH SEX COLOR MARITAL 10/28/05 M W STATUS Dilor S M STANGEL, Herbert PLACE OF BIRTH (City, province or PRESENT NATIONALITY state & country) Vienna Austria Gx Britain D W ALIASES (Identify maiden names or nicknames) PARENTS NAMES (Include present address, if known) HEIGHT WEIGHT EYES HAIR COMPLEXION IDENTIFYING MARKS OR SCARS Middle & index fingers, 6'2\" 185 brn brn fair left hand, amputated to 1st joints RESIDENCE LAST FIVE YEARS (Street & No., RFD, etc.) (City, state and country) FROM TO 900 S. Highland Ave. Clearwater, Fla 29 PRIOR RESIDENCES, IF AVAILABLE. EMPLOYMENT LAST FIVE YEARS (Employer's name and address) OCCUPATION OR PROFESSION FROM TO Minneapolis-Honeywell, St. Petersburg, Fla. Engineer PRIOR OCCUPATIONS (Not included in bove) years SPOUSE (Full name & other names used, & present address if not same as above) DATE OF BIRTH 12/18/05 Milada Stangel PLACE OF BIRTH (City, province or state & country) Vesely, Czech. ORGANIZATIONS (Include any societies clubs, etc., with which now or previously affiliated). None LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U. S.) 4/27/57, Detroit, Mich. Permanent Res. PREVIOUS NUMBERS ASSIGNED (Milit, S/N; passport, social security; FBI; etc., identify each) PREVIOUS REPORTS FURNISHED BY FBI NO YES. If yes attach list of reports. REASON FOR REQUEST DEPORTATION OTHER (Specify) APPLICANT FOR: PROCEEDINGS BENEF. PB #: ADM. TO U.S. ADJ. OF STATUS SFONSOR PB #: FOR RELIEF OF NATZ. RETURN TO: DISTRICT DIRECTOR, U.S. Immigration and Naturalization Service 312 Old Post Office Bldg., 12th & Penna. Ave., N.W. (7) Assistant Commissioner Washington 25, D.C. Investigations"
}