{
	"anumber": "A10891711",
	"id": "A10891711_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization, Form N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Austria"]
		},
		"years": {
			"ms_years_nlp_v1": [1957, 1905, 7957, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R083.9. DUPLICATE UNITED STATES OF AMERICA (To accompany 17,982 monthly report on Form N-4) PETITION FOR NATURALIZATION No. 316(a) Filed under DISTRICT THE UNITED STATES TAMPA, FLORIDA To the Honorable the Court of at This petition for naturalization, heretterdere filed. fully shows: (1) My full, true, and correct name is 900 S. Highland Ave. Clearwater Pinellas F12. (Full, true name. without viation) Senior 10/28/05 Vienna, Austria (3) My occupation (Apt. No.) (Number and street) (City or town) (County) (State) is (4) 1 was born on male in fair brown (Month) (Year) (City or town) (County. districtes State) brown (5) My personal description is as follows: Sexo 185 complexion missing color Joines fingers color of hair height Engl setd inches, weight pounds, visible distinctive marks Milada Antounty which Buredik citizen, subject, or national Mar. 30, 1939 (6) I am Glasgow married the wife or husband is Scotland we married were Vesely Moravin, on GzechozIoväkia Dec 1905 he or she was born (City or town) at (Country Apr. 27 on 7957 Month) and entered the United Detroit, Michdger strict. province, or State) (Day) (Year) States at on motor permanent residence in the United States of town) (State) (Month) (Day) (Year) and now resides at and was naturalized on (Number and street) (City or town) (County and State) (Month) (Day) (Year) at certificate No. ; or became a citizen by (City or town) (State) (7a) (If petition is filed under section 319 (a), Immigration and Nationality Act.) I have resided in the United States in marital union with my United States citizen spouse for at least 3 years immediately preceding the date of filing this petition for naturalization, and have been physically present in the United States at least half of that time. (7b) (If petition is filed under section 319 (b), Immigration and Nationality Act.) My husband or wife is a citizen of the United States, is in the employment of the Government of the United States, or of an American institution of research recognized as such by the Attorney General of the United States, or an American firm or corporation engaged in whole or in part in the development of foreign trade and commerce of the United States, or subsidiary thereof, or of a public international organization in which the United States participates by treaty or statute, or is authorized to perform the ministerial or priestly functions of a religious denomination having a bona 'fide organization within the United States, or is engaged solely as a missionary by a religious denomination or by an interdenominational mission or- ganization having a bona fide organization within the United States, and such husband or wife is regularly stationed abroad in such employment. I intend in good faith upon naturalization to live abroad with my spouse and to resume my residence within the United States immediately upon termination of such employment abroad. two (8) I have Johnson, female, Vienna, Austria 7/15/31 Southamp children; and the name, sex date and place of birth. and- resent place of f-residence of each of said children whosis living, are as follows: Doris Signature Rosemary Lillian, female, Glasgow, Scotland 1/10/39 with me Detroit, Michigan (9) My lawful admission for permanent residence in the United States was at Herbert Stangel (City or town) April Blate 1957 under the name of on Ambassador Bridge (Month) (Day) (Year) on the (Name of vessal or other means of conveyance) (10) Since my lawful admission for permanent residence I have not been absent from the United States, for a period or periods of 6 months or longer, except as follows: DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE (11) It is my intention in good faith to become a citizen of the United States and to renounce absolutely and entirely all allegiance and fidelity to any foreign prince potentate, state, or sovereignty of whom or which at this time I am a subject or citizen. (12) It is my intention to reside permanently in the United States. (13) I am not and have not been for a period of at least 10 years immediately preceding the date of this petition a member of or affiliated with any organization proscribed by the Immigration and Nationality Act or any section, subsidiary, branch, affiliate or subdivision thereof nor have I during such period believed in, advocated, engaged in or performed any of the acts or activities prohibited by that Act. (14) I am able to read, write and speak the English language (unless exempted there- from). (15) am, and have been during all the periods required by law, a person of good moral character, attached to the principles of the Constitution of the United States and well disposed to the good order and happiness of the United States. I am willing, if required by law, to bear arms on behalf of the United States, to per- form noncombatant service in the Armed Forces of the United States, and to performa work of national importance under civilian direction (unless exempted there- Apr. 21,1957 from). (16) I have resided continuously in the United States since and continuously in the State in which this petition is mad for the term (Month) (Day) (Year) of 6 months at least immediately preceding the date of this petition and have been physically present in the United States for at least one-half of the year not period immediately preceding the date of this petition. (17) I have heretofore made petition for naturalization No on at in (Month) (Day) (Year) ty or town) (County) (State) the Court, and such petition was denied by that Court for the following reasons and causes, to wit: (Name of Court) (18) Attached hereto and made a part of this, my petition for naturalization, are the affidavits of at least two verifying witnesses required by law. (19) Wherefore I, your petitioner for naturalization, pray that I may be admitted a citizen of the United States of America, and that my name be changed to none I, aforesaid petitioner, do swear (affirm) that I know the con- tents of this petition for naturalization subscribed by me, and that the same are true to the best of my knowledge and belief. and that this petition is signed by me with my full, true name: so HELP ME GOD. A10 891 711 ALIEN REGISTRATION NO. (Full, true, and Bangd signature of petitioner. without correct abbreviation) Form N-405 (Rev. 4-2-62) 16-41073-15"
}
