{
  "anumber": "A10891711",
  "id": "A10891711_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, I-1297"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1956,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Copied at the National Archives at Kansas City 2 35. I intend to remain in the United States for the following period of time: have previously been in the United States during the following periods: permanently short trips 37. I have had the following excludable clauses explained to me and state that I am no as hereinafter noted, a member of any one of the following classes of individuals excluded from the United States under the Immigration and Nationality persons who have had one or more attacks of insanity; (2) persons who are narcotic drug addicts or chronic alcoholics; (3) persons who are afflicted with losis in any form, leprosy, or any dangerous contagious disease; (4) persons afflicted with any other disease, physical defect or disability which is of such a natu may affect such persons' ability to earn a living unless affirma- tively established that they will not have to earn a living; (5) paupers, professional beggars or vagraires (6) persons convicted of, or who have admitted committing, a crime involving moral turpitude, or committing acts constituting the essential elements of such a crime, with the exceptions noted in the Act; (7) persons con- vieted of two or more offenses for which the aggregate sentences to confinement actually imposed were 5 years or more; (8) polygamists, practitioners or advocates of polygamy; (9) prostitutes, persons who have engaged in prostitution, persons coming to the United States solely, principally or incidentally to engage in pros- titution, procurers and persons attempting to procure, or persons who have procured or attempted to procure or import, prostitutes or persons for the purpose of prostitution or for any other immoral purpose, or persons who are or have been supported by or receive or have received the proceeds of prostitution, or persons coming to the United States to engage in any other unlawful commercialized vice; (10) persons coming to the United States to engage in any immoral sexual act; (11) persons coming to the United States to perform skilled or unskilled labor who do not meet the requirements of the Act; (12) persons likely to become public charges; (13) persons excluded from admission and deported, or persons arrested and deported, or persons fallen into distress and removed, or persons removed as enemy aliens, or persons removed at Government expense, who do not have the Attorney General's permission to reapply for admission; (14) stowaways; persons procuring, or who have sought to procure, visas or other documentation, or who seek to enter the United States by fraud or willful misrepresentation of a material fact; (15) immigrants not possessing valid unexpired immigrant visas, reentry permits, border crossing identification cards or other documentation required by the Act, and a valid unexpired passport or other suitable travel document or document of identity and nationality; (16) quota immigrants possessing visas not issued in compliance with the quota provisions of the Act; (17) persons ineligible to citizenship of the United States, or persons who have departed from or have remained outside the United States to evade or avoid military training or service in time of war or national emergency; (18) persons convicted of a violation of any law or regulation relating to the illicit narcotics drug traffic or of any law or regulation governing commerce or manufacture of narcotic drugs as provided in the Act; (19) persons who seek admission from foreign contiguous territory or adjacent islands after arriving therein by nonsignatory or noncomplying transportation lines; (20) persons seeking to enter the United States solely, principally, or incidentally to engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; (21) persons who are, or at any time have been, anarchists, Communists, or other political subversives, as specified in Sec. 212 (a) (28) of the Act; (22) persons who after entering the United States probably would engage in activities prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in any other activity subversive to the national security, or engage in any activity a purpose of which is opposition to, control or overthrow of, the United States Government by force, violence or other unconstitutional means, or join, affiliate with, or participate in the activities of any organization registered or required to be registered under Sec. 7 of the Subversive Activities Control Act of 1950; (23) persons accompanying other persons ordered excluded, deported, and certified to be helpless from sickness or mental or physical disability or infancy pursuant to Sec. 237 (e) of the Act, whose protection or guardianship is required by the persons excluded and deported; (24) persons who at any time, knowingly and for gain, encouraged, induced, assisted, abetted, or aided any other alien to enter or try to enter the United States in violation of law. 38. I have had the exceptions to the foregoing excludable classes explained to me and claim to be exempt from exclusion on account of membership in the class or classes noted above because: I am not a member of any of the foregoing classes 20 5.00 FILE PAID: U.S. Herbert Hanged (Signature of applicant [SEAL] Subscribed and sworn to before me this 24 day of April 57 Fee No. heave II. Struct GEORGE HofstRUnited States of America. Fee: $5. sr Vice Consul of the United States of America Pet. No. VP-10-I-250 DET. UNITED STATES OF AMERICA App. Date. Dec 7, 1956 IMMIGRANT VISA AND ALIEN REGISTRATION AMBASSADOR BRIDGE PORT OF DETROIT, MICH. IMMIGRANT CLASSIFICATION: I certify that the immigrant named herein arrived in the United States at this port on APR 2 7 1957 AMBASSADOR BRIDGE Nonquota Quota T-1 DETROIT, MICH. (Symbol) (Symbol) on (Day, month, year) CONSULATE GENERAL (admitted American and was inspected by me and TORONTO, CANADA under Section T-1 of the Immigration and Nationality Act. at Jackbe Benda IMMIGRANT VISA NO. 1348 Austrian No 40 (Immigration officer) (State quota) Issued on 24 April 1957 ACTION OF SPECIAL INQUIRY OFFICER (Day, month, year) The immigrant named herein was (admitted) (excluded) and and no appeal taken taken appeal The validity of this visa expires midnight, E. S. T., at the end of under Section of the Immigration and Nationality Act. 23 August 1957 (Day, month, year) Date STATISTICS Nationality (if stateless, SO state, and give previous nationality) (Special Inquiry officer) British This visa is issued under Section 221 of the Immigration and Nationality Act ACTION ON APPEAL and upon the basis of the facts stated in the application. This visa does not Admitted Excluded Date entitle the bearer to enter the United States if, upon arrival at a port of entry of the United States, he is found to be inadmissible under the law. SERVICE No 21 [SEALF George Jd. TARIFF ITEM No Strumg 200 as GEORGE H. STRUNZ Vice Consul of the United States:of:/ America- of the FEE PAID: U.S. United States of America. Fee No. EQUIV.: CDN. $ Fee: $20. must be sed with ular seal D119064 25 N sr Passport No. or other travel document (describe) former. British 3 Issued THerbert Stangel By High Commissioner for the UK Ottawa Can. On Feb 5, 1957 Neb 5, 1962 Expires U. PRINTING OFFICE 16-67444a-1"
}