{
	"anumber": "A10891712",
	"id": "A10891712_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0009/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Statement of Facts for Preparation of Petition, 10891712"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Austria"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 1957, 1939, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "5 yrs 3 ALIEN REGISTRATION STATEMENT OF FACTS FOR PREPARATION OF PETITION Name Milada A. STANGEL SECTION OF LAW 316@) No. 10891712 (1) My full, true, and correct name is Milada Antonia STANGEL (Full, true name, without abbreviation) (2) My present place of residence is 900 S.Highland Ave. Clearwater Pinellas Florida (Number and street) (City or town) (County) (State) Housewife (3) My present occupation is 12 18 (4) I was born on 1905 in Vesely Moravia Czechoslovakia (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) F (5) My personal description is as follows: Sex ; complexion fair ; color of eyes grey ; color of hair light brown. height 5 feet 6 inches; weight 165 pounds; visible distinctive marks none ; country of which I am a citizen, subject, or national Herbert STANGEL Great Britain ENglANd (6) I (am, am not) married; the name of my wife or husband is we were married on March 30 1939 at Glasgow Scotland ; (Month) (Day) (Year) (City or town) (State or country) Vienna Austria he or she was born at (City or town) (County, district, province, or State) (Country) 10 28 1905 Detroit on ; entered the United States at (Month) (Day) (Year) (City or town) Michigan on April 27 1957 for permanent residence in the United States and (State) (Month) (Day) (Year) with me; now resides apart from me at ; and was naturalized on Not 12 (Show full address if not living with you) at (Month) (Day) (Year) (City or town) (State) Certificate No. or became a citizen by (7) I have one living children, as follows. (Complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise, give child's full address.) NAME Sex PLACE BORN DATE BORN Now LIVING AT- Rosemary Lillian Stange F Glasgow, Scotland 1-10-39 with me (8) My lawful admission for permanent residence in the United States was at Detroit Michigan ; (City or town) (State) under the name of Milada Antonia STANGEL on April 27 1957 (Month) (Day) (Year) on 3 the Bredge in own car (Name of vessel or other means of conveyance) (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows (if none, state \"None\") : DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES PORT DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE (10a) I have resided continuously in the United States of America since April 27,1957 and continuously in the State of Florida where I now live since October 27, 1958 and during the past 5 years I have been physically present in the United States for an aggregate period of 60 months. (OVER) (10b) Do you intend to reside permanently in the United States? Yes No. If \"No,\" explain:"
}
