{
  "anumber": "A10943354",
  "id": "A10943354_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10943354_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, Form N-600"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1884,
        1957,
        1889
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Copied at the National Archives at Kansas City Form N-600 U. S1 DEPA RTMENT OF JUSTICE weys. Form approved. Budget Bureau No. 43-R105.7. IMMIGRATION AND NATUR ALIZATION SERVICE FEE STAMP (Rev. 5-23-56) 101 Signature APPLICATION FOR CERTIFICATE $5.00 FEE PAID 958 OF CITIZENSHIP No. 177-451 10 NEWARK SEC. 341 OF THE IMMIGRATION AND Immigration and Natura alization Service NATIONALITY ACT Take or mail this application to: Date 3/15/57 Accepted by mlng Newark, N. J. IMMIGRA FION AND NATURALIZATION SERVICE: Date FEBRUARY 17, 1957 (Print or type) JACOB LAVINE (Name) ALIEN REGISTRATION 630 Division STREET NO (Apartment number, Street address and if appropriate, \"in care of\" TRENTON 10 NEW JERSEY (City) (State) I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) (If a married woman) My maiden name was (2) I was born in LIDA RUSSIA on DECEMBER 16 1884 (City) (State or country) (Month) (Day) (Year) (3) My personal description is: Sex MALE ; complexion FAIR ; color of eyes BLUE ; color of hair GRAY ; height 5 feet 8 inches; weight 163 pounds; race WHITE ; visible distinctive marks Marital status: Single; Married: Divorced; Widow(er) Management sk thint (4) I arrived in the United States at TRENTON of JACOB LAVINE (City) under the name on 29 1889 New DECEMBER JERSEY (State) right by means of SHIP BREMMEN of (Month) (Day) (Year) (Name vessel or other means of arrival) (5) I have not been absent from the United States except as follows: Date departed Date returned Name of ship, or of airline, railroad company, bus company, or other Place or port of entry through which you returned to means used to return to the United States the United States NONE (6) My last permanent foreign residence was LIDA RUSSIA (City) (Country) (7) The place where I took or train to the States the ship United was BREMMEN GERMANY (City) (Country) Answer questions (8), (9), and (10) only if you arrived in United States before July 1, 1924. (8) The person in the United States to whom I was coming was Simon LAVINE (9) The place in the United States to which I was going was TRENTON, NEW JERSEX (10) The names of some of the passengers or other persons I traveled with, including members of my family, and their relationship to me, if any, are ada faving - my mything Esther and minimis favine - sisters; TO THE APPLICANT: DO NOT WRITE BETWEEN THE DOUBLE LINES BELOW. CONTINUE ON NEXT PAGE Charles favine, my brother Bading faving, a sister FOR USE IN SEARCHING RECORDS OF ARRIVAL: RECORDS EXAMINED RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status (Signature of person making search)"
}