{
	"anumber": "A11138471",
	"id": "A11138471_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0031/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Fingerprint Card, 28-2-51"
		},
		"years": {
			"ms_years_nlp_v1": [1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "R.C.M.P. Revised 28-2-51 F.P.S. No. FEMALE R.C.M.P. C-2.2 Sex Female Prisoner's No. PATTERSON Name COHEN, Mrs. Florence(Midow) nee: P. Code LR 191 Surname Given names Aliases and Nicknames NLP. 10 $ 0001 Resident Address 867 Victoria Ave., Windsor, Ontario. Thumb Index Middle Ring Little S.M 11 5 13 13 R I-01 I G H T R H 14 O-I E F T All Four Fingers Taken Together a Comean Left Thumb Right Thumb Signature of official taking prints Signature of person fingerprinted ist. (W.J. Hodgson) #17260. Date 1-8-57 Mrs Date Contributor R.C.M.Police, London Sub/Division, \"0!\" Div. Windsor Deta chment. (Please state name and address of Police Department, Jail or Penitentiary, if R.C.M.P. indicate Detachment, Sub-Division and Division) Date of arrest Case handled by P.D. (If on remand state whether on bail or in custody and date remanded to) Nationality Canadian Racial Origin Scotch Date of conviction Searched against R.C.M.P. Fingerprint Records Only Place of Birth Kintore, Scotland Date.30=11=05 Place and Court Negative Results Apparent Age 52 yrs. Occupation. Hswf. . Height: Ft 5 Inches 1 Weight 160 lbs. AUG 8 1957 Build Nose (Stout, medium, thin, erect, stooping) (Large, small, hooked, straight, R.P.B. HANSON, Supt. concave, broken, turned up) Offence or Offences Officer. in Charge Complexion Lips Identification Branch (Fair, dark, sallow, fresh) (Thick, thin, upper or lower protruding) Ottawa. Ont. Eyes Mouth (Colour, large, small, peculiarities, (Large, small, open, close shut) wears glasses) Hair Teeth (Colour, quantity, parting, cut) (Clean, discoloured, prominent, false, gaps) Face Chin (Long, round, smiling, scowling, (Receding, projecting, dimple, double) wrinkled) Forehead Ears (High, low, bulging, vertical, receding) (Large, small, close to head, pro- truding, pierced, long) Sentence Eyebrows Voice (More than one charge state Concurrent or Consecutive) (Colour, thick, thin, bushy, plucked) (Accent, gruff, effeminate) Peculiarities (Stammer, accent, squint, gait, etc.) Marks (Scars, warts, birthmarks, pimples, tattoo, deformities, etc.) REMARKS: VISA APPLICANT. (If any fingerprint is not recorded, give reason for omission-if amputated give date) When this form used for IDENTIFICATION only, state whether for Visa, Police or other Applicant, etc In Criminal Offences complete reverse side-Give date Photograph taken-Clip hereto do not paste"
}
