{
	"anumber": "A11138471",
	"id": "A11138471_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1903]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service To Petitioner: In connection with the scheduled final hearing on your petition, It Is necessary to furnish current Information. Answer \"Yes\" or \"No\" to each of the questions below, without making any further explana- tion at this time. The questions refer to what has happened since the date you appeared with your wit- nesses and filed your petition for naturalization. They do not refer to anything that happened before that date. When you have answered each question, sign your name on the line marked \"Sign here\" and fill in your present address. Do not swear to your answers. BRING THIS LETTER WITH YOU when you come to the final hearing and give it to the naturalization examiner. He will then require you to swear to the truthfulness of your answers. Since the filing of your petition for naturalization: 1. Has your marital status changed in any way? (1) Answer no 2. Have you been absent from the United States? (2) Answer no 3. Have you committed any crime or offense, or been arrested, fined, or charged with the violation of any law whatsoever? (3) Answer no 4. Have you joined any organization? (4) Answer no 5. Have you become a member of the Communist Party? (5) Answer no 6. Have you claimed exemption from military service? (6) Answer no 7. Has there been any change in your willingness to bear arms on behalf of the United States; to perform non-combatant service in the armed forces of the United States; to perform work of national importance under civilian direction, if the law requires it? (7) Answer no 8. The law provides that a petitioner for naturalization shall not be regarded as a person of good moral character who, at any time after his or her petition for naturalization has been filed, has committed adultery; has been a prostitute; has procured any person for the purposes of prostitution; has been a narcotic drug addict; or has dealt in narcotic drugs illegally in any way. Have you committed such an act or been such a person? (8) Answer no mrs Florine Cohes (Sign here) apr 5 419 (Present N address) 32 Place Phoenix Arizo PETITIONER: DO NOT WRITE BELOW TIIIS LINE Sworn to (Affirmed) before me at the final hearing at PHOENIX ARIZONA on JAN 21 1903 I certify that before being sworn (affirming) this petitioner stated in my presence that he (she) had signed this form; that he (she) understood the contents; and that his (her) answers therein were true to the best of his (hor) knowlodge and belief. Tway and (Signature) (U. S. Naturalization Examiner)"
}
