{
  "anumber": "A11138471",
  "id": "A11138471_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1960,
        1957,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved. Budget Bureau No. 48-R079.7. UNITED STATES DEPARTMENT OF JUS IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien reg- Mail or take to: istration receipt card, and the number of your card. If you did not register, so state.) IMMIGRATION AND NATURALIZATION SERVICE Name FLORENCE COHEN No. A 11 138 471 APPLICATION TO FILE PETITION FOR NATURALIZATION (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) I desire to file a petition for naturalization in the- Date: AUGUST 1962 U.S. District Court at MIAMI FLORIDA (Name of Court) (City) (State) FLORENCE COHEN (Print or type here your present full name only) APT 7 1667 WASHINGTON AVE - FLETCHER APTS (Print or type present apartment number, street address, and if appropriate \"in care of\") MIAMI BEACH 39 - DADE FLORIDA (City) (County) (State) (Print or type here any other name you have ever used, including maiden name) (PATTERSON) (1a) Was your father or mother ever a United States citizen? Yes No. If \"Yes\" explain fully separately. (1b) Can you read and write English Yes No. Speak English? Yes No. Sign your name in English? Yes No. (2) In what places in the United States have you lived during the last 5 years ? List present address first. FROM- To- STREET ADDRESS CITY AND STATE (a) SEPT 1960 PRESENT TIME 1667 WASHINGTON,AVE MIAMI BEACH FLORIDA (b) APRIL 1959 SEPT 1962 2129 WASHINGTON AVE MIAMI BEACH FLORIDA (c) OCTOBER, 1957 SEPT 1960 525 W.40TH STREET MIAMI BEACH FLORIDA (d) , 19 APRIL 1959 & (e) , 19 , 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment first. FROM- To- EMPLOYER'S NAME OCCUPATION OR TYPE ADDRESS OF BUSINESS (a) JANUARY, 1962 PRESENT TIME HARRY BRICK 16 75WASHINSTON HOTEL OWNER (b) APRIL , 1959 SEPT , 1962 SCHWARTZ of GLAZIER 2129 WASHINGTON, HOTEL OWNER (c) OCTOBER 1957 APRIL 1960 JACK COHEN 514 A. GODFREKRA STORE OWNE (d) ,19 JANUARY 1959 (e) ,19 ,19 (4) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following informa- tion for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES How many times has your husband or wife been married? / - (5) How many times have you been married? If either of you has been married more than once, fill in the following information for each previous marriage. (Check one) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED Sex PERSON MARRIED WAS How MARRIAGE ENDED CITIZEN ALIEN (a) (b) G-360 SENI (c) (d) Form N-400 (Rev. 4-16-62) 9-7-22 (1) (OVER)"
}