{
  "anumber": "A11138471",
  "id": "A11138471_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER OF COURT TRANSFERRING PETITION, GPO 861897"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPROVAL BY DISTRICT DIRECTOR Investigation having fully established that the applicant has removed from the jurisdiction of the Court as alleged in his application, approval of the transfer of the for naturalization, 4s given. Nov 16 , 1962 (District Director, Immigration and Naturalization Service) ORDER OF COURT TRANSFERRING PETITION District the United States In the Court of Miami, Florida at Upon consideration of the foregoing application and approval of the transfer by the District Director, Immigration and Naturalization Service, it is hereby Ordered and Decreed that the application be 21,899 granted, and that the petition for naturalization No. District AT filed in this Court shall ted approval of the transfer by the Court of Begart Phoenix, Arizona CLERK at be transferred toosaid Court. U. SOUTHERN DISTRICT OF FLORID'S 19 the November 62 By the Court, this day of 19 By Williain dongton DEPUTY CLERK Judge. INSTRUCTIONS TO CLERK OF COURT WHERE PETITION IS PENDING 1) Enter the order of your Court on the original of this application and file it with the petition record. 2) If your Court does not approve the transfer, return the 3 copies to the I&N office sending you this form. 3) If your Court approves the transfer, (a) send 2 copies showing the order of your Court, attested and certified, to the Court to which the petition is to be transferred and (b) return the third copy showing the order of your Court, attested and certified, to the I&N office. 4) When the Court to which the petition is to be transferred acts on this application, one copy of the order of that Court, attested and certified, will be returned to you for filing in your Court. 5) If the Court to which the petition is to be transferred approves the transfer, send to that Court a certified copy of the petition filed in your Court, together with the originals of all documents filed therewith, and notify the I&N office which originally sent you this application. 6) If the Court to which the petition is to be transferred disapproves the transfer, notify the I&N office which originally sent you this application. ORDER OF COURT APPROVING TRANSFER OF PETITION In the Court of at Upon consideration of the foregoing application, the approval thereof by the Court in which the peti- tion is pending and by the District Director, Immigration and Naturalization Service, it is hereby Ordered and Decreed that the transfer to this Court of petition for naturalization No. filed in the Court of at is hereby approved. By the Court, this day of , 19 Judge. INSTRUCTIONS TO CLERK OF COURT TO WHICH PETITION IS TO BE TRANSFERRED When your Court approves or disapproves the transfer to it of this petition: 1) Enter the order on one of the 2 copies of this application that you have received and file it in your Court. 2) Return the other copy showing the order of your Court, attested and certified, to the Court which sent it to you. 3) When you receive the certified copy of the petition and record in a case where thetransfer to your Court has been approve further action shall be taken by you in accordance with section 334.17(e) of Title 8 of the Code c 'ederal Regulations. GPO 861897"
}