{
  "anumber": "A11138471",
  "id": "A11138471_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0026/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Form FS-265a (Revised August 1930)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        1956,
        1905,
        1948,
        1914,
        1952,
        1957,
        1920
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1 Form FS-256a FOREIGN SERVICE OF THE UNITED STATES OF AMERICA (Revised August 1952) Approved Bureau Budget No. 47-R108.2 APPLICATION FOR IMMIGRANT VISA I- 885436 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Vice Consul at Windsor, Ont. 1. Family name Given name Initial 2. Place and date of birth November 30,1905 Age COHEN, Florence nee Patterson Kintore Aberdeen, Scotland 52 3. Other names by which I have been known 4. Last permanent residence 867 Victoria Ave. Windsor, Ontario 5. Address in the United States 6. Name and address of person to whom destined, if any 1216 Victoria, Lincoln Park, Michigan 7. Name and address of nearest relative in home country sister 8. Travel documents presented Mrs. O.S. Bulloch Box 422, Ceylon, Sask. Valid Passport 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Canadian 1/2 White M Married Single 14. Complexion 16. Ethnic Classification brown blue-gray 5 ft. 1 in. 160 lbs. Med. Scotch F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Housewife English 22. Intended United States port of entry 23. Final destination 24. I have (x) (no) 25. Purpose of going to the United States through ticket to Detroit, Michigan Lincoln Park, Mich. destination to live permanently 26. Places of previous residence from birth in Kintore, Scotland until 1912; then to Sinclair, Manitoba from 1912 to 1914; then to Radville, Sask. from 1914 to May 1920; then to Winnipeg Man. from 1920 to Aug. 1948; then to Vancouver, BC from 27. Names and places of residence of spouse and minor children 1948 to Mav 01956: then to Medicine Hat. Alta. from 1956 to July 1956; then to the U.S.A. Florida from Nov. Dec. 1956 to July 1957; then to Windsor, Ont. from July 1957 to date. daughter Cheryl Cohen - Windsor, Ont. 28. Name and address of father 29. Name and address of mother James Patterson, Deceased lizabeth Patterson, nee Mennie Deceased 30. I claim to be fnongustax X a } immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are \\preference quotaj filed herewith and made a part hereof, as follows (Sec. 222 (b)): following facts: Birth Certificate Death Certificate Birth in England Scotland Police Certificate 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: nil 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: nil 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: nil 67444-2 (Application continued on reverse side)"
}