{
	"anumber": "A11138471",
	"id": "A11138471_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TD LIKE TO BE YOUR MOVER, 8-9090"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1957, 1940, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "MLACH MICH NO.7 IMLACH MOVERS IMLACH MOVERS MLACH MOVING STORAGE CARTAGE MOVERS Service Anywhere In The U. S. team Modern Storage Warehouse 1183 FORT STREET * LINCOLN PARK 25, MICHIGAN WARWICK 8-9090 I, Charles Wilson Tmlach, of 1216 Victoria Avenue, Lincoln Park, Michigan, U. S. A. do certify that I will be responsible, if need be, for the support of Florence Cohen, sister of my wife, Margaret. Besides my wife there are no other dependents and I am the sole proprietor of Imlach Movers of 1155 Fort Street, Lincoln Park, Michigan and a citizen of the United States since September 10, 1940. Included in my assets are: Residence at 1216 Victoria Lincoln Park, Mich. Warehouse at 1183 Fort Street Lincoln Park, Mich. Warehouse at 2128 Kansas Avenue Flint, Michigan Office Building at 1155 Fort Street. Lincoln Park, Mich. Garage building at 28266 Grand River Detroit, Michigan Cottage at 939 Lakeside Drive Brighton, Michigan Approximately twenty pieces of revenue equipment used in my moving business at Lincoln Park and Flint, Mich. My moving and storage business grosses over $225,000.00 each year and nets sufficient amount for our living each year. Charles Wilson Imlael CHARLES WILSON IMLACH Manjarit Imlach MARGARET IMLACH, Wife State of Michigan County of Wayne Sworn to and signed before me thi -27. day of July 1957. 1 Notary Public AndethMaffor State of Michigan County of Wayne Jus RUDOLF PFEIFFER Notary Public, Wayne County, Mich. My Commission expires My Commission Expires Nov. 22, 1958 \"ID LIKE TO BE YOUR MOVER\""
}
