{
	"anumber": "A11336118",
	"id": "A11336118_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11336118_0028/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, 56"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Forma 55 Cert. Núm 040440 Rec. de Chihua Cantidad $ 10. Reducción según Oficio Núm. ACTA 1004. No. 417947 DENTRAL DEL STATEMENT ESTADO DE CHIHUAHUA Eu nombre de la República Mexicana y como Juez del Registro Civil de este lugar, hago saber a los que la presente vieren y certifico: Que en el Libro Núm 52. de la Sección de NACIMIENTOS. del Registro Civil que es a mi cargo, a fojas 47. se encuentra una acta del tenor lite- CHIH.. ral siguiente: A1 márgen: No. 1004. Nacimiento de la - niña JOSEFINA BARRIO. AL centro: NUMERO MIL CUATRO- En la ciudad de Chihuahua, a las 11 once de la mañana del- viernes 28 veintiocho de mayo de 1915 mil novecientos quin ce, ante mi, Manuel López de Nava, Juez del Registro Civil, comparecieron el señor Francisco Barrio y la señora Rosa - Chacón. E1 primero natigo de Satevo, Distrito Benito Juárez, y vecino de esta ciudad, de 43 cuarenta y tres años, con - domicilio en la casa numero 610 seiscientos diez. La señora- Chacón, dijo:ser nativa de Guadalupe, Distrito Gamargo, y vecina de esta ciudad, de 35 treinta y cinco años de e dad, de raza mestiza, con igual domicilio que el exponente quien manifestó que la niña presentada nació a las 11 once - de la mañana del dia 18 dieciocho de agril anterior, a quien pusieron por nombre, JOSEFINA BARRIO, hija legitima de los- comparecientes, dicha nina es la septima que han tenido ye- es nieta por linea paterna de los finados Antonio Barrio y- de la señora Petra Sánchez de Bérrio; y por la materna de los finados tambien, Nicolas Chacon y de la señora Luz Gar- cía de Chacón, - Fueron testigos de este acto Los señores: Agustin Guerra y E spiridión López, mayores de edad, el pri mero viudo, zapatero y vive en la Avenida Independencia nu mero 559 quinientos cincuenta y nueve y el segundo casado, empleado público y vive en la calle Allende numero 900 nove cientos. Lei da que les fue esta acta firmaron de conformidad. Doy fé. M. L. de Nava,-Franco, Barrio. Rosa Chacón. Espiridión - Lopez.-Agustin Guerra. - Rúbricas. II -ES COPIA FIEL Y CORRECTA SACADA DE SU ORIGI- NAL QUE EXPIDO EN LA CIUDAD DE CHIHUAHUA, A LOS VEINTIOCHO- DIAS DEL MES DE MAYO DE MIL NOVECIENTOS CINCUENTA Y SIETE.- DOY FE. - EL JEFE DE LA OF. C. DEL R. CIVIL. JOSE CARLOS CHAVEZ. SM. 44256 IEN 57"
}
