{
  "anumber": "A11336118",
  "id": "A11336118_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11336118_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization,, N-4-550"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "In connection with the hearing to be held on your petition for naturalization, Sure and by by checking \"Yes\" or \"No\" without giving any further explanation. Authority for collection of the information requested on Form N-455 The questions refer only to what has happened AFTER THE DATE you appeared and filed your petition for naturalization. They do not refer to anything that happened before that date. is contained in Sections 101 (f), 316, 332,335 and 336 of the Immigration After you have answered every question, sign your name, give your address, and fill in the date and place of signing. and Nationality Act (8 U.S.C. 1101 (f), 1427, 1443, 1446 and 1447). Submis- You must BRING THIS COMPLETED LETTER WITH YOU to the hearing and give it to the naturalization examiner, who will question you sion of the information is voluntary. further on the answers. The principal purposes for requesting the information are to enable desig- AFTER THE DATE you filed your petition: (Answers) nated examiners of the Immigration and Naturalization Service to deter- 1. Have you married, or been widowed, separated, OF divorced? (If \"Yes\" please mine a petitioner's eligibility for bring documented proof of marriage, death, separation or divorce.) 1. Yes No naturalization and to make appropriate 2. Have you been absent from the United States? recommendations to the naturalization 2. Yes No courts. The information requested may, 3. Have you knowingly committed any crime or offense for which you have not been as a matter of routine use, be disclosed arrested; or have you been arrested cited, charged, indicted, convicted, fined, or to naturalization courts and to other imprisoned for breaking or violating any law or ordinance including traffic violations? federal, state, local or foreign law 3. Yes No enforcement and regulatory agencies, 4. Have you joined any organization, including the Communis Party, or become the Department of Defense, including any component thereof, the Selective associated or connected therewith in any way? 4. Yes No Service System, the Department of State, the Department of the Treasury, the 5. Have you claimed exemption from military service? 5. Yes No Department of Transportation, Central 6. Has there been any change in your willingness to bear arms on behalf of the Intelligence Agency, Interpol and in- United States: to perform non-combat service in the armed forces of the United dividuals and organizations in the States; to perform work of national importance under civilian direction, if the la processing of any application or pet- requires it? ition for naturalization, or during the 6. Yes No course of investigation to elicit further information required by the Immigration 7. The law provides that a petitioner for naturalization shall not be regarded as and Naturalization Service to carry out person of good moral character who, at any time after the filing of the petition for its functions. Information solicited naturalization, has advocated in polygamy or been a polygamist; received income which indicates a violation or poten- mostly from illegal gambling: been a prostitute or procured anyone for prostitution; tial violation of law, whether civil, knowingly and for gain encouraged or helped an alien to enter the United States criminal, or regulatory in nature, may illegally; been an illicit trafficker in drugs or marihuana; or has been a habitual be referred, as a routine use, to the drunkard. Have you been such a person or committed any of these acts? 7. Yes No appropriate agency, whether federal, state, local or foreign, charged with I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. the responsibility or investigating, enforcing or prosecuting such viola- tions. Failure to provide all or any Signed at Los (City and State) angeles California on 8-8-88 of the requested information may result in an unfavorable recommenda- (Date) tion as to a petitioner's eligibility (Full Signature) Josefine Barrod Gomez 126n (Full Address Hamilton and ZIP Code) DT. Benerly for naturalization and denial by the court of a petition for naturalization. Itiles OT.la 91211"
}