{
	"anumber": "A11324862",
	"id": "A11324862_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11324862_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 5/9/2023"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "of I cho del Registro de Propiedad de este Departmento; valuada en la sume de Doscien- 2 tos Ochentidos Mil Colones, -Presente en este acto dona Martha Calderon viuda de 3 Rodas, Oficinista, de este domicilio, de cuarentiun años de edad, que firma: - 4 \"Martha C. V. de Rodas\" con cedule de recinded número cuatrocientos setentiseis mil 5 ciento cinco Serie #B# extendida en esta ciudad el veinticinco de Mayo del corriente 6 año y enterada de lo que antecede dice: ave acepta las obligaciones de pago que por 7 esta escritura contrae SU cuñado senor Sisniega Salazar y que de acuerdo con 81 ce- 8 de y transfiere al Gobierno de Estados Unidos de America su derecho personal de 9 exigir de su mencionado cuñado el cumplimiento de esas obligaciones por él contra i- 10 das En este estado el señor don José Sisniega Salazar, manifiesta que está de A- 11 cuerdo con lo expresado por su cuñada y:se da por notificado de la eesión y tras 12 paso que de su derecho de exigir el cumplimiento de las expresadas obligaciones 13 de pago que hace ella al Gobierno de Estados Unidos de America.-Asi se expresaron 14 los otorgan tes a quienes conozco y he hecho saber los efectos de esta escri tura, 15 Y leido que les fue par m1 lo escrito, en un solo acto, sin interrupcion 8 present 16 cia de dichos testigos ratifican su contenido por estar redactado a su entera TO- 17 luntad y todos firmamos. De todo day fe. -J. SISNIEGA S. MARTHA C. V. DE RODAS.- 18 J. D. GARCIA M. JESUS MOLINA. Ante mi: ANTONIO BERDUGO h. Rubricadas, - 19 PASS ante m1 del folio ciento sesentisei al ciento sesentisiete 20 ambos frente del Libro Primero de mi Protocolo que llevo en el corriente aflo y pa- 21 ra constancia, extiendo, fi IMO y sello este Testimonio en Santa Ana, a veintidos 22 de Junio de mil novecientos cincuentiseis, - Entre lineas-- SOS ten imiento durante SI) 23 permanencia en aquel pais y que asi mismo se compromete 8 pagar los gastos necesal 24 rios para SU-Vale,- nmendado-cuarentiun-vale 25 NEW BERNUM NOTARIO"
}
