{
  "anumber": "A11336118",
  "id": "A11336118_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11336118_0032/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 12444888"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 Form 1 (Revised A Approved Bureau Budget No. 47-R108.2 APPLICATION FOR IMMIGRANT VISA I- 1244888 AND ALIEN REGISTRATION I, the undersigned, being duly sworn, state the following facts regarding myself and hereby make application for an IMMIGRANT VISA and ALIEN REGISTRATION under the Immigration and Nationality Act to the American Consul CIUDAD JUAREZ CHIHUAHUA MEXICO at : 1. Family name Given name Initial 2. Place and date of birth 42 Age GOMEZ Chihuahua, Chih. April 18,1915 Josefina Barrio de 3. Other names by which I have been known 4. Last permanent residence none Calle Jimenez #1408 Chihuahua, Chih. 5. Address in the United States 6. Name and address of person to whom destined, if any CAlif. 1460 1/2 W. 22nd.St. Los Angeles 7, Husband- U.S. Res-Esteban Gomez. Add. as #5 7. Name and address of nearest relative in home country 8. Travel documents presented Cd. Juarez, Chih Mother-Rosa Ch, Vda. de Barrio. Mejia #963 Oriente. WAIVED 9. Hair 10. Eyes 11. Height 12. Weight 13. Nationality 15. Race 17. Sex 18. Marital status Mexican white M Married x Single black brown 5 ft. 6 in. 178 14. Complexion 16. Ethnic Classification lbs. Med. Mexican. F Widowed Divorced 19. Occupation 20. Distinguishing marks 21. Languages spoken, read, or written Home duties none Spanish. 22. Intended United States port of entry 23. Final destination 24. I have Xa) (no) 25. Purpose of going to the United States through ticket to El Paso, Texas. see Item #5 destination no Reside. 26. Places of previous residence Chihuahua, Chih. 27. Names and places of residence of spouse and minor children Husband- U.S. Res. - Esteban Gomez. Add. as #5. Children-Josefina, Jesus, Carolina, Cesar Gomez. 28. Name and address of father 29. Name and address of mother Deceased- Francisco Barrio Rosa Ch. Uda. de Barrio. Add. as #7. 30. I claim to be a nonquota immigrant and my claim is based on the 31. Available documents required by the Immigration and Nationality Act are following facts: filed herewith and made a part hereof, as follows (Sec. 222 (b)) : Med. Certf. Birth Certf. Born in Mexico Marriage Certf. PBlice Certf. Aff. of Support. 32. I have never been: Arrested; convicted; in prison; in an almshouse; treated in an institution, hospital, or other place, for insanity or other mental disease; the beneficiary of a pardon or amnesty, except as hereinafter stated: Never 33. I have never applied to any American consular officer, either formally or informally, for a visa or other documentation as an immigrant or nonimmigrant, except as hereinafter stated: ever 34. I have never been excluded, deported, or removed from the United States at Government expense, except as hereinafter stated: Never 16-67444-2 (Application continued on reverse side)"
}