{
  "anumber": "A11336118",
  "id": "A11336118_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11336118_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, Nº 4 47813"
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 d At Bt .47- Reducción según Oficio Núm. ACTA th No. 385 R1 No. 417813 ESTADO DE CHIHUAHUA ires En nombre de la República Mexicana y como Juez del Registro Civil de este lugar, hago saber a los que la presente vieren y certifico: Que en el Libro Núm 89 de la Sección de MATRIMONIOS del Registro Civil que es a mi cargo, a fojas. 433 se encuentra una acta del tenor lite- ral siguiente: -Al margen: No. 385. - Latrimonio del señor JOSE FRANCISCO ESTEBAN GOMEZ ORTIZ y la señorita: JOSEFINA BARRIO AL CENTROY NUMERO TRESCIENTOS OCHENTA Y CINCO.-En la Ciudad de Chihnahua siendo las 20 veinte horas del sabado 16 dieciseis de octubre de 1937 mil novecientos treinta y siete; constituido yo Manuel Gomez Chavez, Juez del Registro Civil en la casa numero 2612 dos mil seiscientos do - ce de la calle Dieciseis compareCiaron con el objeto de celebrar ma- trimonio el señor JOSE FRANCISCO ESTEBAN GOMEZ ORTIZ y la señorita JOSE- FINA BARRIO y los testigos propuestos por éstos. Se mando se diera le c- tura al escrito de solicitud presentada fecha de hoy y a las diligen-- cias practicadas con motivo de dicha solicitud de las que aparece que - no hay impedimento alguno legal para verificar el matrimonio que preten- den en esa virtud interrogué separada y sucesivamente si es su voluntad unirse en matrimonio tomandosey entregandose mutuamente por marido y - mujer y habiend contestado ambos en sentido afirmativo hice la siguien- te declaración:\"an nombre de la Ley y la Sociedad declaro unidos en -- perfecto legitimo matrimonio al señor JOSE FRANCISCO ESTEBAN ORTIZ y la señorita JOSEFINA BARRIO\"- Imediatamente se procedió a levantar la pre- sente acta, haciendose constar haberse cumplido con todas las formalida- des de Ley y como antes se expresa no hay impedimento legal para efectuar clai el matrimonio de que se trata, en seguida se inscriben las generaleside llow los contrayentes y testigos:- JOSS FRANCISCO ESTABAN GOMEZ ORTIZ, mexi- cano, evangelico metodista, soltero, empleado de la American Smelting, originario del punto denominado Ciameguita mpio Santa Maria del Oro Edo. de Dgo, de 23 veintitres años de Jedad, hijo legitimo del-sinor Antonio- Gomez y de la señora Elena Ortiz de Gomez el primero de 65 esenta y - cinco años de edad, agricultor, con residencia en Delicias Chih,, y la segunda finada en Durango JOSEFINA BARRIO, mexicana, celibe, católica, 22 véintidos años de edad, nativa y con domicilio en Esta Ciudad, en - 1a casa donde se efectía el presente acto, hija legitima del señor Fran- Cesco Barrio y de la señora Rosa Chacón de Barrio, el primero de 65 se- hav senta y cinco años lechero y la segunda de 55 cincuenta y cinco. años de edad, ambos viven con su hija. Fueron testigos de éste acto los señores Guadalupe Chacón, Porfirio Perez, Luciano Velazquez y José Nevarez, ma yores de edad de ésta vecindad, los dos primeros casados, ferrocarrile- ros y electricista respectivamente con domicilios en las casas numeros 2413 y 1602 mil seiscientos dos de la calle Mina y Ave .0campo, el ter- Cero soltero, empleado de la American Smelting, con domicilio en Fran- cisco Portillo y el último casado, mecanico y viva en la casa de las - calles Veintisiate y Aldama, los que declaran bajo protesta de decir - verdad que conocan a los contrayentes hace mas de tres años y saben y ha les consta de vista y ciencia cierta que no tienen impedimento alguno except he legal para verificar su concertada unión.-Despues de su matrimonio los contrayentes radicarán en esta Ciudad y presentaron certificados de bue- na salud, expedidos por el Departamento de Servicios Sanitarios Coordi- nados.-Leida que les fué la presente acta a las personas que en ella - 44256 IEN 57"
}