{
	"anumber": "A11507210",
	"id": "A11507210_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11507210_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration,, I-151"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Australia"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 1957, 1959, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2 32. Length of time I intend to remain in the United States (if permanently, 33. I have previously been in the United States during the following period so state) : Permanent residence 34. Under the provisions of section 212 (a) of the Immigration and Nationality Act, aliens who fall within one or more of the following classes are, with certain exceptions, ineligible to receive immigrant visas and are excludable from the United States: (1) feebleminded; (2) insane; (3) have had one or more attacks of insanity; (4) afflicted with psychopathic personality, epilepsy, or a mental defect; (5) narcotic drug addicts or chronic alcoholics; (6) afflicted with tuberculosis in any form, or with leprosy, or any dangerous contagious disease; (7) afflicted with any other physical defect, disease or disability of such a nature that it may affect the ability of the alien to earn a living, unless affirmatively established that the alien will not have to earn a living; (8) paupers, professional beggars or vagrants; (9) convicted of or who admit having committed acts which constitute the essential elements of a crime involving moral turpitude; (10) convicted of two or more offenses for which the aggregate sentences to confinement actually imposed were five years or more; (11) polygamists or advocates of polygamy; (12) prostitutes and former prostitutes; procurers and former procurers; aliens who are or were supported wholly or in part from the proceeds of prostitution and aliens coming to the United States to engage in any unlawful, commercialized vice: (13) coming to the United States to engage in any immoral sexual act; (14) coming to the United States to perform skilled or unskilled labor whose entry is barred because of a certification that sufficient workers are available in the area to which destined or employment will adversely affect wages and working conditions: (15) likely to become public charges; (16) excluded and deported from the United States who seek to reenter without consent of the Attorney General within one year of such exclusion; (17) arrested and deported, removed as persons fallen into distress, as alien enemies or at Government expense, who seek readmission without consent of the Attorney General; (18) stowaways; (19) seeking to procure, or has sought to procure, or has procured a visa or other documentation, or seeks to enter the United States by fraud or by willfully misrepresenting a material fact; (20) not in possession of a passport or other suitable travel document; (21) quota immigrants possessing visas not issued in compliance with the provisions of section 203 of the Act; (22) ineligible to United States citizenship, or have departed from or remained outside the United States to avoid or evade military service in time of war or national emergency; (23) convicted of illicit possession of or traffic in narcotic drugs or otherwise known or believed to be illicit traffickers in narcotic drugs; (24) seeking admission from a foreign contiguous territory or adjacent island after arrival there by a nonsignatory transportation line; (25) over sixteen years of age, physically capable of reading, who cannot read and understand some lan- guage or dialect; (27) seeking to enter the United States to engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States as described in section 212 (a) (27) of the Act; (28) aliens described in section 212 (a) (28) of the Act, including anarchists, Communists, advocates of proscribed activities, or members of or affiliates with proscribed organizations; (29) aliens who probably would, after entry, engage in subversive or other activity described in section 212 (a) (29) of the Act; (31) one who for gain knowingly aided or abetted any other alien at any time to enter or try to enter the United States in violation of law. I (am) (am not) a member of any class excludable from the United States. I am a member of the following class or classes excludable from the United States: 35. I have had the provisions of Item 34 explained to me and I claim exemption therefrom for the following reasons: [The possession of a visa does not entitle the bearer to enter the United States if, upon arrival at a port of entry in the United States, he is found to be inad- missible under the immigration laws.] Lows Samethick (Signature of applicant) [SEAL] Subscribed and sworn to before me this SECOND day of DECEMBER 1958 Service No. 2737 Tariff Item No. Fee Paid: U. S. $5. Local CY. equiv. falsica Madison M. Adams Jr., Vice Consul of the United States of America. 21 UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION PORT OF IMMIGRANT CLASSIFICATION: 4 12/2/58 I certify that named hereinjar in the United States at this port on the QEA-742/21 Nonquota Quota X (Symbol) (Symbol) (Name of vessel or flight No-of gircraft), on 1959 and was Visa Petition No., if any: (Day, month, year) inspected by me and detained admitted for further inquiry by special inquiry officer s American ongulate General under { Symbol Section Kenney of the Immigration and Nationality Act. at Sydney, Australia (Immigration officer) IMMIGRANT VISA NO. 866 nonpreference, Czechoslovakinn (State quota) ACTION OF SPECIAL INQUIRY OFFICER Issued on December 2,1958 The immigrant named herein was (admitted) (excluded) and no appeal taken (Day, month, year) land appeal taken Symbol The validity of this visa expires midnight, at the end of under Section of the Immigration and Nationality Act. April 1,1959 (Day, month, year) (Special Inquiry officer) Nationality (if stateless, so state, and give previous nationality) ACTION ON APPEAL Admitted Excluded Date This visa is issued under section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. SSE [SEAL] of Jrs, Vice of the Service No. United States of America. Tariff Item No. Fee Paid: U. S. $20. Sign Local CY. equiv. L9124x 2738 the Passport No. E 182259 or other travel document (describe) STAT'STICS Australian passport Issued- To Lewis Sanitrik By Passport Office, Sydney, Australia On December 16,1957 I-151 MAILED FEB 6 1959 Expires December 16.1962 U. GOVERNMENT PRINTING OFFICE 16-73220-1"
}
