{
	"anumber": "A11507210",
	"id": "A11507210_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11507210_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION., No. 123"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Slovakia"]
		},
		"years": {
			"ms_years_nlp_v1": [1931, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "[No. 123] STATUTORY DECLARATION. ) Here insert name, address and I, (1) Ernest N. Rudlow, Interpreter, occupation of , , do solemnly and sincerely person making the of 137 Darling St. , Balmain NSW, declaration, Here insert matter declare (2) declared to. Where he matter is long it hould be set out in umbered para- I am the Proprietor of the business known as \"RUDLOF'S aphs. TRANSLATION SERVICE, carrying on business at No 77 King Street, Sydney, and duly registered as a firm in the Registrar General's Department, Sydney. Annexed hereto and marked \"A\" is my Translation from the Slovak text of a Birth Certificate, issued on the 30th April, 1931, by the State Registry in Bratislava (Slovakia) in respect of one LUDOVIT SANITRIK. And I also declare that the translation of the said document is a true and correct one. And I make this solemn declaration by virtue of the Statutory Declarations Act 1911-1922 conscientiously believing the statements contained therein to be true in every particular (3) (3) Signature of person making the declara- tion. Emest N. Rindow Declared at Sydney the Nineteenth day of May 1958 before me, (4) J.P. (4) Signature of person before whom the declaration is made. (5) (5) Here insert title of person before whom the declaration is made. NOTE.- - Any person who wilfully makes a false statement in a Statutory Declaration is guilty of an indictable offence, and is liable to imprisonment, with or without hard labour, for four years"
}
