{
	"anumber": "A11638538",
	"id": "A11638538_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS FOR APPLYING FOR AN ALIEN REGISTRATION RECEIPT CARD (FORM I-151, GPO 957-833"
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Estonia",
				"Cuba",
				"Bulgaria",
				"Poland",
				"Albania",
				"Hungary",
				"China",
				"United States",
				"Vietnam",
				"Latvia",
				"Lithuania"
			]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/31/2023 APPLICANT: DO NOT WRITE BELOW THIS LINE (For use in searching Records of Arrival) RECORDS EXAMINED RECORDS FOUND Card Index Port of Entry: Index Books Name at Time of Entry: Manifests Date of Admission: Marital Status: Signature of Searcher Means of Arrival (Vessel, Airline, etc.): (For use by Immigration or Consular Officer) The applicant was interviewed by me under oath on at (date) (city) Remarks: (Signature) (Title) I recommend that the application be Granted MAY Denied APPROVED DISAPPROVED Immigration Officer Blaur Date District Director Date INSTRUCTIONS 1. PURPOSE - To apply for an Alien Registration Receipt Card (Form I-151) for any of the reasons listed in item 1 on the face of this form. This application may be used only by an alien who is a lawful permanent resident of the United States. 2. HOW TO PREPARE - Fill in, in single copy only, by typewriter, or print in block letters, in ink. 3. DOCUMENTARY EVIDENCE - You are required to submit with this application any Alien Registration Receipt Card (Form I-151) or other evi- dence of alien registration now in your possession. An application for a new Alien Registration Receipt Card in a name other than the name which appears on the card previously issued to you may be approved only if your name has been changed by order of any court of competent jurisdiction, or by marriage. If you are applying for the issuance of a card in a changed name, you must attach to this application a certified copy of the public record of your marriage or of the decree of the court changing your name. If you live in a state where, under the decree of the court changing your name, further acts were required of you before the decree became final, you must also attach a certificate from the court that you have complied with the conditions of the decree changing your name. 4. PHOTOGRAPHS - You are required to send with this application 2 identical photographs of yourself taken within 30 days of the date of this application. These photographs must be 11/2 x 1 1/2 inches in size, and the distance from top of head to point of chin should be approximately 1 1/4 inches. They must NOT be pasted on the cards or mounted in any other way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group pictures, full-length portraits, or machine-made photographs will not be accepted. DO NOT SIGN YOUR PHOTOGRAPHS. Using crayon or soft pencil to avoid possible mutilation of the photographs, write your alien registration number lightly on the reverse of the photographs. Consideration will be given to waiver of photographs for applicants who are confined due to age or physical infirmity. 5. DATE OF YOUR ARRIVAL - If you do not know the exact date of your arrival in the United States, or the name of the vessel or port, and you cannot obtain this information by consulting your family or friends who came over with you, give the facts of your arrival as you remember them in the appropriate blank spaces on the first page of this form. Your Immigrant Identification Card or your passport, ship's card, or baggage labels, if you have them, may help you to answer these questions. 6. FEE - If you checked \"(a)\", \"(b)\", or \"(c)\" of item 1, a fee of $5.00 must accompany this application. Otherwise, no fee is required. Remit- tances should be made payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing in the Virgin Islands, remit- tances should be drawn'in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" If you mail this application, attach money order or check. DO NOT SEND CASH. The fee is required for filing the application and is not returnable regardless of action taken thereon. 7. USE OF FORM I-151 AS TRAVEL DOCUMENT - The rightful holder of Form I-151 may present that document at a United States port of entry, in place of a visa, when returning to the United States after a temporary absence not exceeding one year, except when restrictions on travel to, in or through Albania, Cuba, Outer Mongolia, Communist portions of China, Korea and Viet-Nam; Bulgaria, Czechoslovakia, Estonia, Hungary, Latvia, Lithuania, Poland, Rumania, the Soviet Zone of Germany (**German Democratic Republic\"), the Union of Soviet Socialist Republics, or Yugoslavia are applicable. Information concerning exemptions from such restrictions may be obtained at any Immigration and Naturalization Service office. 8. WHERE TO SUBMIT THIS APPLICATION - If you are in the United States, submit the application to the Immigration office having jurisdiction over the place where you are residing. If you are outside the United States, submit it (either in person or through a United States consular officer) to the United States Immigration office outside the United States having jurisdiction over the place where you are temporarily sojourning. If you check item 1(g) you must present the application in person at the Immigration office where you will be finge>printed and registered. GPO 957-833"
}
