{
	"anumber": "A11638538",
	"id": "A11638538_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "National Archives and Records Administration ( Freedom of Information Act Request Form, NARA-FOIA-1023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/31/2023 (3) (31) If serving or ever served in the Armed Forces of the United States, give branch ; from , 19 to , 19 and from 19 to 19 inducted or enlisted at ; Service No. ; type of discharge ; ; rank at discharge ; (Honorable, Dishonorable etc.) reason for discharge (alienage, conscientious objector, other) Reserve or National Guard from 19 (32) My occupation is Retired since 1978 Supported Union to also 13 List the names, addresses, and occupations (or types of business) of your employers during the last 5 years. (If none, write \"None.\") month List present employment FIRST. FROM To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS 14 (b) (a) , 19.78 PRESENT TIME None (retired 1978) 1668 1978 Auto. detailer Chtylers Corp- laboo (c) 19 19 (d) 19 19 15 (33) Complete this block if you are or have Marrito been married. Julie I Divorced am 197E Married name of my husband or wife is (was) C1 adys Arnold (Separated, married, divorced 16 We were married on 1944 10/16/86. widowed) Cos Angeles at Relize City Belize He or she was born at Belize City Belize on 10/26/44 2/17/32 He or she entered the United States at (place) on (date) for permanent residence and now resides with me apart from me at (Show full address if not living with you.) He or she was naturalized on at ; Certificate No (fa or became a citizen by His or her Alien Registration No. is NO Docs (34) How many times have you been married? One How many times has your husband or wife been married?/ One If either of you has been married more than once, fill in the following information for each previous marriage. (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE CITIZEN ALIEN ENDED 19% (4) 1944 01/15/75 Gladys Arnold F Divorce 9/17/86 Alfred Jeruis Devorce (c) (d) 207 No Other (35) I have children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- 3 Number) wise give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date (f) Port of Entry (g) Alien (Country) Born of Entry Registration No. (h) Now Living at- Lorraine F Belize 4-28-38 Unknown Miami, Florida FOIA (b)(6) Et No other (36) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) I DO NOT want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $35 for each child for whom you want certificates, otherwise, send no money with this application.) ( Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages."
}
