{
  "anumber": "A11638538",
  "id": "A11638538_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0043/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, FORM APPROVED 443-R400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1960,
        2023,
        1940,
        1915,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/31/2023 FORM APPROVED BUDGET BUREAU NO. 43-R400 UNITED STATES Date Filed Fee Stamp DEPARTMENT OF JUSTICE Immigration and Naturalization Service St RECEIVED APPLICATION FOR STATUS INFORMATION AS PERMANENT RESIDENT of JAN14 1960 File Number (For use under sections 245 or 249 of the Immigration and Nationality Act or sec- Immigration and tion 13 of the Act of Sept. 11, 1957.) Naturalization Service New York, N. Y. (Do not write above this line) (See Instructions before filling in application. If you need more space to answer fully any question on this form, use a 4266 separate sheet and identify each answer with the number of the corresponding question.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: valuet 10/26/60 ) A. I last entered the United States as a nonimmigrant and an immigrant visa is now immediately available to me. Check one) ) B. I have resided in the United States continuously since prior to June 28, 1940. WHITFIELD HUGH EVAN CAIN 2. My name is My alien registration number is (First) (Middle) (Last) 3. My address in the United States is 37--20 108TH STREET CORONA, NEW YORK (No. and Street) (City) (State) 4. I am now a citizen of BELIVE, REP. OF HONDURAS on AUGUST 11TH, 1915 (Month) (Day) (Year) in LA CEIBA, HONDURAS (City) (Province or District) (Country) 5. I last arrived in the United States at the port of MIAMI, FLORIDA (City and State) on 11/1/59 AIRPLANE by VISITOR (Q+) B.V as a (Month) (Day) (Year) (Name of vessel or other means of travel) (Visitor, student, crewman, stowaway, etc.) 6. I have resided at the following places during the past 5 years (include all United States and foreign residences) From To (Street and No.) (City) (State) (Country) Month Year Month Year 37-20 108TH ST. NEW YORK N.Y. 11 59 7. I have been employed at the following places during the past five years (include all United States and foreign employment) Type of work From To Full name and address of employer I did Month Year Month Year 1940 10 BELIZE ELECTRICITY BOARD ENGINEER 1959 8. I am am not married. If you are married give the following: a. Name of spouse GLADYS CAIN Beffish b. Date and place of birth of spouse REPUBLIC OF HONDURAS c. Number of times you have been married ONCE d. Number of times your spouse has been married ONCE e. Number of children NONE DRITISH f. Address of spouse and children 23 KIRKWOOD ALLEY, RECUBLICO HONDURAS BELITE Height Weight Eyes Hair Complexion Identifying Marks or Scars Form I-485 (4-6-59) 514\" 156 Bxo BLK MED NONE"
}