{
  "anumber": "A11638538",
  "id": "A11638538_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0038/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL CERTIFICATE, Form Number: I-141"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1960
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/31/2023 Form I-141 U.S. DEPARTMENT OF JUSTICE IM MIURATION AND NATURALIZATION SERVICE A 11 638 538 (Rev. 12-7-58) MEDICAL CERTIFICATE INFORMATION Port of XX MIAMI, FLA. FEB 23 1960 1. Name of alien Whitfield Hugh Cain 2n Dateliof arrival 11/1/59 3. Steamship PLANE 40 Occupation vice 5. Age 44 6. Sex MALE New Mork N Y CERTIFICATE The above-named person has been examined and found afflicted with (a clear statement of conditions found to exist with \"a dangerous contagious disease\" added if indicated) : 1. EXAMINED 2. 3. MEDICALLY PASSED These findings are based on (here state history, symptoms, physical signs or other data, laboratory, X-ray, etc.) : EXAMINED MEDICALLY PASSED MEDICAL OPINION It is our opinion: 1. That this person at present* able to travel without danger to life. 2. That special care and attention* be required en route. 3. That the condition at present* in a communicable state, and that special precau- tions* be required en route for the safety of others. 4. That the above conditions No. (give No.) * exist on (give date) 5. That the above conditions No. (give No.) * have been detected by competent medical examination on (give date) * 6. That the above conditions No. (give No.) * interfere with the ability of the person to earn a living as (state laborer or other basic occupation) at present. 7. That the above conditions No. (give No.) * be expected to progress and may affect the ability of the person to earn a living as above on (give approximate dates and state future time) 8. That further medical treatment* indicated at present. USPHS Outpatient Clinic 67 Hudson Street Vincent R. Reilly, M. D. New York 13, New York (Surgeon, U. S. Public Health Service) Sr. Surgeon (R) FEB1 9 1960 (Surgeon, U. S. Public Health Service) *Write in the appropriate words: \"is\" or \"is not,\" \"will\" or \"will not,\" \"may\" or \"may not.\" To be completely filled in and submitted to U. S. Immigration and Naturalization Service in every case examined or treated except for cases found O. K. on preliminary examination. GPO 948868"
}