{
	"anumber": "A11638538",
	"id": "A11638538_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IN THE MATTER OF WHITFIELD HUGH CAIN FOR PERMANENT RESIDENCE IN THE UNITED STATES"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1915, 2023, 1960, 1934]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/31/2023 X IN THE MATTER OF WHITFIELD HUGH CAIN AFFIDAVIT FOR PERMANENT RESIDENCE IN THE UNITED STATES X STATE OF NEW YORK ) ) SS.: COUNTY OF NEW YORK) RUSSELL S. CAIN, BEING DULY SWORN, DEPOSES AND SAYS: THAT MY CITIZENSHIP IS NOW PENDING WITH THE IMMIGRATION AUTHORITIES. I ENTERED THE UNITED STATES IN THE YEAR 1934 AT THE PORT OF NEW YORK CITY ON THE S. S. GATUN, WHICH SHIP SAILED FROM THE PORT OF LA CEIBA, SPANISH HONDURAS. I AM CURRENTLY RESIDING AT 37-20 108TH STREET, CORONA, NEW YORK. I AM THE BROTHER OF WHITFIELD HUGH CAIN. MY BROTHER WHITFIELD, WAS BORN AUGUST 11TH, 1915, LA CEIBA, SPAMISH HONDURAS. I AM A SELF EMPLOYED BUSINESS MAN WHO IS ENGAGED IN THE OPERATION OF A BILLIARD PARLOR. I HAVE BEEN ENGAGED IN THIS ACTIVITY FOR THE PAST NINE YEARS. MY PLACE OF BUSINESS IS LOCATED AT 1697 PARK AVENUE, NEW YORK CITY. OVER THE PAST YEARS I HAVE GROSSED FROM THIS BUSINESS SOME FORTY THOUSAND DOLLARS, AND HAVE NETTED ON THE AVERAGE FOUR THOUSAND DOLLARS. ALSO ATTACHED ARE BANK STATEMENTS WHICH IS MADE A PART OF THIS AFFIDAVIT. I OWN MY HOME LOCATED AT THE ABOVE STATED ADDRESS WHICH IS VALUED AT THE MARKET PRICE OF TWENTY-SEVEN THOUSAND DOLLARS. THE PHYSICAL ASSETS OF MY BUSINESS IS IN THE AMOUNT OF SOME NINE THOUSAND DOLLARS. I OWN AN AUTOMOBILE WITH CURRENT MARKET VALUE OF FIFTEEN HUNDRED DOLLARS. MY SOLE DEPENDENT IS MY WIFE WHO IS FORTY YEARS OLD, AND TWO CHILDREN. | AM READY AND WILLING TO DEPOSIT A BOND, IF NEED BE, WITH THE UNITED STATES IMMIGRATION AUTHORITIES TO GUARANTEE THAT MY BROTHER WILL NOT BECOMEA PUBLIC CHARGE WHILST RESIDING IN THE UNITED STATES. I DECLARE MY BROTHER IS NOT AN ANARCHIST NOR BELIEVES IN UNLAWFUL DAMAGE, INJURY, OR DESTRUCTION OF PROPERTY OR SABOTAGE NOR A DISBELIEVER IN OR OPPOSED TO ORGANIZED GOVERN- MENT, NOR A MEMBER OF, OR AFFILIATED WITH ANY BODY OF PERSONS TEACHING DISBELIEF IN OR OPPOSITION TO ORGANIZED GOVERNMENT. I MAKE THIS AFFIDAVIT WITHOUT ANY RESERVATION FOR I FEEL THAT MY RELATIONSHIP TO THE APPLICANT WARRANTS THE SUPPORT WHICH I AM PREPARED TO EXTEND TO HIM. I THEREFORE RESPECTFULLY PRAY THAT MY BROTHER CURRENTLY RESIDING AT THE ABOVE ADDRESS WITH ME, FOR PERMANENT RESIDENCE TO RESIDE WITH MY WIFE AND SELF, AND TWO CHILDREN. ME SWORN TO BEFORE/THIS 8TH DAY OF MARCH, 1960. Rusull 1 Can RUSSELL S. CAIN"
}
