{
  "anumber": "A11638538",
  "id": "A11638538_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11638538_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REFERENCE REQUEST—FEDERAL RECORDS REQUEST FORM, 5011-106"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/31/2023 REFERENCE REQUEST-FEDERAL RECORDS CENTERS NOTE: Use a separate form for each request. SECTION I-TO BE COMPLETED BY REQUESTING AGENCY RECORD GROUP NO. ACCESSION NO. AGENCY BOX NUMBER RECORDS CENTER LOCATION NUMBER 74-A-0580 OF 538 334854 DESCRIPTION OF RECORD(S) OR INFORMATION REQUESTED (Include file number and title.) A 11 638 538 REMARKS 1-400/Dicit NATURE OF SERVICE FURNISH COPY OF PERMANENT TEMPORARY OTHER RECORD(S) ONLY WITHDRAWAL LOAN OF RECORD(S) REVJÉW (Specify) NAME OF REQUESTER TELEPHONE NO. FTS DATE CMW 1/66/87 RECEIPT OF RECORDS NAME AND ADDRESS OF AGENCY Requester please sign, date and return this form, for INS/Los file item(s) listed above, ONLY if the block to right (Include has been checked by the Records Center. street address, building, SIGNATURE DATE room no. and ZIP Code) (In Washington, D.C. area also include STOP number) SECTION -FOR USE BY RECORDS CENTER REMARKS RECORDS NOT IN CENTER CUSTODY RECORDS DESTROYED WRONG BOX NUMBER-PLEASE RECHECK ADDITIONAL INFORMATION REQUIRED TO IDENTIFY RECORDS REQUESTED MISSING (Neither record(s), information nor charge card found in container(s) specified) RECORDS PREVIOUSLY CHARGED OUT TO (Name, agency and date): DATE SERVICE TIME SEARCHER'S REQUIRED INITIALS 1/28/87 387 SECTION III-TO BE COMPLETED BY REQUESTING AGENCY General Services Administration Federal Records Center NARS NOTE: In Washington, D.C. area TO send to STOP 386 (City) (State) (Zip Code) 5011-106 NSN 7540-00-682-6423 PREVIOUS EDITION USABLE OPTIONAL FORM 11 (Rev. 9-79) Prescribed by GSA, FPMR (41 CFR) 101-1104"
}