{
	"anumber": "A11776754",
	"id": "A11776754_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEBARTMENT OF JUSTICE Immigration and Naturalization Service File No. 776 754 CB/ecm 4-17-59 Please be advised that in addition to Sarah Gizzella Hartenbaum the statements from your friends, it 5447 Lemon Grove Ave., is necessary to submit documentary evidence such as listed below. Perhaps Los Angeles, Calif. a U.S. census record would help. A blank form for that is enclosed. This office has received your Before further action can be taken, it is necessary that you mail or bring to this office, with this letter, the documents or information checked V below. Your application (petition) is returned herewith for Money order or check for $ made payable to the \"Immigration and Naturaliza- tion Service, Department of Justice.\" Do not send cash or postage stamps. photographs of yourself, exactly alike, 2 X 2 inches, printed on thin paper, with light background, showing front view without hat, taken within the last 30 days. Sign full name on front of all photographs in the margin and not across face or clothing. Evidence* that you lived in the United States before June3e-194 0 6 Your Alien Registration number Naturalization certificate of Birth or baptismal certificate of Marriage certificate of Divorce decree of Death certificate of The attached N-105 filled in according to instructions contained in it, with necessary fee, photographs, and supporting evidence. * This is necessary as a record of your alleged lawful admission to the United States for permanent residence has not been identified. Documentary evidence * to show your continuous residence in the United States from shortly before July 1, 1924, to the present time. * This evidence may be in such form as affidavits, birth certificates, baptismal certificates, mar- riage certificates, bankbooks, school records, insurance policies, receipts, licenses, letters, postal cards, employment records, listings in city directories, membership in organizations, police records, census records, leases, deeds, and any records showing your presence in the United States. Form N-14 (Over) GPO 975503 (Rev. 12-18-57)"
}
