{
	"anumber": "A11799647",
	"id": "A11799647_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11799647_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, N-430A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U. S. Department of Justice Screened by NARA, 5/9/2023 Expires 3/31/84 Immigration and Naturalization Service Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 File or A # All 799 647 Date 11/02/1987 agsignel rigistal 38 ni 10 You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, AND PLACE, shown below. mai 10 Date 11/25/1987 SOCORRO DE ARANDA bas Time 8:45 AM 827 So MARIPOSA LOS ANGELES CA 90005 Place 300 NORTH LOS ANGELES STREET LoreM LOS ANGELES, CA 90012 FEDERAL BUILDING - DOWNTOWN ROOM NUMBER : B-119 You MUST BRING the following with you: - This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED IN. - Alien Registration Receipt Card. ERNEST E. GUSTAFSON - Any evidence of Selective Service Registration. DISTRICT DIRECTOR - Any documents you have which you used in connection with any entries into the United States. - Those items noted on the reverse side of this letter which are applicable to - Filing Fee. NO CASH ACCEPTED. BRING $50 MONEY you. ORDER OR CASHIERS CHECK ONLY. MAKE PAYABLE TO DISTRICT COURT BE PREPARED TO SPEND 4-5 HOURS FOR COMPLETION. Please KEEP this APPOINTMENT even if you do not have all the items noted above or those on the back. However, you MUST bring the Filling Fee. Form N-430A IMPORTANT - PLEASE SEE REVERSE"
}
