{
  "anumber": "A11776754",
  "id": "A11776754_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Form I-102, I-102"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1923,
        1910,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "2 (4) Have you ever filed a declaration of intention? Yes No. If \"Yes,\" state when and in what court (5) Have you borne any hereditary title or have you been of any order of nobility in any foreign state? Yes No. 6) How many times have you been married? 2 How many times has your husband or wife been married? 2 If either of you has been married more than once, fill in the following information for each previous marriage. (Check one) PERSON MARRIED DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED How MARRIAGE SEX WAS ENDED CITIZEN ALIEN (a) 1910 1923 David Schwartz M Death (b) 1924 1942 Benjamin Hartenbo Death (c) (d) (7) Have you ever been an inmate of an insane asylum or similar institution? Yes No. (8) Have you ever been treated for any mental disorder? Yes No. (9) Are you or have you ever been a narcotic drug addict? Yes No. (10) Have you ever, in the United States or in any other country, been arrested, charged with violation of any law or ordinance, summoned into court as a defendant, convicted, fined, imprisoned, or placed on probation or parole, or forfeited collateral for any act involving a felony, misdemeanor, or breach of any public law or ordinance? Yes No. If \"Yes\" give the following information for every case. If necessary continue this list on another sheet of paper. WHEN WHERE (City) (State) (Country) OFFENSE INVOLVED OUTCOME OF CASE (a) (b) (c) (d) (e) (f) (g) (11) Are deportation proceedings pending against you, or have you ever been deported or ordered deported, or have you ever applied for suspension of deportation or for pre- examination? Yes No. (12) What organizations, clubs, or societies in the United States or in any other country have you been a member of during the last 10 years? (If none, write \"none.\") (a) NONE (e) (i) (b) (f) (j) (c) (g) (k) (d) (h) (l) (13) What organizations, clubs, or societies in the United States or in any other country have you been a member of before the last 10 years? (If none, write \"none.\") (a) NONE (e) (i) (b) (f) (j) (c) (g) (k) (d) (h) (l) (14) Do you owe a tax of any kind to the Federal Government? Yes No. (15) Have you ever filed a Federal Income Tax Return? Yes No. If \"Yes\" give the last year filed (16) Have you ever misrepresented yourself as a United States citizen either by voting, or by obtaining employment, a license, permit, privilege or other benefit or advantage for which only United States citizens were eligible? Yes No. (17) Have you at any time been a member of the Communist Party in the United States or any other country? Yes No. If \"Yes\" give name of country and dates. (18) Was your father or mother ever a citizen of the United States? Yes No. If \"Yes\" give full information (19) If male, did you ever register under United States Selective Service laws or draft laws? Yes No. If \"Yes\" give date Were you ever exempted from service because of conscientious objections, alienage, or other reasons? Yes No. If \"Yes,\" state reasons (20) If you ever served in the Armed Forces of the United States, state branch ; from 19 to 19 (Army. Navy, etc.) Service No. ; type of separation ; reason for separation, alienage: conscientious objections; (Honorable. Dishonorable, etc.) other (If \"other\" state/details) (21) If the law requires it, are you willing (a) to bear arms on behalf of the United States? Yes No: (b) to perform noncombatant services in the Armed Forces of the United States? Yes No: (c) to perform work of national importance under civilian direction? Yes No. (22) Have you ever deserted from the military, air, or naval forces of the United States while this country was at war? Yes No. Have you ever left the United States or the jurisdiction of the district where you registered for the draft to avoid being drafted into the military, air, or naval forces of the United States? Yes No. (23) The law provides that no person shall be regarded as a person of good moral character who, during the period of residence required for naturalization, is or was an habitual drunkard; has committed adultery; derived income principally from illegal gambling activities; has given false testimony for the purpose of obtaining any benefits under the immigration and naturalization laws; is or was a polygamist or practiced or advocated polygamy; is or was a prostitute, or engaged in or received support or the proceeds from prostitution or procured or imported or attempted to procure or import persons for prostitution or any other immoral purposes or who came to the United States to engage in any other unlawful commercialized vice: knowingly and for gain encouraged or aided any alien to enter the United States illegally; has committed a crime involving moral turpi- tude; or is or has been an illicit trafficker of narcotic drugs. Have you at any time, either within or outside the United States, ever been such a person or ever committed any of these acts? Yes No. If answered \"Yes\" state when, where, and the nature of the Conduct"
}