{
	"anumber": "A11776754",
	"id": "A11776754_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, Form approved - Budget Bureau No. 4-R079.7."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1951, 1906]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form approved. UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R079.7. IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION Mail or take to: (Show the exact spelling of your name as it appears on your/alien registration receipt IMMIGRATION AND NATURALIZATION SERVICE, card, and the number of your card. If you did not register se state.) Name Sarah Gizzella Harten baum 458 South Spring Street Los Angeles 13, California No. APPLICATION TO FILE PETITION FOR NATURALIZATION I desire to file a petition for naturalization in the Dept. of Justice Court at has Angeles (City) Calif Gizzella (Name of court) Sarah Harten baumo (State) 5447 hemon Grove (Print or type your name) hos Angeles (City) (Print or type apartment number. street address. and if appropriate \"in care of' LOS Aneeles Calif (County) (State) INSTRUCTIONS TO THE APPLICANT IMPORTANT.-Under the naturalization laws, citizenship may be revoked for concealment of a material fact or for willful misrepresentation in connection with the naturalization proceedings. It is important therefore that you fill out pages 1, 2, 3, and 4 of this form completely and as accurately as possible, using ink or a typewriter. If you do not have enough room to answer a question, continue your answer on another sheet of paper and show the number of the question you are continuing. PHOTOGRAPHS.-You must send with this application three identical photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 by 2 inches in size, and distance from top of head to point of chin should be approximately 11/4 inches, must not be pasted on a card or mounted in any other way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. DO NOT SIGN YOUR PHOTOGRAPHS. DATE OF YOUR ARRIVAL.- you do not know the exact date of your arrival in the United States, or the name of the vessel or port, give the facts as you remember them. If the date of your arrival in the United States was on or before June 29, 1906, you should submit with this application documentary evidence of your residence in the United States prior to that date. Such documents may be family Bible entries, deeds of record, wills or other authentic legal documents, life insurance policies, bankbooks and records, employment records or other documents showing that you were in the United States on or before June 29, 1906. Do not submit such documents if your arrival in the United States was after June 29, 1906. ALIEN REGISTRATION RECEIPT CARD.-DO NOT SEND your alien registration receipt card with this application. FINGERPRINT CARD.- This application must be accompanied by a record of your fingerprints. Fingerprint cards, with instructions for recording your fingerprints, are available at any office of the Immigration and Naturalization Service. (1) In what places in the United States have you lived during the last 5 years? FROM- To- STREET ADDRESS CITY AND STATE (a) Oct 15 1951 To Present 19 5447 Lemon Gr. hos Angeles Calif (b) 19. 19 (c) 19. 19 (d) 19 19 (e) 19 19 ($) 19 19 (g) 19 19 (h) 19 19 (i) 19 19. (f) 19. 19 (2) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If necessary, use an additional sheet) FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 19 19 (b) 19 19 (c) 19. 19 (d) 19 19 (e) 19. 19 (f) 19 19. (g) 19 19 (h) 19 19 (3) Have you been out of the United States since you first arrived? Yes or No If \"Yes\" fill in the following information for every absence of less than 6 months. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU RETURNED DATE RETURNED TO THE UNITED STATES UNITED STATES Form N-400 (Rev. 10-15-57)"
}
