{
	"anumber": "A11799647",
	"id": "A11799647_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11799647_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Ennombre de la República de México, 78008"
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "9F2 so Screened by NARA, 5/9/2023 OHIFOA oll #sondern 110 GENERAL DEL Ennombredel Repúblicade México, UNIDOS y como Oficial del Estado Civil de este lugar, bago saber a los que la presente vieren, y certi- MEX. YUCATAN, fico ser cierto, que a la foja S 395 y 396. del libro DEL DERECHOS: $1.00 número 131 de NAC IMIENTOS correspondiente al Artículo 139 Fraccion 15 de la Ley General de Hacienda. año de 1914- que existe en esta Oficina a mi Registro de Emision cargo, se encuentra un acta del tenor siguiente: MERIDA, No. 78008 NUMERO 2562. Dos mil quinientos sesenta y dos. NAC IMIENTO Y RECONO_ C IMIFINTO de la niña María del Socorro Rodríguez. Derechos gratis. Maternidad. FN MFRIDA, á trece de noviembre de mil novecientos ca- torce siendo las cuatro y tres cuartos de la tarde ante mi Licen- ciado Cabir Gabriel Aznar y Pérez,Director General Interino del Re gistro Civil del Estado y Juez del Ramo en esta Capital, compareció el Administrador del Hospital 'O'Horán de esta Ciudad,con poder de Fugenia Rodriguez, soltera, de treinta y seis años de edad natural de Oaxaca y vecina de Progreso, según documento que exhibe F el com pareciente y mando archivar, dijo: que en el Pabellón de Haterni- dad aue existe en el Fstablecimiento á su cargo nació la niña MA_ RIA DFI SOCORRO ODRIGUEZ el dia veinte y dos de octubre del año en curso a las cinco de la mañana; que la poderdante tiene volun- tad de reconocer a la mencionada niña,como des-de luego 10 verifi- ca en calidad de hija natural suya, para que goce de todos los dere chos y privilegios aue las leyes acuerdan a los de su clase. Pre- sentes los testigos José M. Hernandez, casado de veinte y cuatro a- Kos de edad I José Ignacio Esquivel, soltero, de veinte I tres, ambos empleados públicos de esta vecindad,se levantó esta acta que les fue leida y quedaron conformes, firmando para constancia. Gabriel Aznar y Pérez.- Mariano Medina M.- José M. Hernandez. José I.Fsqui vel. Rubricas, Y A PEDIMENTO de parte interesada, expide la presente certificación en Mé - rida de Yucatán, a los trece dias del mes de octubre del año de mil nove- cientos cincuenta ocho. Testado. Gabir. -y. No vale. La"
}
