{
	"anumber": "A11776754",
	"id": "A11776754_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR SEARCH OF CENSUS RECORDS, Form 10-611"
		},
		"years": {
			"ms_years_nlp_v1": [1930, 1910, 1940, 1890, 1880, 1950, 1920, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 10-611 DEPARTMENT OF COMMERCE DO NOT USE THIS SPACE (8-8-56) APPLICATION FOR SEARCH OF CENSUS RECORDS BUREAU OF THE CENSUS CASE NO. RETURN TO: U. S. Department of Commerce, Bureau of the Census, Washington 25, D. C. (For further instructions see reverse side.) FULL NAME OF PERSON WHOSE CENSUS RECORD IS REQUESTED (Print or type) FIRST NAME MIDDLE NAME MAIDEN NAME-IF ANY PRESENT LAST NAME NICKNAMES DATE OF BIRTH PLACE OF BIRTH RACE SEX FULL NAME OF HUSBAND OR WIFE OF PERSON WHOSE RECORD IS REQUESTED FIRST MARRIAGE SECOND MARRIAGE THIRD MARRIAGE FULL NAME OF FATHER AND MOTHER OF PERSON WHOSE RECORD IS REQUESTED FATHER MOTHER (SEE INSTRUCTION 1) PURPOSE FOR WHICH RECORD IS TO BE USED (MUST BE GIVE STATED PLACE HERE) OF to RESIDENCE prince AT EACH year ? DATE LISTED Immigration BELOW for nationalization NUMBER AND STREET CITY TOWN TOWNSHIP NAME OF PERSON WITH WHOM LIVING CENSUS DATE COUNTY AND STATE (Very important) (Precinct, beat, etc.) (Head of household) JUNE 1. 1880 SEE INSTRUCTION 2 JUNE 1. 1900 SEE INSTRUCTION 2 APRIL 15. 1910 SEE INSTRUCTION 3 JAN. 1. 1920 SEE INSTRUCTION 2 APRIL 1. 1930 SEE INSTRUCTION 3 APRIL 1. 1940 SEE INSTRUCTION 3 APRIL 1. 1950 SEE INSTRUCTION 3 SEE INSTRUCTION 5 This authorizes the Bureau of the Census to send I hereby certify that information furnished about anyone other than the applicant will the record to: (If other than to person whose FEE REQUIRED: A money order or check payable to not be used to the detriment of such person or persons. record is requested, give name and address of Census, Department of Commerce, must be sent with SIGNATURE OF APPLICANT other person or agency. See instruction 4.) this application. (Do not print) DO NOT SEND CASH (See instruction 7) NUMBER AND STREET (Check type of service requested) $3.00 for a search in regular turn for information about PRESENT ADDRESS OF one (1) person only, in not more than two censuses APPLICANT CITY ZONE STATE (this service takes several weeks), OR, $4.00 for a search ahead of $3.00 searches. SEE INSTRUCTION 6 FOR EXTRA COPIES IF SIGNED ABOVE BY MARK (X), TWO WITNESSES MUST SIGN HERE SIGNATURE *The 1890 Census records were destroyed by fire. $ for extra copies SIGNATURE A1.68"
}
