{
  "anumber": "A11776754",
  "id": "A11776754_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Government Printing Office Verification Form, 1957-0-446078"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Hungary",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1897,
        1958,
        1902,
        1957,
        1924,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "4 (13) My father's full name is/was Benjamin Joseph weiss (14) My mother's maiden name was Katherine handisman (15) My last place of foreign residence was Kassa Hungary (16) I migrated to the United States from the port of Rotterdam Holland (Country) (City) (Country) (Answer questions 17, 18, 19, only if you arrived in the United States before July 1, 1924.) (17) person to was coming was The in the United States whom I Malvine Klein - SisTer (18) The place in the United States to which I was going was Cleveland Ohio (19) The names of some of the passengers or other persons I traveledwith,includingmembers of my ownfamily and their relationship to me, if any, are Jacob Klein Brother-in-haw Date: aug 25, 1958 Her mark X-Sarah (Signature of applicant) Hartenhoum Grzella Daughter (hydia 5447 Lemon Mr (Address at which applicant receives mail) TO APPLICANT: DO NOT FILL IN BLANKS BELOW THIS LINE Las angeles, Calif. NOTE CAREFULLY -This application must be sworn to before an officer of the Immigration and Naturalization Service at the time you appear before such officer for examination on this application. AFFIDAVIT I, , do swear (affirm) that I know the contents of this application comprising pages 1 to 4, inclusive, and the supplements thereto, Forms No. , subscribed to by me; that the same are true to the best of my knowledge and belief; that corrections numbered ( ) to ( ) were made by me or at my request; and that this application was signed by me with my full, true, and correct name. (Complete and true signature of applicant) Subscribed and sworn to (affirmed) before me by the abovè-mentioned applicant at the preliminary interrogation (examination) at this day of , , 19 I certify that before verification the above applicant stated in my presence that he had (heard) read the foregoing application and understood the contents thereof. (Title of officer) For use in searching Records of Arrival RECORDS EXAMINED RECORDS FOUND UNABLE 10 VERIFY Card index JK 1897-1902 Place Index books Name Manifests Rotterdam 4-2-1900 Date Manner Marital status Th folomis OCT 15 1958 (Signature of person making searob) For sale by the Superintendent of Documents, U. S. Government Printing Office Washington 25, D. C. FILE Clink U. S. GOVERNMENT PRINTING OFFICE 1957-O-446078 A .Y.C. VERIFICATION"
}