{
  "anumber": "A11776754",
  "id": "A11776754_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION STATEMENT OF FACTS for PREPARATION of PETITION, No. 3"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Hungary",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1916,
        1884,
        1914,
        1944,
        1920,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Are you able-to: Write the English Language yes not No. 3 Speak the English Language yes no: YES ALIEN REGISTRATION Read the English [STATEMENT OF FACTS No Name Sarah Gizzella HarTenbawrn FOR PREPARATION OF PETITION No. / It 776754 (1) My full, true, and correct name is Sarah Gizzella HarTen baum (2) My present place of residence is 5447 Lemon Grove Ave (Full. true name. without aboreviation, and any other name which has been used must appear here) (3) My present occupation is Housewlife (Number and street) (City or town) hos Angeles Los (County) Angeles (State) Calif (4) I was born on Sent (Month) (Day) 15 1884 (Year) in Joszefi (City or town) Gyomor (County. district. mease or State) (Country) (5) My personal description is as follows: Sex 7 ; complexion fair province, ; color of eyes Green ; color of hair Gray ; height st. lungary feet inches; weight 120 pounds; visible distinctive marks country of which I citizen, subject, national Hungary am a or ; (6) I (am, am not) married; the name of my wife or husband was David Schwartz - 2 Benjamin Marten bauin we were married on Both deceased at (Year) (City or town) MA; ; (Month) (Day) (State or country) he or she was born at (City or town) (County. district. province, or State) (Country) on ; entered the United States at (Month) (Day) (Year) (City or town) OCT7 on for permanent residence du the (State) (Month) (Day) (Year) m United States and now resides at (City or town) (State or country) and was naturalized on at (Month) (Day) (Year) (City or Town) (State) certificate No. or became a citizen by F (')) I have 3 children; and the name, sex, place and date of birth, and present place of residence of each of said children who is living, are as follows: NAME SEX PLACE BORN DATE BORN Now LIVING AT- Barney Schwartz Gleveland Ohio 10/25/1914 530 So Berenda LACalif Cornelia DiGregorio Cleveland Ohio 1/7/1916 605% Bronson. LA Calif hydia Oliverio F Cleveland Ohio 9/4/1920 127 So Oxford LA Calif (8) for residence in the United States was at Ellis Island My lawful admission permanent of Sollie Gizzella weiss (City on April (Month) New (State) York, ; or town) under the name 15 1900 (Day) (Year) on the Ship- Rotterdam (Name of vessel or other means of conveyance) (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows: DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES VESSEL OR OTHER MEANS DATE day, year) of CONVEYANCE PORT VESSEL OR OTHER MEANS (Month, day, year) or CONVEYANCE OCT Part (Month, DATE to OFFS $ (10a) I have resided continuously in the United States of America since 1900 and continuously in the State of Ohio-bas Angeles where I now live since 1944 and during the past 5 years I have been physically present in the United States for an aggregate period of 60 months. calif (10b) Do you intend to reside permanently in the United States? Yes No. If \"No,\" explain (11) I (have, have not) heretofore made petition for naturalization No. on at (Month) (Day) (Year) (City) (State) in the Court, which was denied because (12) I wish the naturalization court to change my name to (Give full name desired) TO THE APPLICANT: DO NOT WRITE BELOW THIS LINE. (1st witness) United States (Name) State (Occupation) residing at Physical presence mos. (Number and street) (City or town) (State) (2d witness) Examiner (Name) (Occupation) residing at (Number and street) (City or town) (State) (OVER)"
}