{
	"anumber": "A11776754",
	"id": "A11776754_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11776754_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTMENT OF COMMERCE BUREAU OF THE CENSUS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1930, 1910, 1940, 1880, 1950, 1920, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 10-611 DEPARTMENT OF COMMERCE (8-8-56) BUREAU OF THE CENSUS WASHINGTON 25 INSTRUCTIONS FOR COMPLETING THIS FORM The law provides a penalty for knowingly and willfully making a false statement to any department or agency of the United States as to any matter within its jurisdiction 1. Purpose. tion. Accordingly, even though the information is not found, if a search has been made, the fee cannot be The purpose for which the information is desired must returned. be shown. The purpose enables this office to determine from which census year the information would be most Should it be necessary to search more than two cen- acceptable, saving the expense of additional searches. suses for the information requested, you will be notified to send another fee before further searches are made. 2. Censuses-years 1880-1900-1920. 6. Additional copies of Census information. A system for filing names by sound is available for Additional copies of the information furnished will be these census years. Information can be furnished in prepared at a cost of $1.00 for each additional copy. many instances when only the following information is Fill in the amount of money enclosed and the number given: of extra copies desired in the spaces provided. The name of the person about whom the information is desired. 7. Applicant. The name of the city or county and State where the In general the signed name of the applicant should be person resided. the same as that shown on the line captioned \"full name The name of the head of the household with whom of person whose census record is requested.\" If the this person was living on the various dates of these applicant's name is not the same, an explanation on a censuses. separate sheet of paper should be attached. Additional information is desirable if it can be furnished. 8. Confidentiality. 3. Censuses-years 1910-1930-1940-1950. Information recorded in the Census of 1900 and later If residing in a city at the time these censuses were censuses is confidential and may be furnished only upon taken, it is necessary to furnish the house number, the the written request of the person about whom it relates name of the street, city, county, and State and the or (for a proper purpose) a legal representative such name of the parent or other head of household with as guardian, administrator of estates, etc. A certified whom residing at the time of the census. copy of the court order naming the legal representative is required. If residing in a small town or a rural area, give all available information as to cross-streets, road names, 9. Minor children. township, district, precinct or beat, etc. If the district Information regarding a child who has not reached legal or township is unknown, give the distance from the age may be obtained upon the written request of either nearest town and the direction, also the rural route parent. number. 10. Records of deceased persons. 4. Confidential information given to other than the person about whom it relates. If the record requested relates to a deceased person, the application must be signed by (1) a blood relative in Census information is confidential and cannot be fur- the immediate family (parent, brother, sister or child), nished to another person unless the person about whom (2) the surviving wife or husband, (3) the administra- it relates authorizes this in the space provided or there tor or executor of an estate, or (4) a beneficiary along is proper authorization as explained in instructions 7 with legal evidence of such beneficiary relationship. through 11 on this page. In all cases involving deceased persons, a certified copy of the death certificate is required. 5. Fee required. Tax monies are not available for the furnishing of this 11. Special cases. information. The fee charged is for the expense of Specific information regarding the necessary authoriza- searching the census records and furnishing informa- tions for special cases will be furnished upon request. GENERAL INFORMATION The application on the reverse side of this sheet is for use benefits, insurance and other purposes. in requesting a search of the census records and for a copy Census records prior to 1900 have been transferred to the of the personal information found which includes age, place National Archives and Records Service, Washington 25, of birth and citizenship. This application should be filled in D. C. The Bureau of the Census still makes searches of and mailed to the Bureau of the Census, Washington 25, the 1880 Census records for genealogical, historical, and D. C., together with a money order or check payable to other purposes. The fee for genealogical or historical Census, Department of Commerce, in an amount based upon searches will be estimated, based upon the population of the fees stated on the face of this form. the area to be searched. An estimate of such fees will be Birth certificates, including delayed birth certificates, are furnished upon request. not issued by the Bureau of the Census but by the Health If you authorize the Bureau of the Census to send your Department or similar agency of the State in which the record to someone other than yourself, attention is called birth occurred. In Federal Censuses, the census takers to the possibility that the information shown in the census obtained the age and place of birth of individuals. Copies record may not agree with that given in your application. of these census records are often accepted as evidence of The record must be copied exactly as it appears and will age and place of birth for employment, social security be sent as you direct regardless of what it shows. U.S. GOVERNMENT PRINTING OFFICE 1956-O-395917"
}
