{
	"anumber": "A11979216",
	"id": "A11979216_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Certificate,, N-550"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1915, 2023, 1987]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "fair"
			},
			"marital_status": {
				"marital_status_llm_v1": "Single"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1987.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "San Gabriel, CA"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "FORM N-550 Screened by NARA, 6/29/2023 U. S. DEPARTMENT OF JUSTICE No. 12952627 IMMIGRATION AND NATURALIZATION SERVICE (REV. 5-1-841Y Name DELGADO, DELIA ISABEL residing at 513 W SAXON AVE SIGNATURE OF HOLDER SAN GABRIEL, CA 91776 Date of birth Date of order of admission IS NOT REQUIRED ON THIS 4/28/15 DUPLICATE STUB Date certificate issued JULY 29, 1987 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH 00685947 All 979 216 Petition No. INS Registration No. 8AM Delia Huntel Deligado ( D TO BE FORWARDED TO No. 12952627 IMMIGRATION AND NATURALIZATION SERVICE CAVIE Pelition No. 00685947 INP Registration No. All 979 216 DUPLICATE Personal description of holder as ofdate of naturalization: Date of birth APRIL 28, 1915 FEMALE sex complexing 147 FAIR colorologes BROWN color of hair BLACK height 5 feet 7 inches; weight pounds virible distinctive marks NONE Marital. status SINGLE Country of formernationality NICARAGUA I certify that the description above givenis true, and that the photograph, affixed hereto is a likeness of me. Delia Isafel Dugodo / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known that at a lermof the District Court of The United States held pursuant to law at Los Angeles on JULY 29, 1987 the Court having foundthal DELIA ISABEL DELGADO then/residing at 513 W SAXON AVE, SAN GABRIEL, CA intends loreside permanently in the United. States when sorequired by the Naturalization Lawsoft the United States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entilled to be Seal admitted locitisenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. Intestimony whereof thesealoft the courtis hereunto, reffixed this 29 th day of JULY nineteen hundred and EIGHTY-SEVEN DIST. OF LEONARD A. BROSNAN Clerkofthe U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
}
