{
	"anumber": "A11979216",
	"id": "A11979216_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service, 8024"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 2023, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Sheridan Screened by NARA, 6/29/2023 3 8024 UNITED 3 TATES DEPARTMENT OF JUSTICE Form Approved Immigration and Naturalization Service RECEIVED Budget Buesu No. 43-R.384 300 Angeles, N. Angeles Calif. St. 90012 NATURE: SERVICES refer to this file No. Los Los JAN 510 j / 38 PM 1966 979 LGS ANGELES CALIF Date: Dec. 24, 1965 Mrs. Delia Isabel Delgado 752 South Carondelet Los Angeles, California 7-29-48 Dear Mrs. Delgado: In order that consideration may be given to the possibility of cancelling the out- standing public charge bond posted in your behalf, it is requested that you appear at the time and place mentioned below for an interview. If you cannot appear on this date, please advise this office. The questionnaire on the reverse hereof should be carefully filled out and presented when you appear. Bring with you evidence of your financial worth, or the evidence of financial worth of the person upon whom you are dependent if you are not self-sustaining, such as bank books, insurance policies, deeds, copies of your income tax returns, etc. If employed, bring with you a letter from your employer, indicating the length of your employ- nient, your salary, and the position you now occupy. It is also necessary that you bring with you a letter from the local Department of Public Welfare of each county where you have lived in the United States, stating whether or not you have ever received public assis- tance. Very truly yours, of Ind. Asst. District Director Travel Control Branch New Federal Building Place: 300 N. Los Angeles Street, L.A. 12, Calif. February Date: 4, 1966 As per your request NOTE: I will be unable to appear Time: 8:30AM January 4, 1966. I would appreciate a new appointment. Room: 8024 The prompt cancellation of the bond is Los a geles Berean of Resource a dependent, in part, upon appearance as collections requested and compliance with the re- quests made. 155 west Washington Bend Form I-356 for angel Calif (Rev. 7-1-60)"
}
