{
  "anumber": "A11979216",
  "id": "A11979216_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0056/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificación de la liberación"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 1 la solicitantes comprobó plenamente los extremos de su solicitud, que ésta 2 fué tramitada con arreglo a derecho, dando en ella la debida intervención 3 al Ministerio Público, quien se personó oportunamente y finalmente que no hubo oposición, POR TANTO: De conformidad con lo expuesto y Arto. 566 C. RE- 5 SUELVO: Repongase en el Registro del Estado Civil de las Personas de ésta 6 ciudad, la partida de nacimientos de la Srta. Delia Isabel Delgado Ocampo, 7 de generales consignadas, quien nació en el barrio de \"El Calvario\" de ésta 8 ciudad, a las diez de la mañana del veintiocho de Abril de mil novecientos 9 quince, siendo hija legítima de Carlos Delgado y de su esposa Carmen Ocampo, 10 el primero ya fallecido y la segunda mayor de edad, viuda, de oficios domés- 11 ticos y de este domicilio, debiendo el señor Registrador poner sucinta nota 12 de mutua referencia al margen del lugar en que fué omitida. Cópiese, notifi- 13 quese y líbrese a la solicitante certificación de lo resuelto para los fines 14 de ley.- Hugo Berríos. José M. Vargas Paz, Srio. Es conforme con su original 15 con el que fué debidamente cotejado y en virtud de lo ordenado se libra la 16 presente certificación en la ciudad de León, a las once de la mañana del diecisiete de Junio de mil novecientos sesenta. HUGO BERRIOS GARCIA. Juez 17 18 de Distrito para lo Civil de León. Ante mí: JOSE M. VARGAS PAZ. Srio. Aquí 19 un sello. Es conforme con su orginal y despues de cotejado lo aprobamos y 20 firmamos. Nicolás Castellén S. E. Somoza. Srio. Y a solicitud de parte ex- 21 tiendo la presente certificación despues de haber sido debidamente coteja- 22 do en la ciudad de León, a los veinte días del mes de Junio de mil novecien- 23 tos sesenta.- 24 25 NICOLAS CASTELLON S. ERNESTO SOMOZA. Registrador Srio. 26 27 B. Salinas. Regidor, Tesorero y Alcalde por 1a ley certifica: Que las fir- 28 mas que anteceden y dicen: Nicolás Castellón S. y Ernesto Somoza, son autén- 29 ticas y corresponden al Registrador del Estado Civil de las Personas de és- 30 ta ciudad y Secretario respectivo. León veinte de Junio de mil novecientos"
}