{
	"anumber": "A11979216",
	"id": "A11979216_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0032/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR CANCELLATION OF PUBLIC CHARGE BOND, 979 216"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 REQUEST FOR CANCELLATION OF PUBLIC CHARGE BOND In connection with the request for cancellation of the outstanding public charge bond posted in my behalf, I sub- mit the following information to establish my financial responsibility: 1. Name Delia Deligado 2. File number A11 979 216 3. Address 752 So Corondelet st LAST 4. Assets: Banle of america Savery of 784 is (List all bank accounts, realty, Insurance, personal property, etc.) Household furnishings, S wons -1,000, 00 5. Liabilities: Two debts, Wearden's of Dorn's (Department sToRes) (Liet debts, loans, mortgages, etc.) Two more payment m291 Change $25.00 Total Paid over lach the years Chri Document 38% being paid 10. or per mo stark 1965. 6. Date of my arrival in the United States was 7-29-60 7. Have you ever been the recipient of public welfare assistance since that date? no 8. Have you ever been hospitalized since that date? no 19. Have you ever been since that date or are you now under treatment by a physician? no (If answer to 7, 8, or 9 is \"Yes\", explain fully on a separate sheet.) 10. Are you presently employed? yes If so, where? Mary Lou Fashion lade Position machine operator Salary? 14/16/16 60.00 average (Price mark - average about 65. or pe week 11. Are you covered by hospitalization insurance? no 12 List all of your dependents and their relationship to you one dependent, my FOIA (b)(6) 13. Physical disabilities, if any none 14. List all places and dates of residence since arrival 1027 Mrattan st 1/2 yrs 825 So Coronado St 2.44 yrs 2 months 752 So Corondelet St blue (months - all Los Angele Delia Delogado DO NOT WRITE BELOW THIS LINE (Signature) TO: It is recommended that bond in this case be (cancelled) (continued) (breached). (Signature) So ordered: (Dietrict Director) (Title)"
}
