{
	"anumber": "A11979216",
	"id": "A11979216_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECEIPT OF IMMIGRATION OFFICER--UNITED STATES BONDS OR NOTES, OR CASH, ACCEPTED AS SECURITY ON IMMIGRATION BOND, Form 1-305"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1960, 1967, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "RECEIPT OF IMMIGRATION OFFICER-UNITED STATES BONDS OR NOTES, OR CASH, ACCEPTED AS SECURITY ON IMMIGRATION BOND 1. Name and address of owner of security 2. Account Number o B Public Charge Assurance Company LOS 60-3751 L Emanuel Braude, President 3. City and State I 356 South Broadway Los Angeles, California G Los Angeles 13, California 4. Date R June 1, 1960 5. Name of alien Delia Isabel-DELGADO 6 A Cit. 7. Immigration bond FOIA (b) (6) Milagros-Jerez DELGADO and Public Charge A-11 979 216 & Marin-Jerez DEFGADO FOIA (b)(6) Form I-352 Date June 1, 1960 8. UNITED STATES BOND OR NOTES (State form of assignment, if registered) Said United States bonds/notes are assigned /not assigned Title of Bonds/Notes Coupon or Total Denomination Serial No. Interest Dates Registered Face Amount U. S. TREASURY BOND Coupons 1967-72 30 to 54 Incl. $1,000 2-1/2$ 409771A June 15 & Commencing Dated June 1, 1945 June 15, December 15 1960 (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely affix same hereto) 9. CASH (Postal Money Order, Certified Check) The sum of dollars ($ ). 10. NOTICE TO OBLIGOR The Immigration and Naturalization Service will deposit accepted United States bonds or notes in a federal deposi- tary for safekeeping; accepted cash will be deposited in the United States Postal Savings Bank. When all of its condi- tions have been met, the immigration bond will be canceled and you will be so notified. You may then recover the accepted security, and any interest on cash to which you may be entitled, by calling in person at this office and pre- senting this receipt, giving your own receipt on Form I-306. If it is not possible for you to call in person, you may make written request to the officer named below for the return of the security at your risk and expense. YOU MUST SURRENDER THE ORIGINAL OF THIS RECEIPT BEFORE THE SECURITY WILL BE RETURNED TO YOU. This receipt is not assignable. 11. ACCEPTANCE OF SECURITY The undersigned hereby acknowledges receipt from above-named obligor of the above-described security, deposited as security on above-named immigration bond filed with the undersigned on behalf of the above-named alien. Signature By: of the immigration officer lead Title of immigration officer George K. Rosenberg, District Director Form 1-305 To: A-File, attached to original of immigration bond form. (Rev. 9-1-58)"
}
