{
  "anumber": "A11979216",
  "id": "A11979216_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 6/29/2023, WOLCOTT FORM 262- REV. 12-57"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        2023,
        1960
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 SINA S. BLUMBERG SEWING CONTRACTOR 317 SOUTH HILL STREET LOS ANGELES 13, CALIFORNIA PHONE MI. 1511 April 1st, 1960. To the U. S. Embassy, Managua, Nicaragua. Sirs: This is to inform you that I am willing to hire DELIA ISABEL DELGADO as a seamstress in my firm, in the event that she is permitted to enter this country for permanent residence. I am willing to pay her $45.00 per week for a forty hour week and her work will be considered permanent. Thanking you in advance for any courtesy shown to Miss Delgado, I am, Respectfully yours, SINA S. BLUMBERG. by: Sma S. gluwlerg WITNESS: Rosa bole STATE OF CALIFORNIA, County of } ss. Los Angeles ON April 4, 1960 before me, the undersigned, a Notary Public in and for said County and State, personally ap- peared Rosa Cole , personally known to me to be the person whose name is subscribed to the within Instrument, e as a Witness thereto, who being by me duly sworn, deposes and says: That. she resides in Los Angeles, California and that she was present and saw Sina S. Blumberg personally known to her to be the same person is described in and whose name. subscribed to the within and annexed Instrument as Part thereto, execute and deliver the same, and acknowledged to said affiant that she executed the same; and that said affiant subscribed her name thereto as a Witness. (Seal). WITNESS my official seal. hand and Notary Public in and for said County and State. ACKNOWLEDGMENT-WITNESS-WOLCOTTS FORM 262- REV. 12-57 My commission expires Nov. 25, 1961 69407"
}