{
	"anumber": "A11979216",
	"id": "A11979216_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 6/29/2023"
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1987, 2016, 1992, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 larve RESULT OF EXAMINATION English: Speaks w Reads No Govt. us COURT ACTION our Write w Classes Date DENIED Neg Debroo G-325 ID. G-325B come Grounds of CHIP MAR pa becapou usq 70 Neg I HEBEBA G-325 Rec. Br. w N-426 Examiner Cont'd G-325C Other Cont'd come 91 (If Requested) Eligibility 101 (f): OK ipomu bonyou Democracy 112 Action or documents still required: IN baggiou you Documents presented: SMOLU the pr SMOLD to POLOLE us pa CPEEK m consi CAID MHK ARC DWI A11999216 31.14 BA EXYWIMER OK 042815 wan - COS SIN (19) 0-1 of we must (year the as 91 tax conjects - a we word will will and usus (12) todness you - DE securities CHISON of ipc test (911) up 1 FOOM aps courses of ips becipion (iv) sw apic my 10 of ising the MUS sug sug ibage LOLLA 194 072960 wibing suq par INJO of ips [ of you bayjour 2016106 10 ryc below or nume message crembing (13) mail quborce to 126 10 Booq tooq Ougus tony ye' 10 sug must pecause to 1 NAZI of ips Classes 21 Neg (sign 10 su maport - MOLK mpcs Chingo p the at 10 international ps91 give STATES on suq PAPER pix ips 10 (15) pacu gouts become a per below of Book to type or 1946 Communication or no mg Investigation statements made at the Recommendation waived. VOI 900 Petitioner GT, under GT oath approved all Preliminary beyounce and preliminary Designated su? Examiner investigation. or (Date) v 2.4 APR 19 1987 of spre bone 24 APR 1987 1216 any Recommendation 19 10% belion psibuores Preliminary Examiner as (Date) (10) 111 DESIGN - 150 of ups nine the upon ml are begine ON 107 a) 1566 nation abou resp SPECING 2016 bone is TO monut is 800g (sig) abou to pas spromy may we change outside To . INVOICE pi or su unreadable text DESIGNATION STATE pour 099 admission inground 10 gp anumans or or options PRACE 3 point U9S expire the and contincies numer groser or repairs special or beppe to the number 2015 RESTRICTION of 57 ency ph 114 a - our or colling IN manage of r'tru as THE (8) (11 or was nugst (p) ) W been aboms # CHISON of THE neuro a in or the process or 01 to bennos R wage at 16921 nx mount ques of the betting suq HISA peen because in 1146 proces as out-pay of any belioq I NEW lenger consimments to inc 2451C # time rpc gace of (pr) belipion mug aline IDA may [04 becomes quist > of Apricy betog as (310) bone 1992 pack . numer 2016 (3) IR betitiou UM mugs Sociou 11a(f) 11 PISAS communical to tics numer 15 mount MACH N/A because abomic (or as per spice because is THE press 191 12 one-years of ency get Acin bayon - (01 in the wourp company biocoquit gais of benefice ang THE us (a) uniques sug I USAG preu (e) OR banjou risiges 210(b) USAS 162994 - ips numsey 2000 101 91 jour line Jose suq commonal is (as proce 112 apply 1ym bention . (2) ⑉00 to the gener proces for because suq paic HOL this surgence (y) I sedacer you us) USUS pc ROWN (3) mis poin of 138\\72 event 108 VACETES sua ISSUED (3) W bucacus bynos of H arxon CYBHIER we Unions mission (1) WA (mg) muq COLLECT ISSUE DETIV DETCYDO cuq you INR besition 10. (616) wage auquise mages are DIESFICE canu DIEW 100 YMGRI as LOUD net DESTRICTION THE or or SOUICE LEUTION LOB"
}
