{
	"anumber": "A11979216",
	"id": "A11979216_0055",
	"page_index": 55,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0055/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACION"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 CUARTA CLASE. as NO 20 CENTAVOS 20 INTERNATIONAL 1 UNIVERSITY B5846711 11 CERTIFICACION 2 NICOLAS CASTELLON S. Registrador del Estado Civil de 3 las personas de ésta ciudad CERTIFICA: Que en el libro de nacimientos que ésta oficina lleva durante el corriente año, se encuen- tra anotada al folio 497 y 498 del Tomo II, el acta que a la letra dice: 6 ISABEL DELGADO OCAMPO: N° 1681. En la ciudad de León, a las nueve y cuaren- 2 ta y cinco minutos de la mañana del día veinte de Junio de mil novecientos 8 sesenta, el insfrascrito Registrador del Estado Civil de las Personas de 9 ésta ciudad, procede a inscribir el atestado que a la letra dice: CERTIFI- 10 CACION. Hugo Berríos García, abogad 1e la Republica y Juez para lo Civil del 11 Distrito de León, CERTIFICA: La sentencia de Reposición de Partida de Naci- 12 miento que literalmente dice: \"Juzgado Civil de Distrito. León, catorce de Junio de mil novecientos sesenta. Las once y cuarto de la mañana.- VISTAS: 13 14 RESULTA: Que en escrito fechado el dos de este mes se presentó a este despa- 15 cho la señora Isabel Delgado Ocampo, mayor de edad, soltera, de oficios do- 16 mésticos y de este domicilio, solicitando se mande a reponer en el competen- 12 te Registro su partida de nacimiento, habiendo nacido a las diez de la maña- 18 na del veintiocho de Abril de mil novecientos quince, en el barrio de E1 cal 19 vario de esta ciudad, siendo hija legítima de Carlos Delgado, ya fallecido 20 y de su esposa Carmen Ocampo, mayor de edad, viudad, de oficios domésticos 21 y de este domicilio, cuya inscripción fué omitida, como lo comprueba con la 22 negativa registral acompañada-Insertó en la solicitud interrogatorio condu- 23 cente a probar los extremos de la misma, al tenor del cual pidió fuesen exa- 24 minados los testigos que presentaría.- Se mandó seguir la información corres- 25 pondiente son audiencia del señor Representante del Ministerio Público, a 26 quien de previo se corrió traslado y el cual lo evacuo personandose y pidien- do la probatoria de ley, por lo que abierto a pruebas el expediente por ocho 28 días se recibió declaración a dos testigos idoneos que lo fueron David León 29 y Rigoberto Reyes Melendez, quienes absolvieron afirmativamente y en forma 30 favorable el referido cuestionario y CONSIDERNADO: Que con la prueba rendida"
}
