{
	"anumber": "A12012827",
	"id": "A12012827_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12012827_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service, 134417"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws. I understand that any wilfully false or misleading statement or wilful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. Ja nizej podpisany(a), ubiegajacy(a) sie o wize imigracyjna do Stanów Zjednoczonych, uroczyscie (albo swiad- cze), ze wszystkie oswiadczenia zawarte W niniejszym podaniu zostaly dokonane przeze mnie lacznie Z punktami zakreslonymi W paragrafie 34, sa prawdziwe i wyczerpujace, dokonane wedlug mej najlepszej wiedzy i prze- konania. Dalej przysiegam (albo swiadeze), ze po wjezdzie do Stanów Zjednoczonych nie bede sie zajmowal dzia- lalnoscia, która bylaby szkodliwa dla interesów ogólu, lub zagrazalaby dobrobytowi, spokojowi i bezpieczenstwu Stanow Zjednoczonych; dzialalnoscia, która bylaby prawnie zakazana W Stanach Zjednoczonych i zwiazana ze szpiegostwem i sabotazem, zaklóceniem porzadku publicznego lub inna dzialalnoscia wywrotowa zagrazajaca bezpieczenstwu publicznemu; jakakolwiek dzialalnoscia, której celem jest opozycja, kontrola lub obalenie rzadu Stanów Zjednoczonych przy uzyciu sily, przemocy lub innych mniekonstytucyjnych sposobów; ze nie bede nale- zal(a), wspólpracowal(a) ani bral(a) udzialu W jakiejkolwiek dzialalnosci organizacji, która jest wymieniona lub winna byc ujeta W paragrafie 7 Aktu o Kontroli Dzialalnosci Wywrotowych Z roku 1950. Rozumiem wszystkie podane wyzej oswiadczenia, gdy pytalem(am) sie i otrzymywatem(am) wyjasnienia odnosnie kazdego punktu, który nie byb dla mnie dostatecznie jasny. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all state- ments which appear in this application have been made by me, including the encircling of items in part 34, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that. if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with, or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. Genowefa BERESNIEWICZ Genoveta Revennerier (Podpis skladajacego podanie) (Signature of applicant) Podpisano i zaprzysiezono W mojej obecnosci dnia 19 Subscribed and sworn to before me this 16 day of August 19 6I (Konsul) Service No13417 (Consular Officer) Tariff Item No 20 Fee Paid: U.S. $ 5.00"
}
