{
	"anumber": "A12250430",
	"id": "A12250430_0101",
	"page_index": 101,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0101/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/22023, NARA Form 430"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 2023, 1930, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -12- Witness WONG KWOCK HAI appears before the Board, is duly sworn, and testifies (speaks SEE YIP - Sun Ning District - dialect): a (By Chairman) State your names, age, date and place of birth, occupation and residence. A. WONG GOK HAI, boyhood and only name: age 16; born CR 6-3-15 (May 5, 1917) in SONG LUNG Vil., Sun King District, China; I am not attending the Virgil Junior High school, at First and Vermont Streets, Los Angeles, and hold a schoolboy's job at 145 South Vermont Avenue, where I reside. (Note by Chairman: Witness is holder of C.I. 63906 issued San Pedro, California April 2, 1930 in name WONG KWOCK HAI, admitted as son of native (parel evidence) ex-ss \"Pres. Jackson\" February 24, 1930, file 30160/129. C.I. is endorsed and retained in San Pedrofile 38160/378, he having obtained approved form 430 on June 13, 1932.). Q Have you abandoned your contemplated trip to China? A. Yes. (Note: Original copy of approved form 430/how surrendered by witness and his C.I. 63906 is returned to him, his receipt therefor being taken) Q In whose behalf do you desire to testify before this Board? A. My brother WONG GOK ON. of Are you the person who executed this affidavit, and whose signature and photograph appear thereon (referring to affidavit executed by WONG KWOCK HAI before Y.C. Hong, notary public, Los Angeles, California, October s, 1932. which is made a part of the record and marked exhibit \"B\")1 A. Yes. a Are all of the statements therein contained true and correct in every respect? A. Yes. Q When and where did you lastsee the applicant WONG GOK ON? A. In the middle part of the 12th month of CR 18 (January, 1930) in our home in SONG LUNG FIL. when I left there to come to the U.S. a What was he doing at that time? A. He was attending school in our home village. of When did he quit school, if you know? A. I don't know. Q Did he ever attend any other than the village school? A. Not that I know of. of Has he ever corresponded with you? A. No. of Was all of your testimony given at the time of your application for admission at this port on February 24, 1930 (file 30160/129) true and correct in every respect? A. Yes. a Was all of your testimony given at the Los Angeles City Office on June 9, 1932, when you were an applicant for citizen&s return certificate, true and correct in every respect? A. Yes. or Have there been any changes in your family history since you testified in June, 1932? A. No, not that I know of. of Where are your two alleged older brothers at the present time? A. In China. of Is either of them married? A.My father told me that they both were married. of Hame either of them any children? A. I do not know. or Are they both residing in your home village at the present time? A. No, my eldest brother GOK DOON and his family do not live in our village, but GOK FAY and his wife do. of Where is KWOCK DOON living with his wife? A. I do not know. 7402/99 -12- 11/7/32"
}
