{
  "anumber": "A12250430",
  "id": "A12250430_0096",
  "page_index": 96,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0096/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1930
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -700 or Where do your villagers do their marketing? A. WAH ON Market. of How far and what direction is WAH ON Markist from your village? A. About 5 or 6 li south.of our village. Q What is the nearest neighboring village to the north of your village? A. TONG BEN VIL., is about 5 or 6 11 north. Q What is the nearest village east of your village? A. There is no village nearby. Q What is the nearest village to the south? A. There is no village nearby, but WAR ON Market is 5 or 6 11 south. of What is the nearest village to the west of your village? A. There is no villa ge nearby. & Do you know of any other villages in the vicinity of your village than those you have mentioned? A. Yes, PING YONG Vil. 5 dr 6 11 to the south. or Do you know the names of any other villages near your village? A. No. or Your prior landed alleged brothers have mentioned several other nearby villages. A. I do not know of any other villages. or Did you ever hear of a CHUNG BIN Village? A. Yes, it is 5 or 6 11 to the north of our village. Q Is that the same as the TONG BEN Vil. which you stated a few moments ago is 5 or 6 11 to the north? A. Yes. Q Can you see the PING YONG Vil. from your village, 5 or 6 11 away? A. Yes, but very dimly. a What clan occupies the PING YONG Village? A. The WONG clan. or Are there any photographs of your father in your home in China? A. No. or Are there any photographs of any of your brothers in your home? A. No. Q What is the color of the cat you now have in your home? A. Yellow. of How long have you had that same cat? A. 7 or 8 years. of a Has your mother any physical peculiarities of any kind? A. No, but she is in poor health and is sick ten. Q Has your mother ever had smallpox? A. Yes. or Is her face pitted? A. I misunderstood the question. I do not know whether she ever had smallpox or not, her face is not pitted. or Have any of the emembers of your family ever had smallpox that you know off A. I had it, but I do not know whether any of the other members of our family had it or not. of How old were you when you had smallpox? I had them about the middle part of OR 19 (1930). Q Have any of your alleged brothers pitted faces? A. I did not notice that they do have. or Have any of your alleged brothers had any serious illness or accidents of any kind? A. Yes, my brother GOK HAI limps a little. He had an accident when he was young. of When, where, and what kind of an accident did he have? A. I think it was when he was 8 or 9 years old, in our home village, he had some kind of an accident, I don't know what it was, but it left him crippled. of Didn't your mother ever tell you what crippled him? A. No. 7402/99 n- 11/7/32"
}