{
  "anumber": "A12288810",
  "id": "A12288810_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12288810_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Abandonment by Alien of Status as Lawful Permanent Resident"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1903,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUST NF7/75 IMMIGRATION AND INATURALIZATION S ICE ABANDONMENT BY ALIEN OF STATUS AS LAWFUL PERMANENT RESIDENT 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER KILKELLY Mary Street) Josephine 412288810 2. LAST PERMANENT ADDRESS IN U.S. (Number and (City) (State) (Zip Code) Dorchester Ma 3. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP July 5-1903 Ireland Irelend 4. DATE OF DEPARTURE FROM UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. OF 5. INTENDED ABROAD July PERMANENT 1962 ADDRESS Departure Irish Air lines Boston Rye Hill Monivea Galway Ircland 6. I VOLUNTARILY AM ABANDONING HAVE ABANDONED MY STATUS AS LAWFUL PERMANENT RESIDENT OF THE U.S. BECAUSE: l have returned to love in Ireland 7. DATE OF ABANDONMENT OF STATUS AS LAWFUL PERMANENT RESIDENT OF THE U.S. March 26 -1979- 8. SELECTIVE 10A. SELECTIVE SERVICE BOARD NUMBER AND LOCATION (City, Town and State) SERVICE STATUS 9. MY DEPARTURE OR PRESENCE OUTSIDE THE U.S. IS IS NOT FOR THE PURPOSE OF AVOIDING OR EVADING SERVICE IN THE ARMED FORCES OF THE UNITED STATES. 10. DOCUMENTS SURRENDERED. (Describe) I-151 destroyed 3-27-75 11. SIGNATURE OF ALIEN DATE PLACE Many g. Kilkeeey 3-26-75 Boston Me FOR GOVERNMENT USE ONLY REMARKS OF IMMIGRATION OR COUNSULAR OF FICER: SIGNATURE OF IMMIGRATION OR COUNSULAR OFFICER TITLE DATE PLACE TO: DISTRICT DIRECTOR FOR FILE DATE (CITY) (STATE) FORM 1-407 (Rev. 4-1-73) N GPO 943-828"
}