{
	"anumber": "A12250430",
	"id": "A12250430_0103",
	"page_index": 103,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0103/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, Form 430 dated 6/23/30 in San Pedro file 31160/47"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -14- of Was his face pitted before you came to the United States? A. Year No. Q Have you any physical peculiarities of any kind that the applicant would know about? Ana No. of Have any of your alleged brothers any physical peculiarities that you would know about? A. Not that I know of. 2 Have you any defects in either of your legs? A. I hurt my leg playing foot- ball at the Virgil Jr. High School in Los Angeles. q Were both of your legs normal when you last left home? A. Yes. Q Did you ever suffer any accident or illness of any kind before you came to the United States? A. No. of Do you recognize this photograph (referring to photo of WONG KWOCK FAY in San Francisco file 27487/8-25)? A. Yes, that is my brother WONG KWOCK FAY. of Do you recognize this photograph (referring to photo of WONG GUCK ON on affidavit, exhibit \"A\"YS A. Yes, my brother WONG GUCK ON. of Do you recognize this photograph (referring to photo of WONG SICK HONG on affidavit exhibit \"A\")8 A. Yes, my father. Q Do you recognize this photograph (referring to photo of WONG KWOCK FAY on Form 430 dated 6/23/30 in San Pedro file 31160/47) A. Yes, my brother KUOCK FAY. Q Do you recognize this photograph (referring to photo of WONG KWOCK DOON on Form 430 dated 10/17/20 in San Pedro fill 30160/1)8 A. Yes, it is KWOCK DOON. of Have you any further statement to make or evidence to offer in behalf of your alleged brother WONG GUCK ON? A. No. Q Have you understood the interpreter? A. Yes. of Any further questions by members of the Board? A. By both members: No. Witness excused. Applicant recalled, sworn. of Are the two houses in each of the four rows of your village joined together or separated by a space? A. They are separated by a very narrow space, about this wide (indicates about 1/2 inch on the ruler). of Can you see through between the houses? A. Yes. of Can you walk through between the houses? A. Yes. or Do you mean you can walk between the two houses in each row? A. No. the two houses in each row are joined together. or What did you refer to, then, as being separated by a space 1/2 inch wide? A. I made a mistake. The two houses in each row are joined, like-abley but there is an alley about 4 or 5 feet wide between each row. of Do you recall that your alleged brother KWOCK HAI was limping when he last left home? A. Yes. 2 And how long had he been limping before he left home? A. I don't remember exactly, maybe 3 or 4 years. or He states that he did not limp before he left home. How about that? A. I don't/he remembers. He limped a little, as far as I can remember. or Have you any further statement to make or any corrections to make in the testimony you have so far given? A. No. BY CHAIRMAN: The applicant and 4 other Chinese males stand in Board room for identification by the witnesses. Alleged father of applicant brought to Board room, and makes immediate and positive identification of the applicant. Prior landed alleged beether WONG KOOCK HAI maices similar identification. 7402/99 -14- 11/7/32"
}
