{
  "anumber": "A12250430",
  "id": "A12250430_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Report of Investigation, G-166A ( (REV. 6-1-66)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION ADMINISTRATIVE PAGE TITLE FILE NUMBER WONG, Wing Hong aka WONG Charles A17 210 251 REPORT NUMBER DATE PLACE CENTRAL OFFICE AND REGIONAL REFERENCES 1 11/4/68 Los CONTROL OFFICE TRANSFERRED TO: G-23 LINE TYPE OF INVESTIGATION Los 503 REPORTABLE Fraud-Citizenship DATE AND PLACE OF BIRTH NATIONALITY DATE, PLACE AND MANNER OF ENTRY 8/4/22 Shiu Chew Vil., TSD., China 9/13/34 SPC as USC China DISTRIBUTION REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE 1: A17 210 251 11/4/68 Los Angeles, California SIGNATURE NAME AND TITLE B. R. Pearson Supervisory Investigator REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE SIGNATURE NAME AND TITLE APPROVED (REGIONAL OFFICE) DATE NAME AND TITLE SIGNATURE STATUS OF INVESTIGATION PENDING PENDING INACTIVE x CLOSED REFERRED TO CONTROL OFFICE Investigation requested by citizenship branch. after SUBJECT applied for a certificate of citizenship. COMMENT: SUBJECT is a native and citizen of China who has never been inspected and admitted to the U. S. as an alien. From the evidence adduced he is the blood son of his immigration father. He testified he had believed he was a citizen of the United States through his father until recently. That he had received information from his mother and from other sources that his father was actually born in China and not in the United States. That he has done nothing restricted to U. S. citizens since learning he is not a citizon. SUBJECT has submitted an application to petition for naturalization under provisions of section 329 of the I. & N. Act on the basis of an honorable discharge after active service in the U. S. Navy from 6/25/43 to 3/23/46. From the investigation there appeano to be no reason for op osing naturalization. Loyd L. Notherlin, Investigator THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE FORM G-166A (REV. 6-1-66) FPI-LPC-9-68-46M-4052"
}