{
	"anumber": "A12250430",
	"id": "A12250430_0074",
	"page_index": 74,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0074/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION OF ALLEGED AMERICAN CITIZEN OF THE CHINESE RACE FOR PRE-EXISTING STATUS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1923, 2023, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form 430 APPLICATION OF ALLEGED AMERICAN CITIZEN OF THE CHINESE RACE FOR PREINVESTIGATION OF STATUS DUPLICATE 2402/99 FT No .8402/196 U. S. DEPARTMENT OF LABOR IMMIGRATION SERVICE Iec Angeles Calif say 315 1933 , 192 To Julesa Officer in Charge, Immigration Service, Los Angeleg Calls. SIR: It being my intention to leave the United States on a tem- Age 15 Height 5 ft 5 in. porary visit abroad, departing and returning through the Chinese (In shoes) Marks Piton tip of nose. port of entry of I hereby apply, under the provisions of Rule 16 of the Chinese Regulations, Sear left temple in hair. for preinvestigation of my claimed status as an American citizen, submitting herewith such documentary proofs (if any) as I possess, and agreeing to appear at such time and place as you may designate, and to produce then and there witnesses for oral examination regard- ng the claim made by me. This application is submitted in triplicate with my photograph attached to each copy, as required by said rule. Respectfully, gnature in Chinese (WONG GOCK ON) (nature in English wong Kwock on Address Vermont Ave. Ies Angeles. High 111 it BH ml Los angeles bal This application having been approved, this duplicate is delivered to the appropriate applicant 31 (with , 1923 indorsement written across the margin of the photograph), who must exchange it at the office of the immigra- tion officer in charge at the port of departure for the original. THIS DUPLICATE IS OF NO VALUE FURTHER THAN TO IDENTIFY THE HOLDER AS THE PERSON WHOSE STATUS HAS BEEN INVESTIGATED. Departed SAN PEDRO, CALIF, AUG 20 1933 PRES. LINCOLN Jenardim Commissioner of Immigration, GOVERNMENT PRINTING origin Rurvilson Inspector in Charge. Immigrant Inspector"
}
