{
	"anumber": "A12250430",
	"id": "A12250430_0094",
	"page_index": 94,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0094/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -5- or HOW long has he been teaching school there? A. As far back as I can remember. of From which village did this schoolteacher come? A. GEE SUEY Village. of Do girls also attend that same school? A. Yes. of Who teaches the girls? A. The same teacher. or Did your sister also attend that same school? A. Yes. Q When did you commence school? A. When I was 8 years old - in CR 14 at the beginning of the year, and continued there until the middle part of this year. Q Who lives in the 1st house, 1st row, counting from the south or head of your village? A. WONG NGUEN HEN who went to Canton City 2 or 3 years ago. H1s wife and two sons AH GOK, age 15 or 16 years, and AH NGAR, age 14 or 15 years, live there now. of What is WONG NGUEN HEN'S occupation in Canton City? A. I do not know. a What was his occupation in your home village? A. Nothing in particular. Q Who lives in the 2nd house, 1st row, counting from the south? A. WONG MONG HEN's house. He is abroad, I do not know where. His wife and one son WONG SHARE GIT, age 14 or 15 years. of Who lives in the 1st house, 2nd row? A. We do. of Who lives in the 2nd house, 2nd row? A. WONG BOON SAI, his wife, and four sons WONG CHOON LEUNG, in his 30s, married; CHOON SIM, 27 or 28 years old, single: CHOON FOT, 17 or 18 years old, single; and CHOON YEN, 15 or 16 years old, single, live there. or What is WONG CHOON LEUNG's occupation? A. Farmer. of Whose house is the 1st house, 3rd row? A. WONG QUONG SAI. or Whose house is the 2nd house, 3rd row? A. WONG GIM HEN. of What is WONG GIM HEN'S occupation? A. He is not home, he is abroad. of Who lives in the 1st house, 4th row? A. WONG LOY HEN. of What is WONG LOY HEN's occupation? A. Nothing in particular. of Whose house is the 2nd house, 4th row? A. WONG DEW CHOW. of What is his occupation? A. Nothing in particular. of Are there any girls living in the 1st house, 3rd row? A. Yes, two MAY HO and GIM HO. of Who is their father? A. WONG QUONG SAI. of What is WONG QUONG SAI's occupation? A. He is in business in SIN CHONG City. of Who is the oldest man in your village? A. WONG BOON SAI. of Describe your own home house. A. One-story, green brick building, consisting of two bedrooms, two kitchens, a parlor, and an open court: tile floors in all the rooms except the open court which is paved with stone. of Whose house in your village isclosest to the schoolhouse? A. WONG NGUEN HEN's house. a Do any of your villages own water buffalo? A. Yes, WONG BOON SAI is the only one in our village who owns a buffalo. of Did you ever own a dog or cat in your home? A. Yes, a cat, but no dog. of Are there any windows or skylights in your home? A. Yes, there are two skylights in each bedroom, and one outside window in each of the bedrooms. of Are there any skylights in the kitchens? A. No. or Who occupied the large door side bedroom to your home when GOK HAI calle to the United States? A. My mother and sister. 7402/99 -5- 11/4/32"
}
