{
	"anumber": "A12296289",
	"id": "A12296289_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Do Zadnej organizacji i tez partyi nie należałam, Strona 3"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Strona 3 31. Od ukonczenia 16 roku jestem lub bylem(am) czlonkiem lub sympatykiem nastepujacych organizacji politycznych, zawo- dowych, zwiazkowych lub spolecznych: Since my 16th birthday I am or have been a member or affiliate of the following political, prefessional, vocational or social organizations: Nazwa i adres organizacji Daty (od-do) Rodzaj przynaleznosci i pelniona funkeja Name and address Dates (from-to) Type of membership and office held. if any. Do adnej organizacji ani te& partii nie nalezalam 32. Mówie, czytam, pisze W nastepujacych jezykach (lacznie Z jezykiem ojczystym): I speak, read, write the following languages (Include your native language): Jezyk Mówie Czytam Pisze Language Speak Read Write Polski 33. Bylem(am) poprzednio W Stanach Zjednoczonych W nastepujacych okresach czasu (podaé rok, rodzaj wizy i rodzaj pobytu) Jezeli Pan(i) nie byl(a) nigdy, podaé ten fakulie bylam nigdy I have previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state) 24. Prawne przepisy imigracyine Standw Zjednoczonych wymagaja od przyszlych imigrantów odpowiedzi na nastepujace pytania. Warunek ten nie oznacza jednakze przypuszczenia, ze Pan(i) nalezy do jakiejkolwiek Z grup objetych tymi pytaniami. Odpo- wiedzi Pana pomoga jedynie konsulowi do ustalenia kwalifikacji do otrzymania wizy. Jezeli nie jest (Pan(i) W stanie odpowie- dziec na któres Z nizej podanych pytan, nalezy Pana(i) pytania, jakiekolwiek by byly, nie koniecznie podac powód wstrzymania sie od odpowiedzi. Wyjasnienie takie nalezy napisac na osobnym arkuszu i dolaczyé do niniejszego formularza. Odpowiedzi na beda mialy wplyw na odmowne zalatwienie Pana(i) podania o wize. Na przyklad W wypadku, gdy zostal(a) Pan(i) areszto- wany(a) lub skazany(a) za mniejsze wykroczenie, a konsul bedzie miat moznosé ustalenia, ze tego rodzaju wykroczenie byto W rzeczywistosci drobnym przewinieniem, aresztowanie lub skazanie Pana(i) nie koniecznie bedzie decydowalo o niezakwali- fikowaniu sie Pana(i) do otrzymania wizy. Wiasciwa odpowiedz na nastepujace pytania nalezy oznaczyc przez zakresiente Kolkiem slowa \"taks\" \"nie\" (1) (a) Czy byl(a) Pan(i) aresztowany(a), oskarzony(a) lub skazany(a) za zbrodnie lub za inne przestepstwo? Have you ever been arrested for, charged with, indicted for, or convicted of, a crime or other offens Tak Nie (b) Czy odbywal(a) Pan(i) kare W wiezieniu cywilnym lub areszcie? Tak Nie Have you ever been confined in a civilian prison or jail? (c) Czy odbywal(a) Pan(i) kare W wiezieniu wojskowym lub areszcie? Tak Nie Have you ever been confined in a military prison or jail? (d) Czy kiedykolwiek posredniczyl(a) Pan(i) lub zajmowal(a) sie niedozwolonym kupnem i sprzedaza narko- tykow? Tak Nie Have you ever been engaged in illicit buying, selling or handling of narcotic drugs? (e) Czy korzystal(a) Pan(i) kiedykolwiek Z prawa laski, amnestii, dekretu o rehabilitacji lub innego aktu utaskawienia? (Jezeli tak, podac jakiego) Have you ever been the beneficiary or a pardon, rehabilitation decree, other act of clemency or Tak Nie action? (If so, explain) (2) (a) Czy umieszczono Pana(nia) kiedykolwiek W przytulku, schronisku dla ubogich lub W jakiejs instytucji dobroczynnej? Tak Nie Have you ever been placed in an almshouse (po or house or charitable institution)? (b) Czy jest Pan(i) biedakiem, zawodowym zebrakiem (zawodowa zebraczka), lub wloczega? Are you a pauper, professional beggar or vagrant? Tak Nie (c) Czy posiada Pan(i) jakas wade fizyczna, lub czy jest Pan(i) dotknieta(a) kalectwem, choroba, która mo- glaby utrudnic zdolnosé do zarobkowania? Tak Nie Are you afflicted with a physical defect, disease or disability which may affect your ability to earn a living? (d) Czy bedzie Pan(i) W moznosci utrzymac siebie W Stanach Zjednoczonych? Will you be able to support yourself financially in the United States? Tak Nie (3) (a) Czy mial(a) Pan(i) kiedykolwiek jeden lub wiecej ataków obledu? Have you ever had one or more attacks of insanity? Tak Nie (b) Czy jest Pan(i) lub byt(a) dotkniety(a) obledem psychopatycznym, epilepsja, wada umystowa, drgawkami, ata- kami omdlenia, konwulsjami lub nerwowym wyczerpaniem? XXXX Are you now or have you ever been afflicted with psychopatihic personality, epilepsy, mental defect, fits, Tak Nie fainting spells, convulsions or a nervous breakdown? (c) Czy jest lub byl(a) Pan(i) markomanem (narkomanka) lub nalogowym(a) alkoholikiem (alkoholiczka)? Tak Nie Are you now or have you ever been a narcotic or drug addict or chronic alcoholic? (d) Czy przebywal(a) Pan(i) na leczeniu W szpitalu, zakladzie lub W innym miejscu dla oblakanych lub umyslowo chorych, dla narkomanów lub nalogowych alkoholikow? Have you ever been treated in a hospital, institution or elsewhere for insanity or other mental disorder or Tak Nie for drug or narcotic addiction or alcoholism?"
}
