{
  "anumber": "A12250430",
  "id": "A12250430_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION, FORM G-166 ( (REV. 7-1-94)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1930,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION TITLE FILE NUMBER FONG, Suey Gee aka WONG, Suey Gee A7 298 161 REPORT MADE AT DATE BY 12/4/68 L. Nothin Los Loyd I/o Netherlin INVESTIGATOR SYNOPSIS X DETAILS: SUBJECT'S file shows her admission to the United States at San Francisco on 10/5/49 as a nonquota immigrant. Nonquota status accorded on the basis of an approved visa petition submitted in her behalf by WONG GUCK ON as her USC husband. File contains affidavit made by SBJECT'S husband on 10/23/68 in which he testified that he is a native and citizen of China. That he and SUBJECT were married in China in 1930 before he first came to the United States. That SUBJECT knew of the arrangements under which he came to the U. S. as the son of a man who was not his father. That he is the person who petitioned in behalf of SUBJECT as her USC husband. That he lives with SUBJECT and that they are parents of 3 children. SUBJECT made an affidavit on 11/15/68 in which she testified she was born on 9/17/14 at Wing On Chuan, TSD., China and that she is a citizen of China. That her only entry to the U. S. was at San Francisco, California on 10/5/49 when admitted as an immigrant. She testified she married Ben Dong WONG on 12/17/30 at Ping Lok Vil., HSD., China. That soon after their marriage her husband went to the United States as Guck On WONG and as the son of a man from a nearby village. That her husband was told to report he was single when he first entered the United States. That her husband returned to China after a year's absence and stayed in the village until 1936. When he left he told her he would report he had married SUBJECT and that they had two sons. She testified that in order to secure a visa she had cla med her h sband was Guck On WONG and that he was a citizen of the United States although she know he was a citizen of China. SUBJECT testified she lives with her husband and that they are parents of 3 children FOIA (b)(6)"
}