{
	"anumber": "A12250430",
	"id": "A12250430_0110",
	"page_index": 110,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0110/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 1929, 1931, 2023, 1932, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -4- Q HOW many of your alleged brothers have come to the United States? A. Allexcept WING HONG. Q When did GOK DOON first come to the United States? A. In the 3rd or 4th month of CR 18 (April, May, or June, 1929). (S.P. file 30160/1). Q When did GOK DOON last return to China? A. About the 11th month of CR 19 (December, 1930 or January, 1931). (San Pedro file 30160/1). Q When did GOK FAY first come to the United States? A. In the 11th or 12th month of CR 17 (December, 1928). (S.P. file 27487/8-25). Q When did GOK FAY last return to China? A. In the 8th or 9th month of CR 19. (September, October, or November, 1930). (S.P. file 31160/47). Q When did GOK HAI first come to the United States? A. In the 11th or 12th month of CR 18 (December, 1929, or January, 1930). (S.P. file 30160/129). Q Has GOK HAI made any return visits to China since his original entry into the United States? A. No. (Applied for form 430 June 9, 1932; S.P. file 32160/378; no record of departure). Q Have you ever corresponded personally either with your alleged father or your alleged brother GOK HAI in the United States? A. No. Q How many buildings in SONG LUNG Village? A. 9, including the schoolhouse. Q What direction does the village face? A. East. Q Which side is the head of the village? A. South. In how many rows are the 9 buildings arranged? A. 5 rows, including the school. Q How many buildings in the 1st row, counting from the south or head of the village? A. Only the schoolhouse, standing by itself. Q HOW many houses in the 2nd row, counting from the head of the village? A. 2. Q Third row? A. 2. Q Fourth row? A. 2. Q Fifth row? A. 2. How many of the buildings in the village are dwelling houses? A. 8. On which side of these four rows of dwelling houses is the large door side? 4. The south side. Q Is the schoolhouse front in line with the four rows of dwelling houses? A.No, it is set out a little in front. Q Is there a lantern house in the village? A. Yes, same as the schoolhouse. It is used both as a lantern house and schoolhouse. Q Have you lived in that same village all of your life? A. Yes. Where do the villagers get their drinking water? A. From a well located on the south side of the village near the lantern or schoolhouse. Q Is it in front of the lantern house, or beside it? A. It is southeast of the lantern house. Q Is their a village God there? A. Yes, the well is just back of the village God. Q Is there a wall of any kind, or bamb hedge around your village? A. No wall, but there is bamboo on the south side. Q How many rooms in the schoolhouse? A. One large room. Q Are there any spaces partitioned off inside of this schoolhouse? A. Yes, one. (Changes) two places spaced off with bamboo mats on the south side of the schoolhouse; one is used for a kitchen, and the other is used by the teacher as sleeping quarters. Q What is the name of the present schoolteacher? A. YEE HEN SANG. 7402/99 -4- 11/4/32"
}
