{
  "anumber": "A12296289",
  "id": "A12296289_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES, Form 133"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "Canada",
        "United States",
        "Poland",
        "Lithuania"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1970,
        1904,
        1932,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved. Budget Bureau No. 43-R052.8. A RE-ENTRY PERMIT DOES NOT PROTECT NATURALIZA- FEE STAMP TION RESIDENCE. SEE INSTRUCTIONS ATTACHED FOR INFORMATION CONCERNING EFFECT OF ABSENCE ON Boz 22061 ELIGIBILITY FOR NATURALIZATION. READ THIS FORM AND ATTACHED INSTRUCTIONS CAREFULLY BEFORE $ 10.00 FILLING IN THIS APPLICATION. APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act. (Fill in with typewriter or print in block letters in ink) IMPORTANT: You Receipt Card with this application. RECEIVED 1. CHECK (a) I am an alien lawfully d misted the United States for permanent residence. ONE (b) I am a treaty merchant, lawfully admitted States between July 1, 1924, and July 5, 1932, both dates inclusive, pursuant JUL 197 to section 3(6) of the Immigration Act of 1924, to carry on trade pursuant to a treaty of commerce and navigation. 2. NAME (First Name Middle Intrageation & Naturalization (Family Name) ALIEN REGISTRATION NUMBER Genowefa Travel Control Tomaszewska A- 12 296 289 ADDRESS (Number) (Street) Boston, Mass, (City/Town) (State) (Zip Code) 835 Montello Brockton, Mass. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY COLOR OF EYES COLOR OF HAIR 05-15-1904 Lithuania Poland blue blond HEIGHT VISIBLE MARKS AND SCARS 5 FEET 5 INCHES none 3. FILL IN THE ITEMS IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RE-ENTER. none ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING MY LAST PERMIT LAST PERMIT IS ATTACHED (City and State) IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR AS A TREATY MERCHANT NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Genowefa Tomaszewska Boston, Mass. 03-13-1962 FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME Adolf Lubert Julianna Giedrowna MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL Pan American Airway 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN UNITED STATES. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL 6. PORT OF Proposed DEPARTURE FROM UNITED STATES DATE OF Proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Montreal, Canada August 19 1970m 113.3 months or more NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL Gdynia America Lines MS Stefan Batory MAILING ADDRESS ABROAD U1. Swierczewskiego 23. Sezytno, woj. Olsztyn Poland COUNTRIES TO BE VISITED (List each country) Poland FOR REASONS FOR GOING ABROAD (Be concise and complete): 8 To visit daughter 1970 IMMIGRATION 7. I DID NOT REGISTER FOR SELECTIVE SERVICE BOSTON, & MASS. NATURALIZATION DID 8. PRESENT OCCUPATION SOCIAL SECURITY ACCOUNT NUMBER None 012-44-2575 NAME OF EMPLOYER ADDRESS OF EMPLOYER FORM I-131 (REV. 4-20-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}