{
  "anumber": "A12250430",
  "id": "A12250430_0090",
  "page_index": 90,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0090/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Heading for Testimony, Form 611"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1929,
        1927,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 Form 611 HEADING FOR TESTIMONY U. S. DEPARTMENT OF LABOR IMMIGRATION SERVICE File 7402/99 B. S. I. No. 122 (Date) N ovember 4, 1932 Manifest No. 943/4. 1 PM At a meeting of IN THE MATTER a of BOARD OF SPECIAL INQUIRY held at San Pedro. Calif. WONG GUCK ON PRESENT: Inspectors: H.B. Hannah, Chairman; Male - age 15 J.J. Cooney, member; Clerk Nellie M. Haffner, member and sec'y. Official Interpreter: Arthur Lem (Chinese) Arrived via: ss \"Pres.Coolidge\"3rd c1Date: 10/21/32 A1. son of U.S. Citizen. 14-2109 U.S. GOVERNMENT PRINTING OFFICE 1929 Held by Insp. Hannah Cause: To establish status. Applicant WONG GUCK ON appears before the Board, is advised as to the nature of proceedings, duly sworn, and testifies (speaks See Yip, Sun Ning District dialect, in which interpreter states he is qualified): MANIFEST DATA: WONG GUCK ON: age 15; m;s; occupation, none; reads and writes Chinese; nationality, U.S.; Chinese race: born in SONG LUNG Village, Sun Ning District, Kwongtung, China; presents father WONG SICK HONG'S affidavit, C.I. of father is numbered 57692 issued at San Francisco, California, January 8, 1927: last permanent residence, SONG LUNG Village, Sun Ning District, China; nearest relative or friend abroad, mother KONG SHEE, at SONG LUNG Village, Sun Ning District, KWONGTUNG, China; final destination, Los Angeles, California; passage paid by father; never before in the United States: to join father WONG SICK HONG, at 446 Los Angeles Street, Los Angeles, California; to remain in U.S. indefinitely; claims not a member of the excludable classes: condtion of health, good; not deformed or crippled; height, 514\"; complexion, yellow: hair, black eyes, dark; marks of identification: large pit scars, crest of nose, edge of forehead right side near hair, upper lip right side, upper left side of forehead. (Manifest data checked with applicant and corrections noted thereon). 7402/99 -1- 11/4/32"
}