{
	"anumber": "A12250430",
	"id": "A12250430_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0042/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, A18 435 414"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1942, 1954, 1955, 2023, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 I made two trips outside the nited States le ving the Lst timeon 8 20/33 and returning on 7/5/36. The last time I left on 5/29/38 and returned through San Pedro on 9/30/40. My immigration father died in 1942. He was a clansman. He was from a village about 2 miles away from my village in China. I never knew him until he brought me to the United States so I have no knowledge of where he was born. I married Shew Ling CHIN in Ping Lok Vil., China in 1933, on my first trip to China. My wife and I have one daughter, Alice WONG.. Who is married to YOU HONG TOM. My daughter and her husband were immigrated from Canada. My son-in-law came with me today. NOTE: TOM YOU HONG Presents I-151 FOIA (b)(6) showing adm. 3/20/67 LOS as Z-2 immigrant. S ys wife immigrated with him. I claimed 4 immigration sons. They were only paper sons and none of them tried to come to the United States. I petitioned for my wife as a citizen of the United States and she was immigrated in 1955, on April 1st, My wife and I were married in an old style Chinese ceremony, My wife lived in my village from 1933 until about 1954. I told her how I had gone to the United St tes as a clansman's son and that in the United States my name was WONG KWOCK HAT and not WONG PEN HUNG. She knew I had reported 4 sons and that $ had never reported my daughter. When I brought her to the United St tes I cautioned her not to say anything about our daughter and not to let anyone know my true name. I have one brother in the U. S. who is also my immigration brother. His name is WONG Ben Dong and his immigration name is WONG Kwock On. He oper tes a laundry at 1802 West 8th St., Los Angeles. I was told my immigration father did have one blood son. I think he was reported as the youngest son in the family. That was information I was given after I came to the U. S. I never knew my immigration father's family in China. I have never been arrested. I never served in the military from forces of any country. I want to stay in the U. S. and will apply for status as a perm nent resident. Subscribed and sworn to before me at Los ngeles, California on 9/11/68. Loyd L. Netherlin, Investigator A18 435 474 Los 9/11/68 2 -"
}
