{
	"anumber": "A12296289",
	"id": "A12296289_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, 537"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States", "Poland"]
		},
		"years": {
			"ms_years_nlp_v1": [1960, 1904, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "AFFIDAVIT OF SUPPORT City of Boston County of Suffolk Commonwealth of Massachusetts I, Wilhelm Tomaszewski of 537 Summer St Brockton Mass. being duly sworn, do depose and say: That I was born Aug. 20, 1908 at Lenéagrad, Russia That I came to the United States on June 8. 1960 through the port of New York, N.Y. on the That I am married That my dependents are my wife- Genoefa not That I am acitizen of the United States by I holde Alien Registration Card Ar 11 993 320 showing my legal entry into U.S.A. That I am employed by London Coat Co. of Brockton Ind. of Brockton Mass. That my earnings are $65. weekly That I have savings in cash $3 00 That I have personal property as follows: Furniture worth about $5500 $700. That I have Ext no debts- That my net worth is about $1000. That evidence of my income and resources is attached hereto as follows: Job letter- That I hereby request the appropriate consular authorities at Warsaw Poland to grant a visa under the Immigration and Nationality Act to: NAME ADDRESS DATE & PLACE OF BIRTH RELATIONSHIP Genoefa Tomaszewska born in Poland May 1904 My wife of U1. Woj. Polskiego 54 Bialogard, Poland That my wife, is desirous of coming to the United States for permanent residence. That I person- ally promise and agree that during my lifetime, I will save the United States and all states, territories, counties, towns, municipalities and districts thereof harmless against any losses or damages which may be suffered by the reason of the fact that any of the persons above mentioned during their alienage shall become a public charge in the United States. That in order to prevent the alien(s) above mentioned from becoming public charges after their arrival in the United States, I shall assume the responsibility for their support and I propose to discharge such responsibility in the following manner, if it shall become necessary. I will provide fully and assure officials that she never become a public charge in U.S That I have read and verified the accuracy of the foregoing statements which 1 believe to be correct and that I hereby affix my signature and swear to this instrument without any mental reservation whatsoever. Wilhelm Tomaszeuric (Scal) Subscribed and sworn to, before me, this 8thday of Feb. in the year 961 where Hattan Notary Public. My commission expires 9 1/62 Witnessed without objection (Seal) (Spouse of affiant)"
}
