{
	"anumber": "A12296289",
	"id": "A12296289_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service Form I-129, Application for Alien Relative, I-129"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Strona 5 (11) Czy jest lub byl(a) Pan(i) kiedykolwiek Are you now or have you ever been (a) anarchista(ka)? Tak Nie an anarchist? (b) zwolennikiem (zwolenniczka) opozycji przeciwko wszystkim ustalonym ustrojom? Tak Nie an advocate of opposition to all organized government? (c) zwolennikiem (zwolenniczka) komunizmu? an advocate of Communism? Nie (d) czlonkiem lub zwolennikiem Partii Komunistycznej lub zwiazanej Z nia pokrewnej organizacji propagujacej ko- Tak Nie munizm. lub organizacji, W której komunizm ma role dominujaca lub kontrolujaca, organizacji nawolujacej do obalenia sila zorganizowanego ustroju panstwowego lub jakiejkolwiek podobnej organizacji? a member of, or affiliated with, the Communist Party or affiliated organization, an organization advocating Communism or a communist-dominated or controlled organization or an organization advocating the over- throw by force of all organized government or any other similar organization? (Jezeli odpowiedz na jakiekolwiek pytanie wymienione wyzej jest twierdzace, nalezy podaé wyjasnienie uwzgle- dniajac daty i rodzaj dzialalnosci lub czionkowstwa). (If the answer to any of the above questions is Yes, axplain, giving dates and nature of activities or mem- bership) (12) Czy zamierza Pan(i) wjechac do Stanów Zjednoczonych Z Kanady, Meksyku, lub tez Z wysp przyleglych do Stanow Zjednoczonych W ciagu dwoch lat od chwili przybycia do jednego Z tych krajów lub jednej Z wysp? (Jezeli odpowied jest twierdzaca, prosze podaé nazwe przedsiebiorstwa przewozowego, przy pomocy którego Pan(i) wjechal(a) lub zamierza wjechac do podanego kraju lub wyspy). Tak Nie Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in such country or island? (If answer is Yes, give the name of transportation company by which you entered or intend to enter such country or island) 35. Czy pomagano Panu(i) przy wypeinieniu tego podania? (Jezeli tak, prosze podac imie, nazwisko i adres osoby lub osób pomagajacych W wypeinieniu, podajac czy to byb krewny, znajomy, prawnik, agent podrózy lub inna osoba). Were you assisted in completing this application? (If so, give name and address of person or persons assisting you indicating whether relative, friend, attorney, travel agent, or other). Imie Nazwisko Adres First name Family name Address Znajomy Grygo Antoni m. Bialogard, ul. 1-go Maja 19/2 PROSZE NIE PISAC PONIZEJ TEJ LINII DO NOT WRITE BELOW THE FOLLOWING LINE Konsul pomoze Panu(i) W odpowiedzi na punkty 36 1 37. The consular officer will assist you in answering the following parts 36 and 37. 36. Prosze o wylaczenie mnie spod zakazu uzyskania wizy i niestosowania wylaczenia, a to zgodnie Z punktem paragrafu 34 Z nastepujacych powodów: I claim to be exempt from ineligibility to receive a visa and exclusion under item 8 in part 34 for the following reason: *** wife of a resident alien 37. Prosze o uznanie mnie za podpadajacego(ja) pod imigracyjna kwote uprzywilejowana zgodnie Z kwota kontyngentowa. I claim to be a 3rd preference quota immigrant under the Lithuanian quota. za imigranta pozakontyngentowego Nonquota immigrant. Moja prosba oparta jest na nastepujacych faktach: wife of lawfully admitted alien VP appr. Feb 15 1961 Jest mi wiadomym, iz jestem zobowiazany oddac wize moja amerykanskiemu urzednikowi imigracyjnemu W miejscu wjazdu do Stanów Zjednoczonych. Jest mi równiez wiadomym, ze posiadanie wizy nie uprawnia mnie do wjazdu do Stanow Zjednoczonych, W wypadku jezeli zgodnie Z ustawa imigracyjna zostanie uznany za osobe, która nie moze byé wpuszczona do Stanow Zjednoczonych. Wiadomo mi. ze swiadomie falszywe i wprowadzajace W blad oswiadczenie lub rozmyslne zatajenie przeze mnie istotnego faktu W niniejszym formularzu moze spowodowac usuniecie na state ze Stanów Zjednoczonych, a po wjezdzie do Stanow Zjednoczonych moze nastapié wytoczenie dochodzenia karnego przeciwko mnie, i/lub deportacje."
}
