{
  "anumber": "A12250430",
  "id": "A12250430_0108",
  "page_index": 108,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0108/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration Hearing Transcript, 500B"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1891,
        1918,
        2023,
        1878,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -3- Q (By Chairman) State all your names. A. WONG GUCK ON, boyhood name, my only name. Q Have you ever used or been known by any other name? A. No. Q When and where were you born? A. On CR 7-6-10 (July 17, 1918) in the SONG LUNG VIL., Sun Ning District, China. Q How old are you at the present time according to Chinese reckoning? A. 15 years. Q Under what status do you seek admission to the United States? A. As the son of a U.S. native citizen. of Have you answered truthfully all questions shown opposite your name on this manifest form 500B? A. Yes. Q You have the right to have present here with you during this hearing a relative or friend under certain conditions to be stipulated by this Board. Do you desire to avail yourself of this right? A. I waive the right. Q What witnesses will appear here to testify in your behalf? A. My father WONG SICK HONG, and my brother WONG GOK (KWOCK) HAI. 2 What documentary evidence have you to present in support of your claim of relationship to a United States citizen? A. The paper I had I surrendered to the Immigration officer upon my arrival at this port. (Note: Applicant presented original copy of affidavit executed by WONG SICK HONG before Y.C. Hong, notary public, Los Angeles, California, June 27, 1932, in re WONG GUCK ON his alleged son. Affidavit bears photos of affiant and his alleged son, that of the latter being agood likeness of the applicant now before the Board. Affidavit is made a part of this record, and marked ex. \"A\"). Q Whose photos appear on this affidavit? A. My father WONG SICK HONG'S, and my own. Q When and where was your photograph, which appears on this affidavit, taken? A. In the 2nd or 3rd month of this year, at the GONG SANG studio in WAH ON Market. a What disposition did you make of your photographs which you had taken at that time? A. I had two copies printed, and gave them to my mother to send to my father in the United States. Q When and where did you first come in possession of this affidavit? A. In the 7th month, I do not remember the date, of this year, my mother gave it to me in our home in the SONG LUNG Village. Q Did your alleged father mail it direct to your mother? A. I do not know where my father sent it, my mother got it from the WAH ON Market some store in the market. Q Name and describe your father. A. WONG SICK HONG, boyhood name, and WONG CHOON WAI marriage name: age 55; born KS 4-5-20 (June 20, 1878) in the United States, I do not know where; is now in Los Angeles at 446 No. Los Angeles Street. Q Name and describe your father's parents. A. I do not know their names. They both died before I was born. Q Havengt you ever heard the names of your paternal grandparents? A.No. of Did your father ever have any brothers or sisters? A. No. Q Name and describe your mother. A. GONG SHEE, age 42, n.F., born KS 17-2-9 (March 18, 1891) in AI YUNG VIL., SND, China, is now living in our home in the SONG LUNG VIL. 7402/99 -2000 11/4/32"
}