{
  "anumber": "A12250430",
  "id": "A12250430_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE, 04-3570"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1914,
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service OMB No. 043-RO570 - 1 Fee Stamp APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS FOR CONVE NIENCE OFF THE Gov'T TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSON TO WHOM INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED IN THE BOX BELOW: PERSON CONSENTING NAME AND ADDRESS NAME STREET Social Security Admin. ADDRESS 419 South Hill Street CITY, STATE ZIP CODE Los Angeles, CHO SIGNATURE OF PERSON CONSENTING Huck On Wong 1. CHECK TYPE OF VERIFICATION REQUESTED: 2. STATE PURPOSE FOR WHICH DESIRED 3. NUMBER OF COPIES DESIRED, IF ANY: AGE OR DATE OF BIRTH SOCIAL SECURITY NATURALIZATION OR CITIZENSHIP 4. IF INFORMATION IS FOR GENEALOGICAL INFORMATION RETIREMENT SOCIAL SECURITY BENEFITS, SHOW SOCIAL OTHER (CERTIFICATE OF BIRTH DATA, ETC.) SECURITY NUMBER: DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME MIDDLE NAME 6. ALIEN REGISTRATION NUMBER WONG BEN DONG -12 250 4301 7. OTHER NAMES USED, IF ANY GUCK ON WONG, KWICK ON WONG 8. NAME USED AT TIME OF ENTRY INTO UNITED STATES KWICK ON WONG 9. PLACE OF BIRTH 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES CHINA 1/22/14 HONG KONG 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY Los ANGELES 5/7/69 SS PRESIDENT COOLIDGE GIVE THE FOLLOWING INFORMATION FOR VERIFICATION OF NATURALIZATION 15. NAME ON NATURALIZATION CERTIFICATE 16. CERTIFICATE NUMBER 17. NATURALIZATION DATE 18. ADDRESS AT TIME OF NATURALIZATION 19. NAME AND LOCATION OF NATURALIZATION COURT 20. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY Duck On Wency DATE: THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: February 11, 1977 LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON May 7, 1969 AT Los Angeles, California NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. NATURALIZATION IN (COURT) ON (DATE) AT (LOCATION) DATE OF BIRTH January 22, 1914 in China. ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE UNABLE TO IDENTIFY ANY RECORD COPIES ATTACHED AS REQUESTED SIGNATURE P Kendrick TITLE Contact Representative Approved By: DATE PRIVACY ACT IDENTITY ESTABLISHED IN PERSON IDENTIFICATION DOCUMENTS (WHEN REQUIRED) G-652 Affidavit OTHER (List) ATTACHED FORM G-641 (Rev. 4-1-76) N"
}