{
	"anumber": "A12250430",
	"id": "A12250430_0099",
	"page_index": 99,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0099/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, -10-"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1929, 2023, 1926, 1930, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -10- a Has your wife never written you whether any children have been born to your alleged sons DOON or GOK FAY? A. No. Witness excused. Board adjourned 12 noon. Board reconvened 12:45 PM. All members present. Witness WONG SICK HONG recalled, sworn. Q You also testified in this office as a witness in behalf of your alleged son WONG KWOCK DOON (San Pedro file 30160/1)on July 9. 1929, is that rights A. Yes. or Was all of your testimony at that time true and correct in every respect? A.Yes. of You also testified at Angel Island, San Francisco (correction) - at Los Angeles Immigration office on Janary 12, 1929 in behalf of your alleged son WONG KWOCK FAY applicant for admission at Angel Island, San Francisco, is that right? A. Yes. Q Was all of your testimony at that time true and correct in every respect? A. Yes. or When and where did you last see the applicant? A. Sometime in December, 1926 in our home village, when I left there for the United States. of Your San Francisco file (25421/3-17) established that you last returnd to the United States on the 88 \"Pres. Taft\" October 20, 1926, is that correct? A. Yes. or Then how could you have seen the applicant in December, 1926? A. I said I last saw him in September, 1936. of What was the applicant doing when you last left home? He was attending school in our home village. of Has he ever attended school at any other place? A. No. of Do you know when hequit school? A. I do not know. Q Have you ever corresponded with the applicant personally? An No. of Has the applicant any physical peculiarities that you know off I did not notice any. a Did he ever have any serious illness or accident of any kind? A. No. a Do you know whether he has ever had the smallpox? A. I do not know. of With whom has your alleged son KWOCK HAI been living since he came to the United States in February, 1930? Ao He lived with me for two or three months, then he went to live with his friends and now lives where he works. of Where does he work? A. I do not know. or Is KWOCK HAI down here with you now to serve as a supporting witness? A. Yes. Q Do you mean tosay you have been down here with him all morning and have not asked him where he works? A. Yes. a Wouldn't a father naturally have more interest in his own son than that? A. He mentioned it to me but I have forgotten it now. of With whom is the applicant going to reside? A. with me. of Howlong will he stay with you? A. I can't tell yet. of Does he also expect to go to his friends later? A. It all depends. 7402/99 -10- 11/7/32"
}
