{
  "anumber": "A12250430",
  "id": "A12250430_0102",
  "page_index": 102,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0102/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1929
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -13- Q Why didn't you accompany your alleged brother KWOCK DOON to the United States in 1929? A. I don't remember, unless it was because my father did not send enough money. of Don't you know of any othe reason? A. No. of Did KWOCK DOON get his schooling in your home village school? A. Yes, but he also attended school in PING YONG Vil. school. Q What is the name of the school there? A. I heard it was called YICK HIM school, but I have never been there. of How long did KWOCK DOON attend that school? A. One or two years. Q Was it one, or was it two? A. I don't know, I was young then. of How far and what direction is PING YONG Vil. from your village? A. About 5 or 6 11, I don't remember whether it is south or north. or Which side of your village is the head? A. The south. or Can you remember exactly where you parted company with the applicant when you left to come to the United States? A. Yes, in the parlor of our house early in the morning about 4 or 5 o'clock, I don't remember the date but it was in the 1st part of the 12th month of CR 18. of Describe your Journey from your home village to Hangkong? A. I wallred to WAH ON Market, 5 or 6 11 north, thence by a barge towed by a little steamer to SUN CHONG City, thence by small steamer to BOK GAI, thence by bigger steam- boat to Hongicong, arriving there sometime that night. Q Where did you stop in HOngkong? A. MON WAH SANG Co. store. of You have heretofore testified that there are 8 dwelling houses in SONG LUNG Village, arranged in four rows of 2 houses each. Is that right? A. Yes. or Are the two houses in each row joined together, or are they separated-by a space? A. They are joined together. Q Did you have any domestic animals in your home when you last left there? A. Yes, a yellow cat. a Who is supporting you now here in the United States? A. My father. Q How often do you get money from him? A. Sometimes once a month, and sometimes once in two weeks. Q Does he know youare attending school this year? A. Yes. of How long did you live with your al leged father after you were admitted to the United States? A. Three or four months. of Then where did you go? A. Then I went to live with WONG SING who operates a laundry at 145 South Vermont Avenue, LOS Angeles. of Where does your alleged father reside? A. At 1135 East 21st Street, Los Angeles. of Why don't you live with your father? A. Because it is too far away from the school, and because I have a schoolboy's job in that laundry. of Has your mother any physical peculiarites? A. I did not notice any. of What was the state of her health when you last left home? A. Shevas in poor heal th in a general way. a Has the applicant any physical peculiarites of any kind that you know off A. I did not notice any. of Did he ever have smallpox? A. I heard that he had smallpox, but I do not know when. of When did you hear it? A. I don't remember. of Did you hear it in China or in the U.S.? A. In China. of Then he had smallpox before you came to the U.S., did he? A. Yes. 7402/99 -13- 11/7/32"
}