{
	"anumber": "A12288810",
	"id": "A12288810_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12288810_0013/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1903, 1930, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "AFFIDAVIT OF SUPPORT City of Boston County of Suffolk Commonwealth of Massachusotts I, Kathleen Alice Lally of 9 Park Vale ave .Allston, Mass boing duly sworn, do doposo and say: That I was born July 5. 1903 at Galway, Ireland That I cama to the Unitod States on March 1930 through the port of New Y ork N.Y. on the S.S. Dresden That I am single That my dependents are none That I am a citizen of the United Statos by Naturalization held at the United States District court held in Boston, Massachuetts on September 15, 1947 cert# 6650395 Tha+ I am employed by Simmons College Residence Halls of Boston, Mass That my earnings are $ 58.45 a week That I have savings $ 7,754.86 held at the Bay State Federal Savings and Loan Association That I havo personal property as follows: 3 rooms of furniture worth $ 1000.00 other personal items worth $ 1000.00 That I have real ostato situated at no outstanding obligation That my not worth is over $ 9000.00 That ovidance of my incomo and resourcos is attached heroto as follows: duplicate statements from my employment and from my savings. That I hereby request the appropriato consular authorities at Dublin, Ireland to grant a visa undor tho Immigration and Nationality Act to: NAME ADDRESS DATE & PLACE OF BIRTH RELATIONSHIP Mrs. Mary Josephine Kilkelly Ryehill, Galway July 5, 1903 sister Ireland +Ireland That My sister is dosirous of coming to the United Statos for pormanent residence. That I por- sonally promiso and agree that during my lifetimo, I will savo tho Unitod Statos and all states, torritorios, countios, towns, municipalitios and districts thoroof harmloss against any lossos or damagos which may be suffored by tho reason of tho fact that any of the persons above montioned during thoir alionage shall bocomo a public charge in tho United Statos. That in order to provont tho alion( above montioned from becoming public chargos after their arrival in the Unitod States, I shall assumo the responsibility for thoir support and I proposo to discharge such responsibility in tho following manner, if it shall bocama necessary. I will meet all of her expenses here in the United States and I guarantee that she will not become a Public Charge here at any time. That I have road and vorified the accuracy of the forogoing statements which I boliovo to bo correct and that I horoby affix my signature and swear to this instrument without any mental reservation whatsoovor. Subscribed and sworn bathleen to boforo mo, this 29 day of (Soal) June in the your 1961 Gyadwill Notary Public. My commission oxpires 12/3/66 Witnossed without objoction: (Soal) (Spouse of Affiant)"
}
