{
  "anumber": "A12250430",
  "id": "A12250430_0097",
  "page_index": 97,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0097/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 7402/99"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -8- Q Which of his legs is crippled? A. I don't remember just now. or Is his leg stiff? A. I think one of his legs is shorter than the other. of Who told you that? A. I saw it myself when he was home. of Was it the result of an illness or an accident? Ano I don't know. of Describe your journey from home to HONGKONG the I walked from my home village towed 5 or 6 11 to WAH ON Market, thence by barge dream by a smell steamer to BOK GAI, thence by steamboat to Hongkong. I left home about daybreak and arrived at Hongkong about 10 o'clock that same night. Does your father own any land in China? dr. Yes. Q How much, and where is it located? A. 15 or 16 mow right close to the village in front. of What use is made of the land? s. It is used for rice growing. of Who is cultivating it at the present time? A. I do not know. Q Where did you stop in Hongkeng while enroute to the United States? A. NG JEW Hotel. of Do you. recognize this photograph (referring to photograph of WONG KWOCK HAI on affidavit of WONG SICK HONG dated 4/20/29 in San Pedro file 30160/129)? A. Yes, GOK HAI. a Do you recognise this photograph (referring to photo of WONG SICK HONG on document mentioned last above)? A. Yes, my father. of Do you recognize this photograph (referring to photo of WONG KWOCK EAY on his affidavit dated 2/24/30 in San Pedro file (301.60/129)? Yes, GOK FAY. of Do you recognise this photograph (referring to photo of WONG KWOCK DOON on affidevit of WONG SICK HONG dated 4/20/29 in San Pedro file 30160/1)? A. Yes, OOK DOON of Do yourecognize this photograph (referring to photo og WONCH XWOCK FAY on affid- avit of WONG SICK HONG dated 5/31/28, in San Francisco file 27487/8-25) A. Yes, GOK PAY. of Do you recognize this photograph (referring to photo of WONG GOOK CHEUNG on his affidavit dated 1/12/29, in San Francisco file 27487/8-25) A. Yes, WONG GOOK CEEUNG a Who is WONG GOOK CHEUNG? A. He is a clansman who brought sometoney to our house in SONG LUNG 711. to my mother in CR 16 or 17. Q Is he a resident of your same village? A. No. of What is his home village? I do not know. Q When and where did you last see WONG GOOK CHRUNG? A. In COR 16 or 17 - I saw him only once - in mur home, of What kind of a road leads from your village to WAH ON Market? A. A stone paved road. OF Have you any further statement to make or evidence to offer in support of your relationship to WONG SICK HONG? A. No. of Have you understood both interpreters? A. Yes. of Any further questions by members of the Board? 4. By both members: No. Applicant excused. 7402/99 11/7/32"
}