{
	"anumber": "A12296289",
	"id": "A12296289_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FOREIGN SERVICE OF THE UNITED STATES OF AMERICA"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FOREIGN SERVICE OF THE UNITED STATES OF AMERICA PODANIE O WIZE IMIGRACYJNA I REJESTRACJE POUCZENIE: Niniejszy formularz nalezy wypeinié na maszynie W dwoch egzemplarzach. W razie wypelnienia recz- nie, litery winny byé czytelne, drukowane. Nalezy odpowiedziec na WSZYSTKIE pytania o ile one sa istotne. Przy pytaniach nie odnoszacych sie do zainteresowanej osoby nalezy zrobié odpowiedni znak. Jesli miejsce na formularzu jest niewystarczajace, nalezy daé odpowiedz na oddzielnych kartkach W dwoch egzemplarzach numeru- jac odpowiedzi stosownie do rubryk formularza. Kartki te nalezy dolaczyé do formularza. NIE NALEZY POD- PISYWAC niniejszego formularza przed uzgodnieniem Z konsulem. Oplata konsularna za zlozenie niniejszego podania O wize imigracyjna wynosi 5 dolarów. Oplate W dolarach amerykanskich lub W postaci czeku nalezy uiscié przy zgloszeniu sie do konsula. OSTRZEZENIE: Jakiekolwiek falszywe oswiadczenie, albo ukrycie jakiegos faktu, moze spowodowac pozbawienie Pana(i) raz na zawsze prawa wjazdu do Stanów Zjednoczonych. Nawet gdyby Pan(i) zostal(a) wpuszczony(a) do Stanów Zjednoczonych, to uzyskany W sposób podstepny wjazd moze byé podstawa do pociagniecia Pana(i) do od- powiedzialnosci sadowej i (lub) deportacji. Niniejszym prosze o udzielenie mi wizy imigracyjnej oraz I hereby apply for an immigrant visa and alien registration o rejestracje dla cudzoziemców W at the United States at Stanów Zjednoczonych W and state the following facts: W zwiazku Z tym podaje CO nastepuje: 1. Nazwisko (Family name) Imie (First name) Drugie imie (Middle name) TOMASZEWSKA GENOWEFA 2. Pelne brzmienie imienia i nazwiska W alfabecie jezyka ojczystego, (jesli jest to alfabet inny niz lacinski) My full name in native alphabet (If other than Roman letters are used) is Tomaszewska Genowefa 3. Inne nazwiska. których uzywalem(am) lub pod którymi bylem(am) znany(a). (O ile mezatka. nalezy podac nazwisko panierskie). Other names I have used or by which I have been known are (If married woman, give maiden name) Panienskie nazwisko Lubert 4. Data urodzenia The date of my birth is (dzier) (miesiac) (rok) (Day) (Month) (Year) 15 maj 1904 roku 5. Miejsce urodzenia My place of birth is (Miasto lub wies, powiat, wojewodztwo i kraj) (City or town) (Province) (Country) Wies Stebuliszki,pow.Swieciany,województwo Wilno Lithnomic 6. Wiek 7. Obecne zatrudnienie lub zawód Gospodyni domu My age is My present calling or occupation is 57 lat 8. Obecny adres miasto Biakogard,ul. Wojska Polskiego My present address is 9. Plec Meska Zenska Plec enska My sex is Male Female 10. Stan cywilny mezatka My marital status is Kawaler (panna) Zonaty (zamezna) Wdowiec (wdowa) rozwiedziony(a) W separacji Single (never married) Married Widowed Divorced Separated Lacznie Z obecnum malzeristwem bylem zonaty razy bylam zamezna 1 razy Including my present marriage, I have been married times 11. Narodowose 12. Rasa biaka 13. Klasyfikacja etniczna Polska My nationality is My race is My ethnic classification is Polska 14. Rysopis 15. Widoczne znaki szczególne nie ma My personal description is Distinguishing marks (visible) a) Kolor wlosów siwy b) oczu Kolor niebieskie Color of hair Color of eyes c) Wzrost sredni 1/0 d) Cera Height Complexion biala"
}
