{
  "anumber": "A12250430",
  "id": "A12250430_0112",
  "page_index": 112,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0112/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1928,
        1929,
        2023,
        1932,
        1930,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -6- Q Where did you and your brothers sleep? A. In the small door side bedroom. Q Where did your two oldest brothers sleep after they were married? A. After my brother GOK FAY was married he lived in the small door side bedroom, and after GOK DOON was married, my second brother moved to my mother's room, and my mother moved into the parlor. GOK DOON slept in the small door side. Q Where did you sleep after they were married? A. In the parlor. Q Where are your paternal grandparents buried? A. In the DANG HONG Hill, 2 or 3 li to the north or our village. Q Are the graves marked with headstones? A. No. Q Are you sure of that? Ao Yes. Applicant excused. Board adjourned 14:15 PM, November 4, 1932. Board reconvened 9:45 AM, November 7, 1932. Same members present. Henry Sy Kwok, official Chinese interpreter. Applicant recalled, sworn. Q (By Chairman) When did your alleged brother WONG GOK DOON quit school in your village? A. About the end of CR 17. (1928). Q What did he do after that? A. He didn't do anything for 3 or 4 months, then he left for the United States,, in the 3rd or 4th month of CR 18. (April, May, or June, 1929). Q Didn't he ever attend any other school than the one in your village at any time? A. Yes, he also attended HIM YICK school at PING YOUNG Vil., Sun Ning District, in CR 17. He attended this school for just the one year. Q When did he quit school in your home village? A. At the end of CR 16 (1927). Q How far and what direction is PING YONG Vil. from SONG LUNG Vil.? A. About 5 or 6 li south of SONG LUNG Vil. Q Did he live at the school during the year that he attended there? A. About half of the time he stayed in the schoolhouse at nights, and the other half of the time he came home to sleep. Q Describe your alleged brother GOK HAI's school attendance. A. He started school in the SONG LUNG Vil. when he was 8 years old, and continued there until he was 12 or 13 years old, at the end of CR 17 (1928). After that he stayed home until the 11th or 12th month of CR 18 (December, 1929 or January, 1930) when he left to come to the United States. Q Were you attending school when GOK HAI left for the United States? A. Yes, Q When did GOK FAY quit the home village school? A. About the end of CR 16 (1927). Q What did he do after that? A. He didn't do anything except stay at home until CR 17 the 11th or 12th month (December, 1928 or January, 1929) when he left to come to the United States. Q About what time of the day was your alleged brother WING HONG born? A. I do not know. Q Was your father ever in business in China that you know off A. Yes. Q Describe it. A. He was in business in Canton City for 7 or 8 years prior to his coming to the United States, about 7 or 8 years ago. Q What was the name of the business he was engaged in in Canton City? A. GING GONG store. 7402/99 -6- 11/7/32"
}