{
  "anumber": "A12250430",
  "id": "A12250430_0098",
  "page_index": 98,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0098/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 74402/99"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1926,
        1878,
        1930,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 -go Witness WONG SICK HONG appears before the Board, is duly sworn, and testifies: (speaks SEE YIP - Sun Ning District - dialect, in which interpreter states he is qualified): Q State all your names, age, date and place of birth, residence and occupation. A. WONG SICK HONG, boyhood name, WONG CHOON WAI, marriage name: I am 55 years old; born KS 4-5-20 (June 20, 1878) in Los Angeles, California; I am operating a vegetable wagon in Los Angeles, and reside at 1135 East 86 21st Street, Los Angeles. (Note by Chairman: Notness presents Certificate of Identity No. 57692 issued San Francisco, California, January 3, 1927 to WONG SICK HONG, admitted as native (CR 38304) #25421/3-17, ss \"Pres. Taft\" October 20, 1926. C.I. endorsed and ret- urned to witness). of In whose behalf do you desire to testify before this Board? A. On behalf of my son WONG GOK ON. Q Are you the person who executed this affidavit and whose signature and photo- graph appear thereon (referring to exhibit \"A\")? A. Yes. of Are all of the statements contained therein true and correct in every respect? A. Yes. of Whose photograph appears beneath your on this affidavit, exhibit \"A\"? A. My son WONG GOK ON's. Q Did you affix the applicant's photograph to that affidavit? 4. Yes. of When did you receive that photograph, and howmany oopies, and from whom? A. The 3rd or 4th month, this year, I received about 6 copies from my wife in SONG LUNG Vil. by mail. Q What disposition did you make of this affidavit after you executed it? A. I sent it home by mail in the 6th or 7th month this year. or To whom did you mail it? A. To my wife. of Through what channels do you send mail to your wife? A. Through NGOON CHONG LEE Co. (Changes) NGOON HANG LEE Co. store in SUN CHONG City, whence it is delivered by messenger. Q When and where did you last testify concerning your family history? A. Some- time in Cr 19 when my son GOK HAI was an applicant for admission at this port. (San Pedro file 30160/129- 2/24/30). of Was all of your testimony at that time true and correct in every respect? A.Yes. or Have there been any changes in your family history of any kind since you testified at this office on February 24, 1930 in behalf of your alleged son WONG KWOCK HAI? A. No. of Has none of your sons married since that time? A. Yes, my son GOK DOON went to China year before last, and was married sometime last year. Q Who did he marry? A. LEE SHIE native of What village, don't know. of Where are GOK DOON and his wife now living? A. I don't know. Q Any other of your sons married since February, 19307 4. Yes, GOK FAY went to China the year before last and was married last year.to LEE SHEE, I don't know of what village she is & native of. of Where are GOK FAY and his wife now residing? A. In our home village. Q Have any children been born to your married sons? A. I don't know. or When did you last hear from your wife? Sometime this year when she sent the photographs of my son GOK ON. 7402/99 -9- 11/7/32"
}