{
	"anumber": "A12250430",
	"id": "A12250430_0040",
	"page_index": 40,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0040/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Investigation, G-166 ( (REV. 7-1-64)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1930, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUST IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION TITYFONG, Ben Nung aka WONG, Kwock Hai FILE NUMBER A18 435 414 REPORT MADE AT DATE BY Los 10/11/68 Loyd L. Netherlin INVESTIGATOR XXXXXXXX DETAILS: SUBJECT'S file shows his admission to SYNOPSIS s at San Pedro, California on February 24, 1930 as WONG KWOCK HAI United States citizen son of WONG SICK HONG. He left the U. S. from San Pedro on 8/20/33 and returned on 7/5/36. Departed again on 5/29/38 and returned on 9/30/40 at San Pedro, California. SUBJECT made an affidavit on 9/11/68 in which he testified his true name is WONG BEN NUNG, that he was born on 12/17/15 at Ping Lok Vil., HSD., China and that he is a citizen of China. That he has never been inspected and admitted to the United States as an alien. SUBJECT testified he married Shew Ling Chin in Ping Lok Village, China in 1933. That his wife immigrated to the United States as the wife of a citizen of the United States on 4/1/55. That he petitioned for his wife as a citizen of the United States. That his wife had known he had entered the United States as the son of man who was not his father. That he and his wife live together. That they have a daughter, Alice WONG who with her husband TOM YOU HONG were immigrated to the U. S. on 3/20/67. That he had claimed 4 immigration sons but had not attempted to bring anyone to the United States. SUBJECT has submitted an application for status as a permanent resident under provisions of Section 249 of the I. & N. Act. Case will be referred to travel control branch for adjudication. SUBJECT testified he has a brother, also his immigration b rother, WONG BEN DONG aka WONG KWOCK ON who operates a laundry at 1802 W. 8th st., Los Angeles, California. Further investigation will be made in cases of SUBJECT'S wife and brother. File checks will be made in cases of SUBJECT'S daughter and son-in-law to determine whether there appear to be need for investigation. FORM G-166 (REV. 7-1-64) FPI-LPC-5-66-30M-2531"
}
