{
	"anumber": "A12250430",
	"id": "A12250430_0121",
	"page_index": 121,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0121/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, -15-"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1916, 1910, 1929, 1918, 2023, 1926, 1913, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -15- Q (to applicant) Who was the first man who looked at you in this room a few moments ago? A. My father. Q Who was the next young man who looked at you? A. My brother KWOCK HAI. Evidence reviewed and informally discussed by the Board. Statement by Chairman: The subject of these proceedings seeks admission as the foreign born and blood son of WONG SICK HONG, alleged native citizen of the United States, identified by San Francisco file 25421/3-17, which record dis- closes that his citizenship was XEEX conceded first on December 27, 1926, when he was admitted at San Francisco as a native citizen. The same record dis- closes that he first departed for China January 7, 1910 as an approved resident merchant, claiming birth at Los Angeles, California, and returned April 22, 1913;he next departed June 10, 1916 with affidavit of U.S. birth, and returned October 20, 1926 at which time the Board of Special Inquiry landed him a citizen. On his last return to the U.S. he claimed five sons and one daughter, the fourth son named being WONG QUOCK ON, age 9, born CR 7-6-10 (July 17, 1918). H4 S alleged son WONG KWOCK FAY was admitted as a son of a native at San Francisco March 18, 1929 on appeal sustained by the Department; alleged son WONG KWOCK DOON was admitted at San Pedro July 9, 1929; and alleged son WONG KWOCK HAI was admitted at San Pedro, February 24, 1930. It is now claimed by and for the applicant that he was born in SONG LUNG Vil., Sun Ning District, China on CR 7-6-10 (July 17, 1918). He appears to be of about the age claimed. His alleged father and prior landed brother WONG KWOCK HAI have testified in his behalf. The applicant's testimony is in substan- tial agreement with that of his prior landed alleged brothers and the al leged father on each of the occasions the latter testified on behalf of his applicant- sons. The applicant has made immediate and positive identification of all photo- graphs of alleged brothers and father in prior records, and similar identification has been made by the present witnesses of the applicant, and vice versa. It is my conclusion that the presumption of relationship claimed has been established by a preponderance of credable evidence, and I therefore move that the applicant WONG GUCK ON be admitted as a citizen of the United States(parol evidence). BY INSPECTOR COONEY: I second the motion. BY CLERK HAFFNER: It is made unenimous. (Applicant advised of his admission). ADMITTED: U.S. citizen (parol evidence); 11/7/32. HoHannah H.B. Hannah, Chairman. I certify the foregoing is a true and correct record of this hearing taken by me direct on the typewriter. Board adjourned 4:00 PM. Hellie Nellie M. Haffner, m cl erk. Happen 7402/99 -15- 11/7/32"
}
