{
	"anumber": "A12250430",
	"id": "A12250430_0092",
	"page_index": 92,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0092/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, 7402/99"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 1911, 2023, 1913, 1922, 1931, 1930, 1920]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 -3- or Name and describe your mother's parents. A. Her father GONG SAI YUK, and her mother,whose name I do not know, both died in their home in the AI YUNG Village before my recollection. or Did your mother ever have any brothers or sisters? A. No. of Name and describe all children born to your parents. A. Five sons, and one daughter: 1- WONG GOK DOON, age 22, married but has no marriage name yet, born ST 3-1-25 (February 23, 1911), now visiting in China. 2- WONG GOK FAX, age 21, married bit has no marriage name yet, born CR 1-12-21 (January 27, 1913), is now visiting in China. 3- WONG GOK HAI, age 16, born OR 6-3-25 (May 15, 1917), single, is now in Los Angeles, California. 4- Myself. 5- WONG WING HONG, age 12, born CR 11-8-4 (September 24, 1922), single, is now in China. 6-(FEMALE). WONG SUEY NGUK, age 13, born CR 9-9-9 (October 20, 1920), single, is now in China. We were all born in the same house in the SONG LUNG Village. of Have you ever been married? A. No. of When, where, and whom did your alleged brother WONG GOK DOON marry? A. In the 12th month of CR 19 (Jamary or February, 1931) in our home in the SONG LUNGV11. to LEE SHEE, age 21, native of NOM LOK Village, They are now living in the LUNG SING Vil., Sun Ning District. They moved there in the 2nd or 3rd month of last year. of When, where, and whom did your alleged brother WONG GOK FAY marry? A. In the 10th month of CR 19 (November or December, 1930) in our home in SONG LUNG Vil. to LEE SHEE, age 20, native of GO ON Vil., Sun Ng ng District. They are living in our home in SONG LUNG Vil. Q Have either of your brothers any children? A. I do not know whether my oldest brother has any children or not, but my second brother GOK PAY has one son WONG soo FAT, born CR 20-9-1 ( October 11, 1931) in our home in the SONG LUNG V11. Q Did your oldest brother GOK DOON have any children when he moved away from your village in the 2nd or 3rd month of last year? A. No. of Have you heard of them having any children since that time? A. No. of Why was your 4th brother WING HONG not named similar to the rest of your brothers in respect to his first given name - why WING instead of GOKY A. I do not know the reason for it. or Didn't your mother ever tell you the reason? A. No. of When and where did you last see your alleged father? A. About 7 or 8 years ago, I do not remember the year, in our home in our village when he left to return to the United States. Q When and where did you last see your alleged brother GOK HAI? A. In the 12th month of CR 18 (January, 1930) in our home when he left there to come to the United States. of What was the exact date he last left home? A. I don't remember what day. of How do you fix the date as being the 12th month of CR 18 (January, 1930) 2 A. He left in that month, and I remember it as I was home then. That is my recollection. 7402/99 11/4/32"
}
