{
	"anumber": "A12250430",
	"id": "A12250430_0082",
	"page_index": 82,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0082/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, NARA Form Number: 54-67"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 of Who folloes-him? A Myself. Q Who follows you? A Wong Sasy Nguk, sister 14, in China. Q Who follows her? A Kong wing Hong, 12, in China of Did you attend school in the village? A Yes. Q Did you attend any o ther school? A 16. Q You didnt attend the Him Yick school in Yung Ping? A No, but my brother did. Q Do you remember where your house is located in the village? 1st AMY home is the 1st house, third row, counting the school house as the adidas row. There are two houses immy row and the 1st house is occupied by Wong Puon Sai, who has four sons, but no girls. Q Do you know their names? A Yes. of How many houses are there inthe second row? A Two houses: The first is occupied by Wong Nguey Hen, who has two sons but do girls and the second house is occuried by Wong Mong Hen; he has one son called Wong Share Git, unmarried. Q How many houses are there in the 1st row counting from the other direct- ion? A Two: The 1st house is occupied by Wong Loy Hen who has a wife and two sons, and the 2nd house is occupied by Wong Dew Chow: he only had a wife when I was there. Q who lives in front of your small door? A Wong Quong Sai who lives in Suia Chung city: he has two girls but mo boys. Q Do you know the girls' names? A Yes. Q Who livesback of him? A Wang Gim Hen, who is abroad.His family consists of a wife and two sons, all living in the village. Q Do you know where the Tong Ben village is? A It ison the North side occupied by \"Wong\" people. Q Are there any villages on the suth side? A Ping Young village occuried by \"Wong\" people. Q Can you see that village from your village? A It is between one and two lis away; sometimes you can see it and sometimes you cannot. Q What other village is there on the South side? A Wah On market on the Suth side, four or five lis away. of Do any people own water buffaloes in you village?A Yes, Wong Poon Sai has one; he is the only man who has one. or Are there anyt villages on the West side of your village? A No. a In what direction does the village face? A East. or Are there any villages on the East side of your village? A None. Q Where did you stay in Hong Kong? A in the Ng Jew no tel. Q Who is Wong Gock Cheung? A There was a Wong Ngook Chong who brought money to my home, but he didnt live in our village. Q How did you travel in going from your village to Hong Kong?A I walked to Wah On market; then took a boat there for Sun Chung: then took ano ther boat for Bok Gai; and then took the steamer for Hong Kong, arriving there between eight and nine o'clock at night. Q Who is Yee Hen Sang? A My teacher, from Gee Suey village. or Do girls attend the village school also? A Yes. or What room in your house did your brother Gold Fay occupy when he warried? A The room on the small-door side of the house. Q Who occupied the large-door side? A My mother, after nit bro ther Gold Doon moved. Q When did he move away? -2-"
}
