{
  "anumber": "A12296289",
  "id": "A12296289_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, 5013"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Poland"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1917,
        1950,
        1904,
        1902
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "AFFIDAVIT OF SUPPORT City of Boston County of Suffolk Commenwealth of Massachusetts I, Vytautas Tamoshaitis of 537 Summer St. Brockton Mass. being duly sworn, do depose and say: That I was born August 26, 1902 at Poland That I came to the United States on 1917 through the port of New York, N.Y. on the S.S.E nie Pyle That I am married That my dependents are myceits son, William 15 years old That I am a citizen of the United States by Naturalization in the Superior Court, Brockton Mass. Dec. 7, 1950- Certificate No. 6803300. That I am employed by Old Colony Shoe Co. of Brockton Mass. That my earnings are $70.60 weekly That I have savings In S curity Federal Savings and Loan Association $1343.56 That I have personal property as follows Furniture in home worth a t least $2000. Automobile worth $300. That I have real estate situated at 537 Summer St., Brockton Mass. house and land assessed at $5250 and worth over $10,000. That my net worth is over $10,000. That evidence of my income and resources is attached hereto as follows: Bank letters Ascessor letter- Job letter That I hereby request the appropriate consular authorities at Warsaw Poland to grant a visa under the Immigration and Nationality Act to: NAME ADDRESS DATE & PLACE OF BIRTH RELATIONSHIP Genoefa Tomasgewska born in Poland May 1904 My sister in law of U1. Woj Polskiego 54 Bialograd, Polland That the said Genoefa Tomaszewska is desirous of coming to the United States for permanent residence. That I per- sonally promise and agree that during my lifetime, I will save the United States and all states, territories, counties, towns, municipalities and districts thereof harmless against any losses or damages which may be suffered by the reason of the fact that any of the persons above mentioned during their alienage shall become a public charge in the United States. That in order to prevent the alien( above mentioned from becoming public charges after their arrival in the United States, I shall assume the responsibility for their support and I propose to discharge such responsibility in the following manner, if it shall become necessary. I shall assist her in getting established in U.S.A. and assure of ficials that she will not become a public charge in U.S. A. She is coming to join her husband, Wilhelm Tomaszewski. That I have read and verified the accuracy of the foregoing statements which I believe to be correct and that I hereby affix my signature and swear to this instrument without any mental reservation whatsnever. Tamishouts (Seal) Subscribed and sworn to, before me, this 20th day of March in the year 961 Timfilia Public. My commission expires 9/1/62 Witnessed without objection (Seal) (Spouse of Affiant)"
}