{
	"anumber": "A12250430",
	"id": "A12250430_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, A1 25-0410"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1934, 1948, 2023, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 I have never been inspected and admitted to the U. S. as an alien. I am surrendering the passport with which I traveled in 1948 and 1949. NOTE: Surrenders U/ S. PP No. FOIA (b)(6) issued to WON GUCK ON on 10/13/48 which contains endorsement showing bearers admission at Honolulu on 8/31/49. My immigration fther was from SONG Lun Vil., HSD., China which is near my own village. He is dead. He also brought my brother to the U. S. as his son. My brother WONG BEN NUNG has confessed (A18435414). I belive my immigration father had one blood son who is WONG WING HONG. He lives in Los Angeles and I recently talked to him on the phone. I do not know him very well. (A17 210 251. I understand he also brought a blood daughter to the U. S. but that she is dead. I married FONG Suey Gee in my village in 1930. When I first came to the U. S. I said I was single. On my second entry I reported I had married while on that trip. My wife knew all about the arrangements under which I first came to the United States and that I was coming to the United States as the son of a man who was not my father. I petitioned for my wife as a citizen of the United States and she was immigrated at San Francisco on 9/1/49. We still live together. We have three children. (1) Don Lem WONG, born Ping Lock Vil., HSD., China in 1934 now living at 2625 Wilshire Blvd., Santa Monica, California where he operates a laundry. (2) FOIA (b)(6) (3) NOTE: Presents birth certificates of children of FOIA (b)(6) FOIA (b)(6) I reported one immigration son but brought no one to the United States in his identity. I have never been arrested. I have never served in the armed forces of any country. I want to stay in the United States and will apply for permanent residence. Subscribed and sworn to before me at Los Angeles, California on 10/23/68. Wong Ben Dong Loyd L. Netherlin Investigator Los 10/23/68 H12250410 - 2 -"
}
