{
  "anumber": "A12250430",
  "id": "A12250430_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF ILLEGAL ALIEN APPREHENDED OR LOCATED, Form I-213 ("
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1948,
        1941,
        2023,
        1933,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 RECORD OF ILLEGAL ALIEN APPREHENDED OR LOCATED (See A.M. - 2790.31-.34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion WONG Ben Dong m blk brn drk Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation China A12 250 430 64 120 laudry opr United States Address (Residence) (Number) (Street) (City) (State) Scars or Marks 1/16 3rd Ave, Los Angeles, Calif. 90019 Airline & Flight No. or Vessel of Arrival Passenger Boarded At F.B.I. No. Marital Status Single Married 11/7/32 SPC SS Pres Coolidge Hong Kong Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location same other inv effort Birthdate Date of Action Location Code Status at Entry Status When Found 1/22/14 11/15/68 Los USC ind City, Province (State) and Country of Birth AR Form: (Type & No.) Lifted Length of Time Illegally in U.S. Date & Hour App./Located Ping Lok Vil, TSD., China US PP Not Lifted over 1 yr Visa Issued At Social Security Account Name Approhended/Located (At/Near) 11/15/68 Los Date Visa Issued Social Security No. Send C.O. Rec. Check Approhonded/Located; By waived To: 553 36 2579 Inv. \"etherlin Immigration Record Criminal Record none none Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of Minor Children Suey Gee FONG - China with me 2 USC Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality. and Address, If Known WONG Wee Don, China - deceased TOM Gim Yep, China - Montreal, Canada Property in U.S. Not in Immediate Possession Fingerprinted Lookout Book Checked Deportation Charge(s) (Codo Words) None Claimed See Form 1-43 Yes No Not Listed Listed, Code Roten Name and Address of (Last) (Current) U.S. Employer From: To: Jack Wong Laundry, 18 0 W. 8th St., Los Angeles, Calif 1941 present Narrative (Outline particulars under which alien located/apprehended and furnish details re time, place and manner of last entry) to the 3. 28 188 son of WONG SICK HONG. Not related to WONG SICK HONG. Has never been inspected and am 98 the U. is as an alien. Made two trips to China leaving 1933 and returing 1936. Left 1948 and returned 8/31/49at HHW as USC. 544(c) 249 Apl. Loyd L. Netherlin, Inv. If space Insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from 1: File i: Stats Officer: 9 19 at ( 1. M. Disposition (Receiving Officer) Form 1-213 (Rev. 3-1-68) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}