{
	"anumber": "A12250430",
	"id": "A12250430_0081",
	"page_index": 81,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0081/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Labor Immigration Service District No. 31, Form 4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1918, 2023, 1933, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 U. S. DEPARTMENT OF L ABOR Immigration Service District No. 31. No.8402/196 ( Office of Inspector in Charge, RE: WONG GUCK ON, ) Los Angeles,California, Applicant for Form 430: ( July 27, 1933. J.C. Nardini, Inspector & Stenographer, Henry Kwok, Interpreter. STATEMENT OF THE APPLICANT. SWORN. Q Please state your name, place and date of birth, occupation and res- idence? A Wong Guck On,only name, single, born in CR 7-6-10 (July 17, 1918) in Sung Lung village, Sun Ning district, China; occupation, student; residence, 145 uth Vermont avenue , Los Angeles, Calif. Q Where have you lived since your admission last year? A I lived wi th my father at 1135 East 21st street, and then I moved to the present address. Q Where is your father? A He works in the market near 21st street. His names are Wong Seck Hong and Wong Choon Wai.He has no bro thers or sisters that I know of. Q Is your mo ther living? A Yes; her name is Hong Shee, about 43, and comes from the Ai Yung village, Sun Ning district, Chija. Sometimes she is sickly. Q When did you last hear from your mo ther? A About a month ago my father received a letter from her, and he is sending me to Chinna How. Q Are you going to China with your brother, Wong Kwok Hai? A Yes. Q Ho many children were born to your parents? A Five sons and one daughter. The 1st born is Wo ng Gok Doon, I dont know his marriage name, now in the United States somewhere. His wife is Lee Shee, but I dont know whether they have any children or not. They had none when I left for the United States. Q Where is his wife living niw? A In Lung Sing village; they moved an CR 21 (1932) That village is very far away. Q Why did she moveia Because there was not enough room in our house. Q Who follows him? A Wong Gok Fay, I dont know his marriage name, now in China. His wife is Lee Shee, and has one son,Wong Soo Fat; no girls when I was there. They live in our house in the village. Q Who follows him? A Wong Gok Hai, 17, in Los Angeles, living at 145 So. Vermont avenue, this city, and attending school. Q Does he limp. A Yes."
}
