{
	"anumber": "A12250430",
	"id": "A12250430_0152",
	"page_index": 152,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0152/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION OF ALLEGED AMERICAN CITIZEN OF THE CHINESE RACE FOR PRE-VESTIGATION OF STATUS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 Form 430 APPLICATION OF ALLEGED AMERICAN CITIZEN OF THE CHINESE RACE FOR PREINVESTIGATION OF STATUS TRIPLICATE No 8402/196 U. S. DEPARTMENT OF LABOR IMMIGRATION SERVICE D.D. 1402/157 Los Angeles, Calif July 11, 1933 , 192 To Judge a F. Shew, Officer in Charge, Immigration Service, Les Angeles, Calif, SIR: It being my intention to leave the United States on a tem- Age 15 Height ft 5 in. porary visit abroad, departing and returning through the Chinese (In shoes) Marks port of entry of San Pedro Gallf , I hereby PEC on tip of nose. apply, under the provisions of Rule 16 of the Chinese Regulations, for preinvestigation of my claimed status as an American citizen, Sear left temple in hair. submitting herewith such documentary proofs (if any) as I possess, and agreeing to appear at such time and place as you may designate, and to produce then and there witnesses for oral examination regard- ing the claim made by me. This application is submitted in triplicate with my photograph attached to each copy, as required by said rule. Respectfully, gnature in Chinese (2) $ (WOND GOOK ON gnature in English Wong Kwock on Address 145 Vermont Ave. To iiii * MJ ste M + # OFFICE OF District Director of Immigration Los Angeles, Calif. July 29, 1933. , 19 Respectfully returned to Judson F. Shaw XXXXXXXXXXX X X Inspector in Charge. Los Angelew, Calif. with the information that I have Approved the application on the basis of the evidence submitted herewith. Herry B. Blee 14-73 GOVERNMENT PRINTING OFFICE Inspector in Oharna Asst. District Director of Immigration Los Angeles District."
}
