{
	"anumber": "A12250430",
	"id": "A12250430_0048",
	"page_index": 48,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12250430_0048/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1943, 1942, 1934, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 actually born in China and not in the United States. My father died about 1942 or 1943 in the United States. My mother is anative and citizen of China. Her name is KONG Wai Hing and she lives at 15A Tai Hum Tsun Rd, Tai Hum Tsun, Diamond Hill, Kowloon, Hong Kong. Since I believe I am not a citizen of the United States I now withdraw my application for a certificate of citizenship. I have never been inspected and admitted to the United States as an alien, never applied to an american consular official for a document as an alien. I entered with the intention of S taying here permanently in 1934. My only absences from the United States since original entry was while in U. S. military service. I served in the U. S. Navy from June 25, 1943 to March 23, 1946 and was honorably discharged. NOTE# File contains copy of honorable diabix discharge of Charles Wong, Serial No. 878 65 78 shoing active service U. S. Navy from 6/25/43 to March 23, 1946. I have not done anything restricted to U. S. citizens since I received information indicating I am not a United States citizen. I did not vote in the primary election for that reason. My parents had 4 blood children. Only two of us came to the United States. My sister WONG Suey Ngook entered with me. She died in Los Angeles in 1942. The other six children are sisters and one of them is in Hong Kong and the other in China. The sister in Hong Kong is actually my twin. My father brought four immigration sons to the United States. They came before me and I had never seen any of them until after I arrived in the United States. I believe two of them are still in Los Angeles. I have been married once. I married Betty Jessie Moy in Chicago for on Dec. 6, 1946. My wife was born in Chicago. We live together and have two children, FOIA (b)(6) I have never been arrested. I believe my immigration brothers have been in touch with this office but if necessary I can get their addresses, one of them who runs a laundry at 8th and Union St., in Los Angeles called me recently, Subscribed and sworn to before me at Los Angeles, California on 10/22/68. Loyd L. Netherlin, los 10/22/68 Investigator A17 210 251 -2 -"
}
