{
	"anumber": "A12288810",
	"id": "A12288810_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12288810_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Registration of Marriages (Ireland) Acts, Q No 5"
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1934]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "55 ACTA um CLÁRú pósao Registration of Marriages (Ireland) Acts Q No 5 cóip Detinnite oe CATFIO 1 SCLR-LeADAR PÓSCAI Pósadh Certified Copy of Entry in the Marriage Register Book Marriage 19. 34. Pósadh do Ceiliúradh i i gCeantar Marriage solemnised at the Roman Catholic Church i gCeantar an Chláraitheóra Maoirseachta of i in the Registrar's District of Aliling in the Superintendent Registrar's District of Luam in gContae the County of Alway Uimh. No. Ainm agus Sloinneadh an Athar Staid maidir Sli Bheatha Gnath-Ait Chonaithe Roimh agus Ainm na Mathar agus a An áit a mbeartaitear buan- Uimh Data an Phosta Ainm agus Sloinneadh Data Breithe le Pósadh Pósadh Sloinneadh roimh pósadh di chonai ann No. Date of Marriage Name and Surname Date of Birth Marital Occupation (full detail) Normal Residence Before Father's Name and Surname and Intended future permanent 59 Condition Marriage Mother's Name and Maiden Surname residence (1) (2) (3) (4) (5) (6) (7) (8) (9) nqth Nov. James Kilkelly 39. Bachelor farmer. Rychuls Winimea, Thomas Kilkelly farmer Claraithe an Registered by 59 1934 me this l 90 many Lally 30. Spristis Ryehill Warrinea michael Lally farmed lá seo de day of march Phósas an Lanú seo i in the Roman bhunk dréir Uird agus Gnathai na h-Eaglaise Catoilicí 19 35 Married Catholic of way according to the Rites and Ceremonies of the CatholionChurch by me for Thundergart P.P. 2.9 Walsh Ceiliúradh an Posadh Janus Kiekelly In ár Lathair-ne This/Marriage seo Eadrainn-ne between us, was many Lally in the Presence of us solemnized hears Kilkilly Lally Cláraitheoir Deimhnim leis seo gur fior choip i seo de thaifid uimh i gClár leabhar Póstaí atá dha choimeád agam. Registrar I hereby Certify that the foregoing is a true copy of the Entry No. 59 in the Marriage Register Book in my lawful custody. Haustin Oifig \"Cláraitheóir (Maoirseactha) na mBreith, na mBás agus na mPósadh Office (Superintendent) Registrar of Births, Deaths and Marriages. Data lit august 1961. *Serios amach an Focal Idir Luibini má's Gádh i Date Strike out word in Brackets if not required. for the District of gCeantar becausing 2Galway"
}
