{
	"anumber": "A12296289",
	"id": "A12296289_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION, Form Number: 12911446"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Poland"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1962]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM (7-15-5 UNITED STATES OF AMERICA AMIGRANT VISA AND ALIEN REGISTRATION 1- 1291146 OF: (Family name) (First name) (Middle name) TOMASZEWSKA Genowefa PORT OF ACTION OF SPECIAL INQUIRY OFFICER Bos (020) The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in and taken no appeal taken the United States at this port on the under BOAC 551 Symbol (Name of vessel or flight No. of aircraft) Section of the Immigration and on (Day) (Month) (Year) Nationality Act. and was inspected by me and inquiry by special inquiry officer Symbol R-22 the admitted ander 1962 further Special Inquiry Officer. Section Of 1 3 the Immigration and ACTION ON APPEAL A MAR ADMITTED Nationality Act EXCLUDED CLASS Immigrant Inspector. DATE TO This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Embassy facts stated in the application. IMMIGRANT CLASSIFICATION AT Warsaw, Poland. NONQUOTA (Symbol) QUOTA (Symbol) K-22 - VISA PETITION NO., IF ANY appr. on February 15, 1961 Consul of the United States of America. IMMIGRANT VISA NO. QUOTA BJK 1003 NONQUOTA ISSUED ON (Day) (Month) (Year) 21 February 1962 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 20 June 1962 NATIONALITY (If stateless, so state, and give previous nationality) Polish PASSPORT NO. UNITED AA-0025838 OR OTHER TRAVEL DOCUMENTS (Describe) 1131326 Service No. ISSUED 2.1 Genowefa TOMASZEWSKA Date TO Tariff Item No. Fee Paid $20 BY Ministry of Interior at Warsaw Local Cy equiv. ON December 14, 1961 EXPIRES December 12, 1962 16-74687-1 U. S. GOVERNMENT PRINTING OFFICE"
}
