{
  "anumber": "A12296289",
  "id": "A12296289_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12296289_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Strona 4, Strona 4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Strona 4 (e) Czy przechodzil(a) Pan(i) nastepujace choroby: Have you ever had any of the following: (A) Gruzlice W jakiejs postaci? Tuberculosis in any form? Nie (B) Trad? Leprosy? Nie (C) Inna niebezpieczna chorobe zakazna? Nie Any other dangerous contagious disease? (4) (a) Czy jest Pan wielozencem, czy uprawia Pan wielozenstwo i czy nawoluje Pan do uprawiania wielozenstwa? Are you a polygamist, do you practice polygamy, or do you advocate the practice of polygamy? Nie (b) Czy jest Pani lub byla kiedykolwiek prostytutka, streczycielka (streczycielem) do nierzadu i czy utrzymywal(a) sie Pan(i) calkowicie lub czesciowo Z prostytucji? Nie Are you or have ever been a prostitute, procurer, or supported wholly or in part from the proceeds of prostitution? (c) Czy Pan(i) jedzie do Stanów Zjednoczonych by uprawiac tam niemoralne czyny piciowe, prostytucje lub inne przynoszace zysk, a zabronione prawem czyny? Are you going to the United States to engage in an immoral sexual act, in prostitution, or other unlawful Nie commercialized vice) (5) (a) Czy poprzednio skladal(a) Pan(i) juz podanie o wize na wyjazd do Stanów Zjednoczonych jako imigrant(ka) lub na pobyt czasowy? (Jezeli odpowiedz jest twierdza.ca, nalezy podaé gdzie i kiedy i czy staral(a) sie Pan(i) o wize imigracyjna czy nieimigracyjna oraz czy wiza zostala wydana? Nie Have you previously applied for a visa to enter the United States either as an immigrant or as a nonimmigrant? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued) (b) Czy odmiówiono Panu(i) wjazdu do Stanow Zjednoczonych podezas ostatnich 12 miesiecy? (Jezeli odpowiedz brzmi \"tak\", prosze dostarczyé dowod, ktory by wykazywal, ze Minister Sprawiedliwosci W Stanach Zjedno- czonych wyrazib zgode na ponowne ubieganie sie o wjazd do Stanow Zjednoczonych). Nie Have you ever been refused admission to the United States during the last twelve months? (If the answer is Yes submit evidence that the Attorney General has consented to your reapplying for admission into the United States) (c) Czy kiedykolwiek byl(a) Pan(i) Have you ever been (A) aresztowany(a) i deportowany(a) ze Stanow Zjednoczonych? Nie arrested and deported from the United States? Nie (B) usuniety(a) ze Stanow Zjednoczonych za wiasna zgoda na koszt rzadu Stanow Zjednoczonych, jako osoba, która popadia W nieszezescie? voluntarily removed from the United States at United States Government expense as a person who fell into distress? Nie (C) usuniety(a) ze Stanów Zjednoczonych jako wróg zewnetrzny? removed from the United States as an alien enemy? (D) usuniety(a) ze Stanow Zjednoczonych na koszt rzadu zamiast deportacji? Nie removed from the United States at Government expense in lieu of deportation? (Jezeli odpowiedz na jakiekolwiek Z powyszych pytañ jest twierdzaca, nalezy dostarczyó dowod stwierdzajacy, ze Minister Sprawiedliwosci wyrazit zgode na Pana(i) powtorne ubieganie sie o wjazd do Stanów Zjednoczonych). (If the answer to any of the above guestions is Yes, submit evidence that the Attorney General has con- sented to your reapplying for admission into the United States) (6) (a) Czy usilowal(a) Pan(i) uzyskaé wize lub inne dokumenty na wjazd do Stanow Zjednoczonych przy pomocy oszustwa lub rozmyslnego przekrecania faktow? Have you ever attempted to obtain by fraud or wilful misrepresentation a visa or other documnentation to Nie enter the United States? (b) Czy otrzymal(a) Pan(i) kiedykolwiek wize lub inne dokumenty na wjazd do Stanów Zjednoczonych przy po- mocy oszustwa lub rozmyslnego przekrecania faktow? Have you ever obtained by fraud or wilful misrepresentation a visa or other documentation to enter the Nie United States? (7) (a) Czy nie kwalifikowal(a) sie Pan(i) przedtem lub obecnie do przyjecia obywatelstwa amerykanskiego? Are you now or have you ever been ineligible for United States citizenship? Nie (b) Czy wyjechah Pan lub pozostal kiedykolwiek poza Stanami Zjednoczonymi po to, aby uniknac sluzby wojsko- wej W czasie wojny lub tez W ezasie stanu wyjatkowego? Have you ever departed from or remained outside of the United States to avoid or evade military service in Nie time of war or national emergency? (c) Czy rejestrowal sie Pan kiec/ykolwiek W komisji poborowej do sluzby wojskowej zgodnie Z prawem obowia- zujacym W Stanach Zjednoc:zonych? Nie Have you ever registered with a draft board under the selective service laws of the United States? (8) Jezeli jest Pan(i)® W wieku powyzej 16 lat, czy nie umie Pan(i) czytac i rozumiec jakiegos jezyka lub dialektu? Are you, if you are over sixteen, unable to read and understand some language or dialect? Nie (9) Czy kiedykolwiek dla zysku (pomagal(a) Pan(i) jakiemus cudzoziemcowi do wjazdu lub do usilowania wjazdu do Stanów Zjednoczonych Z pogwalceniem praw Stanów Zjednoczonych? Have you for gain ever assisted another alien to enter the United States or try to enter the United States in Nie violation of the laws of the United States? (10) Czy zwiedzit(a) Pan(i) Stany Zjednoczone poprzednio na zasadzie wymiany miedzynarodowej? Jezeli tak, to czy przebywat Pan krócej niz dwa lata za granica po wyjezdzie ze Stanów Zjednoczonych? Nie Are you a former exchange visitor who has not resided abroad for two years following your departure from the United States?"
}