{
  "anumber": "A12491240",
  "id": "A12491240_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICACION DE NACIMIENTO, 775"
    },
    "years": {
      "ms_years_nlp_v1": [
        1953,
        1905,
        1936,
        1958
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SENATISE C. SERVICE CERTIFICACION DE NACIMIENTO MINISTERIONDE JUSTIEMN GG REGISTRO DEL ESTADO CIVIL SOLICITUD No. 775 REGISTRO DEL ESTADO CIVIL DE FECHA DEL ASIENTO GUANAJAY DIA MES AÑO 31 OCTUBRE 1905 SECCION DE TOMO FOLIS INSCRIPCION NACIMIENTOS 13 249 248 DIA HORA DEL FEERA QUALITIES SEIS DE LA TARDE VEINTE Y SEIS MES AÑO EEN SEPTIEMBRE MIL NOVECIENTOS CINCO NOMBRES Y APELLIDOS DEL INSCRIPTO DESIDERIO ANGEL MANUEL RANGEL MENDEZ LUGAR DE NACIMIENTO EN ESTA VILLA NOMBRES Y APELLIDOS DEL PADRE LUGAR DE NACIMIENTO DEL PADRE N DESIDERIO JESUS RANGEL Y ESPINOSA GUANACABULLA, SANTA CLARA NOMBRES Y APELLIDOS DE LA MADRE LUGAR DE NACIMIENTO DE LA MADRE MARIA RITA MENDEZ GUANAJAY DESIDERIO ANGEL MANUELA JESUS DOROTEA TOMASA ANTONIA INSCRIPCION PRACTICADA EN VIRTUD DE COMPARECENCIA PERSONAL DE JOSE M. POSADA. HAY TRES NOTAS QUE DICEN: -LL INSCRIPTO CONTRAJO MATRIMONIO CON ES- TER DE LA CARIDAD EODORA OCHANDARENA Y LOPEZ EL DIA 20 DE JUNIO DE INSURANCE 1936. SEGÚN CONSTA AL FOLIO 164 DEL TOMO 29 DEL VEDADO HABANA.-2. - EL NSCRIPTO OBTUVO DIVORCIO DE SU ESPOSA LSTHER DE LA CARIDAD LEODO - RA OCHANDARENTA Y LOPEZ POR SENTENCIA DICTADA POR EL JUEZ DE IRA. INSTANCE A DE ALMENDARES EN 4 DE MARZO DE 1953. 3.-EL INSCRIPTO CON- NOTTER TRAJO MATRIMONIO CON CARMEN GERTRUDIS GARCÍA Y RAMIREZ EL DÍA 26 DE JUNIO DE 1958, SEGÚN CONSTA AL FOLIO 575 DEL TOMO 59 DE MARIANAO. EL ENCARGADO DEL REGISTRO DEL ESTADO CIVIL DE with GUANAJAY DEL ESTIDO CERTIFICA: QUE LOS ANTERIORES DATOS CRACUER OPDILICA DAN FIELMENTE CON LOS QUE APARECEN CONSIGNADOS EN LA INSCRIPCIÓN A QUE CEL DE ESTADO FOR EVITE SE HACE REFERENCIA. GUANAJAY , ONCE and DE ABRIL DE MIL TERMITY NOVECIENTOS DE SECURITY DE SIETE. SESENTA Y CONFECCIONADO CONFRONTADO out (lane) Dr. René Pablo Leiva Arias ENCARCADO DEL REGISTRO DEA. ESTADO CIVIL"
}