{
  "anumber": "A12491240",
  "id": "A12491240_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0040/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information Form, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "0 9. a. Yo tengo 9. a. I have children, as follows: (complete all columns for each child.) If hijos, como a continuacion se explica (complete todas las colum- nas). Si su hijo vive con usted, declare \"conmigo\" en la última columna, de child lives with you, state \"with me\" in last column; otherwise give city and otro modo, de la ciudad y el estado a condado de la residencia del hijo. state or country of child's residence. Name (Nombre) Place of Birth Date of Birth Sex Sexo Lugar de nacimiento Fecha de nacimiento Now Living at (Ahora estáresidiendo en) b. The following members of my family are also applying for permanent resident b. Los siguientes miembros de mi familia tambien estan solicitando la categoría de status. residentes permanentes: My wife Carmen Gertrudis GARCIA Ramirez 10. I list below all organizations, societies, clubs, and associations, past or present, 10. A continuacion hago una lista de todas las organizaciones, sociedades, clubs y in which I have held membership in the United States or a foreign country, and the asociaciones, pasadas o presentes, de las que he sido socio en los Estados Uni- dos o en algun país extranjero, y los períodos y lugares en que era socio. (Si periods and places of such membership. (If you have never been a member of any usted nunca ha sido socio de ninguna organizacion, declare \"Ninguna'\".) organization, state \"None.\") none 11. have have not been charged with a violation of law (other than minor traffic 11. Se han no se han presentado cargos judiciales contra mi (aparte de infracci- violations). If you have ever been charged with a violation of law, give date and ones menores del transito) (Si alguna vez usted ha sido acusado de infringir la ley, place and nature of each charge and the final result. especifique la fecha yel lugar y la naturalezade cada acusacion el resultado final) 12. I have have not requested exemption or discharge from training or service in 12. Yo he no he pedido ser eximido ni licenciado del entrenamiento o servicio en the Armed Forces of the United States. (If you have requested exemption or dis- las Fuerzas Armadas de los Estados Unidos (Si alguna vez usted be pedido ser charge from training or service in the Armed Forces of the United States, give date eximido o licenciado del entrenamiento o servicio en las Fuerzas Armadas de los and place of your request, the reason for such request, and specify to whom it Estados Unidos, indique la fecha y lugar de SIL peticion, la razon para la misma y was made. especifique a quien fue dirigida). 13. Deportation proceedings have have not been instituted against me in the 13. Un procedimiento de deportación ha sido no ha sido instruído contra mi en United States. (If deportation proceedings have ever been instituted against you, los Estados Unidos (Si un procedimiento de deportación ba sido instruído contra give the date and place of hearing, the charge, and the final result.) Ud. alguna vez, de el lugar y la fecha del juicio, la acusación y el resultado final 14. I have have not been a participant in a designated exchange program. (If 14. Yo he no he participado en un programa de intercambio designado (Si Ud. you have been a participant, show dates of arrival and departure from U.S.) ha participado, muestre las fechas de llegada y salida de los Estados Unidos de America.) 15. I have have not heretofore filed an application for the status of a permanent 15. Yo he no he llenado hasta ahora una solicitud por el estado de residente per- resident. (If you have ever filed such application, give the date and place of filing manente (Si alguna vez ba ejecutado tal solicitud, indique la fecha y el lugar en and final disposition.) que la presento y la disposicion final) 16. Completed Form G-325A (Biographic Information) is attached as part of this 16. La planilla G-325A terminada, (Informacion biografica) está unida aquí como parte application. de esta solicitud. 17. IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: SI SU ALFABETO NATIVO NO ES DE LETRAS ROMANAS ESCRIBA SU NOMBRE EN SU ALFABETO NATIVO DEBAJO: Signature of Applicant Deuderio Bangel Date of Signature (Firma del solicitante) (Fecha de la firma) 1968 18. (Signature of person preparing form, if other than applicant.) I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any snowledge. (Firma de la persona que ha preparado la planilla, si fuera otra que el solicitante) Yo declaro que este documento ha sido preparado por mi, a peticion del solicitante y que esta basado en toda la informacion de que tengo conocimiento. Signature Address (Firma) (Direccion) 567 W 185th Street NYNY27 Date (Fecha) 1968 Occupation (Ocupacion) Notary Public (Application not to be signed below until applicant appears before an officer of the Immigration and Naturalization Service for examination.) (La solicitud no debe ser firmada al pie, basta que el solicitante aparezca delante de un funcionario del Servicio de Inmigración y Naturalización para ser examinado.) I, do swear (affirm) that I know the contents of Yo juro (afirmo) que conozco el contenido de esta this application subscribed by me including the attached documents, that the same are solicitud, que el mismo es verdadero, segun mi mejor conocimiento, y que las correc- true to the best of my knowledge, and that corrections numbered ( ) to ( ) were ciones numeradas 0011 a m fueron hechas por mí, o a peticion mía, y que esta made by me or at my request, and that this application was signed by me with my full, solicitud fue firmada por mi con mi nombre completo y verdadero: true name: Rangel Subscribed and sworn to before me by the above-named applicant (Complete and true signature of applicant) at on (Firma completa y verdadera del solicitante) (Month) Henia (Day) (Year) (Signature and tide of officer)"
}