{
	"anumber": "A12491240",
	"id": "A12491240_0048",
	"page_index": 48,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0048/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form Approved OMB No. 4-4-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 1954, 1936]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['retired']"
			},
			"nationality": {
				"nationality_llm_v1": "Cuban"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 8-27-72)N Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R435 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. Rangel, Desidorio FEMALE 9-26-05 Guban (If any) A-12-491-240 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. None Pinace Del Rio Cuba (If any) 265-74-4659 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE Rangel Deciderio Las Villas Cuba Deceased FATHER MOTHER (Maiden name) Mondez Maxia Pinar Del Rio Cuba @ HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE OR PLACE OF MARRIAGE WIFE (For wife, give maiden name) Carcia Carmon 11-27-16 Hav. Cuba 6-26-58 Hav. Cuba FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE Ochandarena Ester 4-1-08 Hav. Cuba 6-1936 Have Cuba 1954 APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 10861 S.W. 7 St. # 1 Sweet Water Fla USA 5 76 PRESENT TIME 2376 --32 St. Astoria New ork 11 1 66 2 76 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Ave 19 # 8205 Marianao hayana Gube 58 61 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Retired 73 PRESENT TIME Mergill Linch Pierce Ferner Inc. New York Mail Department - 65 - 73 Show below last occupation abroad if not shown above. (Include all information requested above.) Self Employed Havana Cuba Lawyer - 30 - 59 THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Desidered OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) RANGEL, DESIDERIO A-12-491-240 (OTHER AGENCY USE) INS USE (Office of Origin) 3/11 MIA CITZ Bar gift JAN 24 1977 (4) Consul FORM G-325A"
}
