{
	"anumber": "A12495368",
	"id": "A12495368_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Naturalization Certificate,, 92264028"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1903, 1970]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "fair"
			},
			"marital_status": {
				"marital_status_llm_v1": "Married"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1970.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "Miami, Florida"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "CA TO BE FORWARDED TO No. 9264028 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Pelition No. 46,641 DUPLICATE AlienRegistration No. A-12 495 368 Personal description, of holder's of date f naturalization: Date of birth December 26, 1903 sex female ; complexion fair coloroferies brown color of hair brown ;height 5 feel 7 inches; weight 170 pounds; visibledistinclivemarks none Maritalstatus married Country of formernationality Cuba I certify that the description, above givenis true, and that a likeness of me. < Haur Hn Cumll ( Complete and true signature of holder) THE UNITED STATES OF AMERICA SOUTHERN DI STRICT OF FLORIDA } SS: Beit known, that at termofthe District the United States Court of held pursuantly lawal Miami, Florida on February 3, 1970 the Courthaving foundshak MARIA ANA CUNILL then residing at Miami, Florida intends loreside permanentlying the United. States when sorequired bythe naturalization Laws of he United. States), had in all other respects, complied with the applicable, provisions of such naturalization laws, and was entitled lobe Seal admilled sociliseenship, thereupon ordered that such person be and(s)hewas admilled as a cilizen a the United States of America. Investimony whereof thesealos, the courtis hereunto affixed this 3r d day of February in theyyourshours Lord mineteen hundred and seventy Joseph I. Bogart Clerk of the U.S. District Court. IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. By John L. Taille Deputy Clerk."
}
