{
  "anumber": "A12491240",
  "id": "A12491240_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY CUBAN REFUGEE FOR PERMANENT RESIDENCE, Form I-485 (A1. U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Cuba",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1905,
        1964,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPLICATION BY CUBAN REFUGEE FOR PERMANENT RESIDENCE SOLICITUD REST SERVICE DE REFUGIADO CUBANO FILE NO. N. Y. C. MAPE UNFI APPLICANT FOR BENEFITS OF SECTION OF THE ACT OF NOVEMBER 2, 1966. JUL 11 9 42 AM '68 (DO NOT WRITE ABOVE THIS LINE.) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH (No escriba mas arriba de esta linea.) (Vea las instrucciones antes de ejecutar la THE NUMBER OF THE CORRESPONDING QUESTION. PRINT IN BLOCK LETTERS. planilla de solicitud. Si necesita mas espacio pera contestar por completo alguna CHECK ITEM 1 OR 2 AND COMPLETE AS APPROPRIATE.) IMPORTANT! EXE- pregunta, use un pliego separado e identifique cada respuesta con el numero de la CUTE IN ENGLISH, pregunta correspondiente. Escriba con letra de impreats. Marque o Seccion 1 o 2 y completela propiamente. IMPORTANTE! EJECUTE EN INGLES. 1. I hereby apply to become a lawful permanent resident alien on the following 1. Por la presente yo solicito convertime en residente permanente extranjero sobre basis: (Check A or B only) la siguiente base: (Marque solamente A o B) I am a native or citizen of Cuba. I was inspected by a U. S. immigration A. Yo soy nativo o ciudadano de Cuba. Fui inspeccionado por un funcionario officer and admitted or paroled into the United States subsequent to Janu- del Servicio de Inmigración de los Esdados Unidos de Americay admitido ary 1, 1959 and have been physically present in the United States for at o permitido entrar bajo palabra en los Estados Unidos con posterioridad a least two years thereafter, or 1 de Enero 1959, y he estado físicamente presente en este pais, por wife menos dos años después de eso, o B. I am not a native or citizen of Cuba but, I am the husband, or minor la esposa hija unmarried child of a native or citizen of Cuba described in \"A\" above with B. Yo no soy nativo ni ciudadano de Cuba, sino soy N el esposo, o 1/ el hijo whom I am residing. I was inspected by a U. S. immigration officer and menor de edad y de estado soltero, de un nativo o ciudadano de Cuba, admitted or paroled into the United States subsequent to January 1, 1959 tal como ha sido descrito anteriormente en \"A\", con quien estoy residiendo. Yo fui inspeccionado por un funcionario del Servicio de In- and have been physically present in the United States for at least two years thereafter. migración de los Estados Unidos de America y admitido o permitido entrar bajo palabra en los Estados Unidos, con posterioridad a 1 de Enero 1959 he estado presente fisicamente en este país por lo menos dos años des- pues de eso. 2. I hereby apply to have my admission for permanent residence recorded as of the 2. date I originally arrived in the United States as a nonimmigrant or parolee, or as Por la presente yo solicito que mi permiso para residencia permanente tenga como fecha, la de mi llegada original a los Estados Unidos de America cuando admitido of May 2, 1964 whichever date is later. (Check A or B only) bajo palabra O como no emigrante, o la del 2 de Mayo de 1964, de las dos la que sea posterior. (Marque solamente A o B) A. I am a native or citizen of Cuba who was lawfully admitted into the United States for permanent residence. A. Yo soy un nativo o ciudadano de Cuba, que fue legalmente admitido en los wife Estados Unidos para residencia permanente. B. I am not a native or citizen of Cuba but, I am the husband, or minor la espose la hija unmarried child of a native or citizen of Cuba described in \"A\" above B. Yo no soy nativo ni ciudadano de Cuba, sino soy el esposo, o AV el hijo menor de edad y de estado soltero, de un nativo o ciudadano de Cuba, tal with whom I am residing. I was admitted into the United States for per- como ha sido descrito anteriormente en \"A\", con quien estoy residiendo. manent residence. Fui admitido en los Estados Unidos para residencia permanente. 3. My name is (First) (Middle) (Last) My alien registration number is Mi nombre es (Nombre de pila) (Nombre intermedio(s)) (Apellido) Mi número del Registro de Extranjeros es Desiderio RANGEL A-12 491 240 4. I reside in the United States at: (Apt. No.) (No. and Street) (City) (State) (ZIP Code) en los Estados Unidosen: (Ním. del Apto.) 2376- (Calle y Núm.) (Ciudad) (Estado) (Código postal-ZIP) 32nd Street, Astoria, Long Island, New York 5. Date of Birth Place of Birth (City or Town) (County, Province, or State) (Country) I am now a citizen of (Country) Fecha de nacimiento. Lugar de nacimiento (Pueblo O ciudad) (Partido o provincia) (País) Ahora soy un ciudadano de (País) 09 26 1905 Guanajay, Pinar del Rio Cuba Cuba 6. My first arrival in the U.S. subsequent to January 1, 1959 occurred on I arrived by (Name of vessel or other means of travel) Mi primera llegada a los Estados Unidos, con posterioridad a 1 de Enero de 1959, Yo llegué por (Nombre del barco u otro medio de transporte) ocurrio e: Date (Month, Day, Year) At the Port of (City, State) Fecha (Mes, día y ano) A1 puerto O aeropuerto de as a (Visitor, student, U.S. citizen, stoway, immigrant, parolee, etc.) como un (Visitante, estudiente, ciudadano de los EE.UU. polizón, inmigrante, bajo palabra, etc.) 7. I last arrived in the United States at the port of by (Name of vessel or other means of travel) Mi ultima entrada en los Estados Unidos fue por el puerto o aeropuerto de por (Nombre del barco u otro medio de transporte) PAA (City and State) on (Month) (Day) (Year) (Ciudad y Estado) en (Mes) (Día) (Ano) as a (Visitor, student, U.S. citizen, stoway, immigrant, parolee, etc.) NONE como un (Visitante, estudiente, ciudadano de los EE. UU., polizón, inmigrante, bajo palabra, etc.) Sept 8 1961 Miami,Fla. exile NOTE: IF YOU CHECKED ITEM 2 (TO APPLY UNDER SECTION 2 OF THE ACT) YOU NEED NOT ANSWER ITEMS 8 THROUGH 16. NOTA: SI USTED HA MARCADO LA SECCION 2 (PARA SOLICITAR BAJO LA SECCION 2 DE LA LEY) NO NECESITA CONTESTAR NADA DESDE EL ARTICULO 8 HASTA EL 16) 8. am single married divorced widowed My present occupation is: Yo soy soltero(a) casado(a) divorciado(a) viudo(a) Mi ocupacion actual es: Clerk a. I have been married 2 times, including my present marriage, if now married. Yo he estado casado veces, incluyendo mi matrimonio actual, (si está casado ahora) (If you are now married give the following:) (Si esta casado abora de los siguientes datos:) b. Number of times my spouse has been married c. Name of spouse d. Date and place of birth of spouse e. Date and place of marriage Número de veces que mi cónyuge ha estado casado Nombre del conyuge. Fecha y lugar de nacimiento del Fecha y lugar de matrimonio 2 Esteban de Varona conyuge dob-Unknown 1942 Habana Cuva Habana, Cuba f. My spouse resides with me apart from me at Address (Apt. No.) (Number and Street) (Town or City) (Province or State) (Country) Mi conyuge reside conmigo separadamente en la dirección (Num. del apto.) (Núm. y calle) (Pueblo o ciudad) (Provincia o Estado) (País) FORM 1-485 (11-2-66) U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}