{
	"anumber": "A12495368",
	"id": "A12495368_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Translation, No. 179"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Spain"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1904, 1966]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "TRANSLATION Doctor: Jos ADALBERTO Vivo ALA, Justice in charge of the northern District of Punar del Rio of Cevil Registry: 6 of the Births section of the Registly of Civil status of Muni- Do hereby Certify - That un the folio 257 of the volume this follows . cipal Court in my charge, here isla Registration reading as n-179 -MARIA ANA DE JESUS ESTEBAN AUGUSTA DE LAS NiEVES DIAZ y BARCENAS - H. - In the City of Pinar, del Y DEL JUNCO, Municipal Justice, assisted by me, the Secretary, GOMEZ Rio on 15th of February of 1904 before Lic Mr OSCAR GOBEL AMA a native of Juane Province of Punar del Rio of age, proprietor Rio DO BAYLINA Y QUE VE DO, appeared Mr CESAR DIAZY to that effect as a father of same he declared: That girl was to have registered, by the lair of 5th of the last month, a girl, form and resident of Marte street # 142 in the City of Pinar del seeking in his domicile at 8, o' clock in the morning of The 28th of December CECiLiA BARCENAS y Rios, a native of Havana, ofage, of 1,903; that she is a daughter of the declarant and Da DOLORES house- - wife, and a resident of same place as her husband. - The girl native is grandaughter on paternal line of ANDRES DIAZ y EARC/A a of Madrid, spain, and ANA SERAFINA GOMEZ Y , RUBIO , a BARCENASY BRINGAS, a native of Vezeaya, Spain, resident dead in native of Guave, both dead, and on material live of RAMON and MARIA ANA Rios Y DELGADO a native of Havana, this City, and that to the aforesaid girl was given the NIEVES names of MARIA ANA DE JESUS ESTEBANG AUGUSTA DE LAS Witnessed this act FRANCISCO VIÑAS VALDES and TEOFILO HUERTH subscribe same the Justice thereon the seal of the Court and signed both of Pinar del Rio Read this act for those who should it with the declarant and slamped the witnesses, before me, who do hereby certify thereto - OSCAR GOBEL - CESAR DiAZ GOMEZ FRANCO VINHS - - TEOFILO HUERTA. AMADO BAYLINA - -There is a seal of the these presents in Pinar del Rio on the none of June of 1961 Muncheal Justice - as requested by ANSELMO ARIAS I am issuing true and I undersigned Buenaventeura from spanish Quitt into Ramary English To hereby certify authentic that foregoing copy of the is Before me: Sgd AMADO BAYLINA y QUEVE Do Judicial the Secretary Sqd JOSE Vivo Menicipal Justice stamped the seal of the court. Birth Registration miami November 15th 1966 Quall - translator"
}
