{
	"anumber": "A12495368",
	"id": "A12495368_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information Form G-325A, FORM G - 325 A ( (11-1-66)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1986, 1963, 1933, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM G . 325 A (11-1-66) FORM APPROVED BUDGET BUREAU NO. 43-R436 BIOGRAPHIC NOV 2.2 1966 UNITED STATES DEPARTMENT OF JUSTICE INFORMATION Immigration and Naturalization Service (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) BIRTHDATE (MO. DAY-YR. NATIONALITY ALIEN REGISTRATION NO MALE DIAZ BARCEITAS MARIA ANADEJESS FEMALE 12-26-03- CUBANA -112-495-368 (IF ANY) PARDLE c ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. - PINARDELRIO- CUBA (IF ANY) 261-42-4455 SPOUSE (IF NONE so STATE) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE. GIVE MAIDEN NAME) 11-26-02 CUNILL BUENAVEATURA BEJUCAL-CURA- 6-12-34- HABAYA FORMER SPOUSES (IF NONE. so STATE) FAMILY NAME (FOR WIFE, PLACE OF TERMINATION OF MARRIAGE ALFONSO JUAN DE 3-5-1892 12-22-23 5-15-1933 DIOS HABANA HABAKA. CUBA FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER DIAZ CESAR - 3-14-1871-GUANE-CUBA PINAR DELRIC MOTHER (MAIDEN NAME) BARCENAS. DOLORES - 4-2-1872 HARANA- CUBA. RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY FROM: MONTH YEAR TO: MONTH YEAR 1132 N.W. MIAMi FLORIDA U.S. 9 1965 PRESENT TIME apt 3 736.N.W.23 AVE - MIHMI n 11 8 1.962 9 1,965 1986. N.W.22CT MIAMI A 1. 11 1.961 8 1,962 EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR FONTAINE MODES live SEWING 10 1963 PRESENT TIME 10/6 1065 EAST 16th st MIAMI MACHINE OPERATOR UNEMPLO YED LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR (IF NOT SHOWN ABOVE): LAST OCCUPATION ABROAD (IF NOT SHOWN ABOVE): CITY COUNTRY FROM TO CITY COUNTRY FROM TO HABANA - CUBA 1903 1961 HABANA @UBA 1922 1961 THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): PERMANENT RESIDENCE PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT OR PETITIONER) COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) (ALIEN REGISTRATION NUMBER) (OTHER AGENCY USE) (INS USE) MIA T.C. HAVANA FILES NOV 25 1966 DEC - 1 1966 NR SIGNED a NA Consul FORM G 325 A"
}
