{
  "anumber": "A12491240",
  "id": "A12491240_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0061/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information, FORM G-325A REV. 4-1-67"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Cuba"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1908,
        1958,
        1968,
        1940,
        1869,
        1879,
        1930,
        1936
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['attorney', ' self employed']"
      },
      "nationality": {
        "nationality_llm_v1": "Cuban"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "0000 FORM G-325 A REV. 4-1-67 A 124.91 240 NY FORM APPROVED BUDGET BUREAU No. 43-R436 BIOGRAPHIC UNITED STATES D'EPARTM OF JUSTICE type case Sec. INFORMATION Immigration and Naturalization Service Rass 12-2161 (FAMILY NAME) (FIRST NAME) (MIDDLE NAME MALE BIRTHDATE (MO-DAY-YR.) NATIONALITY ALIEN REGISTRATION NO. (IF ANY RANGEL Desiderio Angel FEMALE 09-26-'05 Cuban A-12 491 240 ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Guanajay, Pinar del Rio (IF ANY) Desiderio Angel RANGEL (Mendez) Cuba 265-74-4659 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER RANGEL, Desiderio dob 1869 born in Las Villas, Cuba and decsd 10 26 ('33) MOTHER (MAIDEN NAME) MENDEZ. Maria Rita dob 1879 born in Guanajay P-Rio Cuba déc 1940 SPOUSE (IF NONE, so STATE) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE, GIVE MAIDEN NAME) Married 6-26-1958 married in La Habana, Cuba GARCIA, Carmen Gertudis (Ramirez) dob 11-22-16 born in La Habana, Cuba FORMER SPOUSES (IF NONE, so STATE) FAMILY NAME (FOR WIFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE OCHAMBARENA, Esther dob 04-1-1908 both in Artemisa P Rio Cuba born on (married June $36--- June 1936 married in La Habana Cuba divorced 3-4-53 APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 2736 32 Street Astoria LI NY USA Feb '66 PRESENT TIME 600 West 136 Street NYC NY USA Oct 864 Feb 166 1506 16th Street Miamia Florida USA Sept 161 Oct 164 - LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) 19 No 8205 Marianao La Habana Habna Cuba Sept 158 Sent '61 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR PRESENT TIME Merrill Lynch, Pierce and Penner 70 Pine St NYC Clk June '65 LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) Attorney (self employed) Sttorney 06 1930 Sept '61 THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN NATURALIZATION ADJUSTMENT OF STATUS YOUR NATIVE ALPHABET IN THIS SPACE OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW 7 9 1968 bangel FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE times (SIGNATURE OF APPLICANT OR PETITIONER) tagen To ciss, COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) no po Bing (ALIEN REGISTRATION NUMBER) Rangel Desider OcAnge 19 just A-12 491 240 (INS USE) Ghoot (OTHER upon info of data be AGENCY tion USE) aered the as on office code 0300 type case Sec date date 02.2-68 instreet FBI Are (2) Rec. Br. FORM G-325A"
}