{
	"anumber": "A12495368",
	"id": "A12495368_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATO: Que al folio doscientos cincuenta y siete del tomo seis de la Sección de 'NACIMIENTOS' del Registro Civil de este Juzgado, consta el acta que copiada estan con la Ley, dice así:, 0723044135"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "0720304135 DOCTOR JOSE ADALBERTO VIVO Y SALA, JUEZ MUNICIPAL PROPIETARIO DEL DISTRITO NORTE DE PINAR DEL RIO Y ENCARGADO DEL REGISTRO CIVIL DEL MISMO CERTIFICO:-Qu al folio doscientos cincuenta y siete del to- mo seis de la Sección de \"NACIMIENTOS\" del Registro Civil de este - Juzgado, consta el acta que copiada de acuerdo con la Ley, dice así:- No. 179. MARIA ANA DE JESUS ESTEBAN AUGUSTA DE LAS NIEVES - DIAZ Y BARCENAS. - H. En la Ciudad de Pinar del Rio a quince de Febre- ro de mil novecientos cuatro ante el Ldo. Sr. Oscar Góbel y del Junco Juez Municipal de la expresada y de Amado Baylina y Quevedo Secreta- rio compareció el Sr. César Diaz y Gómez natural de Guanes provincia de Pinar del Rio, mayor de edad, propietario y vecino de esta Ciudad enria calle de Marti número ciento cuarenta y dos, a objeto de que se inscriba en virtud de lo dispuesto en Decreto Ley de cinco del mes proximo pasado una hembra y al efecto como padre de la misma declaro que dicha hembra nació en su domicilio a las ocho de la mañana del dia veinte y seis de Diciembre de mil novecientos tres. Que es hija del declarante y de la Sra. Dolores Cecilia Bárcenas y Rios natural de la Habana mayor de edad de ocupación su casa y domiciliada en el del declarante. Que es nieta por línea paterna del Sr. Andrés Diaz y Garcia natural de Madrid y de la Sra. Ana Serafina Gómez y Rubio GE- nex I Bubio natural de Guanes ambos difuntos y por línea materna del Sr. Ramon Bárcenas y Bringas natural de Vizcaya ya difunto y de la - Sra. Maria Ana Rios y Delgado natural de la Habana y vecina de esta Ciudad. Y que a la expresada hembra se le habia puesto el nombre de MARIA ANA DE JESUS ESTEBAN AUGUSTA DE LAS NIEVES. Fueron testigos pre senciales los Sres, ,Francisco Viñas Valdés y Teófilo Huerta mayores de edad y de esta vecindad. Leida esta acta y encontrándola conforme se le estampo el sello ACK y la firma el Sr. Juez el declarante y tes- tigos por ante mi de que certifico.- -Oscar Góbel.-Cesar Diaz y Gomez. Franco Viñas. -Teófilo Huerta.-Amado Baylina.-Hay un sello del Juzga- do. Y a solicitud de Anselmo Arias, expido la presente en la Ciu- dad de Pinar del Rio a nueve de Junio de mil novecientos sesenta y uno.-Testado-del-No vale.-Testado:- Gomez y Rubio.- No vale.- El Secretario."
}
