{
	"anumber": "A12491240",
	"id": "A12491240_0057",
	"page_index": 57,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0057/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENTS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "production A12 491 240 UNITED STATES DEPARTMENT OF JUSTICE any A12 892 885 IMMIGRATION AND NATURALIZATION SERVICE 20 West Broadway REFER TO THIS FILE NO. New York, New York 10007 MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENTS Your medical examination will be given at: USPHS Outpatient Clinic Location Admitting Office, USPHS Out- 245 West Houston Street patient Clinic, Hudson St. New York, New York 10014 Date Time JUN 9'69-1000 AM Desiderio Angel Rangel Carmen Gertrudis Rangel The Immigration examination will be held at: 2736 32nd Street Location Astoria LI New York 20 West Broadway - 11th Floor 2376 - and St Date Time astoria JUN 9'69-1100 INSTRUCTIONS FOR MEDICAL EXAMINATION In connection with your application, it will be necessary for you to take a medical examination. An ap- pointment has been made for you to be examined by a doctor of the U.S. Public Health Service at the time and place given above. If you do not speak English, you must bring a person of your own sex who can act as interpreter. BRING WITH YOU to the medical examination the following checked items. (Obtain these items at once.) 1. X-ray film (size 14 X 17*) of your chest, taken and interpreted at an accredited hospital or clinic. (Film and reading not to be more than 7 months old.) 2. Report of serologic test for syphilis. (Report not to be more than 30 days old.) 3. INSTRUCTIONS FOR IMMIGRATION EXAMINATION An appointment has also been made for an examination before an Immigration officer at the time and place given above. See below for items (if any are which you MUST BRING WITH YOU: LIMITED MAY REC 2. necessary) diss LEL LITTLE Form I-486 (Rev. 5-25-66)"
}
