{
  "anumber": "A12491240",
  "id": "A12491240_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Authority for collection of the information requested on Form N-445 is contained in Sections 101(f), 316, 332, 335 and 336 of the Immigration and Nationality Act (8 U.S.C. 1101(f), 1427, 1443, 1446 and 1447). Submission of the information is voluntary. The principal purposes for requesting the information are to enable designated examiners of the Immigration and Naturalization Service to determine a petitioner's eligibility for naturalization and to make appropriate recommendations to the naturalization courts. The information requested may, as a matter of routine use, be disclosed to naturalization courts and to other federal, state, local or foreign law enforcement and regulatory agencies, the Department of Defense, including any component thereof, the Selective Service Sys- tem, the Department of State, the Department of the Treasury, the Department of Transportation, Central Intelligence Agency, Interpol and individuals and organizations in the processing of any application or petition for naturalization, or during the course of investigation to elicit further in- formation required by the Immigration and Naturalization Service to carry out its functions. Informa- tion solicited which indicates a violation or potential violation of law, whether civil, criminal, or regulatory in nature, may be referred, as a routine use, to the appropriate agency, whether federal, state, local or foreign, charged with the responsibility of investigating, enforcing or prosecuting such violations. Failure to provide all or any of the requested information may result in an unfavor- able recommendation as to a petitioner's eligibility for naturalization and denial by the court of a petition for naturalization. U.S. GOVERNMENT PRINTING OFFICE 676-761"
}