{
	"anumber": "A12491240",
	"id": "A12491240_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0033/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A12 491 240"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "JG:jmb MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place N.Y.C Status as a lawful permanent resident of the United States is accorded: File No. A12 491 240 NAME Sex Desuderoi ADDRESS RANGEL - Mendez M 2376 32nd Street Astoria, Long Island New York NATIONALITY 83 DATE OF BIRTH PLACE OF BIRTH Cuba 9/26/05 Cuba COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE: (If any) PRIORITY DATE W Western Hemisphere 7/11/68 REMARKS NONPREFERENCE: Individual section 212(a)(14) certification issued; Blanket section 212(a)(14) certification issued; Section 212(a)(14) certification not required because . As of 1 11 66 at N.Y.C. (Month) (Day) (Year) (Place) Class of admission (insert coding symbol) CU6 the requirements of the following provision of law having been fulfilled. Sec 203(h) of the I & N Act Sec. 2 of the Act of 11/2/66 Sec 244 ( ) ( ) of the I & N Act Sec 13 of the Act of 9/11/57 Sec 245 of the I & N Act Private Law no. of the Sec 249 of the I & N Act Congress session Sec. 1 of the Act of 11/2/66 (Other law - Specify) (Applicable in all cases) Date NOV 17 1969 Recommended by Immigration Officer Date Approved District Director FOR USE BY VISA CONTROL OFFICE Date 25 NOV 1969 WESTERN Foreign State SA-1 Preference Category Number REDUCED BY ONE Month of Issuance DECEMBER GTV Signed as STATISTICS (Visa Office, Dept. of State) Date Form I-357 delivered 1-18/69 CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service Form I-181 (Rev. 11-2-66) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NAT URALIZATION SERVICE"
}
