{
  "anumber": "A12495368",
  "id": "A12495368_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "4 (11) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: (12) My last place of foreign residence was HABANA CUBA (City) (Country) (13) My father's full name is My mother's maiden name was DOLORES BARCENAS Rios CESAR DIAZ GOMEZ (14) (15) came to the United States from the port of RANCHO MIAMI AIR PORT PORT-HAPANOCUBA EE UH. (16) The person in the United States to whom I was coming was RAYMOND PRIETO (17) The place in the United States to which I was going was 1285-W. 5th COURT HIALEAH (18) The names of some of the passengers or other persons I traveled with, including members of my own family and their relationship to me, if any, were - Signature of person preparing form, if other than applicant. SIGNATURE OF APPLICANT I declare that this document was prepared by me at the request of ap- plicant and is based on all information of which I have any knowledge. Maria Ona Cunill SIGNATURE ADDRESS AT WHICH APPLICANT RECEIVES MAIL 2510 N.W. 23 d et. Miami ADDRESS: DATE: FLA - 33142 TO APPLICANT: DO NOT FILL IN BLANKS BELOW THIS LINE. NOTE CAREFULLY This application must be sworn to before an officer of the Immigration and Naturalization Service at the time you appear before such officer for examination on this application. AFFIDAVIT I do swear that I know the contents of this application comprising Subscribed and sworn to before me by applicant at the preliminary pages 1 to 4, inclusive, and the supplemental forms thereto. No(s) subscribed to by me; that investigation Account ) at Alarda the same are true to the best of my knowledge and belief; that this IV day of Decrease 69 corrections numbered ( ) to were made by me or at my I certify that before verification the above applicant stated in my pres- request; and that this application was signed by me with my full, true, ence that he had (heard) read the foregoing application, corrections and correct name, SO HELP ME GOD. therein and supplemental form (s) and understood the contents thereof. Maria Ana Currill (Complete and true signature of applicant) (Naturalization examiner) (For demonstration to I J. of applicant's to ability store write) for milk I love America residing at (1st witness) 65, Josephing 50 B. ST Tamayo (Street address, and State) Occupation Flabers (2d witness) Maria Serralta Maulent city or town, residing at 55 mu 27 ST Miami Occupation Fla U.S. 12/1/64 State 5/68 (Street address, city or town, and State) Physical presence 31 mos. T2B (Naturalization examiner) ARRIVAL RECORD FOUND ARRIVAL RECORDS EXAMINED Place Card index Name Index books Age Manifests Date Marital status Manner (Signature of person making search) Nonfiled (Dates, reasons, and examiner's initials)"
}