{
	"anumber": "A12495368",
	"id": "A12495368_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0015/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4 ( Rev. 5-1-67"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1928, 1968, 1934, 1969, 1963, 1933, 1967, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form approved. Budget Bureau No. 43-R079.9 UNITED STATES DEPARTMENT OF JUSTIC IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION MMIGHA UN& (Show the exact spelling of your name as it appears on your alien registra- tion receipt card, and the number of your card. If you did not register, so NATURAL ZATIAN Mail or take to: SERVICE Name state.) MARIA ANA CUNILL IMMIGRATION AND NATURALIZATION SERVICE No. 712-495-3681 AUG 7 200 APPLICATION TO FILE PETITION FOR NATURALIZATION (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT. I desire to file a petition for naturalization in the- FICE Date: AUGUST- 6-1969. Miami (City) FLA Court at (Name of Court) (State) My name is: MARIA ANA @UNILL (Print or type here your present full name only) I live at: 2510 N. W. . 239 COURT (Print or type present apartment number, street address, and if appropriate 'in care of MIAMI DADE FLA. 33142 (City) (County) (State) (ZIP Code) Other names I have used are: MARIA ANA DIAZ BARCENAS (mees C (Print or type here any other name you have ever used, including maiden name) My present occupation is MACHINE OPERATOR Sex: Male Female (1a) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No (ib) Can you read and write English? Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? Yes No (2) In what places in the United States have you lived during the last 5 years? List present address FIRST FROM- To- (a) MAY 1968 PRESENT TIME 2510 N.W. STREET ADDRESS 23rd of Migau CITY AND - STATE Pa (b) SEPT- 196.7 MARCH 1968 275- 5 NEW HAMPSHIRE (c) SEPT 1965 August, 1967 1132 N.W 3 street Catef. (d) SEPT 1963 August 1965 736- N.W.23Ave miami Ha (e) 19 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- apn't TOR 1969 390-N.W275/ ADDRESS OCCUPATION OR TYPE (a) October 1968 January -69 Miss EMPLOYER'S Doryssa NAME Desem 68 PRESEN TIME 860 328 N.W. operator BUSINESS (b) September 1967 march 1968 me Co 29st Stor (c , Debruary 1967 august 1968 Defry me - 716- Luncolu Road miami (d October 1963 , July , 1966 Fouttaine Modes me 1090.E.15st Hioleah (4) Have you been out of the United States since you first arrived? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES 12-27-67 1-1-1968 - AIR-PLANE. to for ANGELES AIR PORT SAN SALVADOR. California (5) How many times have you been married? 2 How many times has your husband or wife been married? / If either of you has been married more than once, fill in the following information for each previous marriage. Check one) DATE MARRIED DATE MARRIAGE ENDED SEX How MARRIAGE NAME OF PERSON TO WHOM MARRIED PERSON MARRIED WAS CITIZEN (a) 12-23-1928- Juan de Our allows ALIEN ENDED Cufra 7-24-1933 M. Divorced (b) 6-12-1934- Present husband- Buenaventura Cumill M. Present husband (c) (d) Form N-400 (Rev. 5-1-67) (1) (OVER)"
}
