{
	"anumber": "A12491240",
	"id": "A12491240_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATEMENT OF FACTSS FOR PREPARATION OF PETITION, ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "3 msp ALIEN REGISTRATION STATEMENT OF FACTS FOR PREPARATION OF PETITION Name Rangel Mendoz, Dosiderio No. A-12-491-240 SECTION OF LAW 3160 (1) My full, true, and correct name is Desiderio Rangel (Full, true name, without abbreviations) (2) My present place of residence is 10861 s W- 7 St #1 Sweet Water Fla 331744 (Number and street) (City or town) (County) (State) (ZIP Code) (3) I was born on 2-26-05 in Guanajay pinar Del Rid Cuba (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) 15 16 Carmen (4) I am Marraj ed and have I living children. The first name of my husband or wife is (was) ; (Single; married, divorced; widowed) 6 - 26 - 58 at Havana E uba we were married on ; he or she was born (Month) (Day) (Year) (City or town) (State or country) Havana avana Cuba 11-27-16 at on ; (City or town) (County, district, province or State) (Country) (Month) (Day) (Year) entered the United States at New York City 1-11-66 on for permanent residence in (City or town) (State) (Month) (Day) (Year) with me NOT the United States and now resides apart from me at ; and was naturalized (Show full address if not living with you) 17 - on at Certificate No. (Month) (Day) (Year) (City or town (State) - A=12-892-885 or became a citizen by ; his or her Alien Registration No. /is (5) I was lawfully admitted to the United States for permanent residence on 1 - 11 - 66 under the name (Month) (Day) (Year) get June Sec 1966 of Rangel Mendez, Desiderio at New York City on the Ad (City) (State) (Name of vessel or other means of conveyance) (6) I have resided continuously in the United States of America since 1 - 1 - 66 and continuously in g the State of Florida where I now live since 5-11-76 19 and during the past 5 years I have been physically present in the United States for an aggregate period of 58 months. (7) I (have, have not) previously filed petition for naturalization No. on (Month) (Day) (Year) at in the (City) (State) (8) I wish the naturalization court to change my name to Desideri Range] nane@Dv (Give full name desired or state \"None\") (9) Since such lawful admission, I have not been absent from the United States (for a period or periods of 6 months or longer) except as follows (if none, state \"None\") : DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE nale (10) I have children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), otherwise (No.) give city and State of child's residence.) A (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date (Country) Born of Entry (f) Port of Entry (g) Alien Registration No. (h) Now Living 3212 well AMERICAN theer Dilive Teresita F Cuba 10-3-38 1961 Miami Fla Citizen Miami Fla NC-45C S4 25) noother"
}
