{
  "anumber": "A12495368",
  "id": "A12495368_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0053/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AUTHORIZATION FOR PAROLE OF AN ALIEN INTO THE UNITED STATES PURSUANT TO SECTION 212(d)(5) OF THE IMMIGRATION AND NATIONALITY ACT, Form I-312 ( (Rev. 9-61)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "Cuba",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1903,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF MIGRATION AND NATURALIZATION SERVICE File Number: MIAMI, FLORIDA A12 495 368 Date: 6-22-1965 AUTHORIZATION FOR PAROLE OF AN ALIEN INTO THE UNITED STATES PURSUANT TO SECTION 212(d) (5) OF THE IMMIGRATION AND NATIONALITY ACT MARIA ANA DIAZ BARCENAS 12-26-1903 Name of Alten: Date of Birth: (Middle) (Last) Pisco of Birth: PINAR DEL R10 PINAR DEL R10 CUBA (City or Town) (State or Prevince) (Country) 11. S. Address: 736 No W. 23RD AVENUE, MIAMI, FLORIDA Presentation of the alinched duplicate of this document will authorize a transportation linn to accept the named bearer on board for travel to the United States without liability under Section 273 of the Immigration and Nationality Act for bringing an ellen who does not have a visa. Presentation of the original of this document prior to 6-22-1966 will authorize an Immigration officer at B port of entry in the United States to perole under the provisions of Section 212(d)(5) of the Immigration and Nationality Act the named beater whose photograph appenrs hereon. Remarks: MEXICO THIS DOCUMENT VALID ONLY FOR RETURN FROM:- (Stenation of (Officer) (Authorising Office) ROBERT L. WOYTYCH DISTRICT DIRECTOR ARRIVAL STAMP Form 1-512 (Rev. 8-1-61)"
}