{
  "anumber": "A12491240",
  "id": "A12491240_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Alien Registration Receipt Card ( I-90, I-90"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1974,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "13. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States. (If you have engaged therein, briefly describe and show periods of such employment or business activity.) 14. Since the time I became a permanent resident of the United States, I have filed a federal income tax return as a nonresident. Yes No. \"Yes\", state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of the Internal Revenue Service office where filed.) 15. Since the time I became a permanent resident of the United States, I have failed to file a federal income tax return with respect to income I earned outside the U.S. because I regarded myself as a nonresident alien and therefore exempt from tax on such earnings. Yes No. (If \"Yes\", state the years for which you failed to file tax returns for that reason.) 16. I do do not intend to return to the United States after my temporary visit abroad. 17. I do do not intend to retain my status as a lawful permanent resident. 18. CHECK My Alien Registration Receipt Card is attached. Application Form 1-90 for issuance of Alien Registration Receipt Card is attached. ONE: My Permit to Reenter, which I wish to have extended, is attached. 19. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if I submitted or applied for that card, should be forwarded to: My address as shown in block #1, on reverse. U.S. Embassy or Consulate at U.S. Immigration and Naturalization Office at Other (Specify) 20. If application is for issuance of a Permit to Reenter execute Block A of Item 20 only. If application is for extension of a Permit to Reenter execute Block B of Item 20 only. If application was completed by other than the applicant, that person must execute Item 21. BLOCK A BLOCK B I do swear (affirm) that I know the contents of this application signed I certify that I know the contents of this application signed by me and that the statements herein are true and correct. by me and that the statements herein are true and correct. Deudesic Kanzal (Signature of applicant) Subscribed and sworn to (affirmed) before me this 16th day (Signature of applicant) of MAY A.D. 1974 Date: (Month) (Day) (Year) at Nov YORK N.Y. JOSEPH M. ROMERO (EEAL) My commission expires Notary Public State of New York No. 31-8631200 Qualified in New York County signature of officer administering oath Commission Expires (March 30, 1976 21. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. (Signature) (Address) (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Alien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter 1-151 submitted by alien returned DENIED (See denial notice for reason(s) 1. AR-103 or AR-3 submitted by alien returned GRANTED Permit valid to 5/15/75 New 1-151 issued on basis of I-90 Single entry Multiple entries Restriction on travel in following countries waived: DATE 5/23/74 DELIVERY OF PERMIT INITIALS OF EMPLOYEE OF ACTION, BY MAIL EFFECTING DELIVERY tol would TO APPLICANT PERSONALLY nic OFFICE DATE OFFICE me #0487411 6/4/-4"
}