{
	"anumber": "A12495368",
	"id": "A12495368_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0011/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1903, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT JUSTICE Form approved. IMMIGRATION AND NATURALIZAT ERVICE Budget Bureau No. 43-R083.10. DUPLICATE UNITED STATES OF AMERICA (To accompany 46641 monthly report on PETITION FOR NATURALIZATION No. Form N-4) To the Honorable The District Court of The United States at Miami, Florida This petition for naturalization, hereby made and filed under section 316(a) Immigration and Nationality Act, respectfully shows: (1) My full, true, and correct name is Maria Ana Cunill (2) My present place of residence is 2510 N.W. 23rd Court (Full. true name, without abbreviation) Miami (Apt. No.) Florida (Number and street) Dade 33142 (3) I was born on December 26, 1903 in (County) (State) (ZIP Code) Pinar del Rio (Month) (Day) (Year) (City or town) Pinar del Rio Cuba (County. district. province. or State) (Country) (4) I am married, and have four living children. (5) I was lawfully admitted to the United States for permanent residence on May 22, 1964 19 and have not abandoned such residence. (6) My present nationality is Cuba ALIEN REGISTRATION NO. A12 495 368 (7) I have not heretofore made a petition for naturalization. (8) I pray that my name be changed to None (continued over) AFFIDAVIT OF WITNESSES The following witnesses, each being severally, duly, and respectively sworn, depose and say: (1) My name is Josephine B. Tamayo I reside at 651 E. 50th St., Hialeah, Fla. and (Number and street) (City or town) (State) (2) My name is Maria Serralta I reside at 55 N. W. 27th St., Miami, Fla. (Number and street) (City or town) (State) I am a citizen of the United States of America; I have personally known and have been acquainted in the United States with the petitioner named in the petition for naturalization of which this affidavit is a part, since at least 1V-1-64 ; to my personal knowledge (Month) (Day) (Year) the petitioner has resided, immediately preceding the date of filing this petition, in the United States continuously since the date last mentioned: that the petitioner has been physically present in the United States for at least 31 months of that period; and that the petitioner has been a resident in the State in which the petition is filed during at least the last 6 months. I have personal knowledge that the petitioner is, and during all such periods has been a person of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happiness of the United States, and in my opinion the petitioner is in every way qualified to be admitted a citizen of the United States. I do swear (affirm) that the statements of fact I have made in the affidavit to this petition for naturalization subscribed by me are true to the best of my knowledge and belief: SO HELP ME GOD. Josephine P (Signature of Tamayo Witness) maria Serralta (Signature of Witness) WHEN OATH ADMINISTERED BY CLERK OR DEPUTY WHEN OATH ADMINISTERED BY DESIGNATED EXAMINER CLERK OF COURT Subscribed and sworn to (affirmed) before me by above-named peti- Subscribed and sworn to (affirmed) before me by above-named peti- tioner and witnesses in the respective forms of oath shown in said petition tioner and witnesses in the respective forms of oath shown in said petition and affidavit, and filed by said petitioner, in the office of the clerk of said and affidavit at Miami, Florida this 12th court at day of mondel December A.D. 19 69 this day of Designated Examiner. A.D. 19 I HEREBY CERTIFY That the foregoing petition for naturalization was by petitioner named herein filed in the office of the clerk of said court Clerk. By at Miami, Florida this 12th day of Deputy Clerk. December A.D. 19 69 [SEAL] By Clerk. Deputy Clerk. Form N-405 (Rev. 4-10-67) STATISTICS"
}
