{
	"anumber": "A12495368",
	"id": "A12495368_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0039/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, Form G-3225A ( (REV. 5-1-68)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1923, 1903, 1968, 1934, 1969, 1963, 1967, 1965]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' operator-1', 'miss dorisca']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "Cuba"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 (REV. 5-1-68) Form Approved Budget Bureau No. 43-R436 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE INFORMATION Immigration and Naturalization Service 482-P- (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALIT ALIEN REGISTRATION NO. (If any) CUNILL MARIA ANA FEMALE 12-26-1903- CURA A-12-495-368 ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. MARIA ANA DIAZ BARCENAS PINAR DEL Rio - CUBA (If any) 261-42-4455 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER DIAZ - CESAR - GUANE - CUBA - DEAD MOTHER (Maiden name) BARCENAS - DOLORES.- HABAMA- CUBA - DEAD SPOUSE (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (For wife, give maiden name) CUNILL BUENAVENTURA- 11.26.1902 BESUCAL HABANA 6-12-1934- CUBA FORMER SPOUSES (If none, so state) CUBA FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE ALFONSO- JUAN OF DIOS 3-8-1893 12-23-1923 7-24-1933 HABAMA HABANA CUBA APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY/11 MONTH YEAR MONTH YEAR 2510 - N.W. 23rd CT MIAMI FLORIDA 5 1968 PRESENT TIME 275- S. NEW HAMPSHIRE LUS ANGELES CALIF EE.214 q 1967 3-1968 1132 N.W 3. STREET MIAMI FLORIDA EE - 411 9 1965- 8-1967 736 N.W. 23 AVE MIAMI FLORIDA EE.UU. 9 1963 -9-1965 LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR - - MISS DORISSA - 390-N W. 27 st . machine NONE AT THIS TIME PRESENT TIME OPERATOR 1969 4 1969 CHARM MC KAY of of CALIFil MIAMI, - 328. ORFALEA.CO) N.W. 29st. 860.5 10 1968 12 1968 9 1967 3 1968 FONTAINE DELOY INC. 716 Percoln Road many 2 1967 8 1968 IF NOT SHOWN ABOVE (INCLUD INF ORMA RON ESTED ABOVE) 10 1963 7. 1966. THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): Maria Ann Cumill PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR FOR KNOWINGLY AND WILLFULLY FALSIFYING NATIVE ALPHABET IN THIS SPACE: OR CONCEALING A MATERIAL FACT. 482-P- COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) CUNILL MARIA ANA A-12 495 368 (OTHER AGENCY USE) (INS USE) MIA-CITZ OCT 1 41969 FORM G-325A (3) C."
}
