{
  "anumber": "A12491240",
  "id": "A12491240_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Peru",
        "Canada",
        "Cuba",
        "Mexico",
        "Spain",
        "Argentina",
        "United States",
        "France"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1924,
        1900,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved Budget Bureau No. 43-R0052. A RE-ENTRY PERMIT DOES NOT PROTECT NATURALIZA- RECEIVED INFORMATION UNIT FEE STAMP TION RESIDENCE. SEE INSTRUCTIONS ATTACHED FOR INFORMATION CONCERNING EFFECT OF ABSENCE ON ELIGIBILITY FOR NATURALIZATION. READ THIS FORM MAR 4 1971 AND ATTACHED INSTRUCTIONS CAREFULLY BEFORE MJS FILLING IN THIS APPLICATION. Immigration and Naturalization Service New York, N. Y, APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act. (Fill in with typewriter or print in block letters in ink) IMPORTANT: You must submit your Alien Registration Receipt Card with this application. 1. CHECK (a) I am an alien lawfully admitted to the United States for permanent residence. ONE (b) I am a treaty merchant, lawfully admitted to the United States between July 1, 1924, and July 5, 1932, both dates inclusive, pursuant to section 3(6) of the Immigration Act of 1924, to carry on trade pursuant to a treaty of commerce and navigation. 2. NAME (First Name) (Middle Name) (Family Name) ALIEN REGISTRATION NUMBER DESIDERIO ANGEL RANGEL 412491240 ADDRESS (Number) (Street) (City/Town) (State) (Zip Code) 2376 32St ASTORIA NEW YORK 11105 DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY COLOR OF EYES COLOR OF HAIR 19-26-1900 CUBA CUBA GREEN WHITE HEIGHT VISIBLE MARKS AND SCARS 5 FEET 6 INCHES NONE 3. FILL IN THE ITEMS IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RE-ENTER. ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING MY LAST PERMIT LAST PERMIT IS ATTACHED (City and State) IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR AS A TREATY MERCHANT NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL DESIDERIO ANGEL RANGEL-MENDEZMIAMI FLORIDA 9-8-61 FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME DESIDERIO RANGEL MARIA MENDEZ MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL AIRPLANE-PANAMERICAN WORLD AIRWAYS 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN UNITED STATES. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) M NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL DESIDERIO A RANGEL MIAMI FLA 9-8-61 MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL AIRPLANE PANAMERICAN WORLD AIRWAYS 6. PORT OF Proposed DEPARTURE FROM UNITED STATES DATE OF Proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD MIAMI FLORIDA 6-25-71 6 WEEKS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL LANCHILE MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) COUNTRIES TO BE VISITED (List each country) PERU, ARGENTINA, SPAIN AND FRANCE REASONS FOR GOING ABROAD (Be concise and complete): Received Tr. In Ret'd. Tr. Out Com girted PLEASURE- VACATION 7. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 8. PRESENT OCCUPATION SOCIAL SECURITY ACCOUNT NUMBER CLERK 265-74-4659 NAME OF EMPLOYER ADDRESS OF EMPLOYER MERRILL LYNCH PERCE FERNE f SMITH 570 WASHINGTON ST. N.Y. FORM I-131 (REV. 10-15-69) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}