{
	"anumber": "A12495368",
	"id": "A12495368_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization and Certificate of Citizenship,, G-325A."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1935, 1941, 1924, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "4 9. a. Yo I have children, as follows: (complete all columns for each child.) If tengo 4 hijos, como a continuacion se explica (complete todas las colum- 9. a. child lives with you, state \"with me\" in last column; otherwise give city and nas). Si su hijo vive con usted, declare \"conmigo\" en la última columna, de state or country of child's residence. otro modo, de la ciudad y el estado a condado de la residencia del hijo. Name (Nombre) Place of Birth Sexo Date of Birth Sex CARLOS ALFONSO DiAZ Lugar de nacimiento Fecha de nacimiento Now Living at (Ahora estáresidiendo en) M HABANA 11-7-1924 7012 CONIFER. DR. TAMPA CESAR ALFONSO DIAZ M HABANA 10-5-1926 BUENAVENTURA CUNILL DIAZ M. HABANA 4-11-1935 3418-E-HANNA-TAMPO 3515 RIVER GROVE- THMPA JORGE CUNILL DIAZ M HABANA 2-23-1941 2735.5 9AVE-MIAMI. b. The following members of my family are also applying for permanent resident b. Los siguientes miembros de mi familia tambien están solicitando la categoría de status. residentes permanentes: 10. I list below all organizations, societies, clubs, and associations, past or present, 10. A continuacion hago una lista de todas las organizaciones, sociedades, clubs y in which I have held membership in the United States or a foreign country, and the asociaciones, pasadas o presentes, de las que he sido socio en los Estados Uni- periods and places of such membership. (If you have never been a member of any dos o en algun país extranjero, y los períodos y lugares en que era socio. (Si usted nunca ba sido socio de ninguna organizacion, declare \"Ninguna\".) organization, state \"None.\" \"Colegio de Maestros\" Asociacion Fraternal Caballero de ,Collegio La Puz The de Pedagogan Habain - Cuba 11. have have not been charged with a violation of law (other than minor traffic 11. Se han no se han presentado cargos judiciales contra mi (aparte de infracci- violations). (If you have ever been charged with violation of law, give date and ones menores del transito) (Si alguna vez usted ba sido acusado de infringir la ley, place and nature of each charge and the final results especifique la fecha y el lugar y la naturalezade cada acusaciony el resultado final) 12. I have have not requested exemption or discharge from training or service in 12. Yo he no he pedido ser eximido ni licenciado del entrenamiento o servicio en the Armed Forces of the United States. (If you have requested exemption or dis- las Fuerzas Armadas de los Estados Unidos (Si alguna vez usted be pedido ser charge from training or service in the Armed Forces of the United States, give date eximido o licenciado del entrenamiento o servicio en las Fuerzas Armadas de los and place of your request, the reason for such request, and specify to whom it Estados Unidos, indique la fecha y lugar de su peticion, la razon para la misma y was made.) especifique a quien lue dirigida). 13. Deportation proceedings have have not been instituted against me in the 13. Un procedimiento de deportacion ha sido no ha sido instruído contra mi en United States. (If deportation proceedings have ever been instituted against you, give the date and place of bearing, the charge, and final result,) los Estados Unidos (Si un procedimiento de deportacion ha sido instruído contra Ud. alguna vez, de el lugary la fecha del juicio, la acusación y el resultado final) 14. I have have not been a participant in designated exchange program. (If 14. Yo he no he participado en un programa de intercambio designado (Si Ud. you have been a participant, show dates of arrival and departure from U.S.) ha participado, muestre las fechas de llegada y salida de los Estados Unidos de America.) 15. I have have not heretofore filed an application for the status of a permanent 15. Yo he no he llenado hasta ahora una solicitud por el estado de residente per- resident. (If you have ever filed such application, give the date and place of filing and final disposition.) 21-Cetcher 1947 manente (Si alguna vez ha ejecutado tal solicitud, indique la fecha y el lugar en que la presento y la disposición final) FILE-NO 196-329-886 16. Completed Form G-325A (Biographic Information) is attached as part of this application. 16. La planilla G-325A terminada, (Informacion biografica) está unida aquí como parte de esta solicitud. 17. IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: SI SU ALFABETO NATIVO NO ES DE LETRAS ROMANAS ESCRIBA SU NOMBRE EN SU ALFABETO NATIVO DEBAJO: Signature (Firma del of solicitante) Applicant Maria Ann Diaz de Cunill Date of Signature (Fecha de la firma) 11-14-1966 18. (Signature of person preparing form, if other than applicant.) I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. (Firma de la persona que ha preparado la planilla, si fuera otra que el solicitante) Yo declaro que este documento ha sido preparado por mí, a peticion del solicitante y que esta basado en toda la información de que tengo conocimiento. Signature Address (Firma) (Direccion) Date Occupation (Fecha) (Ocupacion) (Application not to be signed below until applicant appears before an officer of the Immigration and Naturalization Service for examination.) (La solicitud no debe ser firmada al pie, basta que el solicitante aparezca delante de un funcionario del Servicio de Inmigración y Naturalizacion para ser examinado.) I, do swear (affirm) that I know the contents of Yo this application subscribed by me including the attached documents, that the same are juro (afirmo) que conozco el contenido de esta true to the best of my knowledge, and that corrections numbered ( ) to solicitud, que el mismo es verdadero, segun mi mejor conocimiento, y que las correc- were made by me or at my request, and that this application was signed by me with my full, ciones numeradas IIIII a IIIII fueron hechas por mí, o a peticion mía, y que esta true name: solicitud fue firmada por mí con mi nombre completo y verdadero: Maria Ana Cunill Subscribed and sworn to before me by the above-named applicant at MIAMI 21667 (Complete and true signature of applicant) on (Firma completa y verdadera del solicitante) (Month)(Day) (Year) Bridish (Signature and title of officer)"
}
