{
	"anumber": "A12482893",
	"id": "A12482893_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12482893_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORM FS-398, FOREIGN SERVICE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada"]
		},
		"years": {
			"ms_years_nlp_v1": [1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM FS-398 PLACE 3-17-58 FOREIGN SERVICE MONTREAL, CANADA UNITED STATES OF AMERICA DATE OF EXAMINATION MEDICAL EXAMINATION OF VISA APPLICANTS Jan 4th 1961 CITY COUNTRY At the request of the American Consul at MONTREAL CANADA NAME AGE I certifiy that on the above date I examined SEX WYKRYKACH, Mrs. 59yrs F I examined specifically for evidence of any of the following conditions: CLASS A: TUBERCULOSIS (in any form) LEPROSY (Hansen's Disease) DANGEROUS CONTAGIOUS DISEASES : Actinomycosis Granuloma Inguinale Ringworm of scalp Amebiasis Keratoconjunctivitis infections Schistosomiasis Blastomycosis Leishmaniasis Syphilis, infectious stage Chancroid Lymphogranuloma Venereum Trachoma Favus Mycetoma Trypanosomiasis Filariasis Paragonimiasis Yaws Gonorrhea MENTAL CONDITIONS: Feeble-mindedness Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Epilepsy (Idiopathic) (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (Check number (1) below or complete number (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability (2) Defect, discase, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A, B, or C-diagnosis, and pertinent details*) : Chest X-ray report DR. NORMAN BROWN, MONTREAL, P.Q. 12/13/61 No evidence of active disease from Dr. Brown Blood serological report Negative from Dr. Urinalysis report Not required from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL NOTIFICATION USPHS MD *Continue on reverse side if necessary. GPO 894006"
}
