{
  "anumber": "A12495368",
  "id": "A12495368_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION, 31422"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1903,
        1968,
        1934,
        1935,
        1941,
        1902,
        1967,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "3 Name MARIA ANA CUNILL ALIEN REGISTRATION STATEMENT OF FACTS FOR PREPARATION OF PETITION SECTION OF LAW 316 No. 712-495-368 (1) My full, true, and correct name is MARIA ANA CUNILL 33142 (Full true name, without abbreviations) (2) My present place of residence is 2510-N.W. 237 et Miami Dade - Florida (Number and street) (City or town) (County) (State) (3) was born on 12 - 26 - 1903 in Pevar del Rio Peuer del Rio - Ouba (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) (4) am I married and have 4 living children. The first name of my husband or wife is (was) Q Buenaveutura (Single; married; divorced: widowed) 6-12-1934 Habaua Quba we were married on at (Month) (Day) (Year) (City or town) (State or country) BEJUCAL - he or she was born at Habava Cuba (City or town) (County, district, province, or State) (Country) 26- on 1902 ; entered the United States at MIAMI AIR PORT FLORION (Year) (City or town) (Month) FLORIDA (State) (Day) on 17-20-1966 permanent residence in the United States for and with me 2510 (Month) N. W. (Day) 23rd (Year) at miami if Ha now resides apart from me at (Show full address if not living with you) and was naturalized on (Month) not (Day) (Year) P (City or town) (State) Certificate No. or became a citizen by 5-22-64 6 (5) I was lawfully admitted to the United States for permanent residence on 10-10 1961 ; under the name of MARIA ANA DIAZ BARCENRSMIAMI (Month) HIR (Day) PORT-FIA (Year) PAN AMERICAN PLANE 89-7321 (City) (State) 7 on the the (Name of vessel other 10-10 of conveyance) 1961 5/22/64 the or means State (6) I of have Florida resided continuously and in Calif United where States I of now America live since since 10-10 1961 stmlc and continuously during in and the past 5 years I have been physically present in the United States for an aggregate period of months. (7) I (have, have not) previously filed petition for naturalization No. on w (Month) (Day) (Year) at in the Court. (City) (State) (8) I wish the naturalization court to change my name to More II (Give full name desired or state \"None\") (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows (if none, state \"None\"): DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT Lis angeles (Month, day, year) OE CONVEYANCE 12-27-1967 - Plane - Laurates (Month, day, year) OF CONVEYANCE 1-1-1968 Plane an-Pot One IV with (10) My children now living are:(Completeall columns as to each child. If child lives you, state with me' in last column; otherwise, give city and state of child's residence.) POWES Carlos NAME aldouss SEX PLACE BORN DATE BORN Now LIVING AT- M. Habana Cuba 11-7-1924 TAMPA - Ha (Desar afforizo m Habaua Caba 10-5-1926 TAMPA - Fla Buenaveutufia Cynill M Habaun Ouba 4-11-1935- TAMPA - FLA Jorge Cumill m Habewa Cuba 2-23-1941 Miami Ma"
}