{
  "anumber": "A12596514",
  "id": "A12596514_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application,, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1916,
        1918,
        1941,
        1950,
        1889
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(19) Fill in this block only if citizenship is claimed through a stepfather. (a) The full name of my stepfather is (b) He was born at on (City) (State or country) (Month) (Day) (Year) and now resides at and is now a citizen of (City) (State or country) ; he acquired United States citizenship through birth; naturalization; on in the Court (Month) (Day) (Year) (Name of court) of at (City or town) (State) Certificate of Naturalization No. (c) He and my mother were married on at (Month) (Day) (Year) (City) (State or country) (d) My mother is of the race. (e) Before marrying my mother, he was married time(s), as follows: Date married Date marriage ended Name of wife How marriage ended (Death or divorce) (20) Fill in this block only if you are or were a married woman. I have been married / time(s), as follows: Date married Date marriage ended Name of husband Citizenship of husband How marriage ended (Death or divorce) APR. 1916 boct27,1950 MORRIS FLEETMAN UNITED STATES DIVORCE (21) Fill in this block only if you claim citizenship through a husband. (a) The name of my citizen husband is/ was MORRIS FLEETMAN (b) He was born at KIEV Rwssia (Give full and complete name) on (City) (State or country) May 15 1889 (Month) (Day) (Year) and now resides at LOS (City) Angeles cally (State or country) (c) He became a U. S. citizen through birth; naturalization; on May 10 1918 in the County (Name Coust of court) Common Pleecourt of Blair County (Month) at (City town) (State) Perna (Year) (Day) Certificate of Naturalization No. 812272 I am of the white Hollitey burg, or race. (d) Before my marriage to him he was married 0 time(s), as follows: Date married Date marriage ended Name of wife How marriage ended (Death or divorce) (22) Fill in this block if any member of your immediate family has submitted or is submitting a similar application to this office. Name of relative Relationship When application submitted Certificate No. or File No. if known (23) I hav, not heretofore filed an application for a certificate of citizenship (Have) (Have not) on april 13 1941, at Ins angeles, Calif (SIGN HERE) Rose Fleetman (Signature of applicant or parent or guardian) (3)"
}