{
  "anumber": "A12515466",
  "id": "A12515466_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12515466_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAST ENTRY OF AN ALIEN, Form 1-550"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1915,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service Budget Bureau No. 43- 368. 1 APPLICATION FOR VERIFICATION OF LAST ENTRY OF AN ALIEN (See instructions on Reverse) (Fill in with typewriter or print in block letters in ink) Take or mail to- Fee Stamp IMMIGRATION AND NATURALIZATION SERVICE. Alien Registration No. E.N.A A-12-515-466, MoNTerez Naevo Leon mex, I request that the American Consul at Hidalgo, ifas be furnished a verification of my last lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 19 on reverse of form. 1. My name is: (First) (Middle) (Laat) Herlin do Ordaz Maldonado 2. Present address: P.O. Box B. Cucasonsa, California- 3. Date of birth: 4. Place of birth: April 23-1915 Cuascama Carboneya, San Luis, PoTosi, Mex. 5. 1 /am a citizen or national of: (Country) Mexico 6. Father's name: 7. Mother's maiden name: Cesario Maldonado Lucilla Ordaz. INFORMATION IN THESE BLOCKS PERTAIN TO MY LAST ARRIVAL INTO THE UNITED STATES 8. I was admitted under the name of: 9. Port of arrival: Her lindo \"Maldonado Hida180, Texas- 10. Date of arrival: (Month) (Day) (Year) 11. Name of vessel or other means of conveyance: may 3,1962 Walked across - 12. was 13. My occupation was: At that time I married. was not \"Laborer 14. Last permanent residence before my last arrival was: Minas de AzuFre de Guaxcama. Apdo No.12 CerriTos, S.L.P. 15. Name and address of person in the United States to whom I was destined at the time 6f my last entry was: SANGiabriel Valley Labor AssociatioN; 870 6 Arrow Hyway, Calif Creamonda, 16. At time of last entry I was accompanied by: no ONe 17. At the time of my last entry I traveled on an Immigrant visa a permit to reenter a passport an alien registration receipt card and I have not been absent from the United States since. 18. I was was not in the United States before my last admission for permanent residence: (If so give dates of entry and departure) a, b. C. From From From Dee.23-1964 To February 23-1965 To To Form 1-550 (Rev. 3-25-65) OVER"
}