{
  "anumber": "A12515466",
  "id": "A12515466_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12515466_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Estados Unidos Mexicanos, FORMA NO. 421"
    },
    "years": {
      "ms_years_nlp_v1": [
        1956
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "T.G. TRISTAN S.L.P. FORMA NO. 4321 ASORERIA EN NOMBRE DE LA REPUBLICA DE MEXICO, y como Oficial del Estado Civil de este lugar, hago saber a los que la presente vieren y CERTIFICO: ser cierto que en el Libro Núm 2 dos del Registro Civil que es a mi cargo, en la foja 22 frente se encuentra asentada una acta del tenor siguiente: in En el margen. Acta 0.17. Fuera del margen Matrimonio del señor Herlindo Maldonado Ordaz con la señorita Bacilia Zapata Salazar En Villa Juarez, Estado de San Luis Potosi, siendo las 17 horas del dia 9 de Febrero de 1956 mil novecientos cincuenta y seis, ante mi, Tomas Almazan R.Oficial del Registro Civil de este lugar DEPART comparecio el señor Herlando Maldonado Ordaz soltero de 41 afias de edad, agricultor, originario y vecino de Guaxcama de este muni- cipio, de religion catolica y nacionalidad mexicana, hijo legitimo del señor esareo Maldonado y de la señora Lucina Ordas ya finados y Bacilia Zapata Salazar, soltera de 39 años de edad, ocupada en su hogar, originaria de Rioverde, S.L.P. de religion catolica y nacionalidad mexicana, hija legitima del señor Higinio Zapata ya finado y de la señora Priciliana Zalazar que vive con domicilio en Reynosa Tampas. Reunidos los contrayentes y testigos señores Francisco Ruiz y Leonardo Castillo por parte del pretenso y Nicolas Reyes y Franco Almazan por parte de la pretensa, a quienes interro- gue sobre si los contrayentes, fueran las mismas personas que sus- cribieron la solicitud de matrimonio presentada con fecha de by y dijeron que los identifican. Acto continuo: D1 lectura a la solicitud de matrimonio y diligencias practicadas con motivo de la presentación de dicha solicitud y en vista de que no resulta impedimento alguno para la celebracion del matrimonio solicitado he tenido a bien disponer que este se verifique hoy a las 17 horas en esta Oficina del Registro Civil. Luego me dirijo a los contra- yentes en los soguientes terminos, señor Herlindo Maldonado Ordaz es la voluntad de Ud. unirse en legitimo matrimonio Civil con la señora Bacilia Zapata Salazar que presente esta? Habiendo contes- tado I afirmativamente. Igualmente interrogué a la senora Bacilia Zapata Salazar, es la voluntad de Ud. unirse en legitimo matrimonio Civil con el señor Herlindo Maldonado Ordaz que presente esta? habiendo contestado afirmativamente Acto continuo: Dije en alta e inteligible Voz:Declaro solemnemente en nombre de la Sociedad y de la Ley, que quedan Udes. unidos en legitimo matrimonio Civil segun las Leyes de nustro Pais, con todos los derechos y prerre - gativas que la Ley concede a los casados y con las obligaciones que la misma impone. Inmediatamente se procedió a levantar la presente acta, haciendose constar el cumplimiento de todas las formalidades antes expresadas y que no se presento ningun impedimento que las generales de los testigos que han intervenido c son como sigue Francisco Ruiz soltero de 67 años, Leonardo Castillo casado de 27 años, Nicolas Reyes casado de 45 años ,Franco Almazan casado de 36 años de edad, haciendose constar que firman conmigo los que supieron hacerlo, asi como las diligencias que 8e practica- ron y que se agregan al apendice con el número 17 que corresponde"
}