{
	"anumber": "A12515466",
	"id": "A12515466_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12515466_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION & NATURALIZATION SERVICE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 1915, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U. S. DEPARTMENT-CIT JUSTICE IMMIGRATION & NATURALIZATION SERVICE 300 NORTH LOS ANGELES STREET Form approved LOS ANGELES, CALIFORNIA 90 UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R040.5 IMMIGRATION AND NATURALIZATION SERVICE File No. To the District Director IMMIGRATION AND NATURALIZATION SERVICE SLB and FEE \"STAMP The undersigned, whose alien registration receipt number is , hereby applies for a new alien registration receipt card. 1. (a) I am attaching the Form I-151 in my possession and desire a new card because my name has been changed the card is mutilated. (Tost) (b) My alien registration receipt document was on or about destroyed 6/23/65 (Date) under the following circumstances In case such receipt which was lost is recovered, or I ascertain its whereabouts, I will report the facts and will surrender such receipt or immigrant identification card to the Immigration and Naturalization office nearest my place of residence. For Statistics 1-151 mailed Received Tr. in Retd-Tr. Out UL. 30 1965 Complet AUG pages Present Name Tot Present Nationality Herlindo Ordaz Maldonado mexican Present address P.O. Box B. Herlindo Ordaz Maldonado. 8706 Arrow Hiway Name at time of registration and fingerprinting as Cucamonga Calif Herlindo Ordaz Maldonado Name at time of lowful admission for permanent residence Akidalgo HID 5.3.62 Texas Admitted at May 3,1962 (city or town) (state) Date of admission 11/11 et Name of vessel or other means of conveyance Destination in U.S. at time of admission 10 Bus ok Chicago - Illinois Birth date Birth place (city) (county) (state) April 23/1915 Guascama Carbonera, San LNIS, Polosi Mexico Dates of any absence from the U.S. for 1 year or longer, since lawful admission for permanent residence: NONE I CERTIFY that the information above is true and correct to the best of my knowledge and belief. Herlindo ordas maldonado Form 1-90 JUL 281965 (Signature of applicant) (Rev. 1-22-62) FPI-LPC-3-64-15M-1095 G-360 SENT"
}
