{
  "anumber": "A12596514",
  "id": "A12596514_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FINAL JUDGMENT OF DIVORCE, G168-B"
    },
    "years": {
      "ms_years_nlp_v1": [
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TAX ESTERIAN laintiff ATTORNEY FOR 707 Villian Fox Building ADDRESS COB . MIL Street Lot As alea 14, California Oc tober 27, 1950 ENTERED 2199 373 BOOK PAGE TELEPHONE Printly 4596 BY DEPUTY IN THE SUPERIOR COURT OF THE STATE OF CALIFORNIA IN AND FOR THE COUNTY OF LOS ANGELES ROST FL SIN No Dr 385,785 Plaintiff, FINAL JUDGMENT OF DIVORCE MORRIS Defendant, In this cause an interlocutory judgment was entered on the 5th day of D2C tobar 19 49, adjudging that plaintiff was entitled to a divorce from defendant, and more than one year having elapsed, and no appeal having been taken from said judgment, and no motion for a new trial having been granted and the action not having been dismissed; Now, upon the Court's own motion, it is adjudged that plaintiff be and is granted a final judgment of divorce from defendant and that the bonds of matrimoy between plaintiff and defendant be, and the same are, dissolved. It is further ordered and adjudged that wherein said interlocutory judgment makes any provision for alimony or the custody and support of children. said provision be and the same is hereby made bind- ing on the parties affected thereby the same as if herein set forth in full, and that wherein said interloc- utory judgment relates to the property of the parties hereto, said property be and the same is hereby assigned in accordance with the terms thereof to the parties therein declared to be entitled thereto, and wherein said interlocutory judgment makes provision for restoration of plaintiff's maiden name, the said plaintiff's maiden name is hereby restored as therein provided. Done in open Court this 27th day of Oc tober , 19 50 Elmer D. Doyle Judge. Filed at request of (Strike out two and sign in ink Attorney-Plaintiff-Defendant) Address 707 William Fox Building 608 S. Hill Street Los-Angeles 14, California THIS JUDGMENT IS NOT EFFECTIVE UNTIL ENTERED IN JUDGMENT BOOK BY CLERK 76F371 Judgment"
}