{
	"anumber": "A12596514",
	"id": "A12596514_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXAMINER'S REPORT—CERTIFICATE OF CITIZENSHIP"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1895, 1916, 1911, 1918, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE No. A 12 596 5 514 June 7, 1961 (Date of examiner's findings) EXAMINER'S REPORT-CERTIFICATE OF CITIZENSHIP (Section 341 of the Immigration and Nationality Act) DISTRICT DIRECTOR OR OFFICER IN CHARGE OF IMMIGRATION AND NATURALIZATION: I submit herewith the above file and the following findings made by me in the above-numbered proceeding based upon my investigation of the facts therein. I find that- 1. The name of applicant is Rose Fleetman 2. The applicant resides at 11227 Hatteras St., North Hollywood, California 3. The applicant was born on Dec. 20, 1895 at Kaunos Lithuania (Month) (Day) (Year) (City) (County, District, Province, or State) (Country) 4. The applicant did lawfully enter United States for permanent residence on 11-7-1911 (Month) (Day) (Year) 5. The applicant did derive acquire citizenship of the United States on April 2, 1916 (Month) (Day) (Year) through the natural ization of her husband, Morris Fleetman, in the Common Pleas Court at Hollidaysburg, Pa. on May 10, 1918 to whom she was married on April 2, 1916. 6. I am satisfied that the applicant, since deriving oxxacxpricing citizenship as set forth in item 5 above, has not become expatriated in any manner and that the applicant is now a citizen of the United States. 7. The following named persons were examined by me under oath on the dates indicated: Address Relationship to Date testimony Name applicant heard Rose Fleetman 11227 Hatteras St.2 N.Hollywood, Cal. applicant 6/7/1961 Jane F. Herman 1040 Grandridge Ave., Monterey Pk., Cal. daughter 6/7/1961 8. Attached to and made a part of the file are the following documents: A - Applicant's M/C B - Applicant S D/D Naturalization Record of her husband, C-812272 -Morris Fleetmand reviewed 9. The application does present a prima facie case of citizenship. 10. I recommend that the said application be granted. (If an adverse recommendation is made, a statement in support thereof should accompany the report.) 11. An A Certificate of Citizenship should be issued in the name of (A or AA) Rose Fleetman (Applicant's legal name acquired: (1) at Birth, (2) through marriage, NATURALIZA Managening officer) I do concur with the decision Date JUN 7 1961 (Signature District Director or officer in charg Form N-635 GPO 977226 (Rev. 7-10-58)"
}
