{
  "anumber": "A12596514",
  "id": "A12596514_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0007/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP UNDER SEC. 341 OF THE IMMIGRATION AND NATIONALITY ACT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1895,
        1924,
        1911
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TYPE OR PRINT IN.BLOCK LETTERS* U.S. DEPARTMENT OF JUSTICE : Form approved. Budget Bureau No. 43-R105.7. IMMIGRATION AND NATURALIZATION SERVICE FEE STAMP APPLICATION FOR CERTIFICATE OF CITIZENSHIP $50 FEE PAID No 1051987 UNDER SEC. 341 OF THE IMMIGRATION AND Immigration and Naturali; ation Service NATIONALITY ACT Los Angeles, Celif. INF Take or mail this application to: IMMIGRATION AND NATURALIZATION SERVICE: Date. 4/13/161 Verified by Q Date April 13, 1961 (Print or type) ROSE FLEETMAN ALIEN REGISTRATION (Name) 11227 Hatteras RADFORD AVE (Apartment number, Street address, and if appropriate, \"in care of NO 12-596-514 NORTH HOLLYWOOD CALIF (City) (State) I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) (If married woman) My maiden was ROSE MIGGANTZ a name (2) I was born in KAUNOS LITHUANIA on DECEMBER 20 1895 (City) FEMALE (State or country) (3) My personal description is: Sex ; complexion (Month) (Year) color of : 2 eyes BROWN ; color of hair Grey ; 5 feet 5 inches; weight 160 pounds; visible distinctive marks none Marital status: Single; Married; Divorced; Widow(er) (4) I arrived in the United States at NEW YORK (City) NEW (State) YORK under the name of ROSE MIGGANTZ on NOVEMBER (Month) (Day) 7, (Year) 1911 by means of NEW AMSTERDAM (SHIP) (Name of vessel or other means of arrival) (5) My last permanent foreign residence was SARIA LITHUANIA (City) (Country) (6) The place where I took the ship or train to the United States was ROTTERDAM, HOLLAND (City) (Country) Answer questions (7), (8), and (9) only if you arrived in the United States before July 1, 1924. (7) The person in the United States to whom I was coming was MR. HARRY FINEBERG (8) The place in the United States to which I was going was ALTOONA PENNSYLVANIA (9) The names of some of the passengers or other persons I traveled with, including members of my family, and their relationship to me, if any, are unknown (10) I have not been absent from the United States except as follows: Name of ship, or of airline, railroad company, bus company, or other Place or port of entry through which you returned to Date departed Date returned means used to return to the United States the United States TO THE APPLICANT: DO NOT WRITE BETWEEN THE DOUBLE LINES BELOW. CONTINUE ON NEXT PAGE FOR USE IN SEARCHING RECORDS OF ARRIVAL: RECORDS EXAMINED RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status (Signature of person making search) Form N-600 (Rev. 5-1-57)"
}