{
	"anumber": "A12537643",
	"id": "A12537643_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12537643_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY OR FOR PERMISSION TO ACCEPT EMPLOYMENT, Form approved Budget Bureau No. 4-R068.9"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1960, 1964, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved Copied IMMIGRATION & NATURALIZATION SE E Budget Bureau No. 43-R068.9 at APPLICAT ION TO EXTEND TIME OF TEMPORARY STAY the OR APPLICATION BY ALIEN STUDENT FOR PERMISSION TO ACCEPT EMPLOYMENT National IMPORTANT PLEASE READ ATTACHED INSTRUCTIONS BEFORE FILLING OUT APPLICATION. TYPE OR PRINT WITH BLOCK LETTERS. Archites IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUES- TIONS ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. PART I (All applicants must fill in this part.) 1. (First Name) (Middle Name) (Last Name) FILE NUMBER SANTIAGO (GO E NA G 4 MURRAY 2. OTHER NAMES (Include all other past and present names; a married woman must give her maiden name) 858NW m street MIAMI FLORIDA 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (Zone) (State) (C/O) PART II (Fill in this part if you are applying for extension of stay) 4. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP JUNE 11-1908 CUBA 5. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS OF LAST ARRIVAL NOV 12-1960 - MIAMI PAN AMERICAN AIRWAYS 6. PASSPORT NUMBER PASSPORT ISSUED BY (Name of Country) PASSPORT EXPIRES ON 24890 CUBA AUGUST to - 1964 7. MARITAL STATUS IF MARRIED, GIVE NAME AND ADDRESS OF SPOUSE MARRIED SARA MAZARREDO IF MARRIED, GIVE NAME AND ADDRESSES OF CHILDREN TERESITA GOENAGA CIENFUEGOSCUBA 8. OCCUPATION SOCIAL SECURITY NUMBER BANK AUDITOR 264-70-8800 9. I HAVE NOT BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. (Insert \"HAVE\" or \"HAVE NOT\") IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, GIVE THE FOLLOWING: NAME AND ADDRESS OF EMPLOYER OR BUSINESS 24890 8-4-59-6 8-4-64 NONE KIND OF EMPLOYMENT OR BUSINESS B-1-2 How 8-20-59 H 8-19-63 and. NONE INCOME PERWEEK FROM SUCH EMPLOYMENT OR BUSINESS DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED NONE NONE 10. MEANS AND SOURCE OF SUPPORT WHILE IN THE UNITED STATES. MONEY SAVED FROM PREVIOUS EMPLOYMENTS INCOB 11. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES: NAME RELATIONSHIP ADDRESS 12. DATE ON WHICH AUTHORIZED STAY EXPIRES 13. DATE TO WHICH EXTENSION IS REQUESTED MAY 12-1961 TEMPORARY RESIDENCE 14. REASON FOR COMING TO THE UNITED STATES NOT WILLING 70 WORK FOR A COMMUNIST REGIME 15. REASON FOR REQUESTING EXTENSION TO BE ABLE TO WORK IN THIS DEMOCRATIS COUNTRY 16. I ATTACH WRITTEN STATEMENT OF DATED IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE AND I MAKE IT PART OF THIS APPLICATION (See paragraph 7 of instructions.) 17. DATE ON WHICH I WILL DEPART FROM U. S. NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. OF DEPARTURE AM 18. I IN POSSESSION OF A TRANSPORTATION TICKET FOR MY DEPARTURE. (Insert \"AM\" or \"AM NOT\") Form I-539 (Rev. 6-1-60)"
}
