{
  "anumber": "A12596514",
  "id": "A12596514_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit, N-4-245773"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "NOTE CAREFULLY.-Do not sign your name on this page until you appear before an officer of the Immigration and Naturalization Service for the examination on this application. AFFIDAVIT Rose Fleetman am the (Full name, without abbreviation) (Applicant, parent or guardian) and do swear (affirm) that the contents of the foregoing application comprising pages 1 to 3 inclusive, are true to the best of my knowledge and belief; that corrections numbered ( ) to ( I were made by me or at my request; and that this application was signed by me with my full, true, and correct name. xrose Fleetman (Complete and true signature of applicant. parent, or guardian) Subscribed and sworn to (affirmed), before me, at Los Angeles, California this JUN 7 1961 day of 19 NATURALIZATION EXAMINER (Title of officer) INSTRUCTIONS TO THE APPLICANT 1. General.-Read these instructions carefully and follow them exactly. This form must be completely filled out-prefer- ably on a typewriter. If you do not have enough room for the answer to any question, continue the answer on another sheet of paper this size, numbering it the same as the question. 2. Execution of this application, if applicant 14 years of age or over.-If you are 14 years of age or over, you must sign your full name in the space provided on page 3 of the application, but do not execute the affidavit on page 4. This affidavit will be executed for you when you appear before an officer of the Immigration and Naturalization Service at the hearing on the application. 3. Execution of this application, if applicant under 14 years of age.-I you are under 14 years of age, do not sign the application on page 3 or the affidavit on page 4. Your parent or guardian must sign his or her name in the space provided on page 3 and must later appear before an officer of the Immigration and Naturalization Service at the hearing on the application to execute the affidavit on page 4. 4. Fee.-A fee of five dollars ($5) must accompany this application. Remittances should be made payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" If you mail this application, attach money order or check. DO NOT SEND CASH. The fee is required for filing the application and is not returnable, regardless of action taken thereon. 5. Photographs.-You are required to send with this application three photographs of yourself taken within 30 days of the date of this application. These photographs must be 2 by 2 inches in size and the distance from top of head to point of chin should be approximately 11/4 inches; must not be pasted on a card or mounted in any other way; must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group, or full-length portraits will not be accepted. PHOTOGRAPHS SHOULD NOT BE SIGNED. 6. Facts concerning arrival in the United States.-Detailed information is necessary in relation to your arrival in the United States. If you do not know the exact date of arrival or name of the vessel or port and cannot obtain this information, give the facts of your arrival to the best of your ability. If you have an immigrant identification card, passport, ship's card, or baggage labels, they may help you to give this information. 7. Documents.-Send with this application any birth, marriage, divorce, death, or other document which will support your claim to citizenship. All documents in a foreign language shall be accompanied by English translations which are certified by the translator as to their accuracy and his competency as translator. Do not send a Certificate of Naturalization or Certificate of Citizenship, and do not photostat or otherwise make copies of either of such documents. The Certificate of Naturalization or Certificate of Citizenship may be presented by you or your witnesses when they appear for examination before an officer of the Immigration and Naturalization Service. If you desire that the original documents which you send with this application be returned to you, they must be accompanied by photostatic or other copies of such documents. Describe in Statement 18, page 2, all the documents which you are sending with this application. 8. Race.-With regard to Statements 19 and 21, you should show race as white, or of African nativity or descent, or any other race that is applicable. (4) S. GOVERNMENT PRINTING OFFICE 1957-O-425773"
}