{
	"anumber": "A12515466",
	"id": "A12515466_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12515466_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "masculino"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 3/30/2023 SERVICIO EXTERIOR DE LOS ESTADOS UNIDOS DE AMERICA SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este formulario se debe llenar en duplicado en máquina de escribir O a mano en letras de molde legibles. De ser necesario, todas las preguntas se han de contestar. Las preguntas que no sean pertinentes se han de senalar. Si no hay espacio suficiente en el formulario, usense hojas aparte en duplicado con los mismos números que aparecen en el formulario. Fijense a éste las hojas aparte. Este formulario no se debe firmar hasta que lo indique el funcionario consular. Los derechos por la solicitud de visa de inmigrante son 5.00 dólares. Los derechos deben pagarse al contado en dólares de los Estados Unidos o su equivalente en moneda local, O en giro bancario, cuando usted comparezca ante el funcionario consular. ADVERTENCIA: Toda declaración falsa, O el ocultar algún hecho esencial puede ser causa de exclusión total de los Estados Unidos de América. Aun cuando se le permita a usted la entrada al país, toda entrada a base fraudulenta puede ser causa de enjuicia- miento o de deportacion. Por la presente solicito visa de inmigrante y matrícula de extranjero en Consula do de los Estados Unidos en Monterrey, y al efecto declaro lo siguiente: (I hereby apply for an immigrant visa and alien registration at the United States at and state the following facts:) 1. Apellido (My family name is) Nombre (My first name is) Apellido materno (My middle name is) Mal donado Herlindo Ordáz 2. Nombre completo en el alfabeto nacional si no se usan caracteres romanos (My full name in native alphabet (If other than Roman letters are used) is) pre- Herlindo aldonado Ordáz 3. Otro nombre usado O por el cual se le conozca. (La mujer casada debe dar su nombre de soltera) (Other names I have used or by which I have been known are) D - (If married woman, give maiden name) Ninguno NONE do; 4. Fecha de nacimiento (The date of my birth 5. Lugar de nacimiento (My place of birth is) is) día 23 mes 4 año 15. ciudad o pueblo Guaxcamá, Carbnovincia S.L.P, y país México (day) (month) ABETI (city or town) (province) (country) los 6. Edad (My age is) 7. Profesion u ocupacion actual (My present calling or occupation is) 46 años Jornalero LABORER 8. Direccion actual (My present address is) Hidalgo #19. Guaxcama, Mpio. Villa Juárez, antes Carbonera, S.L.P., Mex. les 9. Sexo (My sex is) 10. Estado civil (My marital status is) Soltero Casado Viudo Divorciado Separado Masculino Femenino (Single (never married)) (Married) (Widowed) (Divorced) (Male) 1 (Separated) (Female) Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married times. 11. Nacionalidad (My nationality is) MEXICAN Mexicana 14. Filiacion (My personal description is) 15. Tengo las siguientes márcas visibles de identificacion (I have the following visible marks of identification) (a) Color del pelo (Color of hair) (c) Estatura (Height) Entrecano LIGHT 5 GRAY pies (ft.) IO pulgs. (in.) NONE (b) Color de los ojos (Color of eyes) (d) Tez (Complexion) BROWN Cafés DARK Ninguna Moreno 16. Mi objeto al ir a los Estados Unidos es: (My purpose in going to the United States is) Trabajar TO LIVE AND WORK 17. Pienso radicarme en los Estados Unidos permanentemente o (indíquese el 18. Pienso entrar a los Estados Unidos por el puerto de (I intend to enter the período de permanencia) (I intend to remain in the United States perma- United States at the port of) nently or (Give length of time)) PERMANENTLY Permanentemente. Reynosa, Tamps. 19. Tengo (o no tengo) boleto hasta mi destino final (I (Do) (Do Not) have a ticket to my final destination) NOT YET No 20. (a) Voy a los Estados Unidos a reunirme con la siguiente persona (indíquese 20. (b) Mi fiador es (indíquese el nombre y la direccion de la persona u organiza- el nombre, la dirección y el parentesco si es que lo tiene) (I am going to the United States to join the following person) (Give name and address cion si es distinta de la que aparece en el parrafo (a) (I am sponsored by the following person and/or organization) (Give address if different and relationship, it any) from(a) BOX 408 AIA MO TEXAS JOSE Jose Vera (EMPLOYER) BERA (EMPLOYER) box 408 ALAMO \"Sr. 11 21. Mi dirección permanente en los Estados Unidos será (My final address in the United States is) c/o Gestrudis Maldonado BEXAS NA Acasia St. Box 408, Box ,LaFeria, Texas 22. Mis recursos personales son: (My personal financial resources are) (a) Efectivo (Cash) $600.00M/N (c) Bienes raices (Real estate (value)) NONE (b) Depósitos en bancos (Bank deposits) (d) Otros (Other) ESTE FORMULARIO SE PUEDE OBTENER GRATIS EN TODAS LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA"
}
