{
  "anumber": "A12515466",
  "id": "A12515466_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12515466_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Gobierno de los Estados Unidos Mexicanos, FORMA NO. 421"
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "T.G. TRISTAN - S. L. P. - FORMA NO. 4321 DEPARTMENT EN NOMBRE DE LA REPUBLICA DE MEXICO, y como Oficial del Estado Civil de este lugar, hago saber a los que la presente vieren y CLIND CERTIFICO: ser cierto que en el Libro Núm 1 uno del Registro Civil que es a mi cargo, en la foja 29 vuelta se encuentra asentada una acta del tenor siguiente: En el margen:- 111. Acta número ciento once. I Al centro: - \"HERLINDO MALDONADO\". SCIA En el tenor:- En Carbonera, a las 5 cinco de la tarde del dia 10 diez de Mayo de 1915 mil novecientos quince compareció Cesareo Mal- donado de 19 diez y nueve años de edad, soltero, jornalero origina- rio y vecino de Guascama y dijo:- Que en aquel lugar el dia 23 vein- titres de Abril anterior a las 8 ocho de la mañana nació una criatu- ra del sexo masculino que ha de llevar por nombre Herlindo Maldonado a la que presents viva y declara que es hijo natural suyo y pide que asi se haga constar en la presente acta, mexicano y de religion caté- lica. Fueron testigos de este acto los ciudadanos Juan Ruiz de 36 treinta y seis años de edad y Ramon Zuñiga de 42 cuarenta y dos años de edad, ambos casados, agricultores, originarios y vecinos de esta Villa y sin parentesco con el interesado. Levantada la presente ac- ta se leyo a los concurrentes y estando con élla conformes, firmo conmigo uno de los testigos y no los otros por expresar no saber. Doy Fé. Lorenzo Ruiz. Juan Ruiz. (Rubricados) Es copia sacada fielmente de su original y debidamente cotejada, que T I F I C 0 y expido á petición del interesado para los usos legales a que hubiere lugar. SUFRAGIO EFECTIVO, NO REELECCION, DEL Villa Juarez, S.L.P. Octubre 21 de 1961 EL OFICIAL DEL REGISTRO CIVIL TIMIL Jomas Tomas Almazan R."
}