{
  "anumber": "A12596514",
  "id": "A12596514_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES OF AMERICA PETITION FOR NATURALIZATION, 729"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1916
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. DEPARTMENT OF LABOR NATURALIZATION SERVICE No 779 DUPLICATE to the STATES OF Nationalization UNITED PETITION FOR NATURALIZATION Honorable the Common Pleas Courting Blair County, Ienneyl vania petition of Morris Flatman Hollidaysburg, Pa. First My place of resultance 1515 19th Street, Altoona, Ja. hereby respectfully showeth Second My occupation is Shoemaker Third I was born on the 15\" day of May I/AMO Domini 889 Rakitno, Russia Fourth I migrated to the United Bremen, Germany when the 5\" Domini / 910 day or June and United States. at the part of Baltimore, nd. 7th Domini / 910 Cassel day of July on Fifth I declared my intention to foreme citizen of the United States on the day October Hollidaysburg, Pa. anno in the Common Pleas 912 Court Blair County Sixth I am married Rose Kovno, Russia and now resides at Altoona, Pa. one children place of and place Herman S. as Born 10\" day of December 1916 at Altoona, Pa. now resides at Altoona, Pa, Seconth exposed to or a member of or agliticated with any organization body of persons teaching disbelief in or opposed organized are not a polygamist nor a believer in the practice of polygamy I attached to the principles of the Constituti of the United States and (* is my intention to Become it citizing of the United States and to renownes absolutely art forever all allefiance and Adelity to any foreign prince potentate state or covernignty the present government of Russia and particularly to of whom at this time I'am a subject and it is my insection reside permanently in the United Highth speak the language Ninth / have continuously in the United States of America for the form of Mia years at immediately preceding the date of this petition. to wit, since 19\" day of June Domini I. 910 and in the State Pennsylvania petition. since the 22 day June continuously next preceding the date of arm. Domini I 910 being a residence within this State of at least one year next proceding petition Tenth / have not heretoform made petition citicenship - / either the United States and the certificate from the Department of Labor the herefore be admitted (F officer of the United States movie Hatman of Intention 729 Certificate Arrival No 2782/D-729 9\" January JOSE B Department of AFFIDAVITS OF PETITIONER AND WITNESSES State of Pennaylvaria County of Blair the the income statever"
}