{
  "anumber": "A12797485",
  "id": "A12797485_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice, Immigration and Naturalization Service, N-4-0"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of , ice Immigration and Naturalization Service Oakland Naturalization Office 1301 Clay Street, Room 380-iv Oakland CA 94612-5217 Ana Dolores Moronta File No. A 12797.485 Date 8-17-98 Requested by mjh N-400 Examination of the (enclosed) application shows that certain additional information, documents, or forms are needed before your application can be acted upon. To help you in that connection, we have checked , , in red in this letter the items winton nood your attention. Please read those items, and, when you are able to comply with them, RETURN THIS LETTER with the requested information, documents, and forms. We will then complete processing of your application. Unless you funith the required information or & checked , it will be necessary to recommend to the court that your petition for maturalization be denied for lack of prosecution. The application form you have submitted is obsolete. Complete and return the enclosed new application. Send money order or check for s made payable to the Department of Justice, Immigration and Naturalization Service. Do not send cash or postage stamps. Please submit the documents/information checked by [ A new set of fingerprints, completed and processed by an officially Designated Fingerprint Service, card enclosed. (Check with your fingerprinting service to see if they are officially designated by the INS.) [] A certified copy of the court complaint, disposition and sentence for [ ] An original or certified copy of a letter from the respective agency attesting to the lack of record for you regarding [ ] Copy of proof of child. support (e.g. copy of canceled checks, DA letter, notarized letter from child's other parent) for [ ] Copy of rent agreement, deed, insurance binder, utility bills, bank/credit statements, other specified evidence of marital union: . Submit of these. [] Copy of first two pages of income tax returns (forms 1040 & 540) and W-2's for you and your spouse for tax year(s) Letter from your medical provider clarifying points, as indicated in the attached note, regarding his/her letter or form N-648, dated 3-21-97 , that you submitted to support your disability exemption claim. ( ] Letter from Welfare Dept./Social Services agency regarding eligibility, attached. Form N-14 (Rev. 12-31-82) Y (Over)"
}