{
	"anumber": "A12797485",
	"id": "A12797485_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Oficial del Estado Civil de la Primera Circunscripción del Municipio de Santiago, 13951"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "M alamy E Republica Dominicana Oficialato del Estado Civil de la Primera Circunscripcion del Municipio de Santiago -=Yo,PEDRO VARON CURIEL, Oficial del Estado Civil de la Primera Circunscription del Municipio-de Santiago, CERTIFICO: Que en el archivo a mi cargo,en el l+bro No.-39,folio 76 bajo el-numer ro 1089, se encuentra una partida de NACIMIENTO la que copiada- a la Ietra ace as-: 11 En la ciudad de Santiago de los Caballeros, diez y seis de- \"Noviembre de mil novecientos uno, siendo las diez y tres cuar- \"tos a.m.-Por ante Nos,Jose Manuel Rodriguez y Rodriguez, Ofi-- \"cial del Estado Civil del segundo,distrito de esta y su Comun \"estando en nuestra oficina con nuestro Despacho abierto en la \"calle 30 de Marzo,casa No. ( )camparectó el Señor Antoni o Mo- \"ronta,mayor de edad, casado labrador y vecino de Hato del Ya-- \"que el que declara que allf el cuatro de Mayo p.p.a las cua-- \"tro a.m.nacto una nina que sera bantizada hoy con el nombre- \"de ANA DOLORES, ija legit-ma del Declarante y Mercedes Nunez- \"labradores y vecinos de ese lugar, siendo sus Padrinos, Francis \"CO Perez y Perez y Vitalina Almonte.-En fe de lo que levanta- \"mos el presente ante los testigos Eladio Victoria y Rodolfo-- \"Lithgow mayores de edad,casados,empleados públicos y vecinos- \"de esta, que firman despues de lefdo,que dijeron estar confor- \"me y el declarante se habia ausentado, por ante Nos,que certi- \"ffcamos.-(Firmado) Jose M1.Rodriguez y Rodriguez. CERTIFICO: ue la copia que antecede es fiel y conforme a su - original, que a requerimiento de parte interesada,expido-la- presente, en Ia Ciudad de Santiago de los Caballeras,Republica- Daminicana,a los VEINTE atas del mes de JUNIO del año mil nove cientos sesenta y dos.7 Sello de R.I. No.- 2176466-250 CIAL Art.103=Ley-659 20--Junio-~962 PEDRO VAR ON CURILL, P. V. Official del Estado Civil de la Primera Circunsort potion del Municipio de Santiago,ReD. PVC 1817/18 4847413 20/6/62"
}
