{
  "anumber": "A12797485",
  "id": "A12797485_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "femenino"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANGERO"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1901
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "0 (Spanish) 10-61 SERVICIO EXTERIOR DE LOS ESTADOS UNIDOS DE AMERICA SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este formulario se debe llenar en duplicado en máquina de escribir o a mano en letras de molde legibles. De ser necesario, todas las preguntas se han de contestar. Las preguntas que no sean pertinentes se han de señalar. Si no hay espacio suficiente en el formulario, úsense hojas aparte en duplicado con los mismos números que aparecen en el formulario. Fijense a éste las hojas aparte. Este formulario no se debe firmar hasta que lo indique el funcionario consular. Los derechos por la solicitud de visa de inmigrante son 5.00 dólares. Los derechos deben pagarse al contado en dólares de los Estados Unidos o su equivalente en moneda local, o en giro bancario, cuando usted comparezca ante el funcionario consular. ADVERTENCIA: Toda declaración falsa, o el ocultar algún hecho esencial puede ser causa de exclusión total de los Estados Unidos de América. Aun cuando se le permita a usted la entrada al país, toda entrada a base fraudulenta puede ser causa de enjuicia- miento o de deportación. embajada Santodonunce Por la presente solicito visa de inmigrante y matrícula de extranjero en TERRITERIO de los Estados Unidos en y al efecto declaro lo siguiente: (I hereby apply for an immigrant visa and alien registration at the United States OSH at and state the following facts:) 1. Apellido (My family name is) Nombre (My first name is) Apellido materno (My middle name is) MORONTA ANA DOLORES NUNEZ 2. Nombre completo en el alfabeto nacional si no se usan caracteres romanos (My full name in native alphabet (If other than Roman letters are used) is) AND DOLORES MORONTA NuirEz 3. Otro nombre usado o por el cual se le conozca. (La mujer casada debe dar su nombre de soltera) (Other names I have used or by which I have been known are) (If married woman, give maiden name) 4. Fecha de nacimiento (The date of my birth 5. Lugar de nacimiento, (My place of birth is) Hora is) día 4 mes 3 año 1901 ciudad o pueblo SANDAGO provincia Borpom país (day) (month) (year) (city or town) (province) (country) 6. Edad (My age is) 7. Profesión u ocupación actual (My present calling or occupation is) GLANOS QUEH DOMESTICOS housework 8. Dirección actual (My present address is) CALLE ALUARO GARABITO 7 48 SANTO DOMINOU 9. Sexo (My sex is) 10. Estado civil (My marital status is) Soltero Casado Viudo Divorciado Masculino Femenino Separado (Single (never married)) (Married) (Male) you (Widowed) (Divorced) (Female) (Separated) Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married ND times. 11. Nacionalidad (My nationality is) Dominilana 12. Filiación (My personal description is) 13. Tengo las siguientes marcas visibles de identificación (I have the (a) Color del pelo (Color of following visible marks of identification) NEGRIGlacks Estatura (Height) pies (ft.) / pulgs. (in.) (b) Color de los ojos (Color of eyes) (d) Tez (Complexion) NEGRAblack NINGUNIT 14. Mi objeto al ir a los Estados Unidos es: (My purpose in going to the United States is) BESIDIA 15. Pienso radicarme en los Estados Unidos permanentemente o (indíquese el período de permanencia) (I intend to remain in the United States perma- 16. Pienso entrar a los Estados Unidos por el puerto de (I intend to enter the United States at the port of) nently or (Give length of time)) PERMANENTE NEW YORK 17. Tengo (o no tengo) boleto hasta mi destino final (I (Do) (Do Not) have a ticket to my final destination) 18. (a) Voy a los Estados Unidos a reunirme con la siguiente persona (indíquese 18. (b) Mi fiador es (indíquese et nombre y la dirección de la persona u organiza el nombre, la dirección y el parentesco si es que lo tiene) (I am going. to cion es que el (I am the United States to join the following person) (Give name and address and relationship, if any) GLORIA MERCEDE MORONTA 3762 101S1 68 My the person and/or (Give address if from following si (a) distinta de la aparece organization) en párrafo (a) sponsored different by 19. Mi dirección permanente en los Estados Unidos será (My final address in the United States is) 3762 101 SI CORONA 68 N.Y. N/. 20. Mis recursos personales son: (My personal financial resources are) No (a) Efectivo (Cash) (c) Bienes raíces (Real estate (value)) ND (b) Depósitos en bancos (Bank deposits) WV (d) Otros (Other) NO ESTE FORMULARIO SE PUEDE OBTENER GRATIS EN TODAS LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA"
}