{
  "anumber": "A12797485",
  "id": "A12797485_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0055/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: U.S. Department of Justice Immigration and Naturalization Service, Form Number: N-14"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U. S. Department of Justice Immigration and Naturalization Service Oakland Naturalization Office 1301 Clay Street, Room 380-N Oakland CA 94612-5217 ATTACHMENT TO FORM N-14 Date: 12 797 485 By DAO: m, Name of Applicant for Naturalization Ana Dolores Moronta Alien Registration Number: 12797485 To the physician or clinical psychologist: We have reviewed the form N-648 or letter you submitted dated regarding the named applicant. You indicated that the applicant has certain disabilities that may affect his/her participation in standard naturalization examination procedures. Based on the information you provide, the applicant may be eligible for an exemption from specific aspects of the citizenship examination, as stated on pages 1 - 3 of the attached document entitled \"Supplemental Information for Doctors and Psychologists on Naturalization and the Exceptions from the English and Civics Requirements for Persons with Disabilities\", dated March 12, 1997. Under federal regulations, the four distinct exemptions possible are tests of the applicant's ability to: 1. Read words in ordinary usage in the English language. 2. Write words in ordinary usage in the English language. 3. Speak words in ordinary usage in the English language. 4. Express a knowledge and understanding of the history and government of the United States. The form N-648/letter you submitted is not clear as to in which, if any, of the above four fields the applicant is able or unable to perform due to a disability or combination of disabilities. Please prepare a signed statement clarifying this matter, describing how the disabilities impair the applicant's ability in any or all of these four fields for which he/she seeks an exemption. You may explain on this paper,- or provide a separate brief statement. Your assistance is crucial as part of the overall determination of the applicant's qualifications to become a United States citizen. Other: Applicant is unable to understand oath or why she visited I N.S. office today (in Spanish language). Enclosure"
}