{
  "anumber": "A12797485",
  "id": "A12797485_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Name Change, PETITION FOR NAME CHANGE COURT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Dominican Republic"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        1901,
        2001,
        1999
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PETITION FOR NAME CHANGE COURT INSTRUCTIONS TO THE PETITIONER: Under the Immigration and Nationality Act of 1952, as amended by the Immigration Act of 1990 (Sec 336), an applicant who requests a change to his or her name must have the oath administered by a district court by decree of that court. The decree of name change will be issued at the same time as the administration of the oath of allegiance, and the certificate of naturalization shall be issued in accordance therewith. If you elect the United States district court ceremony and wish to change your name, please print or type the information requested. I hereby petition this court to change my name. In support of my petition I truthfully state the following: (1) My full and correct name is Ana Dolores Moronta Nunez. (2) My present place of residence is 18998 Carlton Avenue Castro Valley CA 94546 (3) My country of birth is Dominican Republic. (4) My date of birth is March 4, 1901. (5) My INS registration number is A 012 797 485. I certify that I am not seeking a change of name for any unlawful purpose such as the avoidance of debt or evasion of law enforcement. I petition the court to change my name to: Ana Moronta OCT 18 1999 Date ana Musices Signature of Petitioner CERTIFICATION OF NAME CHANGE I certify that the above petition was granted by the court on MAR 2 7 2001 MAR 2 7 2001 Date Richard W. Clerk Wishing (by Deputy Clerk)"
}