{
  "anumber": "A12797485",
  "id": "A12797485_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS 398, Moronta, Ana Dolores"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "MORONTA NUNEZ; Ana Dolores FORM. FS 398 PLACE 9-17-62 FOREIGN SERVICE CLINICA ABREU UNITED STATES OF AMERICA DATE OF EXAMINATION MEDICAL EXAMINATION OF VISA APPLICANTS SEPTEMBER 22/62 CITY COUNTRY At the request of the American Consul at SANTO DOMINGO DOMINICAN REPUBLIC ANA DOLORES MORONTA NUNEZ NAME AGE SEX I Certify that on the above date I examined 61 F I Examined specifically for evidence of any of the following conditions: CLASS A: TUBERCULOSIS (in any form) LEPROSY (Hansen's Disease) DANGEROUS CONTAGIOUS DISEASES: Actinomycosis Granuloma Inguinale Fingworm of scalp Amebiasis Keratoconjunctivitis infections Schistosomiasis Blastomycosis Leishmaniasis Syphilis, infectious stage Chancroid Lymphogranuloma Venereum Trachoma Favus Mycetoma Trypanosomiasis Filariasis Paragonimiasis Yaws Gonorrhea MENTAL CONDITIONS: Feeble-mindedness Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopothic personality Chronic alcoholism Epilepsy (Idiopathic) (See proviso, sec. 34.7, USPHS Regs) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (Check number (1) below or complete number (2) My examination, including the X-ray and other reports below,revealed: (1) No defect, disease, or disability -X- (2) Defect, discease, or disability OI previous occurrence of one or more attacks of insanity, as follows (give class-A, B, or C-diagnosis, and pertinent details*) CONCLUSION: \"There is no evidence of tuberculosis or any Chest X-ray report other chest pathology.\" Jose A. Penzo from Dr. NEGATIVE A. Ravelo Blood serological report from Dr. Urinalysis report from Dr. SIGNATURE OF MÉDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL NOTIFICATION JORDI DROSSA Alemany 30170-9-62 *Continue en reverse side if necessary"
}