{
  "anumber": "A12797485",
  "id": "A12797485_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR IMMIGRATION INFORMATION, A-12 7974485"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Dominican Republic"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        1963,
        1938
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "A12797485 THE CITY OF NEW YORK & DEPARTMENT OF WELFARE IMM. & NAT. SERVIN2/63Rd W.C. N.Y.C.MAIL UNIT SPECIAL SERVICES Address WELFARE CENTER 1963 NOV 27 AM 9:21 42 FRANKLIN ST. NJ Y. 13, N. Y. REQUEST FOR IMMIGRATION INFORMATION United States Department of Justice Passport # 51255 Immigration and Naturalization Service 20 West Broadway, Alien Registration Number New York 7, N. Y. L INFOR fig Fold DEC 3 1963 Fold all Service Please provide US with the information requested below: N Name Used at Time of Arrival Present Name (if changed) Moronta, Ana Delores same Current Address 171 West 95th Street Port of Entry Date of Entry Name of Vessel or Airline Port of Embarkation (foreign) New York City 11-15-62 Pan American Santo Domingo, D.R. Place of Birth Age at Time of Arrival Social Security No. Santo Domingo D.R. 62 Names of Accompanying Relatives and Friends Specific Information Requested 1. First entry? For permanent Residence? How long lived in Dominican Republic? 2. Patient& her assets? 3. Relatives & their assets? 4. Sponsor ;& his assets? 5. Bond or affidavit posted? Social Investigator Devis Caseload No. Assistant Supervisor Date Ocie Davis 112 mar/m Marvin Robran Lehrman 11-21-63 Case Name Moronta, Ana Delores Category and Case Number 112-197903 ma-2 REPLY FROM IMMIGRATION AND NATURALIZATION SERVICE Re: ANA DOLORES MORONTA NUNEZ A-12 797 485 INF. I.N.S. File No. 1. Yes; yes; from 1938 to 1962. 2. None shown. 3. Niece, Gloria Mercedes Moronta, as of 7-11-623 37-62 101st St., Corona, L.I.,N.Y.; employed by Durlacher & Co., 120 E. 23 St., N.Y.C. at $90 per week. 4. See No. 3. 5. Affidavit submitted by No. 3. (Sponsor's assets as of 7-6-62 show! savings account at Chase Manhattan Bank 599 Broadway, N.Y.C. in sister Mercedes' name in trust for Gloria Moronta-balance $1,511.) This information furnished for your official use only. Signature Title Date P.A. ESPERDY in District Director, N.Y.District 12-6-63 Form W-497* Rev. 5/25/61"
}