{
  "anumber": "A12797485",
  "id": "A12797485_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0011/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE PREPARATION SHEET and OATH DECLARATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Dominican Republic"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1901,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CERTIFICATE PREPARATION SHEET and OATH DECLARATION Alien Number: A 012 797 485 File Number: SFR*000001239 Daytime Phone: (510) 537-9275 Name (changing to): Ana Moronta DOB: March 4, 1901 Sex: Female Height: 5 ft. 2 in. Marital Status. Widowed Country of Former Nationality: Dominican Republic Name Change: No (If yes, see attached name change form) Oath of Allegiance I HEREBY DECLARE, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign prince potentate, state, or sovereignty of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and the laws of the United States of America against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will perform noncombatant service in the Armed Forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely without any mental reservation or purpose of evasion; SO HELP ME GOD. In acknowledgment whereof I have hereunto affixed my signature. PANA moroin NOV 18 1998 Applicant's Signature (name change) Date Rev. 5/23/97"
}