{
  "anumber": "A12851813",
  "id": "A12851813_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12851813_0000/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Investigation, G-166 ( (Rev. 5-16-60)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Haiti",
        "Netherlands",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION 1 TITLE RELATING FILES G-29 LINE A12 851 813 514 DE LA FUENTE, Bruno W. TYPE OF INVESTIGATION DATE AND PLACE OF BIRTH DATE, PLACE, AND MANNER OF LAST ENTRY IN U.S. Deportation - General 1/27/12, Haiti Highgate Springs, Vt., 4/3/56, NATIONALITY B-2 visitor to 4/18/56. Netherlands OFFICE IN CONTROL OF INVESTIGATION REPORT MADE AT DATES INVESTIGATION CONDUCTED St. Albans St. Albans March 12, 1963 XXNXXXXX DETAILS Investigation predicated upon receipt of nonimmigrant overstay photostat (I-94) from Central Office, unable to verify departure. On March 12, 1963, MRS. CATHLEEN BLAKE, 640 39th Avenue, Lachine, P. Q., Canada, a former neighbor of SUBJECT, advised that SUBJECT returned to Holland with her family about 6 years ago; that she subsequently received Christmas cards from the following address: 105 Leidsche Kade, Amsterdam, Holland, % Lido Restaurant. SUBJECT'S presence outside United States verified. PENDING PENDING INACTIVE XX CLOSED REFERRED TO CONTROL OFFICE DISTRIBUTION REPORT MADE BY 3/29/63 DATE EAL 1 - File Investigator Signature Title Photostat cleared to C.O., per REVIEWED AND APPROVED 3/29/63 current instructions, 3/29/63 eal hichard Deputy DATE District Signature Title Director Form G-166 (Rev. 5-16-60) GPO 894065"
}