{
  "anumber": "A12994632",
  "id": "A12994632_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1970,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 (32) My occupation is owner List the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) Jan. 1970 PRESENT TIME man wah BOOK store 9331/4 Chung king owner (b) 19 19 (owner) -.A, Ca 90012 (c) 19 19 (d) , 19 , 19 (33) Complete this block if you are or have been married. I am Married The first of my husband wife is (was) Yen Ping name or (Single, married, divorced, widowed) We were married on 12-26-64 at Reno, Neveda He or she was born at Hong Kong on 5-2-27 He or she entered the United States at (place) Honolulu Hawai on (date) 7-22-64 for permanent residence and now resides with me apart from me at (Show full address if not living with you.) He or she was naturalized on None at Certificate No ; or became a citizen by His or her alien Registration No. is FOIA (b)(6) (34) How many times have you been married? 2 How many times has your husband o wife been married? 1 If either of you has been married more than once, fill in the following information for each previous marriage. (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE CITIZEN ALIEN ENDED (a) 2-8-39 Sept. 1961 Hing man Yeung F N/A Deceased (b) (c) (d) (35) I have 4 children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- (Number) wise give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date Born (f) Port of Entry (g) Alien (Country) of Entry Registration No. (h) Now Living at- Sam chu M china 11/28/39 12.6.62 Monolulu Citizen Los angeles Felix chu M 11 5-4-42 5.6.63 alaska 11 11 Diane chu F 11 1-18-44 5.6.63 if 1) San Francisco Elizabeth chu F 11 9-5-45 5.6.63 11 11 \" (36) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) I want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $10 for each child for whom you want certificates, otherwise, send no money with this application.) Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages"
}