{
	"anumber": "A12994632",
	"id": "A12994632_0053",
	"page_index": 53,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0053/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice\\nForm G-325A ( (Rev. 10-1-82)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1918, 1937, 2023, 1960]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' retired', 'owner']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "CHINESE"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened RM NARA5918/2023 OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION Approval expires 4-30-85 (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER CHU WAI MAN FEMALE 05-27-14 CHINESE A- 12-994-632 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE CANTON CHINA (If any) 564-68-6626 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE . GEE SUN WY UNKNOWN CHINA DECEASED FATHER MOTHER (Maiden name) PING KIT GAN UNKNOWN CHINA DECEASED HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE YUNG- 05-03 SO PING 27 HONG KONG 10-26-64 U.S.A. FORMER HUSBANDS OR WIVES (if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE YUNG HING-MAN 1918 1937 HONG KONG 1960 DECEASED CHINA APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 3379 DESCANSO DR LOS ANGELES CA 90026 U.S.A. 06 71 PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR KOWLOON HONG KONG 03 60 05 63 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE. so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR MAN WAH BOOKSTORE LOS ANGELES, CA OWNER 06 71 PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT OTHER (SPECIFY): Wa Man alm 12-04-86 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) CHU WAI MAN A12-994-632 LOS CIT a 400 JAN 13 (date) Form G-325 A (Rev. 10-1-82) (1) IDENT."
}
