{
	"anumber": "A12994632",
	"id": "A12994632_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES, G-360 SENT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DE RTMENT OF JUSTICE Screened by NARA, 9/18/2023 Form approved. O MB No. 43-R0052 Immigration and Naturalization Service A RE-ENTRY PERMIT DOES NOT PROTECT IVM TURALIZA. MOD TION RESIDENCE SEE INSTRUCTIONS ATTACHED FOR FEEBIAMP21 1974 INFORMATION CONCERNING EFFECT OF ABSENCE ON ELIGIBILITY FOR NATURALIZATION READ THIS FORM N IN AND ATTACHED INSTRUCTIONS CAREFULLY BEFORE FILLING IN THIS APPLICATION. 628-3449 APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act. (Fill in with typewriter or print in block letters in ink.) CHU WA/ MAN 3/31/23 IMPORTANT: You must submit your/ 1. YOUR NAME Alien Registration Receipt Card with this application. ADDRESS STREET 9334 CHUNG KING ST ALIEN REGISTRATION NUMBER CITY AND (Zip Code) STATE L.A. CALIF 30012 A- 12 994 632 DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR HEIGHT 05-27-14 CHINA CHINESE BROWN GREY VISIBLE MARKS AND SCARS 5 FEET 6 INCHES NONE 2. FILL IN THE ITEMS IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RE-ENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING MY LAST PERMIT LAST PERMIT IS ATTACHED NONE (City and State) IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: 3. FILL IN THEITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATEAS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED CHU WAI MAN SFR 04-01-66 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) LAWFUL ADMISSION VERIFIED NWA I-151 FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME them Sur Wy Chu D. CHu Pan INITIALS 4. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN UNITED STATES. (Exclude any re-entry after an absence of less than six manishs in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHU WAI MAN SFR 04-01-66 NAME OF VESSEL. AIRLINE OR OTHER MEANS OF CONVEYANCE NWA 5. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD L.A. INTERNATIONAL AIRPORT st APR 74 MONTH NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL GIVE NAME OF VESSEL CAL MAILING ADDRESS ABROAD (Number and Street) (City/Town) State/Province/District) (Country) 424- CHAN RD CHAN BEILDING 17#FL KOWLOON HONG KONG COUNTRIES TO BE VISITED (List each country) 3 HONG KONG REASONS FOR GOING ABROAD (Be concise and (complete): G-360 SENT 3 1975 VISIT FAMILY RELATIVE 6. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 7. PRESENT OCCUPATION SOCIAL SECURITY ACCOUNT NUMBER MANGER 564-68-6626 NAME OF EMPLOYER ADDRESS OF EMPLOYER MAN WAH Book STORE 9334 CHUNG KING ST L.A. CALIF 90012 RECEIVED TRANS IN RET'D TRANS OUT COMPLETED FO RM I-131 (REV. 11-1-72) N 8 APR 1974 (over) mem"
}
