{
	"anumber": "A12994632",
	"id": "A12994632_0101",
	"page_index": 101,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0101/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "American Consulate General - 2 -, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Japan", "China"]
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1962, 1937, 1960, 2023, 1950, 1947, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 American Consulate General - 2 - October 5, 1962 In the interview, the petitioner furnished the folliwng information: Since becoming naturalized, she has given birth to an additional child by the name of FOIA (b)(6) FOIA (b)(6) Her mother, Pan (Pong) Git Jing (Ching) lives in Hong Kong and is about 70 years of age. She has never seen her blood father, Gee Lap Lin. She asserted that he died before her birth. Her stepfather died about three years ago in Hong Kong of cancer; his name was Shu Wai (Wy) Jee. In her immigrant visa, the petitioner's father's name was given as Chu Nup Woon. She stated that this name was partially correct, but that the actual name should have been written as Gee Lap Lim. The petitioner has no sisters but she does have one brother, who is the beneficiary. She has no maternal uncles and no paternal uncles. She does not know the names of her maternal or paternal grandparents. The petitioner alleges that she and her beneficiary/brother were separated during the Japanese invasion of China, and during that period she served in the Chinese Army. When they lived in the Ping Kong Village, the mother was a school teacher, teaching children in her home. The petitioner, her mother, and her brother lived together in Canton City for a period prior to 1937, except during summer vacations, when her brother and she attended school. She attended the Canton City First Girls School. Her brother attended the Hing Wah High School at Canton City, China. Her brother has also studied in Shanghai, China and in Japan, prior to World War II. He was approximately 20 years of age when he studied in Japan. He studied politics at the Ming Gee University in Japan for two or three years. The petitioner and her brother and mother were reunited in Canton City after World War II (approximately 1946 or 1947). The mother went to Hong Kong first in 1950 and the peti- tioner's brother followed in 1959. His wife, Young Hing Man, died in October 1960. The petitioner sends her mother and brother approximately $300.00 to $400.00 a year. There are attached hereto: (1) Individual photos of petitioner and beneficiary; (2) Signature specimen form of petitioner. (3) Blood type of petitioner in triplicate. On the basis of the interview, review of existing files and records, and the allegations contained in the petition, it is concluded that"
}
