{
  "anumber": "A12994632",
  "id": "A12994632_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, A12 994"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "by OMB #1115-0064 Expires 3/31/84 U. S. Department of Justice Immigration and Naturalization Service Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch 300 NORTH LOS ANGELES STREET 632 LOS ANGELES, CA 90012 File or A # A12 994 63 Date 2/23/1987 You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, AND PLACE shown below. Date 3/17/1987 WAI CHU 3379 DESCANSO DR. Time 9445 AM LOS ANGELES CA 90026 Place 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 FEDERAL BUILDING - DOWNTOWN ROOM NUMBER: 8-119 You MUST BRING the following with you: - This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED IN. - Alien Registration Receipt Card. ERNEST E. GUSTAFSON - Any evidence of Selective Service Registration. DISTRICT DIRECTOR - Any documents you have which you used in connection with any entries into the United States. - Those items noted on the reverse side of this letter which are applicable to you. - Filing Fee. NO CASH ACCEPTED BRING 550 MONEY ORDER OR CASHIERS CHECK ONLY. MAKE PAYABLE TO DISTRICT COURT BE PREPARED TO SPEND 4-5 HOURS FOR COMPLETION. Please KEEP this APPOINTMENT even if you do not have all the items noted above or those on the back. However, you MUST bring the Filling Fee. N-430A IMPORTANT - PLEASE SEE REVERSE"
}