{
  "anumber": "A12994632",
  "id": "A12994632_0084",
  "page_index": 84,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0084/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GRANT DEED, 1704395"
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1959,
        1943
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 1704395 800r 4565 PAGE 403 ICATION. No. GRANT DEED SHOU WY JEE AND KATHERINE C. WONG hereby do GRANT to KATHERINE C. WONG, A MARRIED WOMAN all that real property situated in the County of Santa Clara State of California, described as follows: Portion of Lots 16 and 17 as shown upon that certain Map entitled, \"The J.J. Morris Real Estate Company Subdivision of the Cogan Tract\" filed November 5, 1907 in Book M of Maps, at page 3, in the office of the County Recorder of the County of Santa Clara, State of California, described as follows: BEGINNING at a point on the Northeasterly line of First Street, (60 feet wide), formerly Third Street, distant thereon 191 feet Northwesterly from the Northwesterly line of W. Meadow Drive (70 feet wide) *formerly Diss Road, as said street and drive are shown upon the Map a bove referred to; thence Northeasterly and parallel with the Northwesterly line of W. Meadow Dr. 87 feet to the Southwesterly line of that certain Tract of land described in the Deed from Florence E. Ohler and Clinton Ohler, her husband to Fred O'Day and Mabel O'Day, his wife, dated August 12, 1943 and recorded August 16, 1943 in Book 1160 of Official Records, page 19, Santa Clara County Records; thence Northwesterly along the Southwesterly line of said property of 'Day 46.50 feet to a point; thence Southwesterly and parallel with the Northwesterly line of W. Meadow Dr., 87 feet to the Northeasterly line of First Street, thence Southeasterly along the Northeasterly line of First Street, 46.50 feet to the point of beginning. the Shou Wyfee Dated: October 2, 1959 Shou Wy Jee Katherine Catherine C. Wong e. wong SOLELY FOR RECORDER'S USE STATE OF CALIFORNIA COUNTY OF Sah Mateo BS. 1704395 On October 2, 1959 before me, Marjorie Cieciera a Notary Public 8007 4565 PAGE 403 in and for said San Mateo County and State, personally appeared Shou Wv Jee and FILED FOR RECORD Katherine C. Wong AT REQUEST OF City Title Insurance Co. OCT 5 I 34 1959 known to me to be the persons... whose name subscribed to the within instrument and acknowledged that they executed the same. SANTA OUNTY WITNESS my hand and official seal. (SEAL) Magine No, Marjorie Cieciera 2-16-63 Notary Public My Commission Expires: or 105 and 11-12 COMPARED- By Jan CITY TITLE INSURANCE COMPANY PA Accom. 20,000-472"
}