{
  "anumber": "A12994632",
  "id": "A12994632_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OF PERMIT TO REENTER THE UNITED STATES, 4-131 ( (Rev. 3-1-74)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1975,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITEDSE by NAPAME18/2023JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. FEE STAMP APPLICATION FOR ISSUANCE Orre XTENSION OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act tel: 628-7490 Use typewriter or print in block letters with ball-point pen. + issuance I hereby apply for (check one) extension Oakpermit to Reenter the United States FAMILY NAME (Capital Letters) FIRST MIDDLE IMPORTANT: You must submit your Alien Registration Receipt 1. YOUR NAME CHU WAT MAN Card with this application if you checked \"Issuance\" above. C/O IN CARE OF If you checked Extension.\" you must submit the reentry per- mit you wish to have extended. ADDRESS (City) 933144 CHUNG (State) King (ZIP St. (No and Street)(Ap No MAILING ALIEN REGISTRATION NUMBER Code) IN U.S. LOS ANGELES CALIF 90012 A- 12 - 994 - 632 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR MAY 27 1914 CHINA CHINA BROWN GRAY HEIGHT 5 FEET 6 INCHES VISIBLE MARKS AND SCARS NONE 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR AD JUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS CHO WAi GRANTED ADJUSTMENT WAS GRANTED SFR 04-01-66 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline. etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL SFR DATE OF ARRIVAL CHiNa Air LiNE Hong Kong TAIWAN 8 MAY 1974 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED,STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD CHINA Air LINE LA FATWANTORIA 30 23 DAYS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. Hong Kong Taiwan 13 Apr 1914 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY AST PERMIT APRIL 8 1974 (City and State) is ATTACHED LOS ANGELES, CALIF IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT, OCCUPATION: NAME and ADDRESS OF EMPLOYER Self EMLOYER / MAN WAH Co) MAN WAH Book store SOCIAL SECURITY ACCOUNT NUMBER 93314 CHung KingRd 564-68-6626 L. CALIF 90012 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) State/Province/District) (Country), J93314 CHong Kinged L.A 90002 22 Ask Man st 4thf 11. COUNTRIES TO BE VISITED (List each country Kowloon Hong Kong Taiwan LAWFUL AMARLET ADMISS TON VERIFIED 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): 2-2 I-151 4/4/25 Business INITIALS RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM I 131 (Rev. 3-1-74)Y OVER APR 1975 28 APR 1975"
}