{
  "anumber": "A12994632",
  "id": "A12994632_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, I-181 ( (Rev. 12-1-65)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1914,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place San Francisco, California Status as a lawful permanent resident of the United States is accorded: File No. A12 994 632 H-41 NAME CHU Wai-Man ADDRESS 15641 Jackson Street, San Francisco, California U.S.A. NATIONALITY DATE OF BIRTH PLACE OF BIRTH China May 27, 1914 Toysan, Kwangtung, China COUNTRY TO WHICH CHARGEABLE (It any) PREFERENCE: (If any) PRIORITY DATE China Sec. 203 (A) (5) 9-5-62 REMARKS As of APR 1 1966 at SAN FRANCISCO, CALIFORNIA (Month) (Day) (Year) (Place) Class of admission (insert coding symbol) Z2 P5-1 the requirements of the following provision of law having been fulfilled. Sec 203 (h) of the I & N Act Sec 13 of the Act of 9/11/57 Sec 244 ( ) ( ) of the I & N Act Private Law no. of the Sec 245 of the I & N Act Congress session Sec 249 of the I & N Act (Other law - Specify) (Applicable in all cases) Date Tobauary 8, 1966 3/3/66 Recommended by Louis T. Jofur Immigration Officer Date APR 1 1966 Approved District Director its For use by Visa Control Office MAR 7 1966 Date Foreign State China Preference Category Fifth Number 4717 Month of Issuance APRIL Signed VHA (Visa Office, Dept. of State) AR CARD MAILED MAY 20 1966 STATISTICS TO FILES MAY 20 1966 Date Form I-357 delivered CC: Visa Control Office, Visa Office, Department of State, Washington 25, D.C. for allocation of Immigrant visa number. State Director, Selective Service Form 1-181 (Rev. 12-1-65) FPI-LPC-12-65-50M-2283"
}