{
	"anumber": "A12994632",
	"id": "A12994632_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM I-131 ( (Rev. 9-2-77)N5"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "Mexico", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1914, 1975, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNSpreened by NARA 9/18/2023TICE Form approved. OMB No. 43-R0052. Immigration and Naturalization Service FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES 7490 as provided in section 223 of the 628-7409 Immigration and Nationality Act Use typewriter or print in block letters with ball-point pen. Phonei 628-3449 issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME CHU WA MAN IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked \"Issuance\" above. If you IN CARE OF C/C MAN WAH Co., 932 CHUNG KING RD., LA. checked \"Extension\" you must submit the reentry permit you wish to have extended. (No. and Street) (Apt. No.) MAILING ADDRESS CHUNG KING ST. ALIEN REGISTRATION NUMBER (2IP Code) IN U.S. (City) LOS ANGELES (State) CA. 90012 A. 12-994-632 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 05-27-1914 CHINA CHINA BROWN GRAY HEIGHT 5 6 VISIBLE MARKS AND SCARS FEET INCHES NONE 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL ORDATE AS OR IMMIGRATION OFFICE WHICH WHICH GRANTED ADJUSTMENT WAS CHU WAI - MAN or Q356 SAN FRANCISCO 47-166 GRANTED ADJUSTMENT OF STATUS FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline. etc.) NoR nest AIRline FATHER'S NAME TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME Sur Y. Gee KET T. 5. FILL IN THE ITEMS IN THIS BLOCK AS TO lost ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Conada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHU WA MAN SAN FRANCISCO 5-6-1973 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Los ANGZ-LES 12-25-76 Jone mouth NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL AIR SIAM AIRLINE FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your lost departure from the United States, in the order HONG KONG visited INVITISION TESTIVE WITHIN DATE & PORT OF LAST DEPARTURE FROM U.S. MAY23,75L.A 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT APR=28, 1975 (City and State) IS ATTACHED Los ANGELES IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON IF PERMIT IS ATTACHED. STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20. INCLUSIVE 9. OCCUPATION NAME and ADDRESS OF EMPLOYER PRESENT SOCIAL MANAGER SECURITY ACCOUNT NUMBER OWNER of MAN WAH Book STORE MAN WAH Book STORE 564368-6626 9331/4 CHUNG KING STREET 10. MAILING ADDRESS ABROAD (Number and Street) 4th LOSANGELES, CALIF 90012 (State/Province/District) (Country) 11. 618, COUNTRIES TO KING'S BE VISITED (List each country) ROAD fl RuBy (City/Town) COURT HONG KONG HONG KONG, TAIWAN (REPUBLIC of CHINA) 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): TRAVEL RECEIVED TRANS. IN RET'D-TRANS. OUT COMPLETED FORM I-131 (Rev. 9-27-75)N OVER DEC 1976 LAB"
}
