{
	"anumber": "A12994632",
	"id": "A12994632_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4 ( 901-78)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 2023, 1963, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form Approved IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-R0079 AUG 2.3 1979 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: NO RECORD LOS IMMIGRATION AND IATURALIZATION SERVICE Files 19005 2/1/20 8:00 C FRC Index ALIEN REGISTRATION ( Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS BE SURE Y EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT PLEASE PRINT OR TYPE.) G360 sent Name CHU, WAI MAN No. A 12-994-632 Section of Law Date: (Leave Blank) (1) My full true and correct name is CHU, WAi MAN (Full true name without abbreviations) (2) I now live at 933 1/4 chung King Road - Les angeles, Ca 90012 (Number and street, city, county, state, Zip code) (3) I was born on 5-27-14 in canton China (Month) (Day) (Year) (City or town) (County, province, or state) (Country) (4) I request that my name be changed to Same as above (5) Other names I have used are: No (Include maiden name) Sex: Male Female (6) My father's name GEE SHU WY (7) My mother's maiden name Pat Kit chung (8) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (9) Can you read and write English? Yes No (10) Can you speak English? Yes No (11) Can you sign your name in English? Yes No (12) My lawful admission for permanent residence was on 4 1 66 under the name of Chu, wai Man (Month) (Day) at San Franciso, (Year) CA on Northwest aireine (City) (State) (Name of ship, airline or adjustment of status) (13) Since that date I have resided continuously in the United States and continuously in the State of California where I now live since 5-6-1963 During the last five years I have been physically present in the United States for a total of 60 months. (14) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) April 1966 PRESENT TIME 933 1/4 chung King Rd Les angeles, Calif (b) 19 19 (c) 19 19 (d) 19 19 (15) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES 1-4-79 1-26-79 china airline LOS angeles airport 2-17-78 3-31-78 11 \" 3-8-77 3-31-77 \" 11 (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES (16) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: Form N-400 (Rev. 9-1-78) N (1) #153583 (OVER) 2.16.84"
}
