{
	"anumber": "A12994632",
	"id": "A12994632_0071",
	"page_index": 71,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0071/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Block II—Information Pertaining to Alien Beneficiary, NARA Form 1024"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1942, 1945, 1914, 2023, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "your Screened by NARA, 9/18/2023 Block II.-Information Pertaining to Alien Beneficiary 7. Name of alien the MAN CHU me WAI (First name) (Middle initial) (Last name) If this petition is for a woman give name married her maiden VILLARE 8. Alien was born MAY 3, 1914, /TOI SHAN, KWANGTUNG, CHINA (Date) (City or town) (State or Province) (Country) 9. Relationship of alien to petitioner BROTHER Is the alien related to you by adoption No 10. If this petition is for your spouse or child, give the following: Date and place of your present marriage Number of your prior marriages Number of prior marriages of spouse 11. If this petition is for a child, is the child married? Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state. 12. If this petition is for a brother or sister, are your parents the same as the alien's parents? AMERICAN CITIZEN If not, submit a separate statement giving full. details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 13. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner. CHI 14. If this petition is for a married brother, sister, son, or daughter of a United States citizen, give the following: Name of alien's spouse and country of birth Names, birthdates, and countries of birth of alien's children YIU MAN CHU, 11/28/39, CHINA (m) YIU CHUNG CHU, 5/4/1942, CHINA (n) YIN MOY CHU, 1/12/1944, CHINA (F) HOI WAN CHU, 9/5/1945, CHINA (F) Full address of alien's spouse and children 15. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: 16. Has this alien ever been deported from the United States? NO If so, give alien registration number, reason for deportation, and place where deportation hearing was held: 17. Address in the United States where alien will reside 3030 ROSS RD, PALO ALTO, CALIFORNIA 18. Present address of alien 22 POK MAN ST, 4/F. KOWLOON , HONG KONG 19. Check the appropriate box below and furnish the information required for the hox checked: HONG KONG B.C.C. Alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at , (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) AI SUBC SALPTOR Block III.-Oath or Affirmation of Petitioner swear (affirm that I know the contents of this petition signed by me and that the statements herein are true and correct. SWORN TO (Catherine (Signature of petitioner) Chu (See Instruction Wong No. 5) I Subscribed and sworn to (affirmed) me this hura before 5 day of Sept , A.D. 19 67 at few Flaming [SEAL] My commission expires SEP 22 empurgers ITs (Signature of officer administering oath) (Title) STATE you need more space to answer fully any questions on this form, use a separate sheet, identify each answer with the the corresponding question, and date and sign each sheet.) AND 2"
}
