{
  "anumber": "A13073806",
  "id": "A13073806_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13073806_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "A QUIEN CORRESPONDA, P.M./1059"
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 A QUIENCORRESPONDA : El C. Teniente Coronel de Cab., Rosendo Hernandez - Sanchez, Inspector de Policia de esta ciudad, CERTIFICA :- que hecha una búsqueda en el archivo de la Oficina a mi cargo, no se encontraron ningunos ante cedentes penales en contra del C. RAFAEL SANCHEZ VEGA, o- riginario del Rancho El Comal, Mpio., de Uriangato, Gto.- y vecino del de San Chyetano, perteneciente a este Distri to, de quien aparece al margen su fotograffa y por el re- verso sus huellas digitales para su debida identificación. A pedimento del interesado y para los usos legales HEREE que mejor le convengan, expido el presente por duplicado- VUFIBLA GTO en la ciudad de Yuriria del Estado de Guanajuato, a los 7 siete dias del mes de febrero de 1962 mil novecientos se senta y dos GENERAL UNIDOS way the spector de Policia, ROSANCO Hernandez Sanchez El suscrito Presi-dente Municipal Int. de este lugar CERTIFICA :- que la firma que antecede es autenti- ca y corresponde a la que usa en todos sus negocios el C. - Teniente Coronel de Cab., Rosendo Hernandez Sanchez, Ins -- peetor de Policia de esta ciudad. A pedimento del interesado y para los usos legales - MEXICO MEXICO que mejor le convengan, expido el presente por duplicado - 1PESO 1PESO E.P. EP en la ciudad de Yuriria del Estado de Guanajuato a los 7 - siete dias del mes de febrero de 1962 mil hovecientos se-- SERVIC PESOJU PESON senta y dos. P.MEXICO E.P.MEXICO DEPARTMENT El Presidente Municipal Int., P.M./1059. Damian Nazquez González. GTO. James E1 Secretario, TERRIRIA, To Jesus Guzman Cintora."
}