{
	"anumber": "A13073806",
	"id": "A13073806_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13073806_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARW 07/29/2023, Form I-693"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Unidos 6/29/2023 Estados Página 3 inmigrantes contesten las siguientes preguntas. Este requisito no implica que en el cuestionario. Sus respuestas ayudarán al funcionario consular a establecer su elegibilidad Anteriorspoke cualquiera de estas preguntas, sirvase explicar por completo su incapacidad para hacerlo en una hoja aparte vase tener presente que cualquiera que sea la naturaleza de sus respuestas a estas preguntas no se considerará, nece- para obtener una visa. Por ejemplo, si usted ha sido arrestado O convicto de una falta de un delito de menor cuantía, el haber sido usted arrestado O convicto no influye, necesariamente, para declararlo consular inelegible puede leve y el funcionario 33. Sirvase dar la respuesta correcta a las siguientes preguntas poniendo un círculo alrededor de \"Si\" O \"No.\" para (1) (a) ¿Ha sido usted arrestado, acusado o convicto de un crimen u otro delito? (Have you ever been arrested for, charged with, indicted for, or convicted of, a crime or other offense?) Yes No Sí No (b) ¿Ha sido usted recluído en una prisión O carcel civil? (Have you ever been confined in a civilian prison or jail?) Si No (c) ¿Ha sido usted recluído en una prision O cárcel militar? (Have you ever been confined in a military prison or jail?) Si No (d) ¿Se ha dedicado usted a la venta, compra O tráfico ilícitos de drogas narcóticas? (Have you ever been engaged in illicit buying, selling or handling of narcotic drugs?) Sí No (e) ¿Se le ha otorgado a usted perdón O amnistia, decreto de rehabilitación u otro acto de clemencia O acción semejante? (En caso afirmativo sirvase explicarlo) (Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If so, explain)) Si No (2) (a) ¿Ha sido usted recluido en un asilo de mendigos (casa de caridad o institución de beneficencia)? (Have you ever been placed in an alms- house (poorhouse or charitable institution)?) Sí No (b) ¿Es usted indigente; mendigo de profesión O vago? (Are you a pauper, professional beggar or vagrant?) Sí No (c) ¿Padece usted de un defecto físico, enfermedad o invalidez que pueda afectar su capacidad para ganarse la vida? (Are you now afflicted with a physical defect, disease or disability which may affect your ability to earn a living?) Sí No (d) States?) ¿Le será posible a usted atender a su sostenimiento en los Estados Unidos? (Will you be able to support yourself financially in the United Sí No (3) (a) ¿Ha tenido usted uno o más ataques de demencia? (Have you ever had one or more attacks of insanity?) Sí (b) ¿Está O estuvo usted afectado du personalidad psicopática, epilepsia, defecto mental, paroxismos, desmayos, convulsiones, O neurastenia? (Are you now or have you ever been afflicted with psychopathic personality, epilepsy, mental defect, fits, fainting spells, convulsions or a nervous breakdown? Si No (c) ¿Es o ha sido usted adicto al uso de narcóticos o drogas o es O ha sido usted alcohólico crónico? (Are you now or have you ever been a narcotic or drug addict or chronic alcoholic?) Sí No (d) ¿Ha recibido usted tratamiento en un hospital, institución O en otro lugar por padecer de demencia O enajenación mental O por ser adicto a drogas y narcóticos O por alcoholismo? (Have you ever been treated in a hospital, institution or elsewhere for insanity or other mental disorder or for drug or narcotic addiction or alcoholism?) Si No (e) ¿Ha padecido usted de lo siguiente? (Have you ever had any of the following:) (A) Tuberculosis en alguna de sus formas (Tuberculosis in any form?) Sí No (B) Lepra (Leprosy?) Sí No (C) Cualquiera otra enfermedad contagiosa (Any other dangerous contagious disease?) Sí No (4) (a) ¿Es usted polígamo? ¿Practica usted la poligamia O aboga usted por la práctica de la poligamia? (Are you a polygamist, do you practice polygamy, or do you advocate the practice of polygamy?) Sí (b) ¿Es O ha sido usted prostituta, conseguidor O se sostiene usted totalmente O en parte con el producto de la prostitución? (Are you or have you ever been a prostitute, procurer, or supported wholly or in part from the proceeds of prostitution?) Sí No (c) ¿Va usted a los Estados Unidos para dedicarse a actos-sexuales inmorales, a la prostitución u otro vicio ilegal comercializado? (Are you going to the United States to engage in an immoral sexual act, in prostitution, or other unlawful commercialized vice?) Sí No (5) (a) ¿Ha solicitado usted antes una visa para entrar a los Estados Unidos de inmigrante o de no inmigrante (Si la respuesta es afirmativa sirvase indicar el lugar y la fecha en que la solicitó, y si le fué expedida la visa.) (Have you previously applied for a visa to enter the United States either as an immigrant or as a nonimmigrant?) (If answer is yes, state where and when, whether you applied for a Si No nonimmigrant or an immigrant visa and whether the visa was issued.) (b) ¿Se le ha negado a usted la entrada a los Estados Unidos durante los últimos doce meses (si la respuesta es \"Si,\" sirvase presentar pruebas de que el Procurador General le ha permitido solicitar de nuevo su entrada a los Estados Unidos). (Have you been refused ad- mission to the United States during the last twelve months?) (If the answer is yes submit evidence that the Attorney General has Sí No consented to your reapplying for admission into the United States) (c) ¿Ha sido usted (Have you ever been) (A) ¿Arrestado y deportado de los Estados Unidos? (arrested and deported from the United States?) Sí No (B) ¿Expulsado voluntariamente de los Estados Unidos por cuenta de este Gobierno como persona que ha caído en la desgracia? (volun- tarily removed from the United States at United States government expense as a person who fell into distress?) Sí No (C) ¿Expulsado de los Estados Unidos como extranjero enemigo? (removed from the United States as an alien enemy?) Si No (D) ¿Expulsado de los Estados Unidos a costa del Gobierno en vez de deportación? (removed from the United States at Government Sí No expense in lieu of deportation?) (Si la respuesta a cualquiera de las preguntas que anteceden es \"Si,\" sirvase presentar pruebas de que el Procurador General le ha dado permiso para solicitar nuevamente su entrada a los Estados Unidos) (If the answer to any of the above questions is yes, submit evidence that the Attorney General has consented to your reapplying for admission into the United States.) (6) (a) ¿Ha tratado usted de obtener una visa u otros documentos fraudulentamente O falseando intencionalmente los hechos para entrar a los Estados Unidos? (Have you ever attempted to obtain by fraud or willful misrepresentation a visa or other documentation to enter the Sí No United States?) (b) ¿Ha obtenido usted una visa u otros documentos fraudulentamente O falseando intencionalmente los hechos para entrar a los Estados Unidos? (Have you ever obtained by fraud or willful misrepresentation a visa or other documentation to enter the United States?) Si No (7) (a) ¿Es O a sido usted inelegible para naturalizarse en los Estados Unidos? (Are you now or have you ever been ineligible for United States citizenship?) Si NO (b) ¿Ha salido usted de los Estados Unidos O ha permanecido fuera de ellos para evitar O evadir el servicio militar en tiempo de guerra o de emergencia nacional? (Have you ever departed from or remained outside of the United States to avoid or evade military service in time Sí No of war or national emergency?) (c) ¿Se ha inscrito usted en una junta de reclutamiento, de conformidad con la Ley de Servicio Militar Obligatorio de los Estados Unidos? (Have you ever registered with a draft board under the selective service laws of the United States?) Sí No (8) ¿Puede usted, si es mayor de 16 años, leer y comprender algún idioma O dialecto? (Can you, if you are over sixteen, read and understand some language or dialect?) Sí No (9) ¿Ha ayudado usted, en beneficio propio, a otro extranjero para entrar O tratar de entrar a los Estados Unidos en infracción a las leyes de los Estados Unidos? (Have you for gain ever assisted another alien to enter the United States or try to enter the United States in violation of Si the laws of the United States?) No"
}
