{
  "anumber": "A13073806",
  "id": "A13073806_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13073806_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 6/29/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        1942,
        1962,
        2023,
        1940
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 19. The persons in whose behalf such information is requested are as follows: Full name Relationship DARIO SANCHEZ MARTINEZ Heis my son Place of birth Date of birth URIANGATO, GUANAJUATO, MEXICO Present address June 26, 1940 Callejón Sonora y Calle 11. No. 1649. San Luis R.C., Sonora, Mexico. Full name Relationship ELISEO SANCHEZ MARTINEZ He is my son Place of birth Date of birth URIANGATO, GUANAJUATO, MEXICO June 17, 1942 Present address Callejón Sonora y Calle 11. No. 1649. San Luis R.C., Sonora, Mexico. FOIA (b)(6) Full name Relationship ROSA MARTINEZ ALCANTAR She is my wife Place of birth Date of birth URIANGATO, GUANAJUATO, MEXICO. September 15 1912 Present address Callejon Sonora y Calle 11. No. 1649. San Luis R.C., Sonora, Mexico. Full signature of applicant asnow used Rafaelvegu sauches RAFAEL VEGA SANCHEZ. INSTRUCTIONS TO THE APPLICANT Application should be executed and SIGNED in duplicate and submitted to the Immigration and Naturalize tion office shown on the reverse hereof. A fee of three dollars ($3) must accompany the application. Remittanoes should be made payable to the \"Immigration and Naturalization Service, Department of Justice, 11 If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.'' Do not send ooins or postage stamps. A postal, express, OF bank money order or equivalent is preferred. Show your Alien Registration Number in the block in the upper right-hand corner on the reverse hereof. [NOT TO BE FILLED OUT BY APPLICANT] Immigration and Naturalization Service at Phoenix, Arizona Date 3-1-67 Considered, and the Seoretary of State is hereby respectfully informed that entry has been verified as follows: Name Rafael SANCHEZ Vega Port of entry Calexico, California Date March 17, 1962 Manner of arrival afoot 1581.1 XIN30MJ Was XWAX XOU lawfully admitted for permanent residence. 2961 NU 2E DL REMARKS: (Show \"Symbol\" or \"Section\" of admission for after Tatties 87/0-1 JOHN A MURPHY 0-80-24). ACTG DISTRICT DIRECTOR"
}