{
  "anumber": "A13073806",
  "id": "A13073806_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13073806_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 230 North First Avenue Phoenix, Arizona 85025 March 1, 1967 Rafael Vega Sanchez INFO I-550 P. O. Box 249 A-13 073 806 San Luis, Arizona Reference is made to your recent letter or application. In this connection, please read and comply with the instructions checked below: The information requested has Your request should be directed to: been sent to: American Consulate, Apdo Postal 972, Hermosillo, Sonora, Mexico Your request comes within the jurisdiction of our office shown below. has been referred to that office for appropriate attention and all further correspondence with regard to this matter should be sent directly to: No record could be identified as relating to the subject of your inquiry. This Service, therefore, can be of no assistance to you in the matter. A fee is required in the amount of Money order or check should be made payable to the \"Immigration and Naturalization Service, Department of Justice\". THE ATTACHED COPY OF THIS LETTER SHOULD BE RE- TURNED WITH YOUR REMITTANCE. Fee is returned in the amount of Because no fee is required at this time. Because an incorrect fee was submitted. Fee for this service is For resubmission with the enclosed application. Sincerely yours, JOHN A MURPHY ACTG DISTRICT DIRECTOR Form G-343 (Rev.12 -5 -63)"
}