{
	"anumber": "A13073806",
	"id": "A13073806_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13073806_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAST ENTRY OF AN ALIEN, I-550"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1960]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service Budget Bureau No. 43-R358,1 APPLICATION FOR VERIFICATION OF LAST ENTRY OF AN ALIEN (See instructions on Reverse) (Fill in with typewriter OF print In blook letters In ink) Take or mail to- Fee Stamp IMMIGRATION AND NATURALIZATION SERVICE, $3 FEE PAID No.53-1 650 Capitol Mall, Room 1110 Immigration and Inturalization Service Sacramento, California 95814 this Sacramento. Colif. Date 9-14-64 Verified A Allen Registration No. A-13- 073-806 NEc 9-17-64 NDC I request that the American Consul at Mexico City be furnished a verification of my last lawful admission into the United States for permanent residence to be used in connection with the person(s) listed below: (First) Sau NO RECORD F 1. My name Is: (Middle) (Last) Rafael Vega Sanchez 2. Present address: 1374 Smith Rd. Yuba City California 5. Date of birth 4. Place of birth 05-26-14 Uriangato Gtm Mexicolova. 5. I am a citizen or national of: (Country) Mexico 6. Father's name 7. Mother's maiden name Esteban Sanchez Pudenciana Vega INFORMATION IN THESE BLOCKS PERTAIN TO MY LAST ARRIVAL INTO THE UNITED STATES 8. I was admitted under the name of: 9. Port of arrival Rafael Vega Sanchez Cal 10. Date of arrival (Month) (Day) (Year) 11. Name of vessel or other means of conveyance 103-11-16 Bus 12. was 13. My occupation was: At that time I married was not Laboror 14. Last permanent residence before my last arrival was: Contadero # 32 Yuriria Gto Mexico 15. Name and address of person in the United States to whom I was destined at the time of my last entry was: Montalvo Growers Ass. 433 E. Main St. Ventura Calif 16. At time of last entry I was accompanied by: No One 17. At the time of my last entry I traveled on an immigrant visa a permit to reenter a passport an allen registration receipt card and I have not been absent from the United States since. 02-10-64 18. I was was not in the United States before my last admission for permanent residence: (If so give dates of entry and departure) a, b. c. From From From 1960 To 7067 Ag Bracero To To Form 1-550 (Rev. 5-25-61) OVER"
}
