{
  "anumber": "A13580960",
  "id": "A13580960_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0049/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPARY STAY"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R068.9 AP CATION TO EXTEND TIME OF TEMP ARY STAY IMPORTANT PLEASE READ ATTACHED INSTRUCTIONS BEFORE FILLING OUT APPLICATION. TYPE OR PRINT IN INK WITH BLOCK LETTERS. alpha IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTIONS ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. PART I 1. (First Name) (Middle Name) (Last Name) FILE NUMBER GENiA LAUTURE 2. OTHER NAMES (Include all other past and present names: a married woman must give her maiden NONE 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (Zone) (State) (C/O) 4816 w. Lon Angeles 16 CALIF 4. DATE OF BIRTH 5/13/09 COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 2/18/63 JACMEL HAiTi HAITI W.I. 5. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS OF LAST ARRIVAL 4/1/61 Miami FLA.15 PAA 432 6. PASSPORT NUMBER PASSPORT ISSUED BY (Name of Country) PASSPORT EXPIRES ON 522-61 HAITI W.I. 2/5-64 7. MARITAL STATUS IF MARRIED, GIVE NAME AND ADDRESS OF SPOUSE SINGLE No NAMES AND ADDRESSES OF CHILDREN Elisabeth Hyppolite R.N. 4816 W. 21 LINDA LAUTURE, 616w 113 ST N.Y. 8. OCCUPATION SOCIAL SECURITY NUMBER RETIRED NONE 9. (Insert \"HAVE\" or \"HAVE NOT\") I have NOT BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, GIVE THE FOLLOWING: NAME AND ADDRESS OF EMPLOYER OR BUSINESS NONE KIND OF EMPLOYMENT OR BUSINESS NONE INCOME PER WEEK FROM SUCH EMPLOYMENT OR BUSINESS DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED NONE NONE 10. MEANS AND SOURCE OF SUPPORT WHILE IN THE UNITED STATES 11. I I AM live VISITING THE with FOLLOWING my PERSONS daughter IN THE UNITED STATES: Elisabeth Hyppolite R.N. who supports me NAME RELATIONSHIP ADDRESS Elisabeth Hypolite daughter 4816w 21 staceh LAIL 12. DATE ON WHICH AUTHORIZED STAY EXPIRES 13. DATE TO WHICH EXTENSION IS REQUESTED 14. REASON FOR COMING TO THE UNITED STATES July 30 august 18. 1963 15. REASON FOR REQUESTING viviting EXTENSION my daughter For my eyes here 16. have no and to care for me is Haih I Would like to continue trailement I ATTACH WRITTEN STATEMENT OF DATED IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE, AND I MAKE IT PART OF THIS APPLI- CATION. (See paragraph 7 of instructions.) 17. DATE ON WHICH I WILL DEPART FROM U.S. NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. OF DEPARTURE 18. (Insert \"AM\" or \"AM NOT\") I IN POSSESSION OF A TRANSPORTATION TICKET FOR MY DEPARTURE I certify that the above is true and correct. DATE CITY AND STATE SIGNATURE OF APPLICANT Form 1-539 (Rev. 11-1-61) Special Instructions for Students: After you have completed PART I, PART II must be completed by an authorized school official."
}