{
	"anumber": "A13580960",
	"id": "A13580960_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Mexican-American Social Service, 2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1963]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 MEXICAN- AMERICAN SOCIAL SERVICE (SERVICIO SOCIAL MEXICO-AMERICANO) DELFINO VARELA, M. S. W. 2411 BROOKLYN AVE. March 18, 1963 SOCIAL WORKER LOS ANGELES 33. CALIFORNIA ANGELUS 1-2047 Immigration and Naturalization Service 510 South Vermont Los Angeles 5, California Gentlemen: We earnestly hope that you will find it possible to give Miss Lauture at least another thirty days extension on her voluntary departure from the United States. This will give us time to receive a reply from the American Embassy at Mexico informing us whether or not they will be able to accept jurisdiction of her application there. It will also give us time to receive a change in the entry permit from the Mexican government. The entry issued to Miss Lauture was for Tijuana, since we believed that that Consulate might accept jurisdiction, but we had to request a change when we were informed otherwise. For reference we are enclosing herewith copies of our letters to the American Embassy, the entry permit granted by the Mexican government, and a copy of our letter to that government requesting a change in the permit. If the American Embassy does not accept jurisdiction, although we believe that they will, we will then request the American Consulate at Montreal to accept jurisdiction, and make arrangements for Miss Lauture to enter that country. Very truly yours, Delfins Uarele Delfino Varela, Social Worker enc. 4 ASSISTANCE & GUIDANCE WITH IMMIGRATION. MARITAL, & PERSONAL PROBLEMS"
}
