{
  "anumber": "A13580960",
  "id": "A13580960_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Spanish), FS-510"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Haiti",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 Form FS-510 (Spanish) Página 4 32. (CONTINUED) (10) ¿Es usted un exvisitante del programa de canje de personas que no ha residido en el exterior durante dos años después de su salida de los Yes Estados Unidos? (Are you a former exchange visitor who has not resided abroad for two years following your departure from the United No States?) Sí No (11) ¿Es O ha sido usted (Are you now or have you ever been) (a) ¿Anarquista? (an anarchist?) Sí No (b) ¿Partidario de oposición a todo gobierno constituído? (an advocate of opposition to all organized government?) Sí No (c) ¿Partidario del Comunismo? (an advocate of Communism?) Sí No (d) ¿Miembro o afiliado del Partido Comunista o de sus organismos afiliados o de una organización dominada por los Comunistas o de una organización que aboga por el derrocamiento por la fuerza de todos los gobiernos constituidos, o de cualesquiera otras organizaciones semejantes? (a member of, or affiliated with, the Communist Party or affiliated organization, an organization advocating Communism Sí No or a Communist-dominated or controlled organization or an organization advocating the overthrow by force of all organized govern- ment or any other similar organization?) (Si la respuesta a cualquiera de las preguntas que anteceden es \"Si,\" sirvase dar explicaciones, indicando las fechas y la naturaleza de las actividades de los miembros) (If the answer to any of the above questions is Yes, explain, giving dates and nature of activities or membership.) (12) ¿Trata usted de entrar a los Estados Unidos desde el Canadá, Mexico o desde una isla adyacente a los Estados Unidos dentro de dos años después de su llegada a dicho país o isla? (Si la respuesta es \"Si\" sirvase indicar el nombre de la compañía de transportes en que llegó o trata de entrar en ese país o isla.) (Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States Sí No within two years after arrival in such country or island?) (If answer is Yes, give the name of transportation you entered or intend to enter such country or island) company by which 33. ¿Le ayudaron a usted a llenar esta solicitud? (De ser así, sirvase anotar el nombre y la dirección de la persona o personas que le ayudaron, indicando si son assisting you indicating whether relative, friend, attorney, travel agent, or other) parientes, amigos, o abogados, agentes de viajes, etc.) (Were you assisted in completing this application?) (If so, give name and address of person or persons Nombre (Name) Direccion (Address) Mexican-American Social Service 409 N. Soto St. Immigration Consultants Los Angeles, Calif. 90033 NO SE DEBEN LLENAR LAS SIGUIENTES PARTES El funcionario consular le ayudará a contestar las siguientes partes 34 y 35. 34. Declaro estar exento de exclusión para recibir una visa de conformidad con el artículo de la casilla 32, por las siguientes razones: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 32 for the following reason:) n/a 35. Declaro ser inmigrante de cuota preferencial (I claim to be a) conforme a la cuota preference quota immigrant under the quota.) L'inmigrante no incluido en cuota (Nonquota immigrant) Mi declaración se basa en los hechos siguientes: (My claim is based on the following facts:) I was born in Haiti Reconozco que estoy obligado a entregar mi visa al empleado de Inmigración de los Estados Unidos en el lugar donde solicité entrada al país y que, además, la posesión de la visa no me da derecho a entrar a los Estados Unidos si se encuentra que en el mo- mento no soy admisible, de conformidad con las leyes de inmigración. that (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) Reconozco que toda declaración hecha por mi intencionalmente, falseada o enganosa, o, el ocultar expresamente algún hecho esencial me puede sujetar a exclusión permanente de los Estados Unidos y, si se me admite a los Estados Unidos, me puedo ver sujeto a enjuiciamiento criminal o a deportación, O a ambos. exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent El infrascrito, solicitante de una visa de inmigración a los Estados Unidos, juro (o afirmo) solemnemente que todas las declara- ciones consignadas en esta declaración han sido hechas por mí, inclusive los círculos de las casillas en el artículo 32, y que son ver- daderas y completas, a mi mejor y más leal saber y entender. Asimismo, juro (o afirmo) que en caso de ser admitido a los Estados Unidos no me dedicare a actividades que sean perjudiciales al interés público o que pongan en peligro el bienestar, la seguridad y la tranquilidad de los Estados Unidos; a actividades prohibidas por las leyes de los Estados Unidos relacionadas con espionaje, sabotaje, desorden público, O a otras actividades subversivas a la seguridad nacional; a toda actividad que tenga por objeto oponerse, dominar o derrocar el Gobierno de los Estados Unidos por medio de la fuerza, la violencia u otros medios anticonstitucionales; que no me afiliaré o participaré en las actividades de toda organización que esté inscrita o se requiera su inscripción conforme al Artículo 7 de la recibido explicación de todo punto que no entendía con claridad. Ley de Control de Actividades Subversivas de 1950. Reconozco, además, todas las declaraciones que anteceden, pues he pedido y cation (I, have the undersigned been made applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this appli- do further swear (or affirm) by me, that, including if admitted the encircling of items in part 32, and are true and complete to the best of my knowledge and belief. into or endanger the welfare, safety, or security of the United States: in activities which engage would activities be prohibited which by would the laws be prejudicial of the United to the public interest, the United States, I will not in espionage, to, or the control sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which States is the opposition relating to or participate in the or activities overthrow of of, the Government of the United States. by force, violence, or other unconstitutional means; or join, affiliate with, any organization which is Act of 1950. I understand all the foregoing statements, having asked for and obtained registered an explanation Section on every 7 of point the Subversive which was Activities not clear to Control me.) registered or required to be under gerag-Lauture Firma del Solicitante p. October 16, 1963 (Signature of applicant) Montreal Canada Firmado y jurado ante mi el día 16 de October Subscribed and sworn to before me this de 19.63 day of 19 Service No. Richard H. Stock Tariff Item No. Vice-Consul of the Fee paid U.S. $5.00 CY Equiv. United States of America Oficial Consular (Consular Officer) U.S. GOVERNMENT PRINTING OFFICE 1961-O-615972 SERVICE 20 Cmes"
}