{
	"anumber": "A13580960",
	"id": "A13580960_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States of America Immigrant Visa and Alien Registration, G-360"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1963, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED S1 : OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION 1- 2070862 OF: (Family name) (First name) (Middle name) LAUTURE Genia PORT OF 014-HIG ACTION OF SPECIAL INQUIRY OFFICER The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in and taken no appeal taken the United States at this port on under Bus Symbol (Name of vessel or flight No. of aircraft) and was inspected by me and Section of the Immigration and IMM. & NAL SERVICE HIGHGATE SPRINGS, VT. 7 Nationality Act. ADMITTED OCT 17 1963 Special Inquiry Officer. detained for further inquiry by special officer under CLASS ACTION ON APPEAL Section D-1 Symbol TO of the Immigration and ADMITTED Nationality Act EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN CONSULATE GENERAL facts stated in the application. IMMIGRANT CLASSIFICATION AT MONTREAL CANADA NONQUOTA (Symbol) QUOTA (Symbol) Richard H. Stock 0-1 of the United of America Pickand it flock VISA PETITION NO., IF ANY of the United States of America. IMMIGRANT VISA NO. QUOTA 2043 ISSUED ON (Day) (Month) (Year) 16th October 1963 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 4th December 1963 NATIONALITY (If stateless, so state, and give previous nationality) Haitien PASSPORT NO. 522-61 OR OTHER TRAVEL DOCUMENTS (Describe) Service No. ISSUED Genia LAUTUME TO Tariff Item No. Fee Paid $20 Seeretairerie Dietat de L'Interieure Local Cy equiv. STATISTICS BY Form I-151 issued ON March 20, 1961 EXPIRES February 5, 1964 FORM 5-61 S-511 360 SENT mr 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE NOV 4 1963 MATER vies. OT"
}
