{
  "anumber": "A13580960",
  "id": "A13580960_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0040/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2018,
        2023,
        1909,
        1963,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 RECORD ILLEGAL ALIEN APPREHENDED OR L TED Family Name Given Nam Initial Color of Eyes Color of Hair LAUTURE LATURE Genia F Blue Brown Nationality (Citizenship) Passport Number File Number Height Weight Occupation Haiti 522-61 A 13 580 960 68 125 Housewife United States Address Scars or Marks 616 West 113 Street, Apt 5, New York City none Airline & Flight No. or Vessel of Arrival 4-1-61 B-2 Passenger Boarded At Social Security No. F.B.I. No. PAA 432 MIA Haiti none Permanent Address Method of Location 113 Avenue Couplard, St Antoine, Port-au-Prince, Haiti 524 Birthdate Date of Action Location Code Status at Entry Status When Found May 13, 1909 6/13/63 NYC B-2 Overstay Birthplace Length of Time Illegally in U. S. Alien Registration Jacmelde LaValle, Haiti 2 mos Visa Issued At Lifted (At/Nex) 8.30 Date Port- Au-Prince-Haiti Form I-94 400 Broome St, NYC 6/12/63 Not Lifted Date Visa Issued Send C. 0. Record Check To: / By March 28, 1961 NYC Bishop-Mann Immigration Record Criminal Record none none Name, Address and Nationality of Spouse Number & Nationality of Minor Children single 1 Haiti Father's Name and Nationality Mother's Name and Nationality Alpenier Lature, Haiti Gervina Bocicaut, Haiti Property in U. S. Not in Immediate Possession Deportation Charge Clothes and personal property at the above U S address Narrative (Time, Date, Place, Manner of Last Entry - Furnish Details) (See Reverse) Subject was located as a result of liason with the NYC Police Dept. She is a native and citizen of the Republic of Haiti who last entered the United States at Miami, Florida via PAA 432 as a B-2 visitor antik on 4-1-61 until 7-30-61 and applied for an extension at Los Angles on 2018-63, extension denied and VD to 3-18-63 and placed under Docket Control at Los Angles. On 3-19-63 RD date extended to 4-18-63 and also to 4-25-63 at Los A ngles. On April 18, 1963 the subject left Los Angles, California without notifying Immigration and proceeded to New York City via TWA. She is presently visiting her daughter one, Linda Lature of the above S address. Linda Lauture is a LPRA A FOIA (b)(6) Subject does not have a return ticket to Haiti. She depends upon her daughter for support. She has never applied for or received a Social Security Card. She is not now and has never been a member of the Communist Party. She has no fear of returning to Haiti. The reason that subject Mascame to the US was to care for her daughter's child who is FOIA (b)(6) (Continu Rec 05 (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from 6-19-63 Officer: SEARCH 19 at M. Disposition (Receiving Officer) Form I-213 (Rev. 8-15-62) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service # u.s. GOVERNMENT PRINTING OFFICE 1962-657851"
}