{
  "anumber": "A13573268",
  "id": "A13573268_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573268_0011/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information, G-325 ( (11-1-66)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1962,
        1929,
        1952,
        1913,
        1967,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "LOS FORM G-325 (11-1-66) FORM APPROVED UNITED STATES DEPARTMENT OF JUSTICE CIT -: 400 BUDGET BUREAU No. 43-R436 BIOGRAPHIC INFORMATION 261 Immigration and Naturalization Service A U.S. PRINTING OFFICE : 1966 OF-239-685 GOVERNM 9 1967 (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY DATE ALIEN REGISTRATION NO. TSE King Chun FEMALE July, 15,1913 Chinese (If any) A-13573268. ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Hoi Ping, Canton, China. (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE Tse Dang Hoiping, Canton, hina Deceased FATHER Shiu Lane Canton, China Kowloon, Hong Kong MOTHER (Maiden name) SPOUSE (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (For wife, give maiden name) Hoi Ping April 11, Yee Hing Jew Frank 12/1/12 Canton, China 1929 Canton, China. FORMER SPOUSES (If none, so state) None FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE 1323-K Sttkkh APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY FROM: MONTH YEAR TO: MONTH YEAR 1323-K Street, Bakersfield Calif. U. S. A. Nov. 1965 PRESENT TIME 515 4th Street Taft Calif. U. S. A. Nov. 1962 Nov. L965 District 16 SIGNATURE SPECIMEN FORM File No: A-13573268 Chinoao characters: Form G-138 Jse King chun (6-16-58) Anglicized form of signature: None. PRESENT TIME LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR (If not shown above): LAST OCCUPATION ABROAD (If not shown above): FROM TO CITY COUNTRY FROM TO (Month) (Year) (Month) (Year) (Month) (Year) (Month) (Year) City Country Kowloon Hong Kong 10, 1952. 11, 62 None. THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: NATURALIZATION ADJUSTMENT OF STATUS OTHER (Specify): The Kirg him PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR 16/67 KNOWINGLY AND WILLFULLY FALSIFYING OR CON- CEALING A MATERIAL FACT. Date (Signature of applicant or petitioner)"
}