{
  "anumber": "A13580960",
  "id": "A13580960_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/18/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UN ED STATES DEPARTMENT OF JU ICE Immigration and Naturalization Service 20 West Broadway, New York, N.Y. PLEASE REFER TO THIS FILE NUMBER September 17, 1963 A13 580 960 Genia LAUTURE 616 West 113th Street, Apt. 5 New York, N.Y. Please note the below checked action which has been taken in your case. In accordance with a decision made in your case you are required to depart from the United States at your own expense on or before . You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. Failure to depart on or before the specified date may result in the withdrawal of voluntary departure and steps being taken to effect your deportation. If you are unable to depart by the date stated above, an additional period of time may be granted if, prior to the above date, you appear at this office with confirmed arrangements for your departure. Your application for an extension of time in which to depart from the United States has been granted . You are required to depart on or before October 16, 1963 . Failure to depart may result in the withdrawal of the privilege of voluntary departure. You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. If there is a bond outstanding in your case, you are warned that to expedite cancellation of the bond and return of the collateral posted, you must make advance arrangements with this office to have your departure witnessed by an officer of this Service. At the time of departure, you should surrender your Form 194 DOCKET CLEARED Very truly yours, DATE 10/28/16 DISTRICT DIRECTOR By: HAROLD R. KAPNER VISA APPT. 10/16/63, Mont. Supervisory Deportation Officer FOR IMMIGRATION AND NATURALIZATION USE ONLY My I-94 or I-95 stamped I-530 submitted I-161 prepared I-156 prepared RD 10/17/63 - Samil - Foreign Highgote Springs, Vr. Form I-210 (Rev. 2-1-60) GPO 945546"
}