{
  "anumber": "A13580960",
  "id": "A13580960_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service, Form I-210 ( (Rev. 2-1-60)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 UNITEL STATES DEPARTMENT OF JUSTI Immigration and Naturalization Service file 20 West Broadway PLEASE REFER TO THIS FILE NUMBER New York 7, N.Y. A-13 580 960 F&P EVH June 13, 1963 Miss Genia Lauturo 616 West 113th Sr, apt 5 New York,N.Y. Dear Madam: Please note the below checked action which has been taken in your case. In accordance with a decision made in your case you are required to depart from the United States at your own expense on or before Sept. 13, 1963 . You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. XXX Failure to depart on or before the specified date may result in the withdrawal of voluntary departure and steps being taken to effect your deportation. If you are unable to depart by the date stated above, an additional period of time may be granted if, prior to the above date, you appear at this office with confirmed arrangements for your departure. Your application for an extension of time in which to depart from the United States has been . You are required to depart on or before . Failure to depart may result in the withdrawal of the privilege of voluntary departure. You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. If there is a bond outstanding in your case, you are warned that to expedite cancellation of the bond and return of the collateral posted, you must make advance arrangements with this office to have your departure witnessed by an officer of this Service. At the time of departure, you should surrender your Form I- 94 Very truly yours, DISTRICT DIRECTOR By: F.W. WROBLEWSKI RA Assistant District Director for Investigations Haiti PP# FOR IMMIGRATION AND NATURALIZATION USE ONLY 522-61 I-94 or I-95 stamped I-530 submitted I-161 prepared I-156 prepared NE/29 Form I-210 (Rev. 2-1-60) GPO 887203"
}