{
	"anumber": "A13559853",
	"id": "A13559853_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13559853_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization and Citizenship Application Packet,, NARA-12-2470-N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1952]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 772472023 to Los Angeles, California 90012 Poom 8010 8th Floor on DEC 1 1971 at 10:45 A .M. The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. If you are applying for citizenship for yourself, you will be tested on your knowledge of the government of the United States and its history. You will also be tested on your ability to read, write, and speak English, unless on December 24, 1952, you had been living in the United States for a total of at least 20 years and were then over 50 years old, or unless you are physically unable to read, write, or speak. YOU MUST BRING WITH YOU THESE SEVEN ITEMS, AND THE ITEMS CHECKED ON THE OTHER SIDE OF THIS LETTER. 1. This letter. 2. Alien registration receipt card(s). 3. Any draft card(s). 4. $25 in (cash) (postal money order made payable to the Clerk of Court for filing fee). 5. Any documents you have which you used in connection with any entries into the United States. 6. Two witnesses who are citizens of the United States, and who have seen you very often for as much of the past years as possible. who have very often seen you and your child (children). who have very often seen you, your spouse, and your adopted child (children). who can identify you as the person named in your discharge certificate(s). 7. The Personal Description Form on the reverse hereof, completely filled in. PLEASE HAVE YOUR WITNESSES READ THIS PARAGRAPH Your witnesses, unless born in the United States, must bring with them their naturalization or citizenship certificates. If the witnesses you bring with you have not known you for the entire number of years checked above, additional witnesses will be needed to cover the remainder of those years. The additional witnesses ordinarly will not have to appear at an office of this Service. Instead, the examiner will furnish you with a set of forms which you will send or give to these witnesses to complete and return to this Service at the address shown at the top of this letter. IMPORTANT - SEE ITEMS CHECKED ON OTHER SIDE Form N-430 (Rev. 12-24-70)N"
}
