{
  "anumber": "A13573268",
  "id": "A13573268_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573268_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Alien Beneficiary Information Form, B-210"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1913,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Block II. Information Pertaining to Alien Beneficiary 7. Name of alien King Chun TSE, aka Kin Jean DERE (First name) (Middle initial) (Last name) 8. Date, city, and country of birth of alien July 15, 1913; Ong Mok Village, Hoiping Dis- 9. Relationship of alien to petitioner Spouse. /trict, Kwangtung Province, China. 10. If this petition is for a spouse, give the following: Number of prior marriages of husband NONE NONE Number of prior marriages of wife 11. If this petition is for a child, is the child married? - 12. If this petition is for a brother or sister, are your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 13. If separate petitions are, also being submitted for other relatives, give names of each and relationship to petitioner: Yee Sheung CHAU (JUE) - Adopted son. 14. If this petition is for a highly skilled person or a minister, give the following: Alien's occupation ; full address in the United States where services will be performed Name of alien's spouse Names and birthdates of children Full address of spouse and children If they are abroad, will spouse and children accompany or follow alien to the United States ? 15. Have you ever filed a petition for this alien before? No. If so, give place and date of filing and result: 16. Has this alien ever been deported from the United States? No. If so, give alien registration number, reason for deportation, and place where deportation hearing was held: Mailing address of beneficiary: No. 73 Sa Po Road, 2nd Floor, Kowloon, Hong Kong. 17. Address in the United States where alien will reside with me. 18. Present address of alien 42 H Pak Tai St. 2nd Floor, To Kwa Wan. Hunghom, Kowloon, 19. Location of American consulate where application for visa will be made Hong Kong, BCC HONG KONG British Crown Colony. (City in foreign country) (Foreign country) I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. (Signature of petitioner) (See Instruction No. 5) Subscribed and sworn to (affirmed) before me this 8th day of January A. D. 19 62 at Los Angeles, Calif. Holam wiKwan [SEAL] My commission expires Sept. 3, 1965 HIRAM W. KWAN Notary Public (Signature of officer administering oath) (Title) (If you need more space to answer fully any questions on this form, use a separate sheet and identify each answer with the number of the corresponding question.) 2 AM SECURITY PERSON"
}