{
  "anumber": "A13559853",
  "id": "A13559853_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13559853_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/24023, Form FS-552"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Japan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1934,
        1929,
        1914,
        1952,
        2023,
        1933,
        1940,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 FS55 23. am submitting the following personal documents in support of and as part of my application) (Birth certificate) (Military record) (Promise of employment) (Police certificate(s)) (Evidence of support or (Medical record(s)) (Other (describe)) own resources) (Marriage certificate) 24. ) (Name and present residence of my wife/husband is (Give maiden name of wife)) YU Pui Fun 124 Tai Po Road, 1/F, Kowloon. 25. names and addresses of my children under 21 years of age are) WONG Mee Kuen, WONG Tak Chung, WONG Tak Shun WONG Mee Ling, WONG Mee Chok, WONG Tak Fay WONG Tak Woo 124 Taipo Road, 1/F, Kowloon. 26. (The names of members of my family who are immigrating with me are) YU Pui Fun. WONG Mee Kuen. WONG Tak Chung, WONG Tak Shun, FOIA (b)(6) FOIA (b)(6) and YIP Kum. 27. ) (The name and address of my father is (If deceased, so state, giving date)) WONG Chau Wah In Macau 28. (The maiden name and address of my mother is (If deceased, so state, giv. ing date)) YU Chuen Oi F Deceased in Toi Shan in 1952 29. (The name and address of my next of kin in Hong Kong or Macau is) WONG Chau Wah In Macau 30. (Since birth my places of residence for 6 months or more have been (Give address in Hong Kong, Macau, and other cities)) (Country), (Province), (District), P(Heung), #(Village), (-) (Dates(From-To) (Occupation) China Kwangtung Toi Shan Fat Lub 1914-1929 Nil Canton 7 Wai Kat Fong, G/F, 1929-1933 Student Japan Tokyo Japan Dental College 1934-1940 China Kwangtung Canton 215 Wing Hon Rd. 1940-1957 Dentist Hongkong 124 Taipo Road, I/F, 1957-now 31. (Since my sixteenth birthday I am or have been a or affiliate of the following political, professional, vocational or social organizations) (Name and address) (Dates (From-To)) (Type of membership and office held, any) N/A 32. (I speak, read, write the following languages (Include your native languages) (Languages) #(Speak) (Read) (Write) Chinese Good Good Good Japanese Good Good Good 33. ) (I have previously been in the United States during the following periods (Give year and type of or status)(If never, so state)) N/A 34. (United States immigration laws require that prospective immigrants answer the following questions. This requirement does not imply that you are suspected, of being within any of the classes described in these questions. Your answers will assist the consular officer to establish your eligibility to receive a visa. If you are unable to answer any of these questions please explain your inability fully on a separate sheet of paper which you should attach to this form. Please bear in mind that whatever the nature of your answers to these questions, you are not necessarily ineligible to receive a visa. For example, if you were arrested and/or convicted for a minor offense, and the consular officer is able to establish that such offense was in fact a misdemeanor, your arrest and/or conviction would not necessarily make you ineligible for a visa.) (Give the correct answer to the following questions by circling \"Yes\" or \"No\") (Have you ever been arrested for, charged Yes No crime or other offense?) IS in a civilian prison or jail?) TO jail?) G"
}