{
	"anumber": "A13580960",
	"id": "A13580960_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0039/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/18/2023, A13 580 960 Temp."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/18/2023 A13 580 960 Temp. Memo for file: Re: Genia Lauture Subject speaks only the Creole French. It was not possible to obtain information directly from subject through official French interpreter. The following information was given by subject's daughter, Lenda Lauture: Subject has 3 daughters and 2 sons in the United States, as follows: Lenda Lauture, FOIA (b)(6) living at 616 West 113th Street, Apt. 5, NYC. She arrived at Miami 12-12-61 0-1, born 1-28-32, working at Horn and Hardart,600 West 50th Street and 11th Ave. NYC as distributor, earning $56 per week. Elizabeth Hyppolite, arr. NYC 1959 perm. res. living at 4816 w 21 St. Los Angeles. She is FOIA )(6) registered nurse working in General County Hosp. LOS. born 4-4-34 Marie Cecile Lauture,arr.Jan.1963 MIA by PAA perm.res. dob 2-22-48, living in LOS with FOIA (b)( (6) Elizabeth. She attends Jr.high school. son Jean Lauture, arr 4-14-63 NYC PAA perm res living with Lenda at 616 w 113th Street FOIA (b)(6) born 9-29-40, working at Horn and Hardart, counterman, $45 per week H&H on East 86th Street. NYC son Joseph Anicet Lauture, arr 4-13-63 NYC PAA perm res. living with Jean and Lenda at FOIA (b)(6) 616 W 113th St. NYC, born 1-22-42, working at Horn and \"ardart, counterman, East 86th Street, NYC earning $45 per week. Subject had been living with dtr Elizabeth in LOS and was supported by her until 4-18-63 when subject came to NYC. Now subject is supported by dtr Lenda and 2 sons Joseph and Jean, and subject is living with Lenda. Subject has only one relative in Haiti, a brother, who has wife and 2 children and can hardly support them no less his sister, the subject. He could do nothing for subject. Subject was never married. All the children are from the same father, Georges Lauture, who has the same family name as subject. Georges +auture was a citizen of Haiti, died about 15 years ago just before Marie was born. Subject's daughter Lenda states subject would starve to death if she returned to Haiti Lenda endeavored to obtain the file numbers of her 2 brothers, by telphoning to their place of business, but was unable to reach them. She will obtain the numbers and phone this office. She is unable to give us the file numbers for Elizabeth and Marie who are in LOS. Lenda states subject has never been employed in United States, has no money, and depends on Lenda andsons to support her. Lenda states a visa appl.: is pending at A/C Montreal since April; yesterday she went to Police to get the required document and was told subject would have to have the paper from Immigration first. 6/13/63 to process Also application. m mach goders as VD Carolum Caroline B board Dowd Investigator"
}
