{
	"anumber": "A13573675",
	"id": "A13573675_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573675_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (Spanish), Form FS-510 ( (Spanish)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1925, 1962, 2023, 1961, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Form FS-510 (Spanish) Página 2 23. En apoyo de mi solicitud, y como parte de ella, presento los documentos siguientes: (I am submitting the following personal documents in support of and as part of my application) certificado de nacimiento (Birth certificate) hoja de servicio militar (Military record) oferta de trabajo (Promise of employment) certificado(s) de policía (Police certificate(s)) prueba de propio sostenimiento o de recursos historial médico (Medical record(s)) (Evidence of support or own resources) Otros (describanos) (Other (describe)) 24. Nombre y dirección actual de mi esposa/marido/(dese el nombre de soltera de la esposa): (Name and present residence of my wife/husband is) (Give maiden name of wife) Francisco Colima (finado).- 25. Nombres y direcciones de hijos de menos de 21 años de edad (The names and addresses of my children under 21 years of age are) No Aplicable. 26. Nombres de los miembros de mi familia que emigran conmigo (The names of members of my family who are immigrating with me are) No Aplicable, 27. Nombre y dirección de mi padre (si ha fallecido, indíquese) (The name and address of my father is) (If deceased, so state, giving date) Franci Rubio (finado).- 28. Nombre de soltera y dirección de mi madre (si ha fallecido, indíquese) (The maiden name and address of my mother is) (If deceased, so state, giving date) Anastacia Casillas (finada).- 29. E1 nombre y dirección de mi pariente mas cercano en mi país es: (The name and address of my next of kin in my home country is) Jesus Colima Rubio, Calle 15a. #778 Col, Libertad, Tijuana, B.O. (ME Hijo).- 30. Desde que cumpli 16 años he residido por seis meses O más en los lugares siguientes: (Since my sixteenth birthday my places of residence for 6 months or more have been) Ciudad Provincia País Fechas (de-a) Profesion u oficio (City or town) (Province) (Country) (Dates) (From-To) (Calling or occupation) 3 Huerta de San Javier, Jal. Mexico, Deade 1900 a 1925 Su Hogar:- Ameos, Jel, Mexioo, Desde 1925 a 1961. Su Hogar.- Calle 15a. #778, Col. Libertad, Tijuana, B, Cfa. Mexico Deade Enero/1962 a. la fecha, Su Hogar.- 31. Desde que cumpli 16 años he sido o soy miembro o afiliado de las siguientes sociedades políticas, profesionales u organizaciones sociales: (Since my sixteenth birth- day I am or have been a member or affiliate of the following political, professional, vocational or social organizations) Fechas (de-a) Clase de miembro y cargo ejercido, de haberlo tenido Nombre y dirección (Name and address) (Dates) (From-To) (Type of membership and office held, if any) No Aplicable.- 32. Hablo, leo y escribo los idiomas siguientes: (I speak, read, write the following languages) (Include your native language) Escribo (Write) Idioma (Language) Hablo (Speak) Leo (Read) Español. Espanol. Español. Español. (d) the sido handling usted (e) recluido recluido en una Unidos en los períodos periods) siguientes (Give year (Indíquese and type el año, of visa clase or de status) visa o (If condicion) never, so (Si state) nunca ha estado, indíquelo): (I have prision de un sulentes (c) (2) (b) upadece (a) EE house usted physical actions indicenter de un mendigo perdon de una prision carcel crimen civil? u pregung usted compre carcel tráfice militar3 (Have (Have you deliteparienda por amaintin, ilicitos ever (Have (d) decreto you been you circulo ) de drogas ever been confined ever been narcobi arrester"
}
