{
  "anumber": "A13570214",
  "id": "A13570214_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13570214_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form 510 ( (Chinese), Form Approved Budget Bureau No: 447-R150.2."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Form FS-510 (Chinese) Form Approved Budget Bureau No: 47-R150.2. (b) (I hereby apply for an immigrant visa and alien registration at the American General at Hong Kong. and state the following facts: 1. (My family name is) (My first name is) (My middle name is) Kwan Chau Dau Ghan 2. (My full name in native alphabet (If other than Ro- man letters are used) is) 3. (Other names I have used or by which I have been known are (If married woman, give maiden name)) Chau Sau Ghan 4. (The date of my birth is) 5. (My place of birth is) #(Year) A (Month) E (Day) (Country) (Province) (City or town) District SBIR Heung # Village) 1910 January 29 China Kwangtung Hoi Ping District Fung Yeung 6. (My age is) 7. (My present calling or occupation is) Village 52 Housewife 8. (My present address is) 1B Liberty Ave. 1st Fl. Kowlon, Hong Kong. 9. (My sex is) 10. (My marital status is) (Male) * (Female) (Single) (never married) (Married) (Widowed) (Divorced) (Separated) ## it(Including my present marriage, I have been marriedOne times.) 11. (My nationality is) 12. (My race is) 13. (My ethnic classification is) Chinese bling Chinese Mongolian 14. (My personal description is) 15. (1 have the following visible marks of identification) (a) aime (Color of hair) (c) (Height) (feet) (inch) None; Dark (b) (Color of eyes) (d) FACE e (Complexion) Dark Yellow 16. (My purpose in going to the United States is) To assist my daughter in taking care of children 17. M) (I intend to remain 18. (I intend to enter the United States the United States permanently or (Give length of time)) at the port of) Permanently Los Angeles; or; 19. (I (Do) (1% not) have a ticket to my final destination) 20. (a) (I am 20. (b) going to the United States to join the following person (I am sponsored by the following person and/or organi- (Give name and address and relationship, if any)) zation (Give address if different from (a)) Mrs Donna K Jue, daughter, Mrs. Donna K. Jue, 253 Linden Dr. Ventura Calif,U. S. A. Same as (a) 21. (My final address in the United States is) 253 Linden Dr., Ventura Calif,, U. S. A. 22. F (My personal financial resources, are) (a) (Cash) supported by daughter; (c) 11(ii) (Real estate (value)) (b) RIT## (Bank deposits) (d) (Other)"
}