{
  "anumber": "A13580960",
  "id": "A13580960_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/18/2023 4816 W. 21 St. Los Angeles 16, Calif. January 15, 1963 TEL: RE 3-516) United States Department of Justice Immigration and Naturalization Service 510 South Vermont Avenue Los Angeles 5, California Gentlemen: This is to reply to your questionnaire of January 9, 1963, re- garding my mother, Genia Lauture, who came to the United States on a visitor's visa on April 1, 1961, and who has been obliged to remain with me ever since because of her age and her difficulty with her eyes. Being unfamiliar with immigration procedures, I did not know that it was possible to obtain extensions for here of her non-immigrant stay. At the same time, I was unable to return her to Haiti because my sister and I both live in the United States and she has no one to care for her back home. I have begun the process of applying for an immigrant visa for my mother through the American Consulate at Tijuana, with the help of Mexican-American Social Service, at 2411 Brooklyn Ave., Los An- geles 33, California. This office informs me that the process of obtaining an immigrant visa application for my mother will take about three months, and I would appreciate permission for her to remain with me for that period of time. Very truly yours, Elizabeth Hyppolite"
}