{
	"anumber": "A13573268",
	"id": "A13573268_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573268_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ALIEN REGISTRATION, A-13573268"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1919, 1943, 1962, 1929, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "3 3/6/20 ALIÉN REGISTRATION Name ISE, King Chun STATEMENT OF FACTS FOR PREPARATION OF PETITION SECTION OF LAW 3192 No. A-13573268. (1) My full, true, and correct name is TSE, King Chun, JEW U U 2 (Full, true name, without abbreviations) (2) My present place of residence is 1323-K Street, Apt.C Bakersfield Kern California. (Number and street) (City or town) (County) (State) (3) I was born on July 15 1913 in Hoi Ping Canton China. (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) a (4) I am Married and have living children. The first name of my husband or wife is (was) Frank ; (Single; married; divorced; widowed) we were married on April 11 1929 at Yee Hing Canton China. ; (Month) (Day) (Year) (City or town) (State or country) he or she was born at Yee Hing Canton China (City or town) (County, district, province, or State) (Country) on Dec. 1st 1912 ; entered the United States at San Francisco (Month) (Day) (Year) (City or town) California Nov. 11 on 1919 for permanent residence in the United States and (State) (Month) (Day) (Year) with me now resides apart from me at ; (Show full address if not living with you) and was naturalized on March 11 1943 at Tampa Florida (Month) (Day) (Year) (City or town) (State) Certificate No. 5471778 or became a citizen by 16 (5) I was lawfully admitted to the United States for permanent residence on Nov. 21st 1962 ; (Month) (Day) (Year) under the name of TSE King Chun San Francisco California. at S S President Wilson Honolulus (City) Hawaii on the (Name of vessel or other means fo conveyance) de (6) I have resided continuously in the United States of America since Nov. 21. 1962 and continuously in the State of CALIFORNIA where I now live since Nov. 21. 1962 and during the past 5 years I have been physically present in the United States for an aggregate period of 57, 60 months. (7) I (have, have not) previously filed petition for naturalization No. on (Month) (Day) (Year) at in the Court. (City) (State) Nit. MONE D (8) I wish the naturalization court to change my name to (Give full name desired or state \"None\") (9) Since such lawful admission, I have not been absent from the United States for a period or periods of 6 months or longer except as follows (if none, state \"None\") None. DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT (Month, day, year) OF CONVEYANCE PORT (Month, day, year) OF CONVEYANCE (10) My children now living are: (Complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise, give city and state of child's residence.) NAME SEX PLACE BORN DATE BORN Now LIVING AT- Edward Hoi Ping, Canton, China.8-27-44 Los Angeles, Calif. ADOPTED in Chana Ground Hucha 12"
}
