{
	"anumber": "A13570214",
	"id": "A13570214_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13570214_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMIGRANT VISA AND ALIEN REGISTRATION, 1-1039803"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 1963, 1960]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "ORM -511 (7-15-58) Huc UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION OF: (Family name) 1- 1039803 (First name) (Middle name) CHAU Sau Ghan PORT OF ACTION OF SPECIAL INQUIRY OFFICER HHW-170 I certify that the immigrant named herein arrived in The immigrant herein was (admitted) (excluded) the United States at this port on the and appeal taken no appeal taken under PAA. 2 Symbol (Name of vessel or flight No. of aircraft) on JAN: 1963 Section of the Immigration and (Day) (Month) (Year) admitted Nationality Act. and was inspected by me and detained } for further inquiry by special inquiry officer under Symbol K-21 Special Inquiry Officer. Section of the Immigration and ACTION ON APPEAL ADMITTED Nationality Act EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Consulate General facts stated in the application. IMMIGRANT CLASSIFICATION AT Hong Kong NONQUOTA (Symbol) QUOTA (Symbol) they a (fally K-21; VISA PETITION NO., IF ANYVP approved on May 6, 1960 Thomas A Kelly at Los Angeles expires on May 6, 1963; Consul of the United States of America, IMMIGRANT VISA NO. QUOTA 1337; 13 ISSUED ON (Day) (Month) (Year 21st December, 1962; THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 20th April, 1963; NATIONALITY (If state/ess, so state, and give previous nationality) CLONE Chinese: PASSPORT NO. Passport waived under 22 CFR42. 6 (a) OR OTHER TRAVEL DOCUMENTS (Describe) Service No. ISSUED TO Tariff Item No. Fee Paid $20 Local Cy equiv. STATISTICS: BY Form I.151 issuedle ON EXPIRES 16-74687-1 U. S. GOVERNMENT PRINTING OFFICE"
}
