{
  "anumber": "A13580960",
  "id": "A13580960_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13580960_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Acte de Naissance, AA N° 2233"
    },
    "years": {
      "ms_years_nlp_v1": [
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1963 dia October 16, Justice to mi el this services happy No. $ 5.00 Equiv. EGALITE FRATERNITE YES NATION all REPUBLIQUE D HAIT!< SERVICE REPUBLIQUE D'HA ITI 20 20 Cmes. Cmes. also AA No. 2233 front idea registres des actes de naissance de la connune de Fac- PAPER TIMBRE meI déposes au bureau des Archives Nationales de la Republique./. de gourde Aujourd'hui vingt huit du mois de Fevrier mil n neuf cent dix an cent septième de l'Indépendance à huit heures du matin - Par devant nous Joseph Lauture Brun, officier de l'E tat civil de la commune de Jacmel département de l'Quest, soussi ANNEE I9IO gné, est comparu la dame Gervina Boursiquet, agée de trente neuf PAGE 303 ans, propriétaire, demeurant et domiciliée dans la section rurale NUMERO 303 de la Vallée en cette commune 9 laquelle nous a presenté une fil le, qu'elle a declaré être née en leur domicile le treize du mois ACTE DE NA ISSANCE de Mai de l'année dernière , à trois heures du matin, de son légi- DE : GENIA./. time mariage avec le citoyen Alpénier Lauture, agée de quarante quatre ans propriétaire, demeurant et domicilié dans le meme en- droit, a laquelle fille la comparante a donné le prénom de : GE- NIA - qu'elle reconnait pour sa fille légitime . Dont acte fait en notre hotel en presence des citoyens Baptil Joseph et D éno- zi Colin, ma jeurs, propriétaires, domiciliés dans la section ru- rale de la Vallée en cette commune ; témoins requis par la compa rante lesquels après lecture faite ont declaré ainsi que la com- parante ne pas savoir signer de ce interpellés, avons seul signé SIGNE : Jh. L. Brun LE DIRECTEUR DES ARCHIVES Nales. RECEPISSE No. 65769 H de la République d'Hait Port-au-Prince le I8 Fevrier I963 POUR COPIE CONFORME COLLATIONNEE Laurore St-Juste Dteur do M.A. M.G. Archives Nles."
}