{
	"anumber": "A13559853",
	"id": "A13559853_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13559853_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, Form Approved Budget Bureau No. 4-3R002"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1924, 2023, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 Form Approved Budget Bureau No. 43-R400.2 APPLICATION FOR STATUS AS PERMANENT RESIDENT (For use under Section 245, 249 or the proviso to Section 203(a)(7) of the Immigration and Nationality Act or Section 13 of the Act of September 11, 1957) FEE STAMP FILE NO. A13 559 853 APPLICANT FOR BENEFITS OF SECTION LAW Immigrant Nonimmigrant (Type) visa issued at on (DO NOT WRITE ABOVE THIS LINE) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check appropriate box) An immigrant visa is immediately available to me: A. other than as a refugee B. as a refugee I have resided in the United States continuously since C. prior to June 30, 1948 D. prior to July 1, 1924. OH 2. My name is (First) (Middle) (Last) My alien registration number is Man Get Wong 159-13 I have also used the following names (Married women must show maiden name and names by prior marriages, if any) None 3. I reside in the United States at: (Apt. No.) (No. and Street) (City) (State) L554 N. Crescent Hgts, BLvd... Los Angeles Calif 4. Date of Birth Leg Place of Birt) County Province or State) (Country) I am now a citizen of (Country) B-22-1914 Toyshan Kwangtung China China 5. Height Weight Eyes Hair Complexion Marks or Scars 6. Parents' Names HK 5 ft.5 in. 120 lbs. Brown Black Fair None Mr Chau Wah Wong 7. I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) Mrs Chuen Oi Wong Honolulu, Hawaii 11- 16- 624 Deceased by (Name of vessel or other means of travel) a (Visitor, student, U.S. citizen, stowaway immigrant, etc.) President Wilson Immigrant Parolel 8. I have resided at the following places: (Applicants who check Block A or B of Item 1 must furnish all places of residence from date five years prior to entry into the United States, up to and including the present time, listing present address first. Applicants who check Block C or D of Item 1 must show all places of residence during the last five years, listing present address first.) State From To Street and No. City Province Country Month Year Month Year 854 N Crescent Hgts. Los Angeles Calif. U.S.A. 2 64 Present time 5958 Franklin Ave. Hollywood Calif. U.S.A. 11 62 2 64 124 Taipo Road Kowleen Hong Kong Hong Kong 10 57 11 62 9. I have been employed at the following places during the past five years (include all United States and foreign employment) Type of work From To Full name and address of employer did Month Year Month Year Wayne Chong Laundry 8038 Santa Monica BL. Laundryman 12 65 Present time Harvey's Laundry 8820 Burton Way, B.H. Laundryman 1 63 10 65 He llywoood Dental Lab. 4469 Santa Monica Technician 64 76 64 10. I do do not intend to seek gainful employment in the United States. 11. I am am not married. (If you are married give the following:) a. Date of marriage b. Date and place of birth of spouse 4-10-43 4-21-20 Canton China C. Name of spouse and last address at which you and your spouse resided together Name Address (Apt. No.) (Number and Street) (Town or City) (State) From (Month and Year) To (Month and Year) Pui Fun Yu 854 N Crescent Hgts. Los Angeles Calif. 2-64 Present time d. Number of times I have been married, including this marriage e. Number of times my spouse has been married f. Number of children Once Once 76 g. The following members of my family are also applying for status as permanent residents: Spouse (wife), 4 Sons, 3 Daughters, Mother-in-law. h. Name, date and place of birth and present address of each child: Wong, Mee Keun 2-29-45 Canton China 854 N Crescent Hgts. Sava. L.A. (SEE ATTACHMENT) Form I-485 (Rev. 12-1-65) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
