{
	"anumber": "A13559853",
	"id": "A13559853_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13559853_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, 02/41"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 1962, 1963]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "0300 STATUTORY DECLARATION 1. them Get ( Water if Home Name Street ity Card Not 529500 4, dentist. maiding at 174 Talpa Road, 1/6, Castom Take do solemnly, monthly and truly declare ** follows: But in this beat or MY Information and Saling that X WA been ⑉ 1204 1011 in Fat Luk Bainer tal than District, Knowstake Province, China ( My father in Clynic Mail ( *** 1 and my mother WAS YE Chun as ( 74% 1 nerthin declars that I was Harried to YII Put Pin I FAY in Certificate Thankstone Procises, China ******* in 10th will 1963. And 1 make this solement declaration conscientiatisly believing the same to be true and by virus of the providers of the Statutory Declarations Act. 1835. Declared at the Courts of Justice, Hong Kong, this day of 14 SEP 1962 through the interpretation of GEORGE HOW the said come MDK having been also declared that be had truly, distinctly. and audibly interpreted the contents of this docu- asent to the declarant, and that be along would study and faithfully interpret the declaration about to be adminis- spred.to than Before me LIANG-NAI KLANG A_Commissioner etc 1. chance HTC do solemnly and sincerely declare that I will understand the English and Chinese languages and I have truly, distigatly audibly interpected the contents of this document to the declarant, LLONG and 1) shall truly and faithfully interpeet the declaration about to be administered to Declared at the Courts of Justice, Hong Kong this day of IN SIP 1952 .19 Before me. A Complisioner etc."
}
