{
  "anumber": "A13573675",
  "id": "A13573675_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573675_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LETTER OF SUPPORT (CONT. PAGE II)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1962,
        2023,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 LETTER OF SUPPORT (CONT. PAGE II) RE:FRANCISCA RUBIO COLIMA That my wife and I are offering this Letter of Support to my wife's mother, MRS. FRANCISCA RUBIO COLIMA, a Mexican citizen now residing at, \"Calle 15--#778, Colonia Libertad,\" Tijuana, Baja California, Mexico. That we wish to have her here with us living in our home, and that if she be granted entry into the United States we promise and guarantee to support her in all manners that are necessary, and we promise that she will not become a public charge of any governmental agency of these United States. That this Letter of Support is written for the specific purpose of supplementing the application of FRANCISCA RUBIO COLIMA for such other purpose of which this document may be of use in connection there- with. And it is written with the knowledge that swearing to any false statement in any way affecting or relating to the right of any alien to admission to the United States of America constitutes the crime of perjury. IN WITNESS WHEREOF, we have hereunto affixed my signature below, this 13th day of November, 1962, in SANTA MARIA, COUNTY OF SANTA BARBARA, STATE OF CALIFORNIA. Sincerely yours, SUBSCRIBED AND SWORN TO BEFORE ME, Jose JOSE FAUSTO Fausts Lopez LOPEZ THIS 13th DAY OF NOVEMBER, 1962. Margarita Colima de Fauite MARGARITA COLIMA DE FAUSTO ARTHUR MILTON OOSTERVEEN - - NOTARY PUBLIC In and for the County of Santa Barbara and State of Calif My Commission Expires August 21, 1965"
}