{
	"anumber": "A13573675",
	"id": "A13573675_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573675_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LETTER OF SUPPORT, RE:"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1962, 1956, 1947, 1948, 2023, 1961, 1927, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 - LETTER OF SUPPORT - NOVEMBER 13, 1962 RE: FRANCISCA RUBIO COLIMA AMERICAN CONSUL TIJUANA, BAJA CALIFORNIA, MEXICO Dear Sir: I, JOSE FAUSTO LOPEZ, a Mexican citizen born in Ameca, Jalisco, Mexico, on March19, 1907, and a legal and permanent resident of the United States of America residing at 4545 \"11th\" Street in Guadalupe, County of Santa Barbara, State of California, do hereby offer this Letter of Support and I do hereby state: That I was admitted to the United States at Nogales, Arizona on May 31, 1927, and that my registration number is A- FOIA (b)(6), That my wife MARGARITA COLIMA de FAUSTO is a Mexican citizen born in Ameca, Jalisco, Mexico on October 21, 1915, and that she is a legal and permanent resident of the United States having been admitted at San Ysidro, California on December 19, 1947; and that she resides with me at the above address in Guadalupe, California. That I work for SINTON & BROWN COMPANY of BETTERAVIA, CALIFORNIA and have been in their employ since July 10th, 1961. That my annual salary is approximately $5400.00 (fifty four hundred dollars), and that I have submitted two letters from SINTON & BROWN in order to substantiate this claim. I also have submitted a notarized copy of my 1961 Income Tax form 1040 to demonstrate to your office that my income for that year was $3126.59 (three thousand one hundred and twenty six dollara and fifty nine cents). . That my wife is employed by POINT SAL GROWERS AND PACKERS of GUADALUPE, CALIFORNIA and that she has been employed by them for the past eight years. We have submitted two letters from this Company in order to substantiate this claim. That my wife earned $2392.07 (two thousand three hundred and ninety two dollars and seven cents) and this amount is shown on our combined Income Tax form 1040 for 1961. That we own approximately $2500.00 (twenty five hundred dollars) of home furnishings without any encumberances. And that we also own without encumberances two automobiles: Plymouth 1948 four-door sedan, and a 1956 Dodge four-door sedan."
}
