{
	"anumber": "A13570214",
	"id": "A13570214_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13570214_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization,, N-455"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 To Petitioner: In connection with the hearing to be held on your petition' for naturalization, answer each of the questions below by checking \"Yes\" or \"No\" without giving any further explanation. Authority for collection of the information requested on Form N-455 The questions refer only to what has happened AFTER THE DATE you appeared and filed your petition for naturalization. They do not refer is contained in Sections 101 (f), 316, to anything that happened before that date. 332,335 and 336 of the Immigration and Nationality Act (8 U.S.C. 1101 (f), After you have answered every question, sign your name, give your address, and fill in the date and place of signing. 1427, 1443, 1446 and 1447). Submis- You must BRING THIS COMPLETED LETTER WITH YOU to the hearing and give it to the naturalization examiner, who will question you sion of the information is voluntary. further on the answers. The principal purposes for requesting the information are to enable desig- nated examiners of the Immigration AFTER THE DATE you filed your petition: (Answers) and Naturalization Service to deter- 1. Have you married, or been widowed, separated, or divorced? (If \"Yes\" please mine a petitioner's eligibility for bring documented proof of marriage, death, separation or divorce.) 1. Yes No naturalization and to make appropriate recommendations to the naturalization 2. Have you been absent from the United States? 2. Yes No courts. The information requested may, as a matter of routine use, be disclosed 3. Have you knowingly committed any crime or offense, for which you have not been to naturalization courts and to other arrested: or have you been arrested, cited, charged, indicted, convicted, fined, or federal, state, local or foreign law imprisoned for breaking or violating any law or ordinance, including traffic violations? 3. Yes No enforcement and regulatory agencies, the Department of Defense, including 4. Have you joined any organization, including the Communist Party, or become any component thereof, the Selective associated or connected therewith in any way? 4. Yes No Service System, the Department of State, the Department of the Treasury, the 5. Have you claimed exemption from military service? 5. Yes No Department of Transportation, Central Intelligence Agency, Interpol and in- 6. Has there been any change in your willingness to bear arms on behalf of the dividuals and organizations in the United States: to perform non-combat service in the armed forces of the United processing of any application or pet- States; to perform work of national importance under civilian direction, if the law ition for naturalization, or during the requires it? 6. Yes No course of investigation to elicit further information required by the Immigration 7. The law provides that a petitioner for naturalization shall not be regarded as a and Naturalization Service to carry out person of good moral character who, at any time after the filing of the petition for its functions. Information solicited naturalization, has advocated in polygamy or been a polygamist; received income which indicates a violation or poten- mostly from illegal gambling: been a prostitute or procured anyone for prostitution: tial violation of law, whether civil, knowingly and for gain encouraged or helped an alien to enter the United States criminal, or regulatory in nature, may illegally; been an illicit trafficker in drugs or marihuana; or has been a habitual be referred, as a routine use, to the drunkard Have you been such a person or committed any of these acts? 7. Yes No appropriate agency, whether federal, state, local or foreign, charged with the responsibility or investigating, I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. enforcing or prosecuting such viola- tions. Failure to provide all or any Signed at Camarillo, Calif. June 1, 198.6 of the requested information may on result in an unfavorable recommenda- (City and State) (Date) tion as to a petitioner's eligibility Sou grow glan for naturalization and denial by the 568 Otero Court Camarillo, CA 93010 court of a petition for naturalization. (Full Signature) (Full Address and ZIP Code)"
}
