{
  "anumber": "A13833785",
  "id": "A13833785_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13833785_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Petition"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Hungary",
        "Germany",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1903,
        1905,
        1006
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Fourth / enigrated to the United States from Humburg. Germany on or about the 15th day w December unne Dismind , 900 and series in the United States of the port of New York on the 26t Play of December anna Domini , 908 on the vessel Pretoria servical at gives) Fifth / declared my Intention to become a citizen of the United States on the 27th day of March anno Dumini / 917 of New York in the SuPreme toour NY County Sixth. am married MY wife's name it Regina she was born on the 4th day of July esne Junior / 863 at Hungary and now resides at Hungary New Purl N. r. (Give I have 3 children. and the name. date and place of birth and place of residence of each of sold children is as Polices David 15th April 1903 Hungary Hungary Celis 1st Jan. 1905 Hungary Hungary Nathan 2nd Aug. 1907 Hung Hungary Seberth am not . disbeliever in or opposed to organized government or is member of or affiliated with any organization or body of persons teaching diabeHel in OF opposed organis government. / an not a polygamist nor a believer in the practice of polygamy. / am attached to the principles of the Constitution of the United States and 10 is my iKon re become a different of the United States and to resource absolutely and forever all allegiance and Adelity to any foreign perfoce, potentule state. or somereignity and deglan to Charles, Emperor of Austria & Apostoli, King of Hungary whom at this time / am a subject. and it is my intention reside permanently in the United States. / am obin to spenk the English language Minth. I have resident continuously in the United States of Amarica for the term of Ave years of loast, proceeding the date of this petition. to with since the 26th of December day anno Domink 1. 908 and in the Mate of New Pork condinionally nest preceding the date of this potition, since the 26th day of December anno Domini 1. 908. being . residence within this State of of loast one year Mark proceding she 'date of this potition. Tmith I have not herebofore midd petition for elticonship to any court. (1 made petiting the Court of on the day of Down't / and the sald potition by the essays, * use. x and the x such (to * has since Wen Aereta and maile a part of our position are my declaration of information to become 15 different of the United States and the certificate from the Department of Labor, together with my all and the affidavits of the first writting withessee Chereto, required by Inv. Wherefore your potitioner progre that he may be admitted # elitenes of the United America (Complete Declaration w Indication Mr. 149451 and Our Nileata of Arrival No. 2307d149451 from Department of Labor Blid this of My mr.9 Nove 10 Arek OR Coster -If politions arrived In the United Rate ON OR PRODUCE June 20. 1006, strike out the \"and Certificate of Arrival No. from Department of Labor.\" AFFIDAVITS OF PETITIONER AND WITNESSES STATE OF NEW YORK 68/ County w Yese York, The eforesaid petitioner being duly stoom, deposits and anya that As is the petitioner in the proceedings: that No has rand the foregoing potition and Amount the contents thereof Diat the anid petition is signed with his full, true names that the same is true of his as to matters therein stated to be allegoi upon in corporation one ballet. and that as to those matters he believes \" to be true. Morris Smooke declapation Neckwear 334 East 18th 75. NY C Jacab Auslander occupation Headwear realiting at 305 Vermont St. Bklyn. NY Deling duty, and responsible deposit and sapa this ha is or the United States of Generica that No has personally - JACOB PEARL the politioner above mentioned. to have maided in the United States continuously presing the date of filling MA principal does this lot day of May asno Domini I 914 and in the State in which the about potition is made continuously disco the 1st May ando Domini , 914 and that he has personal Ameroledge that the position see to a perpon of good month chancister, attached to the principles of the Constitution of the United States, and that the potitionar is in every and qualified is No to be admitted . ditizen of this District States Omons Smoke (Signature) of Jacob Amstander (Signature of without (State and to before me by the potitioner health - In the offer w the Clarity of sold Court of Nise Prints N. P., 8th day of May GARD Domini 19) 9 Spocial Clark of the Supress Court"
}