{
  "anumber": "A13833785",
  "id": "A13833785_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13833785_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1921,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ALIEN REGISTRATION No. A13833785 APPLICANT.-Do not all in or sign anything on this page AFFIDAVIT I, the APPLICANT do swear Subscribed and sworn to before me upon examination (applicant, parent. guardian) that I know and understand the contents of this application, of the applicant (parent, guardian) at NEWARK signed by me, and of attached supplementary pages numbered MAR 1 thish965 1965 day of MAR 1969 and to ( ), inclusive; that the same are true to the best of continued solely for: my knowledge and belief; and that corrections numbered TESTIMORY OF DAVID PEARL AF NY OFFICE 128 were made by me or at my request. RE of RELATIONSHIP OF APPLICANT TO JACOB PEARL OK.5-7-65 we bee there Wastern Came ATFORNEY (NATIONALITY) (Signature of applicant, parent. guardian) (Officer's signature and title) REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents, records, and persons examined, and the identification upon personal appearance of the under- age beneficiary, I find that all the facts and conclusions set forth under oath in this application are true and correct; that the applicant did derive or require United States citizenship on 11-7-1921 through ON WHICH DATE HE was A LAWFUI PERMANENT RESIDENT (Month) (Day) (Year) OF THE U.S. AND UNDER TWENTY-ONE YEARS OF AEE, HIS FATHER Granted and that (s) he has been expatriated since that time. I recommend that this application be and that A Certificate of Citizenship be issued in the name of NAT PEARL (A) (AA) In addition to documents listed in Item 14, the following documents and records have been examined: Ex5.I404A RELATING TO APPLICANTS LAWFUL ADMISSION EX 6347- RELATING To FATHERS NATURALIZATION - CONTAINE MARRIAGE DEC Relationship Date Testimony Person Examined Address to Applicant Heard NAJ PEARC 631 MAITLAND AVE TEANECK NJ applicant 3-19-65 DAVID PEARL 3048 BRIGHTON 6THST WITNESS 4-15-65 BROOKLYN NY N341EX7 Supplementary Report (s) No. (s) Attached. 5-7-65 Walter Goone (Officer's signature and title) , 196-- GENERAL ATTURNEY (NATIONALITY I do concur in the recommendation. 5-7-65 STATISTICS 27 Mualdi relay Date 19 (Signature of District Director or Officer In Charge) N-600A (7-22-64)"
}