{
  "anumber": "A13833785",
  "id": "A13833785_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13833785_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, N-600 ( (Rev. 8-1-69)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Finland"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1921,
        1924,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "give FEE STAMP Form approved Budget Bureau No. 43-R105.8. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE APPLICATION FOR CERTIFICATE RECEIVED OF CITIZENSHIP Take or mail this application to: IS65ILB-9 1964 AUG 19 AM10:48 IMMIGRATION AND NATURALIZATION SERVICE MNS. N.J. (Print or type) (NATHAN) Not PEARL BRK.N.N / (Name) 2 FUSED FIRST NAME N (Majden name, any) nee NATHAN Date PEARL if MR 8/19 63/MAILLAND Av. TEANECK N.J SINCE 1921 (Apartment number, Street address, and, if appropriate, \"in care of\") Todate ALIEN REGISTRATION EANCCK N.J. No 3 833785 (City) (County) (State) See Instructions on Pages 5 and 6 I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. I was born in DUBOUH HUNGARY on 10 13 1907 (City) (State or country) (Month) (Day) (Year) 4 (2) My personal description is: Sex MALE ; complexion MED ; color of eyes BLUE ; color of hair BROWN; height 5 feet 8% inches; weight 170 pounds; visible distinctive marks hove Marital status: Single; Married; Divorced; Widow (er). (3) I arrived in the United States at N.Y N.Y Son on Nov 7, 1921 under the name NATHAN PEARL (City and State) by means 6 of ship 55 FINLAND (Month) (Day) (Year) PRAGUL (Name of ship or other means of arrival) on U.S. Passport No. issued to me at Chic on (Month) (Day) (Year) (4) Fill in this block only if you arrived in the United States before July 1, 1924. (a) My last permanent foreign residence was Dabiva (b) I took the ship or other conveyance to the United States at (City) ANtURRIP (Country) (c) I was coming to JACOb PEARL (City) (Country) at N.V.C (Name of person in the United States) (City and State where this person was living) (d) I traveled to the United States with REGINA PEARL (mother) -Arother- Celia- sister (Names of passengers or relatives with whom you traveled, and their relationship to you, if any) (5) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following information for every absence. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES a (6) I HAVE NOT filed a declaration of intention to become a citizen of the United States or a petition for naturalization. (have) (have not) (If \"have\" give full details on a separate sheet of paper this size and attach it, showing question number.) TO THE APPLICANT.-D not write between the double lines below. Continue on next page. ARRIVAL RECORDS EXAMINED ARRIVAL RECORD FOUND Card index Place Date Index books Name Manifests no Manner Marital status (Signature of person CLERK making search) Age Form N-600 (Rev. 8-1-68) (1) N.Y.U. VERIFICATION CENTER"
}