{
  "anumber": "A13833785",
  "id": "A13833785_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13833785_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Death, N600-113 83275"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1957,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTMENT OF HEALTH EX 's BUREAU OF RECORDS AND STATISTICS Borough of EROOKLYN Now York N. Y. DEC-21-1964 Below is c photostatic copy of a certificate on file in the Bureau of and Statistics of the Department of Health of the City of New York. father pc Certificate nf Death6-57-324575 FILED Certificate No 1. NAME OF JACOB PEARL DECEASED (Print or Typewrite) First Name Middle Name Last Name PERSONAL PARTICULARS MEDICAL CERTIFICATE OF DEATH (To be filled in by Funeral Director) (To be filled in by the Physician) 15 PLACE OF DEATH: 2 USUAL RESIDENCE: (a) State New York (a) NEW YORK CITY: (b) Borough BROOKLYN (b) Co. K*ngs (c) Post Office Bklyn and Zone (c) Name of Hospital KINGS COUNTY HOSPITAL or Institution (If not in hospital or institution, owe street and number.) (d) No. 1784 Prospect Place Ave. Off in rural area, give location) (d) If in hospital, give Ward No. A-62 (c) Length of residence or stay in City of 45 yrs 16 DATE AND (Month) (Day) (Year) (Hour) New York immediately prior to death HOUR OF M. 3 SINGLE. MARRIED. WIDOWED. DEATH DECEMBER 12th 1957 4-30P OR DIVORCED (write the word) Single 17 SEX 18 COLOR OR RACE 19 Approximate Age 4 DATE OF (Month) (Day) (Year) MALE WHITE 66yrs BIRTH OF DECEDENT 20 I HEREBY CERTIFY that 5 AGE If under 1 year If LESS than 1 day, (a staff physician of this institution attended the deceased) 65 mos. days hrs. or min. yrs from Dec. 12th 1957 to Dec. 12th 19 57 a. Usual Occupation (Kind of work done during most of working life, even If retired) Operator and last saw h im alive a4-3.00M on Dec. 12th 19 57 b. Kind of Business or Industry in which this work was done Childrens Clothing I further certify that death t was not caused, directly 7 SOCIAL SECURITY NO. or indirectly by accident, homicide, suicide, acute or chronic poisoning, or in any suspicious or unusual manner, and that it 8 BIRTHPLACE was due to NATURAL CAUSES more fully described in the (State or Foreign Country) Russia confidential medical report filed with the Department of Health. 9 OF WHAT COUNTRY WAS Cross out words that do not apply. DECEASED A CITIZEN AT TIME OF DEATH? Russia t See first instruction on reverse of certificate. 10a WAS DECEASED EVER 10b. IF YES, Give war or dates IN UNITED STATES of service ARMED FORCES? no 12 of 57 11 NAME OF DECEDENT Aaron Pearl FATHER OF Signature Witness my hand.this day December 19 DO M.D. 12 MAIDEN NAME OF MOTHER Address KINGS COUNTY HOSPITAL OF DECEDENT Anna 13 NAME OF INFORMANT RELATIONSHIP TO DECEASED ADDRESS Gussie Hanff Sister 6059 Putnam Ave Bklyn NY 14a Name of Cemetery or Crematory 14b. Location (City, Town or County and State) 14c. Date of Burial or Cremation New ntefiore Cemetery Pinelawn L.I. N.Y. Dec 15,1957 21 FUNERAL ADDRESS DIRECTOR I J MORRIS, INC. 9701 CHURCH AVE, Brooklyn 12, NY BUREAU OF RECORDS AND STATISTICS DEPARTMENT OF HEALTH THE CITY OF NEW YORK ALTH This is to certify that the foregoing is a true copy of a record in my custody. CARL L. KRHARDT, So.D. BY abraham Sinously Director of Bureau Borough Registrar WARNING: DO NOT ACCEPT THIS TRANSCRIPT UNLESS THE RAISED SEAL OF THE DEPARTMENT OF HEALTH IS AFFIXED THEREON. THE REPRO- DUCTION OR ALTERATION OF THIS TRANSCRIPT IS PROHIBITED BY SECTION 3.21 OF THE NEW YORK CITY HEALTH CODE. NOTICE: In issuing this transcript of the Record, the Depart- ment of Health of the City of New York does not certify to the truth of the statements made thereon, as no inquiry as to the facts has been provided by law."
}