{
  "anumber": "A13833785",
  "id": "A13833785_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13833785_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Hungary",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1903,
        1905
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "2307 U.S DEPARTMENT OF LABOR NATURALIZATION SERVICE No. DUPLICATE Mo Quade STATES OF To be fannarded to the theress of Materialisation ENTITED Assehica PETITION FOR NATURALIZATION 2b the Honorable the Supreme Court of the State of New York, First Judiefal Diatrict: The petition of JACOB PEARL hereby Med. respectfully showesh First. My place of residence is 129 Allen st, NY Civy New York, N. r. minderao Second MY occupation \" Manufacturer Third I was born on the 15th, of July anno Domini I 879 of Samploness, Bungary Pourth / emigrated to the United States from Humburg, Germany on or about the 15th day of December anno Damini , 900 and arrived in the United States, at the port of New York on the 268 Day of December anno Domini / 908 on the result Pretoria (If otherwi ⑉⑉7 Firth / declared my Intention to bacome . citizen of the United States on the 27th day of March I Domini / 917 of New York in the SuPreme of NY County Stoth am married MY wife's name is Regina she this born on the 4th day of July isne 683 of Hungary and now resides as Hungary New Party N. P. (Give 603 steed I have 3 children. and the name, date and place of birth and place of residence each of sold children is as follows David 15th April 1903 Hungary Hungary Celia 1st Jan. 1905 Hungary Hungery Nathan 2nd Aug. 1907 Hungary Hungary Seventh I GAS not a disbellever by or opposed to organised government or 13 member of or affiliated with and organization or body of persons teaching diabellef is or opposed to organized government. / on not a polygamist nor a believer in the practice of polygump. I am attached to the principles of the Constitution of the United States, and is is my interNon to become . officers of the United States and to resource absolutely and forevie all allegiance and Adoliny to any foreign prince potentuale state, or and , particularly to Charles, Emperer of Austria & Apostell, King of Hungary when of this time / em a and \" is my intention to reside permanently in the United States. Eighth , - abio to special the language Minth I have realded continuously in the United States of America for the firm of for geors as leart. Immediately proceding the date of this petition. to will, the 26th Bay of cember and Domins 908 and in the State of the l'brAi has proceding the date of this petition, duce the 26th day of December anno Donical 1. 908. being a residence within this State of of least one year nort proceding the date of this position. funch I have Not heretofure made petition for officenship to ung court (i Mis Court of on the day of anno Domini / and the - politions ⑉ denieR the * Counter the Agrowing resouraged - w with * and the x as (* x has since attached Name and mode a part of this potition are my declaration of intension to become . william of the United States and the certificate from the Department of Labor, together with my adidas and the of the two witnesses charato, required by law Wherefire your pebitioner prays that he may the admitted of the United States of America (Designate Declaration w / Mr. 149451 and Certificate of No. 2307d149451 from Dapselment or Labor (11mg) and of lay Home to CLASS of paid arrived la the United States OR os servina Just 20. 1000 strike out reading and Certificial of Arcival No. fruit Department of Labor.\" AFFIDAVITS OF PETITIONER AND WITNESSES STATE OR and road - County of the Thrit The being daily more, depeare end page that he to the is the presenting<1 that No has read the foregoing and knows the - derri that the sold position is signal with his full true names that the ame is true w No own amesi) as to matters theraln stated to to alleged upon September 1 Hillin and that or to those mailers he believe \" to be true Baroth Poasl I"
}