{
  "anumber": "A13995582",
  "id": "A13995582_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13995582_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION, N-600A ( (7-22-64)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1964,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ALIEN REGISTRATION No. APPLICANT.-Do not fill in or sign anything on this page AFFIDAVIT I, the afflicient do swear (applicant, parent, guardian) Subscribed and sworn to before me upon examination that I know and understand the contents of this application, of the applicant (parent, guardian) at Phil R signed by me, and of attached supplementary pages numbered this 10 day of nov 196 L and , (.).to inclusive; that the same are true to the best of continued solely for: my knowledge and belief; and that corrections numbered ( to ( 9) were made by me or at my request. Herman Dety (Signature of applicant, parent, guardian) Merbet th L (Officer's signature and title) osue REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents, records, and persons examined, identification upon personal of the Exunder aborticianx. I find that all the facts and conclusions set forth under oath in this application are true and correct; that the applicant did THE derive or acquire United States citizenship on April 27,1915 on which date he was through (Month) (Day) (Year) a lawful permanent resident of the U.S. and under 21 years of age, his father having been naturalized on that date. and that (s) he has not been expatriated since that time. I recommend that this application be granted A and that - Certificate of Citizenship be issued in the name of Herman etz. (A) (^^Applicant's name at birth was Chaim Shruel In addition to documents listed in Item 14, the following documents and records have been examined: EX5 Verification of afrival Form I404-A Ex 6 Verification of father's natz Form G347 Person Examined Relationship Date Testimony Address to Applicant Heard Mary Pilverman lietz as above -wife Nov.10,1964 Supplementary Report (s) No. (s) not Attached. Nov.10th 1964 U.S. Natural (Officer's ization Examiner Little I do concur in the recommendation. LW. Hurringers Date Nov 10th 19 -64 (Signature of District Director or Officer in Charge) N-600A (7-22-64)"
}