{
	"anumber": "A13995582",
	"id": "A13995582_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13995582_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Declaration of Intention and Certificates of Petitioner and Witnesses,, M 4 161."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1896, 1906, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Fourth I emigrated to the United States from on or about the 10 day of Yair anno Domini 1 going and arrived in the United States. at the port of newbyand on the 211 anno Domini got the vessel alucia day of Geburny (If the alten arrived therwise than by versel Abothana trahepartation company should be given Fifth my intention to become a citizen of the Unite States on the at (hill District day of april anno Domini 410 in the Court of United State Sixth, am - married My wife's name is Other She was born in Bronch Cussia and now resides at 1927 n Standar (Give It And Shila Pennsylvania I have 5 ch 'dren. and the name. date and place of birth and place of residence of each of said children is as follows molly march 1896 Cuasia Phila their syntan 10g1904 Sight ,1906 Hhla Nathan David July 9. 1908 197.0 Seventh am not a disbeliever in or oppos d to organized government or a member of or affiliated with any organization or body of persons teaching diabeties in or opposed to organized government. I am not a polygamist nor a believer in the practice of polygamy / am attached to the principles of the Constitution of the United States and it is my intention to become a citizen of the United States and to renounce absolutely and forever all allegiance and Adelity to any foreign prince, potentate, state, or sovereignty. and particularly to nicholas II of all th anaseas of whom at this time I am a subject. and it is my intention to reside permanently in the United States. Righth. I am able to speak the English language. Ninth. J have resided continuously in the United States of America for the term of Ave yours at least, immediately preceding the date of this petition. to wit. since the What of Jet Pennsylvania anno Domini 1 and in shid State of continuously next proceding the date of this petition, since 20 day of march anno Domini I In'residence within this State of at least one year next preceding the date of this petition. Tenth. I have not heretofore made petition for citizenship to any court. (1 made petition for chineship to the Court of at on the dev of anno Domini I and the said petition was denied by the said Court for the following reasons and causes, to wit. IS and the cause of such denial has since been cured or removed. Attached hereto and made a part of this petitiprement my declaration of intention to become a citizen of the United Statement the from the Department of Labor, together with my affidavit and the affidavits of the two verifying witnesses thereto, required by law. Wherefore your petitioner prays that he may he admitted a citizen of the United States of America. solymon Declaration of Intention and Certificate of Anninal Aled this Nots TO CLERK OF COURT petitioner arrived in the United States or on REPUBE JUNE 1906, strike was the work ties \"and Certificate of Aprival No. Jan Complete and true signature of petitio of 5 191 from Department of Later AFFIDAVITS OF PETITIONER AND WITNESSES UNITED STATES or AMERICA. Eustern District of Pennsylvania, as: The aforesaid petitioner being duly sworn. deposes and says that he is the petitioner in the above entitled proceedings: that he has read the foregoing petition and knows the contents thereof: that the said petition is signed with his full, true name: that the same is true of his own knowledge except as to matters therein stated to be alleged - information and belief, and that as to those matters he believes it to be true. solomon yet mouis Brooks Hinich thin occupation Crickleyes and true signature 103 Seens residing at Sh Philadelphia Pro Pn and occupation residing at each being setterally, duly. and respectively sworn. deposes and says that he is is citizen of the United States of America; that be has personally known sety potitioner above mentioned to have posided in the United States continumally U/S immediately preceding the date of filing his petition, since cig day of and in the State in which the whom day of you anno Domini/1 410 entitled petition is made continuously since the anno Domini / and that he has personal knowledge that the said petitioner is a person of good moral character, attached to the principles of the Constitution of the United States, and that the petitioner is in every way qualified in his opinion to be admitted a citizen of the United States. More Brown (Signature of witness.) Subscribed and before me by the above petitioner and witnesses in the ando Domini 191 Brown the Clerk of Court this day TOKAT of Clerk Ry wauding Deputy Clark No 489161"
}
