{
  "anumber": "A13995582",
  "id": "A13995582_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13995582_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DECLARATION OF INTENTION, 9017"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form No. 9017 DUPLICATE (TeW forwardet to the Threase Immigration and Naturalization UNITED STATES Department OF A98 of Commerce and Labor INDEXED BUREAU OF IMMIGRATION AND NATURALIZATION DIVISION OF NATURALIZATION BUNBAU of of it MAY 16 1910 RECEIVED DECLARATION OF INTENTION - with (Invalid for all purposes seven years after the date hereof) YAMINED United States of America In the United States District Court Eastern District of Pennsylvania. SS: of Eastern District of Pennsylvania. 3, Pilmer Etty aged 40 years, occupation Build do declare on oath affirm that my personal description is: Color white complexion manch height feet 8 inches, weight 160 pounds, color of hair inhan color of eyes i line other visible distinctive marks nn : I was born in Brink Ruscia $ on the anno Domini I 969 : I now reside at Cride Oc 1cM day of July foreign residence (If the was allen arrived Bronsh otherwis than by vessel. the character places I emigrated to the United States of America from standing on the vessel comportation : my last company should the given.) It is my bona fide intention to renounce forever all allegiance and fidelity to any foreign prince potentate, state, sovereignty, and particularly NichlaB or to my a al the of which I am now a citizen subject : I arrived State Ferritory at of the port of . in the on or about the geni day of District February anno Domini 964 I am not an anarchist: I am not a polygamist nor a believer in the practice of polygamy: and it is my intention in good faith to become a citizen of the United States of Americ and to permanently reside therein : So HELP ME GOD. Polomon Let, (Original signature of de clarant Subscribed and addressed sworn to before me this 5.4 [SEAL.] day of and anno Domini 19 William W. Craig. Clerk of the United States District, Court. By Egotem District of Pennsylvania Clerk"
}