{
  "anumber": "A14115644",
  "id": "A14115644_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FOR Arrest of Alien"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 WARRANT FOR ARREST OF ALIEN United States of Amerira DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE El Paso, Texas No. A14 115 644 To any officer in the service of the United States Immigration and Naturalization Service WHEREAS, from evidence submitted to me, it appears that the alien LUIS CORRALES-MEZA who entered this country KK near Ysleta, Texas on or about the 2nd day of July 1964 , is within the United States in violation of the immigration laws thereof, and is therefore liable to be- ing taken into custody as authorized by section 242 of the Immigration and Nationality Act. NOW, THEREFORE, by virtue of the power and authority vested in me by the immigration laws of the United States and the regulations issued pursuant thereto, I hereby command you to take the above named alien into custody for proceedings thereafter in accordance with the appli- cable provisions of the immigration laws and regulations. The expenses of detention hereunder, if necessary, are authorized payable from the available appropriation \"Salaries and Expenses, Immigration and Naturalization Service.\" For so doing, this shall be your sufficient warrant. Witness my hand and seal this 10th day of September 1964. Time CoNaughu DEPUTY DISTRICT DIRECTOR EL PASO DISTRICT Served by me at on 9.11.64 19 at KOOA m. I certify that following such service, the alien was advised as to right of counsel and was furnished with a copy of this warrant. Main & Form 1-200 at Good Zuting (Rev. 4-15-58) jpd"
}