{
	"anumber": "A14115644",
	"id": "A14115644_0041",
	"page_index": 41,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0041/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE, Form approved OMB No. 043-R0570"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service OMB No. 043-RO570 Fee Stamp APPLICATION )R VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS For the CONVIENCE TYPE OR PRINT THE NAME 'D MAILING ADDRESS OF THE PERSON TO WHOM the GOVERNMENT INFORMATION OR COPIES O RECORD SHOULD BE RETURNED IN THE BOX BELOW: PERSON CONSENTING NAME SOCIAL SecuRity Admin. NAME AND ADDRESS Luis M. CORRALES STREET ADDRESS 1410 S. AtLANtic Blud 1262 S KERN CITY, STATE Los ANGELES, CA 90027 Las ANGELES, CA, 40022 ZIP CODE ATTN: MUDULE I Line Collaice ELT SIGNATURE OF PERSON CONSENTING ANNL PM 1. CHECK TYPE OF VERIFICATION REQUESTED 2. STATE PURPOSE FOR WHICH DESIRED 3. NUMBER OF COPIES NEED CERTIFICATIONY of DESIRED. IF ANY: AGE OR DATE OF BIRTH NATURALIZATION OR CITIZENSHIP LEGAL STHIUS TC PROCESS GENEALOGICAL INFORMATION TitLE II of SOCIAL Security 4. IF INFORMATION is FOR SOCIAL SECURITY OTHER (CERTIFICATE OF BIRTH DATA, ETC.) BENEFITS, SHOW SOCIAL SECURITY NUMBER (Title XIT pending) 585-28-5268 DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME CORRALES MIDDLE NAME A14 6. ALIEN REGISTRATION 115 NUMBER 644 LUIS MEZA UNKNOWN 7. OTHER NAMES USED. IF ANY NONE 8. NAME USED AT TIME OF ENTRY INTO UNITED STATES SAME AS ABOVE 9. PLACE OF BIRTH 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES CHiH. MEXICO 01-11-07 CHiH, MEXiCO 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY EL PASO, TEXAS 12/xx/14 WALK THROUGH GIVE THE FOLLOWING INFORMATION FOR VERIFICATION OF NATURALIZATION 15. NAME ON NATURALIZATION CERTIFICATE 16. CERTIFICATE NUMBER 17. NATURALIZATION DATE 18. ADDRESS AT TIME OF NATURALIZATION 19. NAME AND LOCATION OF NATURALIZATION COURT 20. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: DATE: Sept. 13, 1977 Los Angeles, California LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON AT NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. NATURALIZATION IN (COURT) ON (DATE) AT (LOCATION) DATE OF BIRTH ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE UNABLE TO IDENTIFY ANY RECORD that above subject is a U.S. citizen. COPIES ATTACHED AS REQUESTED SIGNATURE William XX Our records indicate that above subject was twice returned to Mexico voluntarily, and was never TITLE Contact Representative admitted ta the U.S.A. for permanent residence. PRIVACY ACT Approved By: DATE IDENTITY ESTABLISHED IN PERSON IDENTIFICATION DOCUMENTS (WHEN REQUIRED) G-652 Affidavit ATTACHED OTHER (List) FORM G-641 (Rev 4-1-76) N"
}
