{
  "anumber": "A14115644",
  "id": "A14115644_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REception of Illegal Alien Apprehended or Located, Form I-213 ( (Rev. 8-13-62) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 RECORD OF ILLEGAL ALIEN APPREHENDED OR LOCATED Given Na Initial is Color of Eyes Colur of Hair Family Name CORRALES-Mesa, Luis Male Brown Black Nationality (Citizenship) Passport Number File Number Height Weight Occupation 69\" 145 Laborer MEXICO Scars or Marks United States Address NONE Upper front tooth gold Passenger Boarded At Social Security No. F.B.I. No. ROODSOX 7-2-64 EWI ON FOOT AMI DOWNRIVER YSLETA, TEXAS - Method of Location Permanent Address CALLE SAMANIEGO, #223, CIUDAD CHIHUAHUA, CHIH., MEXICO Farm & Ranch check Date of Action Location Code Status at Entry Status When Found Birthdate 1-11-07 (57) 9-9-64 EPT-CSB EWI In Agricul Length of Time Illegally in U. S. Birthplace Alien Registration CD. CHIHUAHUA, CHIH., MEXICO 1-6 months Appreheaded/keeses Date 14307 Visa Issued At Lifted Form Not Lifted Artesia, New Mexico 9-9-64 Date Visa Issued Send C. O. Record Check To: By EPD B.A. Peterson- Redo Stille Immigration Record 152 to 162 as bracero) Criminal Record Claims none Claims none Number & Nationality of Minor Children Name, Address and Nationality of Spouse Ausucion LERMA Mexi CO 2 Mexico (address same) Mother's Name and Nationality Father's Name and Nationality Luis CORRALES-Montes (dec.) Mexi co Angela MESA-Garcia (dec.) Mexico Deportation Charge Property in U. S. Not in Immodiate Possession ROTEN None Narrative (Time, Date, Place, Manner of Last Entry - Purnish Details) (See Reverse) ABFZ REP: 9-10-64 Subject alien states that he last entered the United States without inspection by crossing the river on foot about 1 mile downriver from Yaleta, Texas on July 2, 1964 at about 3AM. Subject states that he then walked to the bus station in El Paso, Texas and caught a bus at about 11:30PM that night to Carlsbad, NM. Subject states that he hid the night on the Pecos river bank that night in Carlsbad and the next morning he caught another bus to Artesia, NM. Subject then went to work for R.C. Clack near Artesia on his farm. Subject states that: His employer was paying him 75$ per hour. His employer paid him each week. He sent about $150 to Mexico, in cash letter.) He worked foogemployer for about 9 years as a bracero. Employer stated that the subject told him that he had his citizenship papers arragned. Employer asked for SS card but shubject told him he did not have one Subject told the employer that he was going to arrange papers but did not have any. NO AIR SMUGGLING KNOWLEDGE. Subject states that he intended to return to Mexico in December. (Continue on Reverse) IMMIGRATION TINSPECTOR Received (subject and documents) (report of Interview) from DISTRIBUTION ORIGIP Officers \" - sec. 19. at ( ) M. \" - IO. Disposition (Receiving Officer) Form I-213 (Rev. 8-15-62) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service * U.S. SOV CAMMENT PRINTING OFFICE: 1964-724.00"
}