{
	"anumber": "A14115644",
	"id": "A14115644_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR A SEARCH OF THE RECORDSINGS OF THE IMMIGRATION AND NATURALIZATION SERVICE UNDER THE FREEDOM OF INFORMATION ACT ( (5 USC 552), NARA-06931478"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 everyo APPLICATION FOR A SEARCH OF THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE UNDER THE FREEDOM OF INFORMATION ACT (5 USC 552) SEE INSTRUCTION I 3 Type or print the name, address and phone PERSON CONSENTING number of the person to whom the infor- mation should be returned in the box below: NAME (SEE INSTRUCTIONS ON REVERSE) LUIS CORRALES ADDRESS NAME 1262 S. KERN AVENUE LIIIS CORRALES CTTY STATE ZIP CODE M A NG LOS ANGELES CALIFORNIA 90022 ADDRESS 1262 s KERN AVENUE SIGNATURE OF PERSON CONSENTING CITY, STATE ZIP COCE LOS ANGELES, CALIFORNIA 90022 PHONE M. NUMBER 268-5063 PLEASE READ ALL INSTRUCTIONS CAREFULLY BEFORE COMPLETING THIS FORM 1. SPECIFIC INFORMATION DESIRED: AVAILABILITY OF A PERMANENTE RESIDENT CARD. 2. STATE PURPOSE FOR WHICH DESIRED: APPLY FOR SOCIAL SECURITY BENEFITS. DATA FOR IDENT IF ICAT ION OF THE RECORD TO BE SEARCHED NOTE: Lack of sufficient information may result in our inability to furnish the information requ sted. Middle Name 4. Alien Registration Number 3. Family Name Given Name CORRALES LUIS 6. Name Used at Time of Entry Into the United States MEZA UNKNOWN 5. Other Names Used, If Any LUIS CORRALES NONE 7. Place of Birth 8. Date of Birth 9. Port Abroad from which left for the United States CHTHUAHLIA MEXICO 1-06-06 10. Port of Entry into the United States 11. Date of Entry 12. Name of Vessel or Other Means of Entry ELP 12-12-19 WALKING GIVE THE FOLLOWING INFORMAT ION IF THE PERSON WASNATURAL 17ED ELP 14. Certificate Number 15. Naturalization Date 13. Name on Naturalization Certificate 16. Address at Time of Naturalization 1% Name and Location of Naturalization Court / to all costs incurred for search and duplication of materials amounting to $3.00 advance or more. Additionally, agree pay where the antic ipated fee chargeable exceeds $25.00, / agree to pay an depos it of 25% of the antic ipated fee or $25.00, whichever is greater. Luis Wallabe Ms (Signature of Applicant) N585"
}
