{
	"anumber": "A14115644",
	"id": "A14115644_0069",
	"page_index": 69,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0069/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REcovery of Illegal Alien Apprehended or Located, Form 1-213 ( (Rev. 8-15-62) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 RECOF OF ILLEGAL ALIEN APPREHENDED OR OCATED Family Name Given Na Initial Color of Eyes Color of Hair CORRALES-Mesa, Luis Male Brown Black Nationality (Citizenship) Passport Number File Number Height Weight Occupation MEXICO 69\" 145 Laborer United States Address Scars or Marks NONE Upper front tooth gold Aixper a KOOD XSKIX Axxixat 7-2-64 Passenger Boarded At Social Security No. F.B.I. No. EWI ON FOOT 1MI DOWNRIVER YSLETA, TEXAS Permanent Address Method of Location CALLE SAMANIEGO, #223, CIUDAD CHIHUAHUA, CHIH., MEXICO Farm & Ranch check Birthdate Date of Action Location Code Status at Entry Status When Found 1-11-07 (57) 9-9-64 EPT-CSB EWI In Agriculture Birthplace Length of Time Illegally in U.S. Alien Registration CD. CHIHUAHUA, CHIH., MEXICO 1-6 months Visa Issued At Lifted Apprehended/ Located /Near) Date 1:30PM Form Not Lifted Artesia, New Mexico 9-9-64 Date Visa Issued Send C. O. Record Check To: Apprehended/kocared By EPD B.A. Peterson- R.J. Stille Immigration Record ('52 to 162 as bracero) Criminal Record Claims none Claims none Name, Address and Nationality of Spouse Number & Nationality of Minor Children Ausucion LERMA (address same) Mexico 2 Mexico Father's Name and Nationality Mother's Name and Nationality Luis CORRALES-Montes (dec.) Mexico Angela MESA-Garcia (dec.) Mexico Property in U.S. Not in Immediate Possession Deportation Charge None ROTEN Narrative (Time, Date, Place, Manner of Last Entry - Furnish Details) (See Reverse) ABFZ REP: 9-10-64 Subject alien states that he last entered the United States without inspection by crossing the river on foot about 1/2 mile downriver from Ysleta, Texas on July 2, 1964 at about 3AM. Subject states that he then walked to the bus station in El Paso, Texas and caught a bus at about 11: 30PM that night to Carlsbad, NM. Subject states that he hid the night on the Pecos river bank that night in Carlsbad and the next morning he caught another bus to Artesia, NM. Subject then went to work for R.C. Clack near Artesia on his farm. Subject states that: His employer was paying him 75$ per hour. His employer paid him each week. He sent about $150 to Mexico, in cash(by letter.) He worked forgemployer for about 9 years as a bracero. Employer stated that the subject told him that he had his citizenship papers arragned. Employer asked for SS card but shubject told him he did not have one. Subject told the employer that he was going to arrange papers but did not have any. NO AIR SMUGGLING KNOWLEDGE. Subject states that he intended to return to Mexico in December. FINGERPRINTS SSNT THIS DATE (Continue on Reverse) IMMIGRATIONSaTRO INSPECTOR DISTRIBUTION ORIG. F Received (subject and documents) (report of interview) from \" - sec. Officer: 19. at CC - SIG. ( ) M. Disposition (Receiving Officer) Form I-213 (Rev. 8-15-62) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service U.S. GOVERNMENT PRINTING OFFICE: 1964-724-002"
}
