{
  "anumber": "A14115644",
  "id": "A14115644_0068",
  "page_index": 68,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0068/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 6/29/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 Place of Birth Date of Birth Color Marital Status Sex S M D Sep. W M F Other Numbers (Soc. Sec.; Armed Forces; FBI; Iden.) Parents' Names and Addresses (if known) Height Weight Eyes Hair Complexion Identifying Marks and Scars Residence last 5 years (Street & Number, RFD, etc.) City State County FROM TO Employment last 5 years (Employer's Name and Address) Occupation or FROM TO Profession Prior Occupation (not included in above) Spouse (alias's present address) Spouse's date and place of birth Organizations (Name of, Including Societies, Clubs, etc., past or present) LAST ENTRY PRIOR ENTRIES AND DEPARTURE'S (Date, Port) Selective Service No., Address of Board; Classification; Ordered to report for Induction OSC Iss. OSC Serv. TD county Validity W/A Iss. W/A Serv. Det; Rel; Prison; Hospital Approx. Hrg. Time VD prior hearing to ; Ext. Apprehension date: Hearing: Line 551 Case (Mexican) Line 552 Case (Other (Check one) Date Place Hour DETENTION Place RELEASE Bond (amount) DATA Expense of DATA Parole Since Since PROCESSING DATA Check column # 1 (when applicable) for action to be taken; column # 2 when action is taken # 1 # 2 # 1 # 2 Prepare order to show cause Obtain pp or other evidence of nationality from alien Prepare docket form Notify consulate Send \"corrected\" Form G-600 to Inv. Statistics Apply for Canadian consent Type and mail Agency Checks Apply for Mexican Certificate of Nationality FBI (Identif.) FBI (Dom. Int.) Complete passport data Form I-217 Report property arrangements (if detained) CIA G-2 Other Notify FBI of selective service violation Two fingerprint sets: one to the FBI, other to file Notify FBI of entry as stowaway Fingerprints to Notify re apprehension: Photographs. Number required District Office Regional Office CO Verify arrival Lodge detainer with civil authority at: Record check Local police (Earliest possible release date is ) Prepare letter granting days to VD Prosecution Report I-530 to CO Report to Overseas Office at Obtain relating file from CO Report to Stc y Coord. Office at Obtain relating file from DO Report to Dist. V. at Report to C.P.I. at"
}