{
  "anumber": "A14115644",
  "id": "A14115644_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 5-5-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1984,
        1919
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE OMB NO. 1115-0009 IMMIGRATION AND NATURALIZATION SERVICE Approval Expires 1/31/84 Auc FEE STAMP 4-12-85 my APPLICATION TO FILE PETITION FOR NATURALIZATION 10:00 John Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name CORRALES-MEZA, LUIS gith TYPE.) No. A14-115-644 Date: 08-08-84 Section of Law (Leave Blank) (1) My full true and correct name is CORRALES-MEZA, LUIS (Full true name without abbreviations) (2) I now live at 1255 S. KERN AVE. (Number and street, ) LOS ANGELES, CA. 90022 (City county, state, zip code) (3) I was born on 01- 11-1907 in CHIHUAHUA MEXICO (Month) (Day) (Year) (City or town) (County, province, or state) (Country) (4) I request that my name be changed to NONE 11 (5) Other names I have used are: (Include maiden name) Sex: Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (9) Can you sign your name in English? Yes No (10) My lawful admission for permanent residence was on 12-27 1919 under the name of (Month) (Lay) (Year) CORRALES-MESA, LUIS at ELP. TEXAS (City) (State) 12 27 - (11) (a) I have resided continuously in the United States since 19 (Month) (Day) (Year) (b) I have resided continuously in the State of CALIFORNIA since 02 ol 84 (Month) (Day) (Year) (c) During the last five years I have been physically in the United States for a total of 60 months. (12) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: (13) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) 02 1984 PRESENT TIME 1255 S. KERN AVE. LOS ANGELES, CA. , (b) 19 19 (c) 19 19 (d) 19 19 (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You DATE RETURNED RETURNED TO THE UNITED STATES UNITED STATES NO RECORD LOS (b) Since your lawful admission, have you been out of the United States for a period of months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6. months. NAME OF SHIP OR OF AIRLINE, RALLROAD COMPANY, Bost DATE DEPARTED COMPANY, OR OTHER MEANS USED $0 KETURNITO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU DATE RETURNED RETURNED TO THE UNITED STATES UNITED STATES NONE GS60 sent (OVER) Form N-400 (Rev. 5-5-83) N (1)"
}