{
  "anumber": "A14115644",
  "id": "A14115644_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER TO SHOW CAUSE AND NOTICE OF HEARING, Form 1-221"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF : TICE Immigration and Naturalization Service ORDER TO SHOW CAUSE and NOTICE OF HEARING In Deportation Proceedings under Section 242 of the Immigration and Nationality Act UNITED STATES OF AMERICA: In the Matter of ) Luis CORRALES-Meza ) ) Respondent. ) To: Luis Corrales-Meza File No. A14 115 644 (name) Alien Detention Facility, El Paso, Texas (address) UPON inquiry conducted by the Immigration and Naturalization Service, it is alleged that: 1. You are not a citizen or national of the United States; 2. You are a native of Mexico and a citizen of Mexico ; 3. You entered the United States XIX near Ysleta, Texas on or about July 2. 1964 ; (date) 4. You were not then inspected by an immigration officer. AND on the basis of the foregoing allegations, it is charged that you are subject to deportation pursuant to the following provision(s) of law: Section 241(a) (2) of the Immigration and Nationality Act, in that, you entered the United States without inspection. WHEREFORE, YOU ARE ORDERED to appear for hearing before a Special Inquiry Officer of the Immigration and Naturalization Service of the United States Department of Justice at the Service Detention Facility El Paso, Tex. on September 25, 1964 at 9:00 a. m, and show cause why you should not be deported from the United States on the charge(s) set forth above. IMMIGRATION AND NATURALIZATION SERVICE Dated: September 10, 1964. Time Form 1-221 (signature and title of issuing officer) A. G. Vaughan, Deputy District Director (Rev. 9-12-63) A FP1-LPC-3-64-20M-1145 (over) E1 Paso. Texas jpd. (City and State)"
}