{
	"anumber": "A14115644",
	"id": "A14115644_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14115644_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RESPONSE TO APPLICANT FOR INFORMATION UNDER THE FREEDOM OF INFORMATION ACT, Form G-639A ( (3-1-75)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 RESPONSE TO APPLICANT FOR INFORMATION UNDER THE FREEDOM OF INFORMATION ACT U. S. DEPARTMENT OF JUSTICE IMMIGRATION & NAMURALIZATION SERVICE DATE: Aug. 23, 1977 300 NORTH LOS ANGELES STREET FILE# A14 115 644 Raymond Campos LOS ANGILLS, CALIFORNIA 90012 Luis Corrales Meze One Stop Immigration Center, Inc. 1443 Wright St. Los Angeles, CA 90015 Your request for a search of the Immigration and Naturalization Service records under the Freedom of Information Act (5 USC 552) has been re- ceived. Please note the paragraph checked below. Time limit for response to your request has been extended to Response to your request has been delayed. We expect a determina- tion to be made by . We seek your patience and understanding during the extension of time or delay which is due to: You may elect to treat this interim response as a denial of your request and file an appeal in writing to the Attorney General (Attention: Freedom of Information Appeals Unit) Department of Justice, Washington, D. C. 20530. Your request was forwarded to this office since we have jurisdiction in the matter. Date received On the basis of the information furnished we are unable to Identify any relating record. The following available information is furnished. No other informa- tion relating to your request is contained in available records. The records of this Service show that the above subject was not lawfully admitted to the U.S.A. as a permanent resident. A fee of is charged for services rendered. Please sub- mit this amount immediately in the form of a check or money order made payable to the Immigration and Naturalization Service. Be sure to re- turn your remittance with the attached copy of this letter. This is confirmation of conversation on concerning the delay in responding to your request. Sincerely, E. William Contact Representative Form G-639A (3-1-75) UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service"
}
