{
	"anumber": "A14366479",
	"id": "A14366479_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form 1205 U.S. DEPARTMENT OF LAVOR NATURALIZATION SERVICE No. 30716 DUPLICATE STATES OF to be for warded to the Bureau of Naturalization UNITED 306384 1500591 PETITION FOR NATURALIZATION To the Honorable The petition the of Supreme Samuel of the State of New Naran Judicial District 96 (arrivedas moural Jr aby Aled. respectfully showeth First. My place of residence is New York, N F Second. My occupation is Carpenter (Give number and street.) Third. I was born on the 10 day of see anno Domini 867 at Ropuea Fourth. I emigrated to the United States from antwerk on or about the g day of nov anno Domini 1. 902 and arriced in the United States, anno Domini for on the ressel feeland At the port of new york on the s day of Dee (If the alien arrived otherwise than the character of conveyance or pain Fifth I declared my intention to become a citizen of the United States onethe 18 Sept given.) Demind / 908 should he at Ida the Disfness day of Breyn H.Y. Court Sixth I am married. name is ( Anegra ) Karan in Rustia and now resides at 96 monral st She was born slutek Now York, N (Give number and street I have children, and the name, date and place of birth, and place of residence of each of said children is as follows Hidas 10 \"sips 1900 aaron 46 pub 190s as Russia Preside ain.4. Seventh. I am not a disbeliever in or opposed to organized government or a member of or affiliated with any organization or body of persons teaching diabelief in or opposed to organized government. I am not a polygamist nor 18 believer in the practice of polygamy. / am attached to the principles of the Constitution of the United States. and it is my intention to become . citizen of the United States and to renounce absolutely and forever all allegiance and Adelity to any foreign prince, potentate, state, or sovereignty. and particularly to of whom at this time / am a subject. and it is my intention NICHOLAS II LIPEROR OF FALL THE RUSSES reside permanently in the United States. ighth. I am able to speak the English language. Ninth. I have resided continuously in the United States of America for the term of Ave years at least. immediately preceding the date of this petition, to with since the day of Dee . anno Domini 90 and in the State of New York, continuously next preceding the date of this petition, since the 5 day of Dee anno Domini ,902 being a residence within this State of at least one year next preceding the data of this petition. Tenth. I have not heretofore made petition for citizenship to any court. it made petition for citizenship to the Court of on the day of anno Domint + and the said estition inas denied by the sold Court for the following reasons and causes. to wit the of - - HP - Attached hereto and made a part of this petition at my declaration of intention to become a citizen of the United States and in refincate from the Department of Lubor, with my agree and the affdarits of the two verifying witnesses thereto, required by law. Wherefore your petitioner prays that he may be admitted a citizen of the United States of America famuel Kallon ii (Complete and true signature of petitioner Declaration of Intention an / of / repartment of Partner the this day of June 3 191 NOTE TO Class or Count It petitioner arrived in the United States ON OR BEFORE JUNE 20. 1906, strike out the wonts reading and Certificate of Arrival No. from Department of labor AFFIDAVITS OF PETITIONER AND WITNESSES. STATE OF NEW YORK, 88: County of New York, The aforesold petitioner being duty sworn. deposes and says that he is the petitioner in the above-entitled proceedings that he has read the foregoing petition and knows the contents thereof; that the said petition is signed with his full. true name: that the same is true of his own knowledge except as to matters therein stated to he alleged upon information and belief, and that as to those matters he believes it to be true. Samuel worldom Complete signature of petitionor & a"
}
