{
  "anumber": "A14366479",
  "id": "A14366479_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Petition, 2-1"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Fifth / declared my intention to become a citizen of the United Ste tes onethe 10 at Disfuel day of the depo & E.Doun.,4. ano Demint 908 Breyn H.Y. Sixth am Scubak married name is Ida Muggar Court , Karan She was born in Rustia and note resides at 96 monrol St : Note York, N I' J (Give number and street.) I have children, and the name, date and place of birth. and place of residence of each of said children is as follows: Hidas Aaron 46 pub 1900 190s as Russia reside 4, lv Spo Seventh. I am not a disbeliever in or opposed to organized government or a member of or affiliated with any organization or body of persons teaching diabelief in or opposed to organized government. I am not a polygamist nor 18 believer in the practice of polygamy. / am attached to the principles of the Constitution of the United States. and it is my intention to become e ottizen of the United States and to renounce absolutely and forever all allegiance and Adelity to any foreign prince potentate state, or sovereignty. and particularly to of whom at this time / am a subject. and it is my intention NICHOLASTI. AMPEROR reside permanently in the United States. ighth. I am able to specific the English language. Ninth I have resided co tinuously in the United States of America for the term of Ave years at least. immediately preceding the date of this petition. to wit. since the day of Dee , anno Domini 1 90 and in the State of New York, continuously next preceding the date of this potition. since the 5 day of Dee anno Domini god being a residence within this State of at least one year next preceding the date of this petition. Tenth. I have not heretofore made petition for citizenship to any court. th made petition for citizenship to the Court of on the day of anno Domtnt + work the still-patition ins denied by the said Court for the following reasons and causes. to wit. 1 the of love - - TIP / Attached hereto and made @ part of this petition my declaration of intention to become a citizen of the United States and 1 certificate from the Department of Lisber, enforce with and the @Mdavits of the two verifying witnesses thereto, required by law. Wherefore your petitioner prays that he may be admitted a citisen of the United States of America famuel Karcon 11 (Complete and true signature of petitioner.) or Problem this June 3 Declaration of Intention RT by day of 191 Nore to CLERK OF COUNT It petitioner arrived in the United States on BEFORE JUNE 20. 1900, out wants of Arrival from Department of Fatior AFFIDAVITS OF PETITIONER AND WITNESSES. STATE OF NEW YORK, ss: County of New York, The aforesaid petitioner being duty sworn, deposes and says that he is the petitioner in the above-entitled proceedings that he has read the foregoing petition and knows the contents thereof; that the soid petition is signed with his full, true name: that the same is true of his own knowledge except as to matters therein stated to be alleged upon information and belief, and that as to those matters he believes it to be true. Samuel worrow January groos (Complete and true signature of petitioner ) occupation Merchant residing at 190 monsest and Wilensky occupation Barker residing at zid madeorn so nach being and respectively swarns deposes and says that he is a citizen of the United States of America: that he has personally known Samuel severally. duly, Marian I the petitioner above mentioned, to have resided in the United States continuously immediately preeeding the date of flung his petition, since the day of entitled petition is made continuously since the gungan anno Domini / 90 Van in the State in which the above- I day of anno Domint / 901 and that he has personal knowledge that the said petitioner is a person of good moral character, attached to the principles of the Constitution of the United States, and that the petitioner is in every way qualified. in his opinion, to be admitted a citizen of the United States. Janual GROSS I Isaac Wilcushy L Subscribed and sworn todbefore me by the above named petitioner and witnesses this day of June (SEAL anno Domini 191.3 11-3444 same Giool Special Clerk of in supreme Court No 231"
}