{
  "anumber": "A14366479",
  "id": "A14366479_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, N-600 ( (Rev. 8-14-64)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "France",
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1910,
        1899,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Due Form approved. FEE STAMP Budget Bureau No. 43-R105.8. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE APPLICATION FOR CERTIFICATE RECEIVED OF CITIZENSHIP 1965 AUG -9 AM 10: 00 Take or mail this application to: IMMIGRATION AND NATURALIZATION SERVICE 1060 BROAD ST. NEWARK, (Print or 2, type) ISIDOR LEONARD KARAN NEWARK N. J. Date AUG 5, 1965 nee (Name) (Maiden name, if any) 330 WEST JERSEY ST. (Apartment number, Street address, and, if appropriate, \"in care of\" ALIEN REGISTRATION ELIZABETH UNION N.J. No. 14366479 (City) (County) (State) D See Instructions on Pages 5 and 6 I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. SLUTSK (1) I was born in RUSSIA / UNKNOWN SEPT. 4 1899 on (City) (State or country) (2) My personal description is: Sex MALE complexion ; color of eyes BROW! Acolor of hair BROWN, Medical (Month) (Day) (Year) height feet 8 inches; weight 170 pounds; visible distinctive marks NONE 5 Marital status: Single; Married; Divorced; Widow (er) (3) I arrived in the United States at (NEW YORK C, N.Y. on JUNE 7-19-1910 under the name YSSOR KARAN CHORON (City and State) Month) (Day) (Year) by means of SHID (UNRNOWN) A Ruston on U.S. Passport No. issued to me at Russia 6-13-10 V-3301 (Name of ship or on other means of arrival) stline SS Stonic 6-22-10 V-3314 (Month) (Day) (Year) (4) Fill in this block only if you arrived in the United States before July 1, 1924. (a) My last permanent foreign residence was UNKNOWN SLUTSK RUSSIA (b) I took the ship or other conveyance to the United States at UNKNOWN (City) (Country) RUSSIA (c) I was coming to SAMUEL KARAN (City) at NEW YORK CITY (Country) N.Y. (d) I traveled to the United States with IDA KARAN (MOTHER) AARON KARAN (BROTHER) (Name of person in the United States) (City and State where this person was living) K-650 (Names of passengers or relatives with whom you traveled, and their relationship to you, if any) (5) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following information for every absence. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH UNITED STATES RETURNED TO THE UNITED STATES several start tips Canada no largest others top Day 7 (f) filed a declaration of intention to become a citizen of the United States or a petition for naturalization. I staremon (have) (have not) (If \"have\" give full details on a separate sheet of paper this size and attach it, showing question number.) TO THE APPLICANT.-Do not write between the double lines below. Continue on next page. ARRIVAL RECORDS EXAMINED ARRIVAL RECORD FOUND Card index Place Date Index books E0 :01 WU L2 901 5961 Name Manifests LINA HVW T'AN Manner FRANCE IVN WWI Marital status Age (Signature of person making search) Form N-600 (Rev. 8-14-64) (1)"
}