{
  "anumber": "A14366479",
  "id": "A14366479_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ARRIVAL INFORMATION, A14366879"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service ARRIVAL INFORMATION File No.: A14366479 TO ASSIST IN LOCATING A RECORD OF YOUR ARRIVAL IN THE UNITED STATES, PLEASE FILL IN ITEMS 1 TO 20 TO THE BEST OF YOUR KNOWLEDGE AND RETURN THIS FORM TO THIS OFFICE. 1. PRESENT NAME ISIDOR LEONARD KARAN 2. NAME USED AT TIME OF ENTRY ISOR CHORON RECEIVED 3. OTHER NAMES USED AT TIME OF ENTRY NONE N 4. PORT OF ENTRY 5. DATE OF ENTRY 6. NAME OF SHIP OR PLANE UNKNOWN NEWYORK CITY PLEASE REFER THE RUSSIAN EASJERN-ASIATIC To ATTACHED NOTE STEAMSHIP Co. 7. CITY WHERE SHIP OR PLANE WAS BOARDED 8. NATIONALITY AT TIME OF ENTRY DATE OF DEPARTURE LiBAVA JUNE 22, 1910 RUSSIAN 8. MARITAL STATUS AT TIME OF ENTRY 10. AGE AT TIME OF ENTRY 11. PLACE OF BIRTH CHILD 10 years SLUTSK, RUSSIA 12. OCCUPATION AT TIME OF ENTRY 13. SEX 14. RACE CHILD MALE WHITE 15. IDENT IF YING SCARS OR MARKS NONE ROTORRIC TOLATEIC 16. LAST PERMANENT ADDRESS IN FOREIGN COUNTRY AT TIME OF ENTRY SLUTSK - -RUSSIA 17. FATHER'S FULL NAME SAMUEL KARAN (SCHMUILO CHORON) 18. MOTHER'S MAIDEN NAME CHAIA KNIGER 19. NAME AND ADDRESS OF THE PERSON IN THE UNITED STATES TO WHOM YOU WERE GOING. SAMUEL KARAN - 96 MONROEST. N.Y. C. 20. NAMES OF PERSONS WHO CAME WITH YOU, AND IF NATURALIZED, GIVE DATE AND PLACE OF THEIR NATURALIZATION CHAIA CHORON - MOTHER ARAN CHORON- BROTHER C-650 N-14A (10-1-62) W-7-8-3348"
}