{
	"anumber": "A14366479",
	"id": "A14366479_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Application"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1897, 1910, 1903, 1938, 1914, 1870]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "(CONTINUE HERE) I claim United States citizenship through my (check whichever applicable) father; mother; both parents; husband ; as a British Columbia Indian having resided in Alaska continuously since (8) My father's name is SAMUEL KARAN ; he was born on UNKNOWN 67 1870 at RUSSIA I (Month) (Day) (Year) ; and resides at DEAD MARCH 7, 1938 (City) (State or country) (Street address, city, and State or country. If dead, write He became a citizen of the United States by birth; naturalization on SEPT. / 1914 in \"dead\" the SUPREME and date of death.) COURT N.Y.C. N.Y. Certificate No. C492887 7 (Month) (Day) (Year) ; (Name of court, city, and State) through his parent(s), and issued Certificate No. A or AA (was) (was not) (If known) His former Alien Registration No. was He HaspiToTsince lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he lost 133 (has) (has not) and attach it, showing question number.) He resided in the United States from 1903 to 1938 ; from to ; from to 2nd (Year) (Year) (Year) (Year) (Year) I am the child of his marriage. (1st, 2d, 3d, etc.) (Kniger) B Dr (Year) (9) My mother's maiden name was IDA KNOEGER ; her present name is decaald ; she was born on UNKNOWN ; at UNKNOWN RUSSIA ; she resides (Month) (Day) (Year) (City) 1-31-14 (State or country) DEAD 18 at She became a citizen of the United States (Street address, city, and State or country. If dead, write \"dead\" and date of death.) by birth; naturalization under the name of on in the (Month) (Day) (Year) (Name of court, city, and State) Certificate No. ; through her parent (s), and issued Certificate No. A or (was) (was not) AA 19 (If known) Her former Alien Registration No. was She since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when she (has) (has not) lost and attach it, showing question number.) She resided in the United States from 1910 to 1912 ; from to ; from to I am the (Year) (Year) (Year) (Year) child of her 1st (Year) (Year) marriage. (1st, 2d, 3d, etc.) (10) My mother and my father married to each other on NNKNOWN at SLUTSK RUSSIA MAY 21 1897 were (Month) (Day) (Year) (City) (State or country) My mother has been married 1 time (s), and my father has been married 23 time (s). 3. etc.) (20) (1, 2, 3, etc.) (11) My NEITHER served in the Armed Forces of the United States from (father, mother) (Date) to and honorably discharged. Harsino (Date) (was) (was not) (12) I lost my United States citizenship. (If citizenship lost, on a separate sheet this size state how and when (have) (have not) you lost and attach it, showing question number.) (13) Issue my certificate in the name of : ISIDOR LEONARD KARAN (14) I submit the following documents with this application: Nature of Document Names of Persons Concerned 22 MI- Karan family Record n mansage parents & birth appl a pool of appl Father's devace from his 15Twife extra DC father (2)"
}
