{
  "anumber": "A14366479",
  "id": "A14366479_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXAMINER'S REPORT OF TESTIMONY OF WITNESS ( (Section 341 of the Immigration and Nationality Act)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        1922,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service EXAMINER'S REPORT OF TESTIMONY OF WITNESS (Section 341 of the Immigration and Nationality Act) File No. A14366479 Date: 10-25-65 DISTRICT DIRECTOR OR OFFICER IN CHARGE I certify that on 10-25-65 at NEWARK N.J. (Date) (City, State, and, if foreign, Country) I examined SARAH KArAN under oath, and on the basis thereof, I made the (Name of Witness) following findings: 1. Witness resides at 330 WEST Jersey St. Elizabeth, NJ 2. Witness was born on 11-25-1900 at NEW york, NY 3. Witness is the wife of (State relationship, friend, etc.) Isidor LEONArd KARAN APPLICANT. and did identify the photograph sub- (Applicant's name) mitted with the application as that of the applicant. 4. Witness has - personal knowledge of the relationship between the applicant and (no) SAmuEL KARAN , having been acquainted with the appli- (Person(s) through whom citizenship is claimed) cant since 1921 (Date) and the person(s) through whom citizenship is claimed since 1922 . (Date) I further certify that I examined this witness regarding all of the essential facts alleged in the application and contained in the record of the case and that no discrepancies or inconsisten- cies were disclosed, except. witness Spouse of Applicant whomshe Married ON 7-3-23 Samel Heldman Form N-341 (Rev. 5-20-65) Exh-5 (Officer's signature) Gen (Officer's ally title) (nastly.)"
}