{
  "anumber": "A14366479",
  "id": "A14366479_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0011/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF DEATH, 5037"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1938
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CITY OF NEW YORK DEPARTMENT OF HEALTH BUREAU OF RECORDS AND STATISTICS Borough of BROOKLYN New York, N. Y. 18,1965 Below is a photostatic copy of a certificate on file in the Bureau of Records and Statistics of the Department of Health of the City of New York. BUREAU OF RECORDS DEPARTMENT OF HEALTH BOROUGH OF BROOKLYN CERTIFICATE OF DEATH 9 MAR 8 AM : 08 Certificate No 5037 1 PLACE OF DEATH BOROUGH OF Brooklyn The Jewish Hospital of Bk 555 Prospect Place Name of Institution 2 PRINT FULL NAME Samuel Karan First Name Middle Name Last Name Residence (usual place of abode) Ave. (If nonresident, give place and State) No. 268 Buffalo Ave St. Borough of Brooklyn PERSONAL AND STATISTICAL PARTICULARS MEDICAL CERTIFICATE OF DEATH 4 SEX 5 COLOR OR RACE 6 SINGLE, MARRIED, WIDOWED. OR 18 DATE OF DEATH DIVORCED (write the word) March 7th 38 Ma Married 19 White (Month) (Day) (Year) 6A WIFE HUSBAND Rebecca Karan OF 19 I hereby certify that deceased was admitted to this institution on February 17th.1938., that I last 7 DATE OF BIRTH OF DECEDENT (Month) (Day) (Year) saw h im alive on the 7th day of March 8 AGE If LESS than 19 3.8, that he died on the 7th day of 1 day .hrs. 69 .yrs ds. or min. March mos 19.38, about. 6. 42lock P.M. Trade, profession, or particular The principal cause of death and related causes of Importance were as follows DURATION kind of work done, as spinner, Sex ton sawyer, bookkeeper, etc Industry or business in which work was done, as silk mill, sawmill, bank, etc. Synagogue Diabetes millette D Total time (years) C Date deceased last worked at spent in this and year). sebruary 15, 1938 occupation 35 this occupation (month Other gostributory causes of Importance: 10 BIRTHPLACE Artivoaclerose (State or country) Russia Community Selectic How long in 12 How long resi- U.S (if of for 36 yrs dent in City eign birth) of New York 36 yrs Name of operation, Date, 13 NAME OF FATHER OF DECEDENT Aaron Karan What test confirmed diagnosis? EKGX Was there an autopay? No 14 BIRTHPLACE OF FATHER (State or country) Rus sia Signature M. D. 15 MAIDEN NAME OF MOTHER 20 Pathologist's Report (See Over) OF DECEDENT unknown 16 BIRTHPLACE OF MOTHER (State or country) Rus sia 17 INFORMANT Son,Dr Aaron Karan Signature M. D. 21 PLACE OF BURIAL Husch Eury DAT OF BURIAL March 8,1938 22, UNDERTAKE # 188 ADDRESS EAU OF RECORDS DEPARTMENT OF HEALTH This is to certify that the foregoing is a true copy of a record in my custody LOUIS Weiner BY Abraham Sinorely Acting Director Borough Registrar WARNING: DO NOT ACCEPT THIS TRANSCRIPT UNLESS THE RAISED SEAL OF THE DEPARTMENT OF HEALTH IS AFFIXED THEREON. THE REPRO- DUCTION OR ALTERATION OF THIS TRANSCRIPT IS PROHIBITED BY SECTION 3.21 OF THE NEW YORK CITY HEALTH CODE. NOTICE: In issuing this transcript of the Record, the Depart- ment of Health of the City of New York does not certify to the truth of the statements made thereon, as no inquiry as to the facts has been provided by law. H+"
}