{
  "anumber": "A14579720",
  "id": "A14579720_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for a of Immigrant Visa,, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1931,
        1962,
        2023,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 Form approved. Budget Bureau No. 43-R401.1 Date filed 10. Fee stamp FEE PAID No. Los-88, S OF RECEIVED Immigration and faturalization Service VE FOR U.S. IMMIGRATION AND NATURALIZATION SERVICE Los Aageles, Calif. M & F OF IMMI- Date 11/2/62 Verified by 16.c NT VISA Nov 2 II 59 AM 1962 (Read this form and the attached instructions carefully before filling in petition) REMOND LOS ANGELES SECRETARY OF STATE: The petition is revalidated: The petition was filed on and is approved. Status is granted under section Your admission cannot be authorized all Remarks time. You are PAROLED INDEMNITELY District Director) (District Director) HONORIY KAHOLSE Conditions: 212 (d) (5) & N Act LOS ANGELES, CALIFORNI FILE: A. (District) (District) HHW DEC 1 A 1962 MAY 11 1965 (Date) (Date) NER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. Block I.-Information Pertaining to Petitioner Sui Kwan Chow 2. Name (First name) (Middle name) (Last name) Woo If you are a married woman, give your maiden name 1227 W. 121st. Street Los Angeles, Calif 3. Address in United States (Apt. No.) (Number and street) (Town or city) (State) none Address abroad (if any) (Number and street) (City or town) (Province) (Country) 4. I was born December 8, 1931 at Gong Tow Vil. Hoiping, China. (Date) (City or town) (State or Province) (Country) 5. If you are a citizen of the United States, give the following: Was your citizenship acquired through birth in the United States, through naturalization, through parentage, or through marriage ? X If at acquired the through through naturalization District give Court, number of L.A.,Califor naturalization certificate on Aug and date 31, and gase of If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? If so, give number of certificate: If not, submit evidence of citizenship in accordance with Instruction 3a (2). Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. 6. If you are a lawful permanent resident alien of the United States, give the following: Alien Registration Number: A- Date, place, and means of admission for lawful permanent residence Have you ever lost status as a lawful permanent resident alien If so, explain: For Statistics Form I-130 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Rev. 6-15-62) <Recei veu Reid-Tr. DEC 1 Compl A 1 1962 MEMBER FEDERAL HOME LOAN BANK SYSTEM FEDERAL SAVINGS AND LOAN INSURANCE CORPORATION"
}