{
	"anumber": "A14579720",
	"id": "A14579720_0069",
	"page_index": 69,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0069/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form Approved, Budget Bureau No. 4-R150.2."
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 WONG Woon Yee 2nd P. Form Approved Budget Bureau No. 47-R150.2. (I hereby apply for an immigrant visa and alien registration at the American Consulate General at Hong Kong and state the following facts: 1. (My family name is) (My first name is) (My middle name is) WONG WOON YEE 2. (My full name in native alphabet (If other than Ro- man letters are used) is) 3. (Other names I have used or by which I have been known are married woman, give maiden name)) Wong Woon Yee 4. (The date of my birth is) Chinese F(Year) A (Month) (Day) Western a (Day) A (Month) *(Year) calendar calendar 22nd July 1913 5. (My place of birth is) (Give in Chinese and English) (Country) (Province) (District) p(Heung) #(Village) China Kwangtung Hoiping PART Hin Kong Lung Kai Lane 6. (My age is) 7. (My present calling or occupation is) 49 years House-wife 8. (My present address is) 203 Electric Road, 2nd floor, HongKong. 9. (My sex is) 10. (My marital status is) (Male) (Female) )(Single) (never married) /Married) (Widowed) (Divorced) (Separated) 11. (My nationality is) (Including my present marriage, I have been Chinese times.) 12. (My personal description is) 13. (I have the following visible marks of identification) (a) (Color of hair) (c) 36 (Height) Black 5 R(feet) 2 (inch) Nil (b) (Color of eyes) (d) B (Complexion) Dark Brown Fair 14. (My purpose in going to the United States is) To join my daughter 15. M (I intend to remain 16. (I intend to enter the United States in the United States permanently or (Give length of time)) at the port of) Permanently Los Angeles 17. (Do) (DOCK) have a ticket to my final destination) 18. (a) am 18. (b) going to the United States to join the following person (I am sponsored by the following person and/or organi- (Give name and address and relationship, if any)) zation (Give address if different from (a)) (daughter) WOO Sui Kwan 1227, West 121 Street, Los Angeles 44, item 18 (a) Calif., U.S.A. 19. final address in the United States is) 1227 West 121 Street, Los Angeles 44, Calif., U.S.A. 20. (My personal financial resources are) (a) (Cash) Supported by my daughter (c) (11(if) (Real estate (value)) (b) IRIT (Bank deposits) (d) (Other) This form may be obtained gratis at Consular Offices of the United States of America"
}
