{
  "anumber": "A14579720",
  "id": "A14579720_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, I-357"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California Status as a lawful permanent resident of the United States is accorded: File No. A14 579 720 TC/HK NAME Woon Yee Wong ADDRESS 1227 West 121st Street, Los Angeles, California NATIONALITY DATE OF BIRTH China 44 7-22-1913 52 PLACE OF BIRTH China COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE: (If any) PRIORITY DATE Immediate Relitive-China REMARKS Sec. 201 (b) As of APR 8 1966 at Los Angeles, California (Month) (Day) (Year) Class of admission (insert coding symbol) Z2IRO IRO (Place) the requirements of the following provision of law having been fulfilled. Sec 203 (h) of the I & N Act Sec 13 of the Act of 9/11/57 Sec 244 ( ) ( ) of the I & N Act Private Law no. of the Sec 245 of the I & N Act Congress session Sec 249 of the I & N Act (Other law - Specify) (Applicable In all cases) Date APR 8 1966 Recommended by w. Henderson Immigration Officer Date APR 8 1966 Approved giggs District Director K Rosebby m For use by Visa Control Housewife Office - H.K. - 12-F-Px-65 Date CLOSING ACTION REQUIRED Foreign State Preference Category Number Month of Issuance HEAD Signed (Viss Office, Dept. of State) Date Form I-357 delivered ALL SERVICE ACTION COMPLETED, ASSIGNED NUMBERS CAN BE USED IMMEDIATELY CC: Visa Control Office, Visa Office, Department of State, Washington 25, D.C. for allocation of Immigrant visa number. State Director, Selective Service Form 1-181 (Rev. 1-1-66)"
}