{
	"anumber": "A14514547",
	"id": "A14514547_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14514547_0002/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Preliminary Form to Take Oath of Allegiance, N-4-01 ( (Rev. 8-1-61)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1888, 1891, 1941, 1940, 1915, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R080.6 ALIEN REGISTRATION Name STATIA Tas AW No. PRELIMINARY FORM TO TAKE OATH OF ALLEGIANCE (By a woman formerly a citizen, under Section 324 (c) of the Immigration and Nationality Act, or the Act of June 25, 1936, as amended) Take or mail to: Date MAY 24 1965 19 IMMIGRATION AND NATURALIZATION SERVICE, I submit herewith a statement of facts to be used in making my application to take the oath of alle- giance to the United States under the Act of June 25, 1936, as amended, or Section 324 (c), Immigration and Nationality Act. (1) My full, true, and correct name is STATIA DWNN TOSAM (Full true name, without abbreviation, and any other name which has been used, must appear here) (2) My present place of residence is 1402 No 20TH OMAHA DONGLAS (Number and street) (City or town) (County) (State)NEBR (3) My occupation is HOUSEWIFE (4) I was born on MAY 23 1891 (Month) (Day) (Year) in ST ANTHONY MARSHALL IOWA HIS, A (City or town) (County, district, province, or State) (Country) (5) My personal description is as follows: Complexion FAIR ; color of eyes BLUE ; color of hair GREY ; height 5 feet 8 inches; weight 160 pounds; visible distinctive marks NONE (6) I am married; the name of my husband is WAS WALTER TOSAW ; we were married on MEB 3 1915 at ST. ANTHONY, IOWA ; (Month) (Day) (Year) he was born at unknown LITHWANIA on MAY to 1888 (City or town) (County, district, province, or State) (Country) (Month) (Day (Year) and now resides at 15 DECEASED UHNE / 1941 (Number and street) (City or town) (State) (Country) (7) I lost, or believe that I lost, United States citizenship solely by reason of my marriage on FEB 3 1915 to WALTER TOSAW then (Month) an alien, a (Day) citizen or subject (Year) of Lethurnia of the WHITE race, and my marital status with such person was terminated on VHNE / 1941 by DEATH (Month) (Day) (Year) (State by what means marital status terminated) (8) I have NOT acquired any other nationality by an affirmative act other than by marriage. (9) I have resided continuously in the United States from the date of my marriage to said alien up to and including July 2, 1940. (10) What organizations in the United States or in any other country have you been a member of during the last 10 years? (If none, write \"none.\") (a) CHHRCH (b) (c) (d) no others (e) (f) (g) (h) (i) (j) (k) (1) (m) (n) (o) (p) (q) (r) (11) The following available documents which support the foregoing facts are attached I certify that the above statement of facts has been read by me and that the statement is true to the best of my knowledge and belief. Statia Tosaw Form N-401 (Rev. 8-1-61) 16-19448-2 (Signature of applicant)"
}
