{
  "anumber": "A14514547",
  "id": "A14514547_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14514547_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS TO APPLICANT, GPO 9161744"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS TO APPLICANT (This preliminary form should be filled out in ink or on the typewriter and taken or mailed to the office of the Immigration and Naturalization Service shown on the reverse hereof. This form is intended for the use of a woman residing within the United States who was a citizen of the United States at birth; who has, or is believed to have, lost United States citizen- ship solely by reason of marriage; and who has continued to reside in the United States since the date of such marriage, or whose said marriage has terminated.) 1. In statement No. 6, show the facts regarding your present marriage, if you are now married. In statement No. 7 show the facts regarding your marriage to the alien through whom you lost your United States citizenship. 2. IMPORTANT.-You must submit with this application your civil birth certificate. If a civil birth certificate is not available, you may submit a baptismal certificate if it shows the date and place of your birth, or a sworn affidavit of either of your parents as to the date and place of your birth, or such a sworn affidavit of an older relative or friend who has personal knowledge of the date and place of your birth. You must also submit with this application certificates of all of your marriages, certificates of all of your divorces (if you have been divorced), and certificates of the death of your husband or husbands, if deceased. GPO 916174"
}