{
  "anumber": "A14579720",
  "id": "A14579720_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "The Naturalization and Immigration Service, Form N-4, 70"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "is a member by treaty or statute and by which the alien was not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for address at least one-half of the period of residence re- permit quired for naturalization except in the case of office of those persons who are employed by, or under contract with, the Government of the United States; Service having those persons who are authorized to perform the place in chick the applicant is ministerial or priestly functions of a religious de- to the issuing nomination having a bona fide organization within pago 2 be the United States, and those persons who are en- persons outside the gaged solely by a religious denomination or by an by international money interdenominational mission organization having a or foreign ex bona fide organization within the United States as the United States All remit- a missionary, brother, nun, or sister. Such approval be to the Immigration should be applied for on Form N-470, \"Application Department of Justice to Preserve Residence for Naturalization Purposes be refunded (under section 316 (b) or 317, Immigration and returned to the Nationality Act)\" available at any office of the Immigration and Naturalization Service. extension thereof Aliens who are absent in connection with or for the purpose of performing the ministerial or priestly an immigration functions of a religious denomination having a bona Common embarking fide organization in the United States, or who are engaged by such a denomination or an interdenomi- national mission organization having a bona fide organization within the United States, as a mission- ary, brother, nun, or sister, are also eligible to make such application. Such aliens may acquire the re- quired one year of uninterrupted physical presence after the absence. EXTENSIONS: The validity of a permit may, on good cause shown, be extended for a period or periods not exceeding one year from the original expiration date. 20"
}