{
	"anumber": "A14579720",
	"id": "A14579720_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0042/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES, 4 131"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1968, 1969, 2023, 1913, 1932, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/6/2023 Form approved. Budget Bureau No. 43-R052.8. A RE-ENTRY PERMIT DOES NOT PROTECT NATURALIZA- FEE STAMP TION RESIDENCE. SEE INSTRUCTIONS ATTACHED FOR INFORMATION CONCERNING EFFECT OF ABSENCE ON REC'D I/C JAN 11 1968 ELIGIBILITY FOR INATURALIZATION READ THIS FORM AND ATTACHED INSTRUCTIONS CAREFULLY BEFORE FILLING IN THIS APPLICATION. APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act. (Fill in with typewriter or print in block letters in ink) Statistics IMPORTANT: You must submit your Alien Registration Receipt Card with this application. Received In Completed 1. CHECK (a) I am an alien lawfully admitted to the United States 361 permanent residence. 1969 ONE (b) I am a treaty merchant, lawfully admitted to the United States between July 1 1924, and July 5. 1932 oth datak ursuant to section 3(6) of the Immigration Act of 1924, to carry on trade pursuant to a treaty of commerce and navigation. 2. NAME (First Name) (Middle Name) (Family Name) ALIEN REGISTRATION NUMBER Woon Yee WONG A- 14 579 720 ADDRESS (Number) (Street) (City/Town) (State) (Zip Code) 1221 Boston St. Los Angeles, California, 90026 DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY COLOR OF EYES COLOR OF HAIR July 22, 1913 China Republic of China Brown Black HEIGHT VISIBLE MARKS AND SCARS 5 FEET 2 INCHES 3. FILL IN THE ITEMS IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RE-ENTER. ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING MY LAST PERMIT LAST PERMIT IS ATTACHED none (City and State) IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR AS A TREATY MERCHANT NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Woon Yee WONG LOS ANGELES April 8, 1966 FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME Doon Lon Wong Chow Fung Ho MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL none Class Z-2 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN UNITED STATES. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Woon Yee Wong LOS ANGELES April 8, 1966 MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL none (Clasd Z-2) 6. PORT OF Proposed DEPARTURE FROM UNITED STATES DATE OF Proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD LOS ANGELES January 19,1968 * about 14 months NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL Pan American Airways Shall wait for my permit before I leave U.S.A. MAILING ADDRESS ABROAD 65 Barwick St., 4th floor, Sum-Sui-Po, Kowloon, COUNTRIES TO BE VISITED (List each country) HUNGKONG LAWFUL ADMISSION VERIFIED REASONS FOR GOING ABROAD (Be concise and complete): see relatives 7. I DID DID NOT REGISTER FOR SELECTIVE SERVICE (female) 8. PRESENT OCCUPATION SOCIAL SECURITY ACCOUNT NUMBER sewing machine operator 561 76 8847 NAME OF EMPLOYER ADDRESS OF EMPLOYER Hollywood Needlecraft 3777 So. Main St., Los Angeles, Cal., 90007 FORM I-131 (REV. 4-20-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}
