{
	"anumber": "A14579720",
	"id": "A14579720_0057",
	"page_index": 57,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0057/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325 ( (REV. 5-1-79)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1485, 1984, 1979, 1982, 1911, 1981, 1955, 1918, 2023, 1913, 1983, 1930, 1978, 1965
			]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['sewing machinist', ' operator']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "China"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 (REV. 5-1-79)Y Screened by NARA, 9/6/2023 BIOGRAPHIC INFORMATION UNITED STATES DEPARTMENT OF JUSTICE Form Approved OMB No. 43-R436 Immigration and Naturalization Service (Family name) (First name) WONG (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER WOON YZZ FEMALE 7/22/1913 CHINA ALL OTHER NAMES USED (Including names by previous marriages) A-14579720 CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. CANTON CHINA (If any) 561-76-8847 FAMILY NAME FIRST NAME DATE. CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER CHESTER WONG DECEASED MOTHER (Maiden name) CHOW FUNG-H Ho DECEASED HUSBAND (If none. so state) FAMILY NAME FIRST NAME OR BIRTHDATE CITY & COUNTRY OF BIRTH WIFE (For wife, give maiden name) DATE OF MARRIAGE PLACE OF MARRIAGE WONG will 8/22/1918 CANTON CHINA 8/30/68 HONG KONG FORMER HUSBANDS OR WIVES (If none, SO state) PASSED AWAY NONE FAMILY NAME (For wife. give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE woo CHI 9/7/1911 2/29/1930 8/12/1955 - PASSED AWA APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 5947 BENNER ST, Los ANGELES CA USA JAN 1979 PRESENT TIME 830 w. BARTLETT ST. #6 Los ANGELES CA USA JAN 1978 JAN 1979 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. SOUTHERN BUILDING 216 KINGSRD 7th FLATBRING HONG KONG MAY 1965 MAY 1485 FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR GRAND CARLTON F-ACTORY 3235 N. MAIN ST. SEWING MACHINE MAY 1983 PRESENT TIME ZD WARD GARMENT CONTRACTOR Los ANGELES CA 90031 OPERATOR JULY 1981 DEC 1982 955 VIGNES S7. LA SEWING MACHENE 90062 OPERATOR Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) STATUS AS PERMANENT RESIDENT IF IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE IN THIS SPACE: YOUR Woon NATIVE ALPHABET Gee wong EXTRE 02/10/84 ALPHABET Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) WONG WOON YEE A 14 579 720 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: LOS CIT - 400 26 FEB 1984 (data) FORM G-325 [1] Ident."
}
