{
	"anumber": "A14579720",
	"id": "A14579720_0079",
	"page_index": 79,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0079/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "In Re: Wong Woon Yee, Woo Hing Po and, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1964, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "In Re: H WONG Woon Yee, Woo Hind PO andv) Affidavit of Support FOIA (b)(6) applicant for parolee documentation. STATE OF CALIFORNIA ) SS COUNTY OF LOS ANGELES ) Sui Kwan CHOW, being first duly sworn according to law deposes and says: THAT she is a citizen of the United States by naturalization; that she is presently residing with her family at 1227 W. 121st Street, Los Angeles, California; AFFIANT states that her petition on behalf of her mother, brother and sister has been approved and it is her desire to have her mother, brother and her sister, the persons named in the caption hereof to join her in the United States and to reside with her permanently thereof; AFFIANT states that she and her husband are both permanently employed; that they own their own hom and other commercial property amounting to $55,000. that as evidence to her financial claim, there are attached hereto copy of her income tax return of 1964 and letter from her bank; AFFIANT states that she is willing and financially able to receive care for maintain and support her relatives, the persons named in the caption; that she further promises, warrants and guarantees that she will not allow her relatives to become public charge upon the United States or any of its political subdivisions; that this affidavit is executed for the purpose of inducing the Appropriate American Consul abroad to issue the visa for them, the persons named in the caption to travel to the United States. X Sin Kwan Chow Subscribed and sworn to before me at Los Angeles, California this 11th day of March, 1965. My Commission expires Notary Public And April 11, 1966. In and for Los Angeles County State of California."
}
