{
	"anumber": "A14514547",
	"id": "A14514547_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14514547_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application to Take Oath of Allegiance and Form of Such Oath, Form N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Lithuania"]
		},
		"years": {
			"ms_years_nlp_v1": [1888, 1891, 1941, 1940, 1915, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2035- R 298 Form approved. UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R086.8. IMMIGRATION AND NATURALIZATION SERVICE UNITED STATES OF AMERICA DUPLICATE Alien Registration No. (To accompany APPLICATION TO TAKE OATH OF 14 514 547 monthly report on Form N-4) ALLEGIANCE AND FORM OF SUCH OATH (By a woman under Section 324 (c) of the Immigration and Nationality Act, or the Act of June 25, 1936, as amended) To the Honorable, the U. S. District Court of Nebraska This application, hereby made and filed, respectfully shows: (1) My full, true, and correct name is Statia Dunn Tosaw (Full, true name, without abbreviation, and any other name which has been used, must appear here) (2) My present place of residence is 1402 North 20th, Omaha Douglas Nebraska (Number and street) (City or town) (County) (State) housewife (3) My occupation is (4) I was born on May 23, 1891 in St. Anthony, Marshall, Iowa (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) (5) My personal description is as follows: Complexion fair color of eyes blue color of hair grey height 5 feet 8 inches, weight 160 pounds; visible distinctive marks none (6) I am married; the name of my husband was Walter Tosaw ; we were married on Feb. 3g 1915 at St. Anthony, Iowa ; he was born (Month) (Day) (Year) (City or town) (State) (Country) at Lithuania tax May 1888 on ; and now resides (City or town) (County, district, province, or State) (Country) (Month) (Day) (Year) is deceased at (Number and street) (City or town) (State) (Country) (7) I lost, or believe that I lost, United States citizenship solely by reason of my marriage on Feb. 3, 1915 (Month) (Day) (Year) Walter Tosaw to then an alien, a citizen or subject of Lithuania of the white race, and my marital status with such person was terminated on June 1 (Day) 1941 by death (Month) (Year) (State by what means marital status terminated) (8) I have not acquired any other nationality by an affirmative act other than by marriage. (9) I am not and have not been for a period of at least 10 years immediately preceding the date of this application a member of or affiliated with any organization proscribed by the Immigration and Nationality Act or any section, subsidiary, branch, affiliate, or subdivision thereof, nor have I during such period engaged in or performed any of the acts or activities prohibited by that Act. (10) I have resided continuously in the United States from the date of my marriage up to and including July 2, 1940. (11) I hereby apply to take the oath of allegiance as prescribed in Section 337 of the Immigration and Nationality Act and the regulations there- under and to become repatriated. Statia Dum Tosaw (Full, true, and correct signature of applicant, without abbreviation) Subscribed and sworn to (affirmed) before me by the above-named applicant, in the office of the clerk of said court at Omaha, Nebraska this 24th day of May , Anno Domini 19 65 RICHARD C. PECK By William OF COURT Lillage Deputy Clerk. [SEAL] Clerk. ORDER United States of America In the U. S. District ZIVO Court ss: District of Nebraska of Nebraska at Omaha, Nebraska Upon consideration of the foregoing application and the applicant having taken the oath of allegiance in open court this 24th day of May A. D. 1965 it is hereby ORDERED that the application be granted and that the said applicant be, and she hereby is repatriated as a citizen of the United States of America. By the Court only n. Delebaut Judge. NOTE TO CLERK OF COURT.- fee is to be collected in connection with the filing of this application. If applicant demands the triplicate copy of the appli- cation, a fee not exceeding $5 may be charged therefor if the proceedings are under Section/ (c) of the Immigration and Nationality Act; if the proceedings are under the Act of June 25, 1936. as amended, a fce not exceeding $1 may be charged therefor. Form N-408 (Rev. 8-1-61)"
}
