{
  "anumber": "A14579720",
  "id": "A14579720_0060",
  "page_index": 60,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0060/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IDENTIFICATION DIVISION, Form G-135a"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023,
        1960,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/6/2023 Form G-135a Agency Name Check Office (Rev. 10-1-65) LOS UNITED STATES DEPARTMENT OF JUSTICE File No. Immigration and Naturalization Service Al4 579 720 TC/HK W.H. Date DIRECTOR, FEDERAL BUREAU OF INVESTIGATION, March 28, 1966 DEPARTMENT OF JUSTICE, Washington, D. C. 20537 Attention: IDENTIFICATION DIVISION Please furnish a copy of any criminal record shown in the fingerprint records of your Bureau concerning the following person. Fingerprints Attached Unavailable FBI Ident. Number (FIRST NAME) DATE OF BIRTH PRESENT NATIONALITY (LAST NAME) (MIDDLE NAME) 7-22-1913 China WONG Woon Yee PLACE OF BIRTH MARITAL STATUS China SINGLE WIDOW(ER) OTHER NAMES USED (Maiden name, names by former marriages, former names changed legally or otherwise, aliases, nicknames, etc. Specify which, and show dates used.) FEMALE MARRIED DIVORCED MALE HEIGHT WEIGHT COLOR COLOR IDENTIFYING MARKS EYES HAIR 5'2 120 Brn Blk None NONE IF MARRIED, WIDOWED, OR DIVORCED, GIVE FULL NAME AND DATE AND PLACE OF BIRTH OF SPOUSE OR FORMER SPOUSE. INCLUDE WIFE'S MAIDEN NAME. GIVE DATES AND PLACES OF ALL MARRIAGES OR DIVORCES. SPOUSE IS DECEADED NAME NOT GIVEN D.O.B. 7-22-1913 PO.B CHINA ADDRESS PARENTS NAMES (Last name) (First name) DATE AND PLACE OF BIRTH (If known) Father WONG CHUN LAN Mother CHOW FUNG HO ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) NONE FROM TO RESIDENCE LAST (5) (7) YEARS (Street & No., RFD, etc.) (City, state and country) 1227 West 121st Street, Los Angeles, California 5-1965 PRESENT 203 Electric Road 2nd Floor N. Point, Hong Kong 1960 1965 FROM TO EMPLOYMENT LAST (5) (7) YEARS (Employer's name) (Number, street, city, state) HOUSEWIFE LAST ADMISSION TO U.S. (Date, port and status) PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U.S.) Honolulu, Hawaii 5-12-65 HKP PREVIOUS REPORTS FURNISHED BY FBI: U.S. PASSPORT NO. (If known) SOCIAL SECURITY # YES NO If yes, attach list of reports. REASON FOR REQUEST ARMED FORCES SERIAL # AND BRANCH OF SERVICE DEPORTATION ADM. TO U. S. BENEF. PB #: NATURALIZATION ADJ. OF STATUS SPONSOR PB #: APPLICANT FOR CONDITIONAL ENTRY FOR RELIEF OF NO RETURN TO DISTRICT DIRECTOR, U. S. Immigration and Naturalization Service ARREST 312 Old Post Office Bldg., 12th & Penna. Ave., N.W. Assistant Commissioner Washington, D. C. 20536 Investigations FOR AGENCY REPLY APR5 IDENTIFICATION FBI 1966 DIVISION FBI - IDENTIFICATION DIVISION (1)"
}