{
  "anumber": "A14579720",
  "id": "A14579720_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14579720_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, I-133 ( (Rev. 4-1-76)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "China",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1968,
        2023,
        1913,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/6/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES not as provided in section 223 of the L05017137 Immigration and Nationality Act OCT 31 1978 Use typewriter or print in block letters with ball -point pen. 628-2103 issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Registration Receipt Wong Woon Yee Card with this application if you checked Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt. No.) MAILING west 830 Bartlett Street # 6 ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) (State) (ZIP Code) Los Angeles CA. 90012 A. 744-579-720 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 07-22-1913 China Chinese Dark Brown Black HEIGHT 5 FEET 3 INCHES VISIBLE MARKS AND SCARS NONE 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED Wong, Woon Yee Los Angeles 04-08-1966 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) Philipine Airlines LAWFUL ADMISSION VERIFIED FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME I-151 Md Wong, Chun Lan Chow, Fung Ho INITIALS 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or MexiCo.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Wong, Woon Yee Los Angeles 04-25-1968 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD DE Los Angeles Dec. 1978 3 months NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL China Airlines FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. 01-29-1968 Hong Kong Los Angeles 1968 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: NAME and ADDRESS OF EMPLOYER Seamstress SOCIAL SECURITY ACCOUNT NUMBER 561-76-8847 Hughes Garment Industry 716 1/2 97th Place Los Angeles, CA 90021 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) (State/Province/District) Country) 261 King's Road, 7th floor, Flat Hong Kong 11. COUNTRIES TO BE VISITED (List each country) Hong Kong 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): Tourist/ & see Relatives RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM I-131 (Rev. 4-1-76)N OVER ml"
}