{
  "anumber": "A14635169",
  "id": "A14635169_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14635169_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "American Consul Hong Kong, B.C.C., A14 635 169, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1962,
        1960,
        1948,
        1953,
        2023,
        1963,
        1967,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/20/2023 A14 635 169, FOIA (b)(6) American Consul January 18, 1967 Hong Kong, B.C.C. John L. Todd, Assistant District Director Travel Control, Los Angeles, California Visa petitions by May Chin Chow - A7 054 355 in behalf of Soo King Chow - A14 635 169, mother; FOIA (b)(6) sister; Man Chik Wong - FOIA (b)(6) brother; Ching Far Wong -FOIA (b)(6) sister; Man Fai Wong - FOIA (b)(6) brother. The petitioner, May Ching Chow, is the subject of our file FOIA (b)(6), which reflects that she was first admitted to the United States at Honolulu, Hawaii on November 19, 1948 as the nonquota spouse of a citizen of the United States. Her spouse admitted his true identity and alienage on March 16, 1960. The petitioner was lawfully admitted for permanent residence at Los Angeles, California on November 28, 1962. She was admitted to U.S. citizenship in the U.S. District Court at Los Angeles on May 27, 1966 and was issued certificate of naturalization No. 8886628. A copy of the sworn statement made by the petitioner on June 2, 1960 at Los Angeles, California, following the admission by her husband of alienage, is attached and is consistent with the instant petitions. The petitioner, when interviewed on November 1, 1966, verified the facts and allegations contained in her petitions, the supporting evidence and the re- lating files. In support of her petitions, Mrs. Chow has submitted secondary evidence which is attached and consists of following: signature specimen form and recent individual photographs of petitioner and all beneficiattes; receipts for money drafts purchased by the petitioner in favor of the beneficiaries for a total of five such drafts, varying in aoumnts from $40 to $170 dating from July 21, 1959 to September 26, 1963; receipts for registered articles sent to the beneficiaries by the petitioner, for a total of 25 such receipts, dating from July 24, 1959 to October 24, 1963; individual photographs of the bene- ficiary brothers and sisters, mailed to the petitioner and taken in Hong Kong in the past recent years; group photograph of all beneficiaries taken in Hong Kong; group photograph depicting the beneficiaries with mutual friend, Mrs. Esteves on her visit to Hong Kong; air letters directed to the petitioner by the beneficiary mother dating from May 1953 to December 5, 1959; affidavit executed by the petitioner's spouse attesting to contemporary knowledge of the relationships as claimed by the petitioner; affidavit executed by Anna Esteves, naturalized citizen of the United States; certificate uf naturalization No.5001642, resident at 22404 South Normandie, Torrance, California, attesting to contemporary knowledge by association of the petitioner's claimed relationships. The petitioner testified on November 1, 1966 that she was the first child born to the first named beneficiary as issue of such beneficiary's marriage to Wong, Gay Toong (aka Wong, Kee Chung; aka Wong, Kden Hork). The petitioner further"
}