{
  "anumber": "A14635169",
  "id": "A14635169_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14635169_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application to File Petition for Naturalization, N-4-009"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1911,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/20/2023 DE:LR U.S. Department of Justice Application to File OMB #1115-0009 Immigration and Naturalization Service Petition for Naturalization This block for government use only. Please read the instructions before filling out this form. Section of Law 316 (a) 1. Your name (Exactly as it appears on your Alien Registration Receipt Card) 14. Place you were admitted for permanent residency (City and State) CHOW, Soo King Honolulu, Hawaii 2. Your Alien Registration number 3. Your Social Security Number 15. Date your continuous residency began in the U.S. (Month/Day/Year) A- 14 635 169 549-90-6748 03-24-68 4. Your name (Full true and correct name, if different from above) 16. How long have you continumusly resided in the State where you ow live? WONG, Chow Soo King (Number of Months) 60 N400 90.00 5. Any other names you have used (Including maiden) 17. Do you intend to reside permanently in the United States? CHOW, Soo King (If No, explain fully) Yes No 6. Your date of birth (Month/Day/Year 7. Your Sex 03-05-1911 Male Female 8. Your place of birth (City or Town) Kaiping, 2 (County, Province or State) (Country) Guangdong, China 9. Was your father or mother ever a United States citizen? 18. Have you served in the United States Armed Forces? (If Yes, explain fully) Yes No (If Yes, complete all of #18.) Yes No Branch of Service (Indicate if Reserve or National Guard) Inducted Enlisted Location where you entered (City and State) 1 Service began (Month/Day/Year) Service ended (Month/Day/Year) 3 10. Can you read and write English? Service number Waiver Section 403 Yes No 11. Can you speak English? Rank at discharge Waiver Section 403 Yes No 12. Can you sign your name in English? Type of discharge (Honorable, Dishonorable, etc.) Yes No 13. Date you were admitted for permanent residency (Month/Day/Year) Reason for discharge (Alienage, conscientious objector, other) 03-24-68 19. At what addresses in the United States have you lived during the last 5 years? List present address first. Street Address City county and State Zip Code From (Month/Day/Year) To (Month/Day/Year) 946 Yale Street, No 23, Los Angeles, CA 90012 1982 Present no others 4 20. What employment have you held during the last 5 years? List present or most recent employment first. (If none, write \"None\".) Name and Address of Employer Occupation or Type of Business From (Month/Day/Year) To (Month/Day/Year) B social 1977 Retired 07/87 Present receiving SSL since no others AUG S to Form N-400 (5/12/88) Y"
}