{
	"anumber": "A14635169",
	"id": "A14635169_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14635169_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "fema"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE AMIGRATION AND NATURALIZATION SERVICE Processing Sheet, A 14 635 169"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Screened by NARA 9/20/2023 MIGRATION AND NATURALIZATION SERVI DESCRIPTION: SEX TEMA Processing Sheet MARITAL STATUS: WIDOW HEIGHT: ft. 5 in. 2 Sec. of Law 316a COUNTRY OF FORMER NATIONALITY File No. A14 635 169 CHINA 50/20 INITIAL INTERVIEW 02-22-93 FINAL ACTION English: Speaks 30/20 Reads 1/20 Initials Date and [ 3 Denial: Date & Initials C 3 Withdraval: Date & Initials Government: INS Test OK STAND. TEST C ] Oath Taken: Certificate issued. REEXAM: Date and Initials ACTION OR DOCUMENTS STILL REQUIRED Documents presented: ( ) See attached N-14 ( J Reexamination ARC: 414 635 169 ( J Other ( ) Visa File DOB: 03-05-11 ( ) Post Audit POE/COE HHW DOE 03-24-68 CID/CDL: none RECOMMENDATION: GA m wory A Date and Initials COMMENTS: PNS DISTRICT FEB27 19th 1993 ASTA Approval (stamp) OATH OF ALLEGIANCE [ ] Modified Oath. Delete part(s) Oath with INS [ ] Promise to Bear Arms [ J Noncombat Duty 1 2 3 Oath with Court NAME CHANGE Soo KING WONG Court No. I HEREBY DECLARE, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to and foreign prince, potentate, state, or sovereignty of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and the laws of the United States of America against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will perform noncombatant service in the Armed Forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely without any mental reservation or purpose of evasion: so HELP ME GOD. In acknowledgement whereof I have hereunto affixed my signature. 94 BOBOKHAY CH18 Signature This form my be overprinted or stamped to show instructions, items requested, items received, or other percinent data which my facilitate processing. Keep this shoes on top of all material in file until initial decision is made Form I- 463 (Rev. 22-1-70!"
}
