{
	"anumber": "A14635169",
	"id": "A14635169_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14635169_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, E06051"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2020, 1925, 1956, 1835, 1911, 1941, 1933, 1957, 1967, 1924, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "#20 3 HONG OKONG STATUTORY DECLARATION I, CHOW Soo KING HOUSEWIFE, HOLDER OF HONG KONG CARD No E06051, NOW RESIDING AT 12 PAK 6TH/FT KOWLOON HONG KONG. w -41V 67 TAKINTYMO do solemnly and sincerely declare that: To THE BEST OF KNOWLEDGE INFORMATION AND BELIEF I WAS BORN IN SHEK KWAN VILLAGE Mou KONG HEUNG Ho1 PING KWONGTUNG ) CHINA ( ON 5TH MARCH 1911. I WAS MARRIED TO WONG KAY CHUNG ALIAS WONG KUM HAWK IN LUEN DUN LANE ) HIN KONG HEUNG Ho 1 PING ) CHINA(#) ) ON 6TH SEPT. 1924, ACCORDING TO THE CHINESE CUSTOMARY RITES AND CEREMONIES. OUT OF THIS MARRIAGE I GAVE BIRTH TO THE FOLLOWING CHILDREN : WONG MAY CHING DAUGHTER, WAS BORN ON 24TH JUNE 1925, IS NOW IN 18203 So. DALTON GARDENA CALIF.U.S.A. WONG MAN FAI (12) ) SON, WAS BORN ON 22ND OCT. 1933. WONG MAN CHIK ) SON, WAS BORN ON 19TH APR .1939. WONG CHING FAR ( DAUGHTÉR, WAS BORN ON 1ST OCT. 1941. AND FOIA (b)(6) DAUG. WAS BORN ON FOIA (b)( (6) ALL OF THEM ARE NOW IN HONG KONG WITH ME. I DO NOT HAVE ANY OTHER CHILDREN EITHER BY BLOOD OR ADOPTED. My HUSBAND THE AFORESAID WONG KAY CHUNG, WHO DIED IN Ho PING, CHINA, ON 29TH APRIL 1956. My FATHER CHOW CHIU TUNG ( ) ALIAS CHAU JOK WAI AND MY MOTHER SETO SHEUNG FUNG BOTH DECEASED. HAVE ONLY ONE BROTHER NAMED CHOW CHI HING ALIAS CHAU SHUI GUT DECEASED. I DO NOT HAVE ANY OTHER BROTHERS AND SISTER, STEPBROTHERS AND STEPSISTERS, ADOPTED BROTHERS AND ADOPTED SISTERS, HALF BROTHERS AND HALF SISTERS. I HAVE NEVER APPLIED FOR A VISA, PASSPORT OR OTHER DOCUMENTATION TO ENTER THE UNITED STATES. THE PRECISE DATE THAT I LAST LEFT MAINLAND CHINA WAS ON AUG. 1957. THE ABOVE GIVEN STATEMENTS ARE TRUE AND CORRECT. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this APR 1967 day of through the interpretation of YUEN Kwok Hung the said YUEN Kwok Hung having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this document to the declarant, and that he would truly and faithfully interpret the declaration about to be administered to him/her. Before me, acto A Commissioner etc. Wong Cheuk Kwan YUEN Kwok Hung I, do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant chow soo and that I will truly and faithfully interpret the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong 1967 YUEN Kwok Hung this AP day of , 19 Before me, 2020 A Commissioner etc."
}
