{
  "anumber": "A14601620",
  "id": "A14601620_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14601620_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICACION, 134811"
    },
    "years": {
      "ms_years_nlp_v1": [
        1967,
        2023,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/31/2023 PRIMERA CLASE CINCUENTA CENTAVOS CERTIFICACION 1964-1967 No 134811 1 El Infrascrito, Secretario Municipal y Encargado del Registro Civil de la ciu- 2 dad de La Ceiba, CERTIFICA: Que a página # 107 del libro original de nacimien- GENERAL DE tos n°.20 que llev8 esta oficina en el año de mil novecientos catorce, y que obra en el archivo de ésta Municipalidad, se encuentra la Partida que literal- HONDURAS mente dice: \"MARIA ESTELA WALKER.- En La Ceiba, a las cuatro y media p.m. del 6 día miércoles diecinueve de Agosto de mil novecientos catorce.- Ante mí, Sa- ADUANAS muel V.Moya, Secretario Municipal de ésta ciudad, y ante los testigos don Alejo INSURANCE E. Quezada y don Damian Dominguez S., mayores de edad, hondureños, escribientes Wonduras y de este vecindario, compareció don Tomas Walker, africano, de cincuenta y un 10 años, casado, fogonero y vecino de esta ciudad, dando cuenta de que El Sábado 11 quince del mes en curso, a las once a.m. nació una niña a quien se puso por nombre MARIA ESTELA WALKER.Es hija legítima del compareciente y de Enma Walker, 13 hondureña, de oficios domésticos, y vecina. Abuelos paternos de la recién nacida 14 William Walker, ya difunto y Anna Walker, residente en Africa; y maternos Da- 15 niel Anderson y Mary Anderson, difunto el primero y vecina de Este puerto la 16 segunda.- Lei lo escrito al compareciente, lo encontrô conforme y no supo fir- 17 mar, haciéndolo los testigos conmigo.- Alejo S.Quezada.- Damián Dominguez S.- 18 Sello.- Samuel V.Moya.-\" 19 ES CONFORME CON SU ORIGINAL.Extendida en la ciudad de La Ceiba, a los diez 20 días del mes de Diciembre de mil novecientos sesenta y cuatro. 21 22 USE MARIA CARIAS 23 J Srio. Municipal. 24 FILL ANTIONIO BLANCO MORENO 25 Azcalde Municipal -- Gaths:"
}