{
  "anumber": "A17181791",
  "id": "A17181791_0128",
  "page_index": 128,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0128/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DETAILSS, A17 181 791"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Monaco",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1914,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 DETAILS The SUBJECT was born on October 27, 1914 in Kiangsu, Shanghai, China and is a citizen of China. She was admitted to the United States at Honolulu, Hawaii on January 17, 1968 as a class P6-1 immigrant on the basis of a form I-140, Visa Petition, which was submitted on her behalf by Mr. and Mrs. ERLE P. HALLIBURTON, JR. of Corona Del Mar, California. The visa petition submitted on the SUBJECT's behalf and the form ES-575, Application for Alien Employment Certification, attached to the visa application reflected that upon the SUBJECT's admission to the United States as an immigrant, the SUBJECT would be employed in the HALLIBURTON's home as a domestic worker at the rate of pay of- $200 monthly plus room and board. The SUBJECT presently resides at 720 South San Rafael Avenue, Pasadena, California 91105 where she is employed as a domestic worker by the family of PHILIP S. FOGG. The SUBJECT's file contains a letter from the Far East Placement Agency, 300 West Coast Highway, Newport Beach, California, dated June 12, 1968 which reports that the SUBJECT is presently employed by Dr. and Mrs. RENATO MONACO, 1243 Santiago Drive, Newport Beach, California and requests that the SUBJECT's alien registration receipt card be mailed to her at the Monaco residence. During April 1969, investigation was conducted as to where the SUBJECT began working following her admission to the United States as an immigrant. On April 9, 1969, Mrs. ERLE HALLIBURTON, JR, 4507 Perham Road, Corona del Mar, California was contacted at her residence as to whether the SUBJECT had been in her employ following the SUBJECT's admission to the United States as an immigrant. Mrs. HALLIBURTON reported that the SUBJECT did not begin working for her because she had filled the SUBJECT's position prior to the SUBJECT's arrival in the United States. She advised that she learned of the SUBJECT through the Far East Placement Agency but because there was such a lengthy time lag between the date that she began petitioning for the SUBJECT and the SUBJECT's arrival in the United States, it became necessary that she fill the SUBJECT's position with another person. She reported that she advised the employment agency that she could not use the SUBJECT and was informed by the employment agency that the SUBJECT would be placed in another home. Mrs. HALLIBURTON reported that she had submitted the employ- ment offer and the visa petition on the SUBJECT's behalf in good faith and not for the sole purpose of assisting the SUBJECT in immigrating to the United States but filled the SUBJECT's position due to the time lag. She advised that she believed that the SUBJECT had been placed in the home of a Dr. MONACO in the Newport Beach area. LA, Calif. - 7/8/69 A17 181 791 -2- -"
}