{
  "anumber": "A17180748",
  "id": "A17180748_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/21/2023, NARA Form 88"
    },
    "years": {
      "ms_years_nlp_v1": [
        1968,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 (10) 15. \"X\" THE APPROPRIATE BOX BELOW AND FURNISH THE INFORMATION REQUIRED FOR THE BOX MARKED. FOR DEPARTMENT USE ONLY: 88 Domestic Couple (Dom. Serv.) 309.999 IND. CODE OCC. TITLE OCC. CODE 21. NAME OF JOB OFFERED 22. NUMBER OPENINGS TO BE 23. DAILY WORK SCHEDULE (HOURS) FILLED Domestic servant cook 1 Employee will sleep in 24. TOTAL HOURS PER WEEK 25. RATE OF PAY 26. IF THE JOB IS UNIONIZED, GIVE NAME AND NUMBER OF LOCAL Usual for domestic $575 per month per servants. couple Not applicable 27. OCCUPATIONAL TITLE OF PERSON WHO WILL BE ALIEN'S 28. TYPE AND DEGREE OF SUPERVISION 29. NUMBER OF OTHER EM- IMMEDIATE SUPERVISOR ALIEN WILL RECEIVE PLOYEES ALIEN WILL SUPERVISE Not applicable Not applicable None 30. DESCRIBE FULLY THE JOB TO BE PERFORMED, INCLUDING DUTIES, WORKING CONDITIONS, AND EQUIPMENT OPERATED. Domestic servant 31. STATE IN DETAIL THE EDUCATION AND TRAINING REQUIRED FOR PROFICIENCY IN JOB. (Specify degrees and major fields of study re- quired. Specify apprenticeship. trade school or other training required). No particular educational requirements. 32. STATE MINIMUM EXPERIENCE REQUIREMENTS OF JOB. INDICATE ACCEPTABLE EXPERIENCE IN RELATED JOBS. At least 3 years prior experience as domestic servant - housekeeper. R 33. DESCRIBE SKILLS, KNOWLEDGES AND ABILITIES REQUIRED FOR PROFICIENCY IN JOB. See answer to Item 32 34. SPECIFY ANY OTHER SPECIAL REQUIREMENTS SUCH AS LANGUAGES, LICENSES, PHYSICAL REQUIREMENTS. Not applicable TOYING 35. DECLARATION OF EMPLOYER: I certify that I have examined the contents of this form and the statements are true and correct to the best of my knowledge and belief. SIGNATURE Bened Ching TITLE Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false document in the submission of this Job Offer For Alien Employment. (U.S. Codes, Title 18, Sec. 1001) Subscribed and sworn to (affirmed) before me this 6th of February A.D. 1967 WIN JAMES CARNRIGHT Family State of New at 4d.5620615 York Affer York, M.Y. Myrn (Sign Onner e of Administering barnight Officer) Rockland County York MO commission expires march 30,1968 melty Public (Title"
}