{
	"anumber": "A17192274",
	"id": "A17192274_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17192274_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 6/30/2023, Form I-72 ( (4-1-66)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/30/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Los Angeles, California File No. A17 161 870 Date January 23, 1967 Hermab W. Rannels, M.D. ,Medical Director Orange County Medical Center 101 South Manchester Avenue Orange, California 92668 YOUR APPLICATION/PETITION AND ITS SUPPORTING DOCUMENTS HAVE BEEN REVIEWED AND FOUND TO BE INSUFFICIENT TO PERMIT ADJUDICATION BY THE SERVICE. PLEASE COMPLY WITH THE BELOW CHECKED X \" INSTRUCTIONS: SEE REVERSE The above application/petition and its supporting documents are attached. After complying with the indicated instructions, please resubmit the fully documented application/petition to this office. Furnish: The required fee of $ Your record of birth (if not available, furnish other evidence of birth). Your marriage record including evidence of the termination of any prior marriage contracted by you or your spouse. Two photographs, 2\" X 2\", with distance from top of head to point of chin 1 1/4\". Machine-made photos not acceptable. you The passport which the beneficiary of your petition used when last admitted to the United States. Also submit Form I-94 (Arrival-Departure Record), which may be found fastened to the passport. Your passport revalidated for a period to extend six months beyond the expiration date of your requested extension of stay. All foreign language documents must be accompanied by English translations thereof, includ- ing certification as to accuracy of translation and competency of translator. Complete Form ES-575A. Furnish evidence of your qualifications in accordance with attached instructions for com- pletion of Form ES-575A. Submit to your (prospective) employer, completed Form ES-575A and evidence of your qualifi- cations. Request your (prospective) employer to complete Form ES-575B, and to submit the Form ES-575A and B and evidence of your qualifications to the local state employment service office. If the Labor Department issues a certification, your employer should return to you the evidence of your qualifications and Form ES-575A and B with the certification stamped on Form ES-575, for submission with your application. (Form ES-575A and B with instructions are attached.) Form I-72 (4-1-66) (OVER)"
}
