{
	"anumber": "A17190805",
	"id": "A17190805_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17190805_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "American Consulate General Hong Kong, B.C.G., A17 190 804 A17 190 805 A17 190 806"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1962, 1956, 1968, 2023, 1951, 1967, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/30/2023 A17 190 804 A17 190 805 American Consulate General A17 190 806 Hong Kong, B.C.C. January 15, 1968 Chas. H. Withers, Jr., Acting Assistant District Director Travel Control - Immigration and Naturalization Service Los Angeles, California Visa petitions in behalf of Mai Man Chan - A17 190 804 (mother); So Laan Chan - A17 190 805 (sister); So Hing Chan - A17 190 806 (sister). The petitioner Grace Chinn, A10 439 461, was lawfully admitted for permanent residence at Blaine, Washington as the nonquota spouse of a citizen of the United States on June 18, 1956. She was admitted to United States citizenship in the United States District Court at Seattle, Washington on June 7, 1965. The application made by the petitioner for an immigrant visa in Vancouver on June 18, 1956 was consistent as to her parents with the instant petitions. The petitioner has submitted secondary evidence which is attached and consists of the following items: signature specimen form and recent individual photograph of petitioner; bank draft directed to the last named beneficiary in the amount of $1,000.00 dated June 1, 1962; three air letters directed to the petitioner by the various beneficiaries post marked from February, 1967 to June, 1967 which have been certified as being consistent in terminology with the claimed relationships by the Service interpreter; four group photographs depicting the petitioner and the various beneficiaries as taken from 1951 to 1966 in Hong Kong; statutory declaration executed by the first named subject beneficiary attesting to the relationship as claimed by the petitioner; statutory declaration executed by Wong Sau 01, resident of Hong Kong, attesting to her knowledge as a witness of the marriage of the first named subject beneficiary and the subsequent birth of all children including the last two named subject beneficiaries and the petitioner; similar statutory declaration executed by witness of such marriage, Lan Lin Yau, resident of Hong Kong. The petitioner testified on October 20, 1967 that she was the third child born as issue of such marriage between the first named subject beneficiary and Chan Yin Chow (now deceased) and that the last two named subject beneficiaries were also born as issue of the same marriage. Report of interview of the petitioner is attached. On the basis of the interview, sworn testimony of the petitioner, review of her file, the allegations contained in the petition and the supporting evidence, it is concluded that the petitioner has established her claim to United States citizenship and has introduced reasonable grounds to believe that the alleged relationships do exist. The petitions filed on behalf of the subject beneficiaries are therefore approved. Attachments OFS-je"
}
