{
  "anumber": "A17181791",
  "id": "A17181791_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION, FORM ES-575A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Cary state State FORM ES-575 APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION Budget Bureau No. 44-R1301.1 PART A-STATEMENT OF QUALIFICATIONS OF ALIEN (ES-575A) 2761 READ THIS NOTICE BEFORE EXECUTING FORMS ES-575A AND B To knowingly furnish any false information in the preparation of this form and any supplement thereto or to aid, abet. or counsel another so to do is a felony punishable by $10,000 fine or five years in the penitentiary, or both (18 U.S.C. 1001). Any alien. prospective employer or any person acting on behalf of such alien or employer, who knowingly makes any misrepresentation concerning the alien. or his prospective employment including such matters as wages, hours, or the occupation in which an alien will be employed, or any person who falsely repre- sents, in the execution of this form that he is offering the alien employment as the prospective employer of such alien, will be prosecuted to the fullest extent of the law. IDENTIFYING AND PERSONAL DATA 1. (Family name in capital letters) (First name) (Middle name) (Maiden name, if alien is a married woman) 2. SEX NAME OF ALIEN MAO Betty Pei-ing Divourced Male Female 3. ALIEN'S BIRTHDATE 4. BIRTHPLACE (City or town) (State or Province) (Country) 5. PRESENT NATIONALITY OR CITI. Month Day Year ZENSHIP Republic of China Oct. 27, 1914 Shanghai, China Taiwan 6. PRESENT ADDRESS (Number and Street) (City or town) (State and ZIP Code or Province) (Country) 7. IF ALIEN IS SEEKING CHANGE OF CLASSIFICATION GIVE TYPE OF VISA NOW HELD Rep. China PP 720 S. San Rafael Ave., Pasadena, Calif. 91105 Valid to 8-31-69 8. ADDRESS IN UNITED STATES WHERE ALIEN WILL RESIDE (Include ZIP Code if known) 9. KIND OF WORK ALIEN IS SEEKING 720 S. San Rafael Ave., Pasadena, Calif. 91105 Cook and maid 10. NAME AND ADDRESS OF PROSPECTIVE EMPLOYER IF ALIEN HAS JOB OFFER 11. IS ALIEN CURRENTLY EMPLOYED? IF so. STATE Philip S. Fogg PRESENT OCCUPATION. 720 S. San Rafael Ave., Pasadena, Calif. Cook and maid 12. EDUCATION AND TRAINING DEGREES OR NAMES AND ADDRESSES OF SCHOOLS, FIELD OF STUDY FROM TO CERTIFICATES COLLEGES OR UNIVERSITIES RECEIVED None SPECIAL QUALIFICATIONS AND SKILLS 13. DESCRIBE SPECIAL QUALIFICATIONS POSSESSED. DESCRIBE ANY SPECIAL SKILLS ALIEN POSSESSES AND PROFICIENCY IN THE USE OF TOOLS. MACHINES OR EQUIPMENT. LIST PROFESSIONAL LICENSES. Experience as cook. No other special skills required. 14. GIVE ANY ADDITIONAL INFORMATION CONCERNING ALIEN NOT GIVEN ELSEWHERE WHICH WOULD HELP ESTABLISH ALIEN'S QUALIFICATIONS. Mrs. Mao has worked for us for ten months and has amply demonstrated her talents as a cook and maid. She has great emotional stability, is very religious, and is an unusually fine Chinese lady. 15. LIST DOCUMENTS ATTACHED WHICH ARE SUBMITTED AS EVIDENCE THAT ALIEN POSSESSES THE EDUCATION, TRAINING, EXPERIENCE AND ABILITIES REPRESENTED, None. (See attached letter of explanation) ENDORSEMENTS (MAKE NO ENTRY IN THIS SECTION-FOR GOVERNMENT AGENCY USE ONLY) O.T.&C. (SEE OVER)"
}