{
	"anumber": "A17181791",
	"id": "A17181791_0096",
	"page_index": 96,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0096/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151, I-151"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "NARA, 9/21/2023 IMMIGRATION IRALIZAT Form approved Budget Bureau No. 43-R040.7 Applicant: Do Not Fill in This Block FILE APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN 24 NO. AM 9:35 FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151 SEP Fee Required Fee Not Required (Please read instructions on the reverse) LOS ANGELES Fee Stamp A 117-181-791 I apply for an Alien Registration Receipt Card (Form I-151), and attach any previously issued Form I-151 or other evidence of registration now in my possession. My Alien Registration Number is Not received . 1. Reason for Application (Please check appropriate blocks.) (a) My alien registration receipt document was lost destroyed on or about , under the following circumstances: (date) (If my document is recovered, I will surrender it to the Immigration and Naturalization Service.) (b) My name has been changed. (c) My present Form I-151 is mutilated. (If you checked \"(a)\", \"(b)\", or \"(c)\" above, see Instruction Number 6 concerning fee required.) (d) My evidence of alien registration (e) I never received Form I-151. is on a form other than Form I-151. (f) My present Form I-151 is in poor con- (g) I am required by Section 262(b) of the Immigration and dition because of improper lamination. Nationality Act to be registered and fingerprinted after my 14th birthday. 2.Name (Last) (First) (Middle) 3. Nationality MAO BETTY - Chinese 4. Admitted to U.S. at (City) (State) 5. Date of Admission (Mo.) (Day) (Yr.) 6. Date ofBirth(Mo.) (Day) (Year) Honolulu Hawaii January 17, 1968 October 27, 1914 7. Means of Arrival (Name of Vessel, or Airline 8. Destination in U.S. at Time of Admission 9. Place of Birth (City) (Province or State) and Flight No., etc.) (Country) BOAC 910 Los Angeles, Calif. Shanghai, China 10. Name Used When Registered as an Allen (If same as present, write 11. Name Used When L awfully Admitted for Permanent Residence (If \"same.\") Same same as present, write \"same.\") Same 12. Present Address (Street, City and State, Country, ZIP Code, Manus. 13. Address in the U.S. (If same as present address, write \"same.\") 720 S. San Rafael Ave. Pasadena 91105 Same 14. Dates of Absences From the U.S. of 1 Year or Longer, Since Lawful Admission for Permanent Residence 15. Date of Last Departure from U.S. None None 16. (If you intend to use Form I-151 as a document for travel within the next six weeks, give the date of your expected departure, list each country to be visited, and be sure to read Instruction 7 in regard to the limitations on use of Form I-151 for travel in or through certain countries.) a. Date of Proposed Departure b. Countries to be Visited None None 17. Signature of Person Preparing the Form if Other Than Applicant 18. Signature of Applicant I DECLARE that this application was prepared by me at the I CERTIFY that the information above is true and correct to the request of the applicant and is based on all information of which I best of my knowledge and belief. have any knowledge. the Signature S. Logg Betty Man 720 S. SAN RAFNEL AVE. Signature PASADEMA CALIF. SEPT. 23, 1968 SEPT. 23,1968 Address Date Signed Date Signed Form I-90 UNITED STATES DEPARTMENT OF JUSTICE (Rev. 3-1-67) Immigration and Naturalization Service"
}
