{
	"anumber": "A17195429",
	"id": "A17195429_0104",
	"page_index": 104,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0104/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EMPLOYMENT CONTRACT, 92267"
		},
		"years": {
			"ms_years_nlp_v1": [1970, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FAR EAST PLACEMENT AGENCY 3511 W. 6th ST: LOS ANGELES, CALIFORNIA 90005 9267 EMPLOYMENT CONTRACT 90005 This contract for employment is made by and between the following: Mr. & Mrs. Nathaniel Paschall herein called 'Employer' and Lau Chuen & Chan Nui ADDENDUM herein called Domestic Help' The parties hereto agree as follows: Thi. TERM: Commencing upon Domestic Help's narrival at the residence of the Employer the Employer hereby employs the Domestic Help, and the Domestic Help hereby agrees to serve the Employer as adomestic for a period of 24 months. (Twenty four) 8. PE 2. PERFORMANCE AND DUTIES: Domestic Help agrees to devote ner his full time and effort in carrying forward the duties as assigned by the Employer and at all times, on and of duty to conduct herself/himself in a proper manner, and Employer agrees to treat Domestic Help fairly and properly. 3. SALARY: The Employer agrees to pay the Domestic Help, in addition to full board and lodging, a by the $660 per month employer. THIS NO WAY salary of Travel per month. Further, after completion of 12 have the funds months employment hereunder, the Domestic Help will receive one week's fully paid vacation at a time to be designated by the Employer, or if the Domestic Help so elects, in lieu of said vacation, an additional week's salary. 4. TERMINATION OF CONTRACT This Contract is terminable only upon justification, and if a dispute arises respecting the justification, then said justification shall be determined by the Labor Commissioner of the State of California Hours hours 5. LABOR LAWS: The Employer agrees to comply with Federal and State laws regulating the type of labor to be performed hereunder and to make the proper deductions from the gross pay of the Domestic Help as provided for under Federal and State law hureday other 6. SICKNESS: In the event the Domestic Help becomes ill, the Employer shall provide food, accomodations and salary for not more than fifteen (15) days during each year of this Contract, but Employer shall have no responsibility for costs of medical attention for the Domestic Help. EMPLOYER: Mrs. Katharine.,Plaseball Mr. Address: 790 Fairfield Circle, Pasadena, California. BETHOG Subscribed and sworn to before me on movember,5,1968 STATE OF california Annette Notary Public in and defferouch for County of has Angeles (SEAL) said County and State ANNETTE SEFFEROVICH My Commission Expires June 7 1970 DOMESTIC HELP: Signed: Lan cheen 1513 x Dated: OcT 30,1968 Address: Arbuthnot Road, 3/A, Top Floor, Hong Kong."
}
