{
	"anumber": "A17195429",
	"id": "A17195429_0085",
	"page_index": 85,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0085/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, FPI-LPC-2-67-30M-U.S. Government Printing Office"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "has not resided abrcad for two years following your departure from the United States?) UE L Screened by NARA, 9/21/2023 behalf) who believes that he qualifies as a member of the pro- ship requiring outstanding achievement as judged by recognized fessions or that he has exceptional ability in the sciences or the national or international experts in the specific discipline or arts must submit his petition to the Immigration and Naturali- field of endeavor. zation Service office having jurisdiction over his intended place (4) Atfidavits and Published material.-If alien's eligibility is of residence in the United States, together with Form ES-575A based on technical training or specialized experience, docu- executed in accordance with the Instructions for Completion of mentary evidence supporting the claim should be submitted. Application for Alien Employment Certification. The Immi- The recommended forms of evidence are affidavits or published gration and Naturalization Service office will forward Form material. ES-575A to the Department of Labor unless the occupation is Affidavits.-These must be made by independent sources, such on the current list of occupations for which the Secretary of as alien's former employers or recognized experts familiar with Labor has issued the required certification, or unless the alien alien's work, and must: is clearly not qualified for third preference classification. (a) Identify the affiant, showing the capacity in which he is c. Sixth preference classification. A sixth preference petition testifying. may be filed only if it is accompanied by the required certifica- (b) Give the place and the dates during which alien gained tion of the Secretary of Labor (or his designated representative), his experience. or the occupation in which the alien will be employed is either (c) Describe in detail the duties performed, tools used, super- on the current list of occupations for which the Secretary of vision exercised over him and exercised by him. A Labor has issued the required certification (Schedule \"A\") or mere statement for example that the alien was employed the current list of occupations requiring no job offer (Schedule as a baker, is not adequate. \"C\"). (d) Show the date on which the affidavit was signed. If the occupation is currently listed in Schedule \"A\" or Published Material. Schedule \"C\", the employer should file his petition in the ap- (a) Copies of material published by or about the alien may propriate office of the Immigration and Naturalization Service be submitted. together with properly executed Form ES-575A, (Statement of (b) The material must be identified as to date, place and Qualifications of Alien) and supporting documents. Form ES- name of publication. 575B (Job Offer for Alien Employment) is not required for occupations on Schedule \"A\" or \"C\". If the occupation is on 7. RULES FOR DOCUMENTS. Schedule \"C\", and the supporting evidence establishes that the All supporting documents must be submitted in the original. beneficiary is qualified in that occupation, the Immigration and No additional copies are required. However, if the return of Naturalization Service office will forward Form ES-575A to the the original is desired, and if a copy is by law permitted to be Department of Labor. made, a photostat or typewritten copy may be submitted. If the occupation is not currently listed in Schedule \"A\", \"B\" Photostatic copies unaccompanied by the original may be ac- or \"C\", application for the certification of the Secretary of cepted if the copies bear a certification by an immigration or Labor (or his designated representative) must be made by consular officer that the copies were compared with the original filling out Forms ES-575A and B in accordance with the Instruc- and found to be identical. A document not in the English tions for Completion of Application for Alien Employment language must be accompanied by a translation, certified by the Certification, Part A and Part B. The employer should submit translator as to the accuracy of the translation, and as to his the completed Forms ES-575A and B, with the documentary competency to translate. (Do not make a copy of a certificate evidence required by the instructions, to the local office of the of naturalization or citizenship.) state Employment Service. If the certification is issued it will be endorsed on Form ES-575, which will be returned to the 8. FILING DATE OF PETITION. employer by the Department of Labor together with the docu- Issuance of immigrant visas to beneficiaries of approved third mentary evidence submitted in support thereof. The employer or sixth preference visa petitions is governed by the chrosolog- will then file the petition, with Form ES-575A, Form ES-575B, ical order in which such petitions were properly filed. Failure and the supporting documents attached. to submit with the petition the attachments required by para- graph 6 above will prevent proper filing of the petition and 6. SUPPORTING DOCUMENTS. result in its return to the petitioner. The following must be submitted with the petition: a. The alien's passport and Form I-94, Arrival-Departure 9. OATH OR AFFIRMATION. Record, if the alien is in the United States. a. In the United States the oath or affirmation may be made b. Form ES-575A executed in accordance with the instruc- before an immigration officer (without fee), or a notary public. tions for completion of that form. The oath may also be made before an officer authorized to ad- c. In sixth preference cases, Form ES-575B with the certifica- minister oaths for general purposes, in which case the official tion of the Secretary of Labor (or his designated representative) seal or certificate of authority to administer oaths must be unless the alien's occupation is listed on the Labor Department's affixed. Schedule \"A\" or \"C\" (see paragraph 5 above). b. Outside the United States, the oath or affirmation must be d. Documentary evidence of the benficiary's qualifications as made before a United States consular or immigration officer. follows: c. The person signing the petition may be required to appear (1) School Records.-If alien's eligibility is based in whole or before an officer of the Immigration and Naturalization Service in part on higher education or attendance at a technical or vo- to reaffirm or reswear to the allegations contained in the peti- cational- school, attach certfied copy of school record. The rec- tion and for other inquiry which may be pertinent. However, ord must show period of attendance, major field of study, and when the petitioner is an organization, that person may author- degrees or diplomas awarded. ize another member of the organization to appear. In that event, (2) License or Other Official Permission to Practice a Profes- a statement by the person who signed the petition must be sub- sion.-If alien is a member of a profession, attach a copy of the mitted to the effect that the named member of the organization, license or other official permission granted him to practice the whose title shall also be indicated, has been authorized to appear profession in the country where he has been found qualified to before the Immigration and Naturalization Service in behalf of practice that profession, if a license or other permission is re- the petitioner. quired in that country. 10. FEE. Submit a fee of $10 with this petition. (3) Evidence of Exceptional Ability in the Sciences or the Arts.- a. The fee IS required for filing the petition and is not return- If alien's eligibility is based upon exceptional ability in the sci- ences or the arts, documentary evidence supporting the claim able regardless of the action taken thereon. should be submitted. Such evidence may testify to the uni- b. If you mail your petition, attach money order or check, versal acclaim and either national or international recognition payable to Immigration and Naturalization Service, Department of Justice. (Exceptions: Remittances in Guam must be payable accorded the alien; show that he has received a nationally or to Treasurer, Guam; and those in the Virgin Islands must be internationally recognized prize or award or won a nationally or internationally recognized competition for excellence for a spe- payable to Commissioner of Finance, Virgin Islands.) cific product or performance or for outstanding achievement; 11. PENALTIES. Severe penalties are provided by law for know- or testify that he is a member in a national or international ingly and willfully falsifying or concealing a material fact or association of persons which maintains standards of member- using any false document in the submission of this petition. FP1-LPC-2-67-30M-2965 For sale by the Superintendent of Documents, U.S. Government Printing Office Washington, D.C. 20402 - Price 5 cents; $3.75 per 100"
}
