{
  "anumber": "A17182973",
  "id": "A17182973_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, I-486"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Greece",
        "China",
        "United States",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 11/7/68 an FOIA (b)(6) 6 Daughter UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Officer's Review and Action Sheet Form No. 8485 aph Han Lee File No. 17182923 5/2/67 The following documents or actions are required before decision may be made in this case: Officer's (China) Section 20 3(a)(2) Requested Received 3-2(P2-1)P220 Date Document or Action Required Initials (Check) (Check) 3, I-486 I-114 FS-398 an G-325a (1) Ident. 11/7/88 Didney 14 (2) Rec. Br. (3) C. anu (4) Consul partist Three seat into 11/13/19 am I-181 - I-484 (Italy, Gormany Greece) G-138 an 11/7/68 (Chinese TRY 11/8/68 I-530 1-156 ( c eatly) STATISTICS DEC 17 1968 DECISION: Attomay ill and requests which (Approved) (Denied) interview he continued until after first REMARKS: (If denied, state reasons) JAN 06 1969 applicant stale dat interview of your Interviewed JAN 06 1969 (date) at Coulon in Birdful but before the that he had applied for an inner vra OK to grant except for: visa could be issued he used lear 1. F5-393 2. G-325AH FOIA (b)(6) 3. 4. USU Ciffer advise also is not pre commit 5. FEB 17 1969 6.56 for 3/6/69 at 9:00 - -Q4A Re.6-325 A4 For the District Director: MAY 05 1969 Richard Dial Date of Decision Signature of Officer Keep this sheet on top of all material in file until initial decision is made Form I-468 (Rev. 5-10-60) GPO 975-806"
}