{
  "anumber": "A17192274",
  "id": "A17192274_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17192274_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IMMIGRANT VISA AND ALIEN REGISTRATION, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/30/2023 UNITE ATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION LOS 2450328 (Family name) (First name) (Middle name) DESAI Bhagwantrai Gulabshanker PORT OF ACTION OF SPECIAL INQUIRY OFFICER SFR-130 The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in and [no appeal taken the United States at this port under PAA 846 on appeal taken Symbol (Name of vessel or flight No of aircraft) and was inspected by me and TMM. & NATZ. SERVICE PASSE D SAN FRANCISCO, CAL 1128 Section of the Immigration and U. S. P. H. S. ADMITTED Nationality Act. SAN ANGISCO by Clayton JUL2 1 1967 CLASS 85-1 Special Inquiry Officer. detained for further inquiry by Special officer under Symbol ACTION ON APPEAL Section of the Immigration and Nationality Act 45 ADMITTED EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN CONSULATE GENERAL facts stated in the application. IMMIGRANT CLASSIFICATION AT BOMBAY, INDIA NONQUOTA (Symbol) QUOTA (Symbol) Darryl N. them Johnson P5-1 VISA PETITION NO., IF ANY Filed: 1/25/66 attached to application Vice Consul lof the United States of America. IMMIGRANT VISA NO. QUOTA 4108 Indian ISSUED ON (Day) (Month) (Year) 27 March 1967 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 26 July 1967 NATIONALITY (If stateless, so state, and give previous nationality) Indian PASSPORT NO. I-436043 OR OTHER TRAVEL DOCUMENTS (Describe) Service No. ISSUED Tariff Item No. 21 STATISTICS TO Bhagwantrai Gulabshanker Desai Fee Paid $20 Local Cy equiv. Rs.160/- I-I5I Mssues BY Assistant Passport Officer, Bombay Sec. (14)-Certification mot required ON 21 March 1967 EXPIRES 20 March 1970 FORM 5-61 FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE"
}