{
	"anumber": "A17181791",
	"id": "A17181791_0086",
	"page_index": 86,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0086/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Mayflower Placement Agency, 1184"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 Mayflower 660038 1184 Placement Agency 3511 WEST SIXTH STREET 5840 GEARY STREET LOS ANGELES, CALIF. 90005 SAN FRANCISCO, CALIF. 94121 Far East Affiliate PHONE 387-5196 PHONE 387-2057 FAR EAST PLACEMENT AGEN 506. COMMERCIAL HOUSE 35 QUEEN'S ROAD HONG KONG EMPLOYMENT CONTRACT This contract for employment is made by and between the following: Rr. and Has. Brie P. Halliburton herein called 'Employer' and hereia called Domestic Help The parties hereto agree as follows: au 1. TERM: The employer hereby employs the Domestic Help to render services to the Employer at the residence of the Employer for a period of twenty-four (24) months, beginning twenty-four hours after Domestic Help arrives at the residence of the Employer to take up duties, subject to the services rendered being satisfactory. 2. PERFORMANCE Domestic Help agrees to perform her/his duties with diligence and to the best of her/his abilities, and at all times, on and off duty, to conduct herself/himself in o proper and respectable manner, and Employer agrees to treat Domestic Help in a proper monner, 3. DUTIES: The duties and conditions of employment shall be as set forth in the document referred to as the WORK ORDER, which is attached hereto and made c part of this Contract. The Employer and the Domestic Help achnowledge that they have road this order and fully understand its terms. a 4. SALARY: The Employer agrees to pay the Domestic Help her/his solary on the 1st and on the 15th of each month. The rate of salary per month, plus full board and lodging is as follows: $200 for 6 months, 225 for 6 months, 250 tharesfier It is further understood and agreed that, upon successful completion of twelve (12) months service, the employee will receive a one-week vacation with full pay (if the employee sorsiects, on extra week's pay will be awarded in lieu of . vocation). 5. TERMINATION OF CONTRACT: 16 the Employer or Domestic Help should wish to terminate the Contract without sufficient reason, it is agreed and understood that any such dispute will be placed before the Labor Commissioner of the Srate of California. 6. LABOR LAWS AND SOCIAL SECURITY: The Employer agrees to comply with all existing labor laws and Social Security deductions of the State of California and of the United States. 7. SIGKNESS: in the event the Domestic Help becomes ill, the Employer shall provide food and accommodations and salary for 0 total period of fifteen (15) days during the term of this Contract, but the Employer shall have no responsibility for costs of medical attention for the Domestic Help. Upon arrival in the United States, The Domestic Help agrees to promptly join 10 recogardeed group providing medical and hospital insurance for the duration of the Contract. EMPLOYER Mrs 4507 Pertion Road Address: Corena del Haz, California Erle Rivallibation for Barch 8, 1997 Subscribed and sworn to before on STATE OF CALIFORNIA, County of Orange Ruth Achuh (SEAL) Notary Public in and for said Cooning and State DOMESTIC HELP: Signed: Bitty Mrs Dated: Address: No. 0, Lane 98, shirt Yuan Street, Taipek, Taivas, Rep. of China. (See reverse side for Work Order)"
}
