{
	"anumber": "A17195429",
	"id": "A17195429_0118",
	"page_index": 118,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0118/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, 00629"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1943, 1942, 1835, 1969, 2023, 1940, 1947, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "by NARA, 9/21/2023 00629 HONGSTEKONG STATUTORY DECLARATION 3/A,T/F., Central, Hongkong. Holder of the Hongkong Identity Card A051467 Alias Ng Rd., Nui I, CHAN NUI ( 159 t Occupation: domestic help. Residing at Arbuthnot 0300 (gt ). 8 III 69 8 STAMP OUT 410 I was born at Chor Shan, Tungkoon, Canton, China on 6th March 1915. do solemnly and sincerely declare that to the best of my knowledge, information and belief Out I was married to my husband Lau Chuen ( A. 7 ) on 1943 at Tungkoon, Canton, China. 'aB? of this marriage, we have two sons. My 1940 son at Lau Wing Kong alias Lau Wing Po ) was born on 11th June, My son Lau Ming Kong the of i was born on 31st.July, 1947 at Hongkong and is now Hongkong and is residing at Arbuthnot Rd.,3/A,T/F., Central, Hongkong. residing at Arbuthnot Rd., ,3/A,T/F., , Central,Hongkong. Kwong. My sons Lau Wing Kong and Lau Ming Kong are also spelt as Lau Wing Kwong and Lau Ming My father Chan Yiu My mother Chow Si deceased on 1940 at Tungkoon, Canton, China. Ft My husband Lau deceased on 1942 at Tungkoon, Canton, China. lear My brother Chan Yiu Ke(1) resides at Tungkoon, Canton, China. Chuen (4) 17 resides at Arbuthnot Rd. , 3/A,T/F., Hongkong. I have never applied a visa or other documents to enter into the United States. I don't have any blood relationship or relatives in the United States. The last time I left the mainland China was on 1943. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this day of 14 MAR 1969 through the interpretation of the said 1515 to having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this docu- ment to the declarant, and that he would truly and faithfully interpret the declaration about to be adminis- tered to him/her. Before me, TSANG CHI HONG A Commissioner etc. I, do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant bhan Min and that I will truly and faithfully interpret the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong thanks this day of 14 MAR 1969 , 19 Before me. Isang HONG TSANG CHI A Commissioner etc."
}
