{
	"anumber": "A17195429",
	"id": "A17195429_0120",
	"page_index": 120,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0120/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, A051467"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1925, 1942, 1943, 1835, 2023, 1940, 1967, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 0052₽ HONGSTOKONG STATUTORY DECLARATION ER I, CHAN NUI (199 t )occupation:general amah, residing Arbuthnot Rd., 3/A,T/F., Central, Hong Kong. Holder of the Hong Kong Identity Card A051467 28 XII STAMP DUTY PAID do solemnly and sincerely declare that : to the best of my knowl edge, inf ormation and belief I was boon on 6th March, 1915 at Char Shan, Tungkoon, Canton, China. I was married to Lau Cheun All )on 1943 at Tungkoon, Canton, China, by the Chinese custom. My father Chan Yiu ( RG KP ) deceased on 1940 at Tungkoon, Canton, China. My mother Chow Si ( It deceased on 1942 at Tungkoon, Canton, China My husbad Lau Chuen (Ya) )Arbuthnot Rd. ,3/A,T/F., C. Hong Kong My son Lau Wing Kwong (14) )Arbuthnot Rd.,3/A,T/F., C.Hong Kong My son Lau Ming Kwong ( 4g 10 )Arbuthnot Rd.,3/A,T/F., C. Hong Kong I have never applied a visa or other documents to enter into the United States. I don't have any blood relationship or relatives in the United States. The àast time I left the mainland China was on 1925. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this day of 28 DEC 1967 through the interpretation of FAN Meng Huan the said FAN Meng Huan having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this docu- Be 4 ment to the declarant, and that he would truly and faithfully interpret the declaration about to be adminis- tered to him/her. Before me, PONG WING SAU A Commissioner etc. I, FAN Meng Huan , do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant Chan Mw and that I will truly and faithfully interpret the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong this 28 DEC 1967 19 bell C day of Before me. A Commissioner etRONG WING SAU"
}
