{
	"anumber": "A17181791",
	"id": "A17181791_0088",
	"page_index": 88,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0088/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE REGARDING DOCUMENTSS REQUIRED BY 22 CFR 4.111(b) WHICH ARE UNBTAINABLE,, FS-552"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 FS-552 6 DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA CERTIFICATE REGARDING DOCUMENTS REQUIRED BY 22 CFR 42.111(b) WHICH ARE UNOB.TAINABLE I, the undersigned Vice Consul of the United States of America in and for the consular district of Taipei, Taiwan have determined that the document(s) indicated below is (are) unobtainable by MAO, Pei-Ing Betty , an applicant for an immigrant visa, for the following reasons: The document(s) is (are) considered to be unobtainable because it (they) cannot be procured without causing to the applicant or a member of his family actual hardship, other than normal delay or inconvenience. He (she) does not wish to attempt to obtain such document(s) from the present Communist or Communist- controlled government of his (her) native country, for personal and/or political reasons. Adequate records of such nature not maintained in China at birth or subsequently. There is attached in lieu of the required document(s): (a) A certificate from the appropriate authority showing that in this particular case the missing document was never properly recorded, together with: (b) (describe the secondary evidence and give your reasons for accepting it) 1. Household registration showing date of birth and name of parents. 2. Alien was married and divorced in China mainland thirty years ago, therefore, both certificates are unobtainable. Date December 29, 1967 Dessand Donald E. Mudd (signature) (SEAL) Unobtainable documentation: Birth certificate Police certificate(s) from Republic of China Military record Marriage certificate Death certificate Divorce decree (other, describe)"
}
