{
	"anumber": "A17195429",
	"id": "A17195429_0048",
	"page_index": 48,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0048/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Extension"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 and by which this after being Application for extension must be made prior to the expiration date shown on this permit. It should be submitted 30 to 60 days prior to the expiration date. The application must contain (a) the name of the applicant, and his address in the United States; (b) when, where, and by what means he departed from the United States; (c) port of landing and date of arrival abroad; (d) countries visited in the order visited; (e) reason for requesting extension and period for which desired; and (f) applicant's address abroad; and must be accompanied by the permit. The application must be submitted to the office of the Immigration and Naturalization Service having jurisdiction over the place in which the applicant is temporarily sojourning abroad or to the issuing office shown on page 2, and must be accompanied by a fee of $10. Remittances by persons outside the United States should be by international money order, drawn on Washington, D. .C., or foreign ex- change on a bank in the United States. All remit- tances should be made payable to the Immigration and Naturalization Service, Department of Justice. The permit, if extended will be returned to the address given in the application. If the validity of the permit or extension thereof has expired the alien must obtain an immigrant visa from an American Consul before embarking m the United for the United States. a denomination or organization having organization within the United States mission ary, brother nun, or sister, are eligible to make such application Such aliens may acquire the re- quired one year of uninterrupted physical presence after the absence EXTENSIONS validity of a permit may on good cause extended for a period or periods not exceeding one year from the original expiration date 16 BUREAU OF ENGRAVING AND PRINTING"
}
