{
	"anumber": "A17181791",
	"id": "A17181791_0183",
	"page_index": 183,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0183/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Investigation, A18 438 344"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION TITLE FILE NUMBER WAI, Chut REPORT MADE AT DATE Last BY R A18 Smith 438 344 Los Angeles 4/11/69 Philip H. Smith, Investigator SYNOPSIS The SUBJECT is a 58-year-old citizen of China who was admitted to the United States as an immigrant during September 1968 to work in the United States as a domestic worker. A visa petition was submitted on his behalf by a resident of the Los Angeles area, which reflected that the SUBJECT would be employed as a domestic worker in the United States. Recently the SUBJECT submitted a visa petition on behalf of his wife, who is also a citizen of China and resides in Hongkong. He reports that he has been employed in the United States as a domestic worker since his admission to the United States, but has not worked for the sponsoring employer. He re- ports that prior to the date that he obtained his visa, he was advised by the employment agency in Hongkong that his sponsoring employer had filled the posi- tion that he was to have in the United States. He stated that it was arranged that he work for another family in the United States as a domestic worker. The SUBJECT'S sponsoring employer was contacted and advised that the position that the SUBJECT was to fill in the United States, was filled with another person prior to the SUBJECT's arrival in the United States. He reported that he advised the employment agency that the position was filled. He states that the employment agency reported that the SUBJECT could be placed elsewhere. The sponsoring employer advised that it was his understanding that the SUBJECT was placed in the home of one of his friends. The SUBJECT's present employer was contacted and advised that the SUBJECT has been employed as a domestic worker since the SUBJECT's arrival in the United States. Evidence indicates that the SUBJECT may be amenable to deportation because the position that he was to fill in the United States was not in existance at the time of the SUBJECT's admission to the United States as an immigrant."
}
