{
	"anumber": "A17181791",
	"id": "A17181791_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0012/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4-073"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1968, 1975, 1936, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED CATCATES Form approved IMMIGRATION AND NATURALIZATION SERVICE OMB No. 43-R0079 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card. and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT.) Name MAO, BETTY PEI-ING No. A-17 18/79 Date: JULY 10, 1975 My name is: The BCTTY PEIZING 2 MAO (Print or type here your present full name only) I live at: 720 So. SANRAFAEL Av. (Print or type present apartment number, street address, and if appropriate in care of'') PASADENA 3 200 augeles (County) CALIF 91105 (City) (State) (ZIP Code) 6 Other names I have used are: 2 X never used 4 type NONE here any other 5 Bexxy you have used. including maiden name) Mao - nothers me Briat or name ever My present occupation is House KEEPER & Cook Sex: Male Female (1a) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No (1b) Can you read and write English? 1219966 8 Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? Yes No (2) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To- STREET ADDRESS CITY AND STATE (a) 6-18- 1968 720 So. SAN RAFAEL Av. PASADENA CALIE PRESENT TIME (b) , 19 19 (c) 19 19 (d) 19 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 6-18 1968 PRESENT TIME MR & MRS. PHILIPS.Fogg 720 So SAN RAZAEL HOUSE KEEPER (b) 19 , 19 PASADGNA CA. 91105 8 cook (c) 19 19 (d) 19 19 (4) Have you been out of the United States since you first arrived? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY. Bus PLACE OR PORT OF ENTRY THROUGH WHICH You DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE RETURNED TO THE UNITED STATES UNITED STATES 9 None TWO (10 11 (5) How many times have you been married? TWO How many times has your husband or wife been married? now If either of you has been married more than once, fill in the following information for each previous matriage. (13) 635 ( Check one) How MARRIAGE DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS ENDED CITIZEN ALIEN DIVORCED (a) FGB 1932 Nov. 23,1936 ZEE TSUNg Liang m CANT GETALONG 776 (b) OCT. 1947 KIU SIKKAN in VLEFT ME, 1700 Lexi eas second husband was previously married, divorced Specifics Unknown- - iseds,Resi eye second was never Form N-400 (Rev. 5-1-73)N disso lived. no (1) their 19 (OVER)"
}
