{
  "anumber": "A17195429",
  "id": "A17195429_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1999,
        2023,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form approved. Budget Bureau No. 43-R0052. A RE-ENTRY PERMIT DOES NOT PROTECT NATURALIZA- FEE STAMP TION RESIDENCE. SEE INSTRUCTIONS ATTACHED FOR INFORMATION CONCERNING EFFECT OF ABSENCE ON ELIGIBILITY FOR NATURALIZATION. READ THIS FORM AND ATTACHED INSTRUCTIONS CAREFULLY BEFORE FILLING IN THIS APPLICATION. APPLICATION FOR PERMIT TO RE-ENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act. (Fill in with typewriter or print in block letters in ink.) IMPORTANT: You must submit your Alien Registration Receipt Card with this application. Out Completed 1. CHECK (a) I am an alien lawfully admitted to the United States for permanent residence. Rec ONE (b) 1971 I am a treaty merchant, owfully admitted fo the United States between July 1, 1924, and July 5, 1932g both dates Inclusive, pursuant DEC 1999 to section 3(6) of the Immigration of 1924, to carry on trade pursuant to a treaty of commerce and navigation. 2. NAME (First Name) Middle Name) (Family Name) ALIEN REGISTRATION NUMBER NH CHAN A. 11 17 195 429 ADDRESS (Number) (Street) (City/Town) (State) (Zip Code) 790. FAIRFIELD CIRCLE PASADENA CALIF 91106 DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY COLOR OF FYES COLOR OF HAIR 3-6-15 CHiNA Hongkong BLACK BLACK HEIGHT VISIBLE MARKS AND SCARS FEET 5 INCHES l NOTHING 3. FILL IN THE ITEMS IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RE-ENTER. ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING MY LAST PERMIT LAST PERMIT IS ATTACHED (City and State) IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR AS A TREATY MERCHANT NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL NU ) ChAN HONOLULU 05-31-69 FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME DECEASED DECEASED MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL B.O.A.C. 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN UNITED STATES. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) LAWFUL NAME UNDER WHICH ADMITTED PORT OF ARRIVAL 1-151 E7c p6-1 DATE OF ARRIVAL MEANS OF CONVEYANCE AND NAME OF TRANSPORTATION COMPANY IF ARRIVAL WAS BY VESSEL, GIVE NAME OF VESSEL 6. PORT OF Proposed DEPARTURE FROM UNITED STATES DATE OF Proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD SAN FRANCISCO 70-11-72 I MONTH NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL CHINA LINE AIR, MAILING ADDRESS ABROAD (Number and Street) (City/Town) State/Province/District) (Country) Room 847 BLOCK 9 8 FLOOR NGALI TAL Kok RESETLEMEAT AREA KOWLOON. H.K COUNTRIES TO BE VISITED (List each country) HONG KONG REASONS FOR GOING ABROAD (Be concise and complete): To SEE FAMiLy I DID DID NOT REGISTER FOR SELECTIVE SERVICE PRESENT OCCUPATION SOCIAL SECURITY ACCOUNT NUMBER HOUSE KEEPER 551 94 5639 NAME OF EMPLOYER ADDRESS OF EMPLOYER MRZMRS N. PASCHALL 790. FAIRFIELD CIRCLE 91106 FORM I-131 (REV. 10-15-69) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}