{
	"anumber": "A17195429",
	"id": "A17195429_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OF PERMIT TO REENTER THE UNITED STATES, FORM 1-131 ( (Rev. 3-1-74)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1972, 1915, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED INAR4,992N2028 JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP 81111 OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the 796 670 ,PA Immigration and Nationality Act Use typewriter or print in block letters with ball 1-point pen. TEL; G-100 issuance 10/21/74 I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME ChAN IMPORTANT: You must submit your Alien Registration Receipt NWI Card with this application if you checked \"Issuance\" above. C/O IN CARE OF MR. PASCHALL If you checked Extension' you must submit the reentry per- (No and Street) (Apt No.) mit you wish to have extended. MAILING 190. FAIRFIELD CIRCLE ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) PASADENA CALIF (State) (ZIP Code) 91106 A- 17 195 429 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 3-6-1915 CANTON CHINA BLACK BLACK HEIGHT 5 FEET 2 INCHES VISIBLE MARKS AND SCARS None 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATEAS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS NWI ChAN GRANTED ADJUSTMENT WAS GRANTED H. it. W. 5-1-69 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH AD JUSTMENT MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) B.O.A.C. I-15,DMISSION VERIFLED FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME CHAN Y10 ChENG HA NWI 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico. NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL N41 CHAN SAN FRANCISCO 3-12-1972 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD LOS-SANGELS ( DEC -151974 2. MONTHS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL T.W. A FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List 11 countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. 8. FILL-IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT DEC 22 1971 (City and State) LOS ANGELS IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE 3 DEC-22-1972 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: HOUSE KEEPER NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER MR. PASCHALL 5519 5538 790. FAIRFIELDCIRLE PASADENA. 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) State/Province/District) (Country) 84 10BB00K9. 8'n sloor. Agan Tan Kak R/E Kowloon HONG KONG 11. COUNTRIES TO BE VISITED (List each country) HONG KONG 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): Vituol my ratation RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM I - 131 (Rev. 3-1-74)Y OVER 1 8 1974 1974"
}
