{
  "anumber": "A17190805",
  "id": "A17190805_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17190805_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/30/2023 UN STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION Los OF: I- 1885262 (Family name) (First name) (Middle name) CHAN So Laan (Lan) PORT OF HONOLULU, HAWAII ACTION OF SPECIAL INQUIRY OFFICER The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in the United States at this port on and under JAL 062 Symbol (Name of vessel or flight No. of aircraft) and was inspected by me and U.S. IMMIGRATION Section of the Immigration and HONOLULU, HAWAII 22 Nationality Act. 63 MAY 10 1969 ADMITTED p-5-p Special Inquiry Officer. detained for further inquiry by special officer under UNTIL Symbol ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act CC EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Consulate General, facts stated in the application. IMMIGRANT CLASSIFICATION AT Hongkong. NONQUOTA (Symbol) QUOTA (Symbol) P5-1 Carl W. McCollum VISA PETITION NO., IF ANYVP, 1/15/68,Los Angeles, P5, Vise Consul enclosed. of the United States of America. IMMIGRANT VISA NO. QUOTA 12182 China ISSUED ON (Day) (Month) (Year) 20 January 1969 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 19 May 1969 NATIONALITY (If stateless, so state, and give previous nationality) Chinese SELED PASSPORT NO. UNITED STATES AMERICA OR OTHER TRAVEL DOCUMENTS (Describe) Certificate of Identity No. 70109 Service No. ISSUED Tariff Item No. TO CHAN Salean Fee Paid $20 V STATISTICS BY The HK Immi.Office, HK Local Cy equiv. form I 151 issued Sep. 212 (a) (14) 110. ON 1/16/69 garatorily required EXPIRES 1/15/70 FORM FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE 5-61 This form may be obtained gratis au visuias FINGERPRINTED ONN 6 Nov68"
}