{
	"anumber": "A17192268",
	"id": "A17192268_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17192268_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FORM FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 2023, 1967, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/30/2023 UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION LOS OF: I- 2450327 (Family name) (First name) (Middle name) DESAI Prabhavanti(ManibenGulabshanker PORT OF SFR-130 ACTION OF SPECIAL INQUIRY OFFICER I certify that the immigrant named herein arrived in The immigrant herein was (admitted) (excluded) PAASEL and{ appeal taken no appeal taken the United States at this port on under IMM & NATZ SERVICE Symbol (Name of vessel or flight No. of aircraft) ISCO, CAL. 1.128 and was inspected by me and P A'S s ADMITTED Section of the Immigration and U. S. P. H. S. JUL211967 Nationality Act. SAN FRANCISCO & of Blayton CLASS IR-S, no few Rex Special Inquiry Officer. detained for further inquiry by special officer under Symbol ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act NN. EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN CONSULATE GENERAL facts stated in the application. IMMIGRANT CLASSIFICATION AT BOMBAY, INDIA NONQUOTA (Symbol) QUOTA (Symbol) Darryl N. Johnson form IR-5 VISA PETITION NO., IF ANY Filed: 1/25/66 attached to application Vice Consulof the United States of America. IMMIGRANT VISA NO. QUOTA 30 Indian ISSUED ON (Day) (Month) (Year) 27 March 1967 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 26 July 1967 NATIONALITY (If state/ess, so state, and give previous nationality) Indian PASSPORT NO. I-008602 FOREIGN SERVIN OR OTHER TRAVEL DOCUMENTS (Describe) Service No. ISSUED Tariff Item No. 21 TO Prabhavanti Gulabshanker DESAI Fee Paid $20 Local Cy equiv. Rs.160/- STATISTICS BY Regional Passport Officer, Bombay FORM T-15T Tesas ON 9 April 1962 Sec. 212(a)(14)-Certification not required EXPIRES 8 April 1965 FORM FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE 5-61"
}
