{
	"anumber": "A17195429",
	"id": "A17195429_0095",
	"page_index": 95,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0095/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Alien Employment Certification of Qualifications of Alien,, Budget Bureau No. 4-1301-M."
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1925, 2023, 1922, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OF Screened by NARA, 9/21/2023 TON FOR ALIEN EMPLOYMENT CERT TION Budget Bureau No. 44-R1301.1 PART A TEMENT OF QUALIFICATIONS OF ALIE -575A) READ THIS NOTICE BEFORE EXECUTING FORMS ES-575A AND B DATE wingly furnish any false information in the preparation of this form and any supplement thereto or to aid, abet, or counsel another is a felony punishable by $10,000 fine or five years in the pénitentiary, or both (18 U.S.C. 1001). Any alien, prospective employer or person acting on behalf of such alien or employer, who knowingly makes any misrepresentation concerning the alien, or his prospective employment including such matters as wages, hours, or the occupation in which an alien will be employed, or any person who falsely repre- sents, in the execution of this form that he is offering the alien employment as the prospective employer of such alien, will be prosecuted to the fullest extent of the law. IDENTIFYING AND PERSONAL DATA 1. (Family name in capital letters) (First name) (Middle name) (Maiden name, if alien is a married woman) 2. SEX NAME OF ALIEN CHAN NUI Male Female 3. ALIEN'S BIRTHDATE 4. BIRTHPLACE (City or town) (State or Province) (Country) 5. PRESENT NATIONALITY OR CITI- Month Day Year ZENSHIP 6 1915 Pui Yee Canton China Chinese 6. PRESENT ADDRESS (Number and Street) (City or town) (State and ZIP Code or Province) (Country) 7. IF ALIEN IS SEEKING CHANGE OF Arbuthnot Rd. 3/A, Top Floor, Long Kong CLASSIFICATION GIVE TYPE OF VISA NOW HELD OR 506 Commercial House, Hong Kong 8. ADDRESS IN UNITED STATES WHERE ALIEN WILL RESIDE (Include ZIP Code if known) 9. KIND OF WORK ALIEN IS SEEKING 790 Fairfield Circle Pasadena, Cli Calif. 91106 general amah 10. NAME AND ADDRESS OF PROSPECTIVE EMPLOYER IF ALIEN HAS JOB OFFER 11. IS ALIEN CURRENTLY EMPLOYED? IF so, STATE Mr. & Mrs. N. Paschall, PRESENT OCCUPATION. 790, Fairfield Circle, Pasadena, Calif. 12. EDUCATION AND TRAINING DEGREES OR NAMES AND ADDRESSES OF SCHOOLS, COLLEGES OR UNIVERSITIES FIELD OF STUDY FROM TO CERTIFICATES RECEIVED Sin Ying Primary School, Chinese subjects 1922 1925 Hong Kong SPECIAL QUALIFICATIONS AND SKILLS 13. DESCRIBE SPECIAL QUALIFICATIONS POSSESSED. DESCRIBE ANY SPECIAL SKILLS ALIEN POSSESSES AND PROFICIENCY IN THE USE OF TOOLS, MACHINES OR EQUIPMENT. LIST PROFESSIONAL LICENSES. None 14. GIVE ANY ADDITIONAL INFORMATION CONCERNING ALIEN NOT GIVEN ELSEWHERE WHICH WOULD HELP ESTABLISH ALIEN'S QUALIFICATIONS. None 15. LIST DOCUMENTS ATTACHED WHICH ARE SUBMITTED AS EVIDENCE THAT ALIEN POSSESSES THE EDUCATION, TRAINING, EXPERIENCE AND ABILITIES REPRESENTED. N ne ENDORSEMENTS (MAKE NO ENTRY IN THIS SECTION FOR GOVERNMENT AGENCY USE ONLY) O.T.&C. (SEE OVER)"
}
