{
  "anumber": "A17195429",
  "id": "A17195429_0115",
  "page_index": 115,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0115/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATUTORY DECLARATION, A051467"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1942,
        1960,
        1945,
        1969,
        2023,
        1940,
        1915,
        1947,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 15 01089 HONG City KONG STATUTORY DECLARATION 03.00 I,CHAN NUI KEEP & )alias Ng Nui (kt ). Occupation: domestic help. Resid- ing at Arbuthnot Rd. 3/A,T/F., Central, Hongkong. Holder of the Hongkong Identity Card A051467. STAMP 17 111 69 8 do solemnly and sincerely declare that to the best of my knowldege information and belief I was born on 6th March, 1915 at Chor Shan, Tungkoon, Canton China. I was married to my husband Lau Chuen ( )on 1939 at Tungkoon, Canton, China. Out of this marriage we have two sons. My son Lau Wing Kong 12% )also spelt as Lau Wing Kwong, alias Lau Wing Po iB )was born on 11th June, 1940 at Hongkong and is now residing at arbuthnot Rd. ,3/A,T/F. Central, Hongkong. My sonLau Ming (Kwong PM 21) also spelt as Lau Ming Kwong (1) of =1 )was born on 31st July, 1947 at Hongkong and is now residing at Arbuthnot Rd., 3/A, T/F. , C., Hongkong. My father Chan Yiu deceased on 1940 at Tungkoon, Canton, China. My mother Chow deceased on 1942 at Tungkoon, Canton, China. My brother Chan Yiu Ke ) resides at Tungkoon, Canton, China. My hsuhand Lau Chuen resides at Arbuthnot Rd. 3/A,T/F., C., Hongkong. I don't have any blood relationship or relationes in the United States. I have never applied a visa or other documents to enter into the United States. The last time I left the mainland China was on 1945. The following is the record of my employment with the ne bits period in which I worked for: Unemployed Mr. Bermecchi 3 Arbuthnot Rd. , Hongkong believit Declarations Ac Hong Kong, this day of MAR 1969 SENG KUT through the interpretation of 134 4 the said having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this docu- ment to the declarant, and that he would truly and faithfully interpret the declaration about to be adminis- tered to him/her. Before me, A Commissioner etc. I, do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant bran Nw and that I will truly and faithfully interpret the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong this day of 17 1960 , 19 Before me. account A Commissioner etc."
}