{
  "anumber": "A17181791",
  "id": "A17181791_0148",
  "page_index": 148,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0148/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, TCW:cZ"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 LAW OFFICES LEON W. DELBRIDGE TELEPHONES C.M. LINTON DELBRIDGE, LINTON & WATERHOUSE (213) 795-5144 THOMAS C. WATERHOUSE 681-7691 99 SOUTH LAKE AVENUE, SUITE 570 PASADENA, CALIFORNIA 91101 RUSSELL B. JARVIS OF COUNSEL July 14, 1969 United States Department of Justice Division of Immigration and Naturalization 300 North Los Angeles Street Los Angeles, California Re: Betty Pei-ing Mao - Mr. and Mrs. Philip Fogg Gentlemen: Thank you for the privilege of talking to you today and for your kind help in assisting with the above mentioned matter. As you know, we now have from the Department of Labor in Washington the full clearances under the reply lettering METTI, indicating an unqualified approval of your form ES 575 and related documents. This communication was signed by Harold K. Montross on the Department's form BES FL-71-48, dated 3-67. In addition to this, as we advised you, we have prepared and are ready to submit at any time that you so request your form I 140. As you may know, we had previously submitted this form with the appropriate filing fee, and you returned it to our client with a special sticker and your stamp dated June 23 at 2:40 p.m. We understand in talking to you that in view of the new rulings by the Board of Immigration Appeals that it is no longer necessary to be concerned about our client's ability to stay in the United States or her ability to remain employed by Mr. and Mrs. Fogg and that if any questions should arise in the future concerning her right to do so you will advise us and give us ample time to take the appropriate measures necessary to apply for her continuance as a resident of this country and an employee of the Foggs. Thank you so much for your very kind assistance. Very truly yours, Thomas of DELBRIDGE, LINTON & WATERHOUSE TCW:CZ File REC'D no 5th"
}