{
	"anumber": "A17181791",
	"id": "A17181791_0129",
	"page_index": 129,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0129/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/21/2023, A17 181 791"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 On April 18, 1969, the SUBJECT appeared at the Los Angeles Service office and executed a sworn statement which is attached as Exhibit \"A\" Ex \"A\" in which she reports that she is a 54-year old citizen of China who was admitted to the United States as an immigrant during January 1968. She stated that when she applied for her immigrant visa, she intended coming to the United States to work for the HALLIBURTON family as this employ- ment had been arranged by the Far East Placement Agency. She stated that on about January 15, 1968, which was about two weeks after her visa had been issued, she was informed by the employment agency that the HALLIBUR- TON family could not use her. She stated that the employment agency then arranged for her to work for a family named MONACO. The SUBJECT reported that on January 15, 1968, she signed an employment agreement in Taiwan whereby she would work for the MONACO family following her admission to the United States as an immigrant. She stated that she did work for this family. The SUBJECT admits that she entered into an agreement about two days prior to her admission to the United States as an immigrant whereby she would work for another person rather than her sponsoring employer. The SUBJECT reported that since during June 1968, she has been employed by Mr. and Mrs. PHILIP FOGG as a domestic worker and earns $300 monthly plus room and board. On April 18, 1969, the SUBJECT's present employer, Mrs. PHILIP FOGG, also appeared at the Los Angeles Service office. She reported that the SUBJECT has been in her employ since about June 18, 1968 as a domestic worker and earns $300 monthly. She advised that it was her understanding that before the SUBJECT began working for her, the SUBJECT was employed by the MONACO family in Newport Beach. Mrs. FOGG stated that if the SUBJECT has violated a provision of the Immigration laws, she would petition for the SUBJECT's admission to the United States as an immigrant. LA, Calif. - 7/8/69 A17 181 791 - 3 -"
}
