{
  "anumber": "A17180748",
  "id": "A17180748_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION, ES-575A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        1935,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPLICAT N FOR ALIEN EMPLOYMENT CERTIFICATION Budget Bureau No. 44-R1301 Expiration Date: 8/31/66 PART A - STATEMENT OF QUALIFICATIONS OF ALIEN (ES-575A) 1150 IDENTIFYING AND PERSONAL DATA 1. (Family name in capital letters) (First name) (Middle name) (Maiden name, if alien is a married woman) NAME OF ALIEN SUM Yuk Ying 2. ALIEN'S BIRTHDATE 3. BIRTHPLACE (City or town) (State or Province) (Country) 4. PRESENT NATIONALITY OR CITI- ZENSHIP 2nd Dec. 1921 Kiukiang Kiangsi China Chinese 5. PRESENT ADDRESS (Number and Street) (City or town) (State or Province) (Country) Flat C, 16th floor, Hing Cheong Building, Shaukiwan Rd., Hong Kong 6. ADDRESS IN UNITED STATES WHERE ALIEN WILL RESIDE 1312 Ridgecrest Drive, Beverly Hills, California D. K. LUDWIG 7. KIND OF WORK ALIEN IS SEEKING 8. IF ALIEN IS SEEKING CHANGE OF CLASSIFICATION GIVE TYPE OF VISA NOW HELD Amah N/A 9. EDUCATION AND TRAINING DEGREES OR NAMES AND ADDRESSES OF SCHOOLS, FIELD OF STUDY FROM TO CERTIFICATES COLLEGES OR UNIVERSITIES RECEIVED Man Chung Evening School - Shanghai, Kiangsu, China 1935 1936 SPECIAL QUALIFICATIONS AND SKILLS 10. DESCRIBE SPECIAL QUALIFICATIONS POSSESSED (List any certificates or licenses that give evidence of alien's abilities. For example, as re- quired for employment in occupations such as architect, engineer, lawyer, physician, surgeon, teacher). N/A 11. DESCRIBE ANY SPECIAL SKILLS ALIEN POSSESSES AND PROFICIENCY IN THE USE OF TOOLS, MACHINES OR EQUIPMENT. Can use sewing machine 12. GIVE ANY ADDITIONAL INFORMATION CONCERNING ALIEN NOT GIVEN ELSEWHERE WHICH WOULD HELP ESTABLISH ALIEN'S QUALIFI- CATIONS. 5 years service as a amah 13. LIST DOCUMENTS ATTACHED WHICH ARE SUBMITTED AS EVIDENCE THAT ALIEN POSSESSES THE EDUCATION, TRAINING, EXPERIENCE AND ABILITIES REPRESENTED. 1 reference - Mr. H. H. Holgate ( MOLLERS' LIMITED, H.K. ) (MAKE NO ENTRY IN THIS SECTION - FOR DEPARTMENT USE ONLY) (SEE OVER)"
}