{
  "anumber": "A17182973",
  "id": "A17182973_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 300 North Los Angeles Street REFER TO THIS FILE NC Los Angeles, California 90012 A-17 182 973 MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENTS Your medical examination will be given at: Location U. S. Public Health Service 825 So. Beacon Street, San Pedro, Ca. Date Time Monday, December 16, 1968 8:45 A.M. Mr. Yoh Han Lee 1801 Pandora Avenue The Immigration examination will be held at: Los Angeles, California 90025 Location 300 North Los Angeles Street ROOM 8024 Los Angeles, California Date Time Wednesday, December 18, 1968 8:30 A.M. INSTRUCTIONS FOR MEDICAL EXAMINATION In connection with your application, it will be necessary for you to take a medical examination. An ap- pointment has been made for you to be examined by a doctor of the U. S. Public Health Service at the time and place given above. If you do not speak English, you must bring a person of your own sex who can act as interpreter. BRING WITH YOU to the medical examination the following checked items. (Obtain these items 1 and 2 at once.) 1. X-ray film (size 14\" X 17\") of your chest, taken and interpreted at a hospital or clinic shown on the attached list. (Film and reading not to be more than 7 months old.) (Not necessary for child 10 years of age or under.) 2. Report of serologic test for syphilis. (Report not to be more than 30 days old.) (Not neces- sary for child 14 years of age or under.) 3. The above tests are at your expense. If you do not obtain such tests promptly, the Public Health Service cannot complete your medical examination 4. SEE ATTACHED INSTRUCTIONS C.C.: RONALD H. BONAPARTE, ESQUIRE 3600 WILSHIRE BLVD, TRAVELERS BLDG. SUITE 1902 LOS ANGELES, CALIFORNIA 90005 INSTRUCTIONS FOR IMMIGRATION EXAMINATION An appointment has also been made for an examination before an Immigration officer at the time and place given above. See below for items (if any are necessary) which you MUST BRING WITH YOU: Please bring evidence that you have registered with Selective Service Please bring letter of employment/or a properly executed Affidavit of Support Please bring two passport type photographs size 1 1/2 X 1 1/'' Please bring marriage certificate and/or divorce records of prior marriage ASK TO SEE INSPECTOR DICK YOU SHOULD ANTICIPATE THAT THIS MATTER MAY TAKE FROM ONE TO TWO HOURS RD/mm Form I-486 (Rev. 5-25-66)"
}