{
  "anumber": "A17180748",
  "id": "A17180748_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE REGARDING DOCUMENTSS REQUIRED BY 22 CFR 4.111(b) WHICH ARE UN OBTAINABLE, F 0R EIGN SERVICE OF THE UNITED STATES OF AMERICA"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 6-6-60 DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA CERTIFICATE REGARDING DOCUMENTS REQUIRED BY 22 CFR 42.111 (b) WHICH ARE UNOBTAINABLE I, the undersigned Vice Consul of the United States of America in and for the consular district of Hong Kong have determined that the document(s) indicated below is (are) unobtainable by LO Yung Sing i , an applicant for an immigrant visa, for the following reasons: 1 The document(s) is (are) considered to be unobtainable because it (they) cannot be procured without causing h to the applicant or a member of his family actual hardship, other than normal delay or inconvenience. He (she) does not wish to attempt to obtain such document(s) from the present Communist or Communist- controlled government of his (her) native country, for personal and/or political reasons. There is attached in lieu of the required document(s): (a) A certificate from the appropriate authority showing that in this particular case the missing document was never properly recorded, together with: (b) (describe the secondary evidence and give your reasons for accepting it) The Government of China does not maintain civil records nor does it issue police certificates. The Hong Kong Government does not issue police certificates. Statutory Declaration in lieu of Birth and Marriage Records. JAN 4 - 1968 Date (signature) Luby H. American Vice Consul (SEAL) Unobtainable documentation: Birth certificate Police certificate(s) from China & Hong Kong Military record Marriage certificate Death certificate Divorce decree (other, describe)"
}