{
  "anumber": "A17181791",
  "id": "A17181791_0184",
  "page_index": 184,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0184/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, LOS 4/11/69 A18 438 344"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1911,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 DETAILS The SUBJECT was born on February 22, 1911 in Canton, China and is a citizen of China. He was admitted to the United States as a Class P6-1 immi - grant at Honolulu, Hawaii on September 27, 1968, on he basis of an immigrant visa issued by the American Consulate General, Hongkong on September 17, 1968. Attached to the SUBJECT's immigrant visa application is an approved form I-140 Petition to Classify Preference Status of Alien on Basis of Occupation or Pro- fession, which was submitted on the SUBJECT's behalf by PHILIP S. FOGG, 720 So. San Rafael Avenue, Pasadena, California. The form I-140 visa petition and at- tachments reflect that the SUBJECT would be employed at the FOGG residence in Pasadena as a domestic worker and would earn $225 monthly plus room and board. The SUBJECT presently resides at 73 Malibu Colony Road, Malibu, California. The SUBJECT has submitted a form I-130 Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa on behalf of his wife, YUN CHOY WAI, A19 053 360, who is a citizen of China and now resides in Hongkong. On March 19, 1969 the SUBJECT was interviewed at the Los Angeles Service office by Immigrant Inspector Betty M. Hansen regarding the form I-130 visa petition, and at that time executed a sworn statement which is attached as Exhibit \"A\" The SUBJECT Ex. reports that since his arrival to the United States on September 20, 1968 he has been employed as a domestic worker in the home of Mr. and Mrs. HANDLER, He reports that the FOGG family made arrangement for his employment through the Far East Employment Agency and an office of that agency in Hongkong advised him before he applied for his visa that the position with the FOGG family had been filled. He was advised by the employment agency that arrangement, had been made for him to work for the HANDLER family in the United States. The SUBJECT reports that when he applied for his visa he was aware that he was not going to work for the FOGG family in the United States, but was going to work for the HANDLER family. Attached to the form I-130 visa petition that the SUBJECT submitted, is a letter dated March 19, 1969 which is signed by RUTH HANDLER, 2222 Avenue of the Stars, Apt. 2803, Los Angeles 90067, that the SUBJECT is employed by the HANDLERS at their home, 73 Malibu Colony Road, Malibu, California. On March 26, 1969 PHILIP S. FOGG, who submitted the form I-140 visa peti- tion on the SUBJECT's behalf, was interviewed at his residence and executed a sworn statement which is attached as Exhibit \"B\" regarding the SUBJECT's employ- Ex\" ment. He reported that he submitted a visa petition on the SUBJECT's behalf in order that the SUBJECT could work for him in the United States as a domestic worker. He stated that the arrangement for the SUBJECT's employment was made through an employment agency named Far East Employment Agency of Los Angeles. He states that when he submitted the visa petition on the SUBJECT's behalf, he had an actual need for the SUBJECT's services in his home, but that during June 1968 he filled the SUBJECT's position with another person. He reports that during the early part of September 1968, he contacted the employment agency to advise that the SUBJECT's position had been filled. He states that the employ- ment agency then reported that SUBJECT could be placed in another home. FOGG reported that one of his friends named HANDLER had need for a domestic worker and it was his understanding that arrangements were made to place the SUBJECT with the HANDLER family rather than with him. He states that he submitted the employment offer on the SUBJECT'S behalf in good faith and not for the sole purpose of assisting the SUBJECT in immigrating to the United States. He also LOS 4/11/69 A18 438 344 - 2 -"
}