{
  "anumber": "A17195429",
  "id": "A17195429_0087",
  "page_index": 87,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0087/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OVERSEAS DOMESTIC APPLICATION FORM, 00634"
    },
    "years": {
      "ms_years_nlp_v1": [
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "00634 FAR EAST PLACEMENT AGENCY (U.S.A.) (HONGKONG AGENCY) 506 COMMERCIAL HOUSE, HONG KONG TELEPHONE: 220342 OVERSEAS DOMESTIC APPLICATION FORM Please attach 3 halfsize 1. State New York. 4. Washington, D. C. and 1 fullsize photographs 2. Connecticut. 5. Los Angeles. X 3. Pennsylvania. 6. California. X PLEASE WRITE IN BLOCK LETTERS CLEARLY Position required General Amah 1. Surname Chan Nui Christian Name 2. Address Arbuthnot Rd., 3-A, Top Floor, Central Tel. HK 238850/234418 3. Date of Birth 6/3/1915 4. Place of Birth Canton, China 5. Age 52 6. Nationality Chinese 7. Religion Confusianssm 8. Height 5 Ft: 3 inches. 9. Weight/lb 95 10. Color of Hair black 11. Marital Status married No of Dependant relatives 2 13. Have you ever lived in any country outside Hongkong for 6 months or more? No If so, give details 14. Do you smoke? No 15. Do you Drink? No Please note that two columns should be completed in Questions 16-39. either \"Wirl\" and \"Have Done\" or \"Will\" and \"Will Learn\" in the tasks you are prepared to undertake. Have Will Have Will Will Will Done Learn Done Learn 16. Take care of Babies X 26. Set Table. Assist with Babies. X Help 17. Look after children 27. Serve at table from age 1-5 years. X (informal) Assist with above. 28. Mend Children's Clothes 18. Look after children 29. Assist with cooking X from age 5-10 years. 30. Do plain cooking X X 19. Work where there are 31. Thorough knowledge children over 10 yrs. of English cooking 20. Bathe children. 32. Do advanced cooking 21. Do general housework (English or Chinese Assist with above 33. Prepare children's 22. Do general laundering X Special diets. Assist with above 34. Prepare invalid's diets X 23. Do hand laundering 35. Look after invalids x 24. Sew. 36. Assist with above 25. Iron. 37. Can you swim. Ve/s/No. If not, Are you willing to learn? Nes/No. 38. Can you Drive Ne/s/No. If not, Are you willing to learn? Nes/No. 39. Can you speak English. / This experience need not necessarily have been gained with an employer, so please give ANY domestic experience whether it be professionally or at home, for friends or relatives. I am an profession amah for many years, I can do kinds of house work, and cook, I would like to accept two years contract."
}