{
	"anumber": "A17182973",
	"id": "A17182973_0057",
	"page_index": 57,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0057/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, Form G-28"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Board of Immigration Appeals and Immigration and Naturalization Service NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE In re: Petitions of Ming-Lo Chin DATE: April 24, 1967 on behalf of Lee Chai Pao, Lee Chai Li, and Lee Yu-Han. FILE NO.: I hereby enter my appearance as attorney for (or representative of) the person whose name appears immediately below, and my appearance is made at his (her) request. NAME Ming Lo Chin ADDRESS (Apt. No.) (Number and Street) (City) (State) (Zip Code) c/o Mr. Robert L. Stack, 321 St. Pierre Rd., , Los Angeles, Calif. 90024 Check applicable item(s) below. 1. I am an attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia United States Supreme Court (Name of court) and am not under a court of administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2. I am an accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so recognized by the Board: 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2, whichever is appropriate. ) 4. Others (Explain fully.) Complete Address Signature print 6331 Hollywood Blvd., Rm. 706 Hollywood, Calif. 90028 NAME-Type of Telephone number RONALD H. BONAPARTE HO. 3-2104 or Ho. 3-2500 Form G-28 (Rev. 10-5-64)"
}
