{
	"anumber": "A17180748",
	"id": "A17180748_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXPERIENCE FORM, NARA-92/2023"
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1954, 2023, 1963, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 (10) 15. \"X\" THE APPROPRIATE BOX BELOW AND FURNISH THE INFORMATION REQUIRED FOR THE BOX MARKED. EXPERIENCE 14. (List the most important jobs related to alien's admission, starting with the most recent) (1) NAME AND ADDRESS OF EMPLOYER University of Hongkong, Robert Black College-Pokfulum Road, Hongkong. NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS No. 1 Houseboy 1/7/1966 Now In charge of the cooks and DESCRIPTION OF WORK PERFORMED take care of the University In charge of all the cooks in the University and takecare dining room. of the dinning room , and prepare the menu for the cooks to do. (2) NAME AND ADDRESS OF EMPLOYER C. de Bedior - Flat A, 14 Conduit Road, 7/F. Hongkong. NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS Cook-boy 8/6/1964 31/7/1966 Cook DESCRIPTION OF WORK PERFORMED Cook both European and Chinese dishes. (3) NAME AND ADDRESS OF EMPLOYER Mr. E. B. Moller of Mollers' Limited- Union House, Hongkong. NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS No. 1 Houseboy Sept. 1954 Dec. 1963 Household duties. DESCRIPTION OF WORK PERFORMED Take care of the household and when the chef is on leave, I take over the cooking (4) LIST NAMES AND ADDRESSES OF OTHER EMPLOYERS IN PAST FIVE YEARS AND DESCRIBE WORK PERFORMED FOR EACH Mr. C. de Bedior-Flat A, 14 onduit Road, 7/F. Hongkong- Cook both European and Chinese dishes from 8th June, 1964-31st July, 1966. Mr. E. B. Moller-Mollers' Limited0 Union House, Hongkong- No. 1 Houseboy - take care of the household and when the chef is on leave I take. over the cooking- from September, 1954- 21st December, 1963. 15. DECLARATION I CERTIFY that all of the statements made in this document are true, complete, and correct to the best of my knowledge and belief. Date 13th September, 1966 Signed Alien (Delete one) Agent of FORM IS SUBMITTED BY AGENT OF 4 VE AGENT'S COMPLETE ADDRESS"
}
