{
  "anumber": "A17182973",
  "id": "A17182973_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1970,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITEDSTATE PNAR848ENT2023 JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE OMB No. 3-R007A *FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card. and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT.) Name LEE YOH HAN No. A - 17 182 973 1 2 June 09 1974 Date: LEE YOH HAN Lee My name is: (Print or type here your present full name only) I live at: 3426 VINTON AVE APT 3 (Print or type present apartment number, street address, and if appropriate \"in care of ) WEST LOS ANGELES CALIF 90034 (City (County) (State) (ZIP Code) w Other names I have used are: (Print or type here any other name you have ever used. including maiden name) My present occupation is COMPU-MACH OPER Sex: Male Female S (1a) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No cn Yes No (1b) Can you read and write English? cn Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? (2) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM- To- STREET ADDRESS CITY AND STATE (a) July 19 73 PRESENT TIME 3426 Vinton Ave Apt 3 W.I.A. Calif 90034 (b) Oct 19 70 June 1973 3731 Mentonve Ave 10 same , (c) May 19 70 Oct ,70 1343 S. Carmelina Ave W.L.A. Calif 90025 (d) Apr 68 19 Apr 1970 1801 Pandora Ave W......... Calif (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- To- ADDRESS OCCUPATION OR TYPE EMPLOYER'S NAME OF BUSINESS (a) Jan 19 73 PRESENT TIME Hollywood Needlecraft 3777 S. Main Garment (b) Oct 19 70 Dec 19 72 E.D. Kramer Co 2181 Venice Bl Promote (c) Sep 19 69 June 19 70 Daniel B. Curran 3511 W. 6Th Finance (d) Apr 19 68 Sept 19 69 Domestic jobs 809 N. Foothill (4) Have you been out of the United States since you first arrived? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months. no matter how short it was. NAME OF SHIP. OR OF AIRLINE, RAILROAD COMPANY. Bus PLACE OR PORT OF ENTRY THROUGH WHICH You DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE RETURNED TO THE UNITED STATES UNITED STATES (5) How many times have you been married? One How many times has your husband or wife been married? One If either of you has been married more than once, fill in the following information for each previous marriage. Check one) How MARRIAGE DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS ENDED CITIZEN ALIEN (a) (b) (c) (d) (1) (OVER) Form N-406 (Rev. b-1-73)N"
}