{
  "anumber": "A17182973",
  "id": "A17182973_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0061/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Visa petition for Lee Chai-Pao, Lee Chai-Li, and Lee Yu-Nan, A17 102 973"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 PLEASE REFER TO THIS FILE NUMBER FOIA (b)(6) UNITED STATES DEPARTMENT OF JUSTICE A17 182 973 IMMIGRATION AND NATURALIZATION SERVICE SEP 1 3 1967 300 NORTH LOS ANGELES STREET LOS ANGELES, CALIFORNIA 90012 Mrs. Hing Lo Chin c/o Mr. Robert L. Stack 321 St. Pierre Road Los Angeles, California 90024 LEE Chat-Pao Chai-Ed Reference: Visa petition for LEE Ye-lian As sufficient documentary proof of relationship has not been presented in support of the above Visa Petition, it will be necessary that a report of your blood groupings be sent to the American Consul so that a comparison may be made with the results of a blood test of the beneficiary. An appointment has been made for you at BRENTWOOD LABORATORY Thursday 1321 North Vermont Avenue on September 21. 1967 at 9:30 A. M. Los Angeles, California 90027 Please bring with you documents which will establish your identity such as BIRTH OR NATURALIZATION CERTIFICATE, ALIEN REGISTRATION RECEIPT CARD OR SIMILAR DOCUMENTS. ALSO BRING TWO RECENT PASSPORT TYPE PHOTOGRAPHS OF YOURSELF. This appointment was arranged for you several weeks in advance. It is im- portant that you appear at this time and place in order to avoid delay in final action on the petition. ces Ronald II. Bonaparte, Require Very truly yours, 6331 Hollywood Boulevard Room 706 Hollywood, California 90028 of Fold. ASSISTANT DISTRECT DIRECTOR TRAVEL CONTROL A CASH FEE OF $25.00 IS PAYABLE TO THE LABORATORY AT TIME OF BLOOD WITHDRAWAL OFS/erg SW-94 Rev. 6-16-58(10)"
}