{
	"anumber": "A17195429",
	"id": "A17195429_0111",
	"page_index": 111,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0111/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Domestic Couple"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "TITLE Domestic Couple OCC. CODE 309.999 22. NUMBER OPENINGS TO BE 23. DAILY WORK SCHEDULE (HOURS) FILLED in Domestic Couple One 8 HOURS PER WEEK 25. RATE OF PAY 26. IF THE JOB IS UNIONIZED, GIVE NAME AND NUMBER OF LOCAL $400 per month plus 44 room and board N/A 27. OCCUPATIONAL TITLE OF PERSON WHO WILL BE ALIEN'S 28. TYPE AND DEGREE OF SUPERVISION 29. NUMBER OF OTHER EM= IMMEDIATE SUPERVISOR ALIEN WILL RECEIVE PLOYEES ALIEN WILL Housewife Minimum SUPERVISE None 30. DESCRIBE FULLY THE JOB TO BE PERFORMED, INCLUDING DUTIES, WORKING CONDITIONS, AND EQUIPMENT OPERATED. All general housework than laundry, ironing and supervision of children, All cooking - assist with maintenance of the home. s 31. STATE IN DETAIL THE EDUCATION AND TRAINING REQUIRED FOR PROFICIENCY IN JOB. (Specify degrees and major fields of study 70- quired. Specify apprenticeship. trade school or other training required). Minimum education only required for this unskilled work - experienced trained domestic not necessary required as employer prefers to train on arrival. 32. STATE MINIMUM EXPERIENCE REQUIREMENTS OF JOB. INDICATE ACCEPTABLE EXPERIENCE IN RELATED JOBS. e 1 As question 31 above bad 33. DESCRIBE SKILLS, KNOWLEDGES AND ABILITIES REQUIRED FOR PROFICIENCY IN JOB. ( As question 31 above I 34. SPECIFY ANY OTHER SPECIAL REQUIREMENTS SUCH AS LANGUAGES, LICENSES, PHYSICAL REQUIREMENTS. Good health - able to pass physical exam. 35. DECLARATION OF EMPLOYER: I/Certify that I have examined the contents of this form and the statements are true and correct to the best of my knowledge and belief. SIGNATURE TITLE Head of Household (Nathaniel Paschall Severe penalties are provided by law for knowingly and willfully falsifying 07 concealing a material fact or using any false document in the submission of this Job Offer For Alien Employment. (U.S. Codes, Title 18, Sec. 1001) Subscribed and sworn to (affirmed) before me this of A.D. 19 at (SEAL) (Signatu Administering Officer) My commission expires (Title"
}
