{
	"anumber": "A17181791",
	"id": "A17181791_0045",
	"page_index": 45,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0045/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/221/2023, FORM ES-5758, Supplement I must also be submitted"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 FOR LOCAL E. S. OFFICE USE ONLY IND. CODE 88 OCC. TITLE Maid, General OCC. CODE 306.878 16. NAME OF JOB OFFERED (If alien is required to live at work, Form ES- 17. NUMBER OPENINGS TO BE 18. WORK SCHEDULE (Hours: Days) 575B, Supplement 1 must also be submitted) FILLED BY ALIENS UNDER MTWFS THIS OFFER Cook and maid one Sundays & Thurs. off Lafter. 19. TOTAL HOURS PER WEEK 20. RATE OF PAY 21. NUMBER OF OTHER 22. OCCUPATIONAL TITLE OF PERSON WHO Hourly Room board plus EMPLOYEES ALIEN WILL BE ALIEN'S IMMEDIATE SUPERVISOR WILL SUPERVISE 44 $1.75 Basic per month None Housewife Overtime 23. TYPE AND DEGREE OF SUPERVISION 24. IF THE JOB IS UNIONIZED, GIVE NAME AND NUMBER OF LOCAL 25. IS THERE A STRIKE OR LABOR DIS- ALIEN WILL RECEIVE PUTE EXISTING OR A LABOR CON. TRACT BEING NEGOTIATED? Very little None No 26. DESCRIBE FULLY THE JOB TO BE PERFORMED, INCLUDING DUTIES, WORKING CONDITIONS, AND EQUIPMENT OPERATED. Cook and house maid 27. STATE IN DETAIL THE MINIMUM EDUCATION, TRAINING, AND EXPERIENCE REQUIRED FOR PROFICIENCY IN JOB. Mrs. Mao has had many years of experience as a cook and maid, which is more than sufficient. 28. DESCRIBE SKILLS, KNOWLEDGES, AND ABILITIES REQUIRED FOR PROFICIENCY IN JOB. SPECIFY ANY OTHER SPECIAL REQUIREMENTS SUCH AS LICENSES, PHYSICAL REQUIREMENTS. No special skills required other than noted in 27. 29. DECLARATION OF EMPLOYER.-I declare that I have examined the contents of this form and the statements are true and correct to the best of my knowledge and belief. DATE April 21, 1968 SIGNATURE Homeowner TITLE (Employer OF representative) Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any faise document in the submission of this Job Offer For Alien Employment (U.S. Code, Title 18, Sec 1001). DECLARATION OF AGENT OF EMPLOYER.- (If this form is submitted by an agent of the employer, the agent must also sign below and give his complete address.) I have read the notice on the face side of this form and am aware that Section 1001 of Title 18 of the United States Code provides a fine of not more than $10,000 or imprisonment for not more than five years or both for knowingly and willfully falsifying, concealing or covering up by any trick, scheme, or device a material fact, or making any false, fictitious or fraudulent statements or representations, or making or using any false writing or docu- ment knowing the same to contain any false, fictitious or fraudulent statement or entry. I accordingly declare that to the best of my knowledge and belief the matters represented in this form, supplement thereto, and accompanying documents are true and correct. DATE SIGNATURE ADDRESS For sale by the Superintendent of Documents, U.S. Government Printing Office, Washington, D.C. 20402 . Price $1.00 per pad U.S. GOVERNMENT PRINTING OFFICE 1966-O-242-218"
}
