{
  "anumber": "A17181791",
  "id": "A17181791_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION, FORM ES-575"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1922,
        1928
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FORM ES-575 Screened NARA 9/21/2023 APPLICA FOR ALIEN EMPLOYMENT CERT CATION Budget*Bureau No, 44-R1301 Expiration Date: 6/31/66 PART A ATEMENT OF. QUALIFICATIONS OF 1184 IDENTIFYING AND PERSONAL DATA 1. (Family name in capital letters), (First name) (Middle name) (Maiden name, if alien is a married woman) NAME OF ALIEN MAO Betty 2. ALIEN'S BIRTHDATE 3. BIRTHPLACE (City or town) (State or Province) (Country) 4. PRESENT NATIONALITY OR CITI- ZENSHIP Oct. 27 & 1914 Shanghai Kiangsu Rep. of China Chinese 5. PRESENT ADDRESS (Number and Street) (City or town) (State or Province) (Country) No. 8, Lane 95, Shui Yuan Street, Taipei, Taiwan, Rep. of China 6. ADDRESS IN UNITED STATES WHERE ALIEN WILL RESIDE 4507 Perham Road Corona del Mar, California 7. KIND OF WORK ALIEN IS SEEKING 8. IF ALIEN IS SEEKING CHANGE OF CLASSIFICATION GIVE TYPE OF VISA NOW HELD Cook-Housekeeper 9. EDUCATION AND TRAINING DEGREES OR NAMES AND ADDRESSES OF SCHOOLS, COLLEGES OR UNIVERSITIES FIELD OF STUDY FROM TO CERTIFICATES RECEIVED Huhtung Primary School of Shanghai General education 1922 1928 Diploma was Iost SPECIAL QUALIFICATIONS AND SKILLS 10. DESCRIBE SPECIAL QUALIFICATIONS POSSESSED (List any certificates or licenses that give evidence of alien's abilities. For example, as re- quired for employment in occupations such as architect, engineer, lawyer, physician, surgeon, teacher). None 11. DESCRIBE ANY SPECIAL SKILLS ALIEN POSSESSES AND PROFICIENCY IN THE USE OF TOOLS, MACHINES OR EQUIPMENT. I know how to use washer-dryer, dishwasher, and all the domestic equipment. 12. GIVE ANY ADDITIONAL INFORMATION CONCERNING ALIEN NOT GIVEN ELSEWHERE WHICH WOULD HELP ESTABLISH ALIEN'S QUALIFI- CATIONS. I can speak English and well experienced in domestic. 13. LIST DOCUMENTS ATTACHED WHICH ARE SUBMITTED AS EVIDENCE THAT ALIEN POSSESSES THE EDUCATION, TRAINING, EXPERIENCE AND ABILITIES REPRESENTED. I have letters of reference. (MAKE NO ENTRY IN THIS SECTION - FOR DEPARTMENT USE ONLY) (SEE OVER)"
}