{
  "anumber": "A17182973",
  "id": "A17182973_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "American Consulate General Sao Paulo, A17 182 973"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1925,
        2023,
        1964,
        1967,
        1950,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 FOIA (b)(6) American Consulate General A17 182 973 Sao Paulo 3th John L. Todd, Assistant District Director NOV - 1 1967 Travel Control, Los Angeles, California Visa petitions filed by Ming-Lo Chin - A14 612 729 in behalf of LEE Yu-Han 40 A17 182 973, spouse: LEE Chai-Pao - FOIA (b)(6) unmarried daughter; LEE, Chai-Li - FOIA (b)(6) , unmarried daughter. The petitioner Ming-Lo Chin is the subject of our file A14 612 729 which reflects that she was lawfully admitted for permanent resi- dence pursuant to the provisions of section 245 at Los Angeles, California on February 1, 1967 following her admission at San Francisco, California as a nonimmigrant visitor for pleasure on September 19, 1964. The petitioner when interviewed on August 10, 1967 verified the facts and allegations contained in her petitions, the supporting evidence and the relating files. In support of her petitions Mrs. Chin has submitted secondary evidence which is attached and con- sists of the following items: signature specimen form and recent individual photographs of petitioner; a group photograph taken in 1950 depicting petitioner and all beneficiaries; a certificate executed by the Vice-Consul in Sao Paulo attesting to the relation- ship between the petitioner and the second named subject beneficiary; similar certificate relating to the last named subject beneficiary; photocopy and translation of a marriage certificate as issued in the city of Shaghai relating to the marriage of the petitioner and the first named subject beneficiary on December 2, 1925 (Year of the Chinese Republic). The petitioner testified that she was born in Shanghai and that she married the first named subject beneficiary on December 2, 1936 (such marriage being the first and only marriage for either party and that as issue of such marriage the last two two named subject beneficiaries were born). Report of interview of the petitioner is attached. On the basis of the interview, sworn testimony of the petitioner, (see attached copy of sworn statement executed Los Angeles, California August 26, 1966), review of her file, the allegations contained in the petitions and the supporting evidence, it is concluded that the peti- tioner has established her claim to lawful permanent residence in the United States and has introduced reasonable grounds to believe that the alleged relationships do exist. The petitions filed on behalf of the subject beneficiaries are therefore approved conditioned upon compati- bility of the blood of petitioner, and that of all beneficiaries. Report of blood grouping tests of the petitioner is attached. Attachments. or"
}