{
	"anumber": "A17181791",
	"id": "A17181791_0119",
	"page_index": 119,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0119/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, I-181"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 1970, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 MEMORANDUM OF REATION OF RECORD OF LAWFUL RMANENT RESIDENCE SIO Place Los Angeles, California File No. A17 181 791 TC/245/STO Status as a lawful permanent resident of the United States is accorded: Sex NAME MAO, BETTY PEI-ING Female ADDRESS 720 South San Rafael, Pasadena, California 91105 NATIONALITY DATE OF BIRTH PLACE OF BIRTH China Oct. 27, 1914 Shaughai China COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE: (If any) PRIORITY DATE China Nonpreference 7-9-69 REMARKS Section Sec. 203(a)(8) NONPREFERENCE: Individual section 212(a)(14) cer tification issued; Blanket section 212(a)(14) certification issued; Section 212(a)(14) certification not required because As of at (Month) (Day) (Year) Los Angeles, California (Place) Class of admission (insert coding symbol) Z-2 (NP-1) NP6 the requirements of the following provision of law having been fulfilled. Sec. 2 of the Act of 11/2/66 Sec 203 (h) of the I & N Act Sec 13 of the Act of 9/11/57 Sec 244 ( ) ( ) of the I & N Act Private Law no. of the Sec 245 of the I & N Act Congress session Sec 249 of the I & N Act Sec. 1 of the Act of 11/2/66 (Other law - Specify) (Applicable in all cases) Date 9-9-70 Recommended by ame Immigration Officer Date Approved Card District Director FOR USE BY VISA CONTROL OFFICE Date 9-9-70 Foreign State China Preference Category Nonputer Number 3960 Month of Issuance Sept 1970 Signed Frances (Visa Marwell Office, Dept. of State) by plane, Confirm their Che to banit Date Form I-357 delivered . important CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service Form I-181 (Rev. 11-2-66) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
}
