{
  "anumber": "A17190805",
  "id": "A17190805_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17190805_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 6/30/2023, Form Number: I-1005A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        1931,
        2023,
        1933,
        1922,
        1940,
        1957,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/30/2023 21. (I am submitting the following personal documents in support of and as part of my application) (Birth certificate) (Military record) (Promise of employment) (Police certificate(s)) (Evidence of support or (Medical record(s)) (Other (describe)) own resources) (Marriage certificate) 75-552 22. (Name and present residence of my wife/husband is (Give maiden name of wife)) 23. (The names and addresses of my children under 21 years of age are) 24. (The names of members of my family who are immigrating with me are) HO Chung Wah MO ther CHAN So Hing -sister 25. (The name and address of my father is (If deceased, so state, giving date)) CHAN Nai Man - deceased 26. (The maiden name and address of my mother is (If deceased, so state. giv- ing date)) HO Chung Wah 7 Tokwawan Road, /f1.Kowloon. 27. (The name and address of my next of kin in Hong Kong or Macau is) 28. (Since birth my places of residence for 6 months or more have been (Give street address in Hong Kong, Macau, and other cities)) (-) (Country,) (Province), If (District), F(Heung), #(Village), (Street Address), (Dates(From-To)) (Occupation) Canton Kwangtung, China. Mar.1922 - Sep.1922 79 Sai Tau Vill., Kowloon. Oct.1922 - Jan.1931 68 Nga Tsin Wai Road, 2/2. Kowloon. Feb.1931 - Jan.1933 Pak Tse Road, Canton, Kwangtung, China. Feb.1933 - Jan.1936 68 Nga Tsin Wai Road, 2/f1. Kowloon. Jan.1936 - Jun.1940 17 Crampian Road, Kowloon. Jul.1940 - Jun.1952 Pui Man Vill., No:57, Kowloon. Jun.1952 - Sep.1957 7 Tokwawan Road, M/f1. Kowloon. Oct.1957 present 29. (Since my sixteenth birthday I am or have been a member or affiliate of the following political, professional, vocational or social organizations) (Name and address) (Dates (From-To)) (Type of membership and office held, if any) 30. (I speak, read, write the following languages (Include your native languages)) (Languages) (Speak) (Read) (Write) Chinese Cantonese Chinese Chinese English English English 31. ) (I have previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state)) 32. (United States immigration laws require that all prospective immigrants answer the following questions. This requirement does not imply that you are suspected, of being within any of the classes described in these questions. Your answers will assist the consular officer to establish your eligibility to receive a visa. If you are unable to answer any of these questions please explain your inability fully on a separate sheet of paper which you should attach to this form. Please bear in mind that whatever the nature of your answers to these questions, you are not necessarily ineligible to receive a visa. For example, if you were arrested and/or convicted for a minor offense, and the consular officer is able to establish that such offense was in fact a misdemeanor, your arrest and/or conviction would not necessarily make you ineligible for a visa.) (Give the correct answer to the following questions by circling \"Yes\" or \"No\") (a) (Have you ever been arrested for, charged Yes No indicted for, or convicted a crime or other offense?) (b) you ever been confined in a civilian prison or jail?)"
}