{
  "anumber": "A17181791",
  "id": "A17181791_0143",
  "page_index": 143,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0143/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ORDER TO SHOW CAUSE AND PROCESSING SHEET"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form 1-265- (Rev. 6-20-66) AP ATION FOR ORDER TO SHOW CAUS D PROCESSING SHEET (RELATING FORM 1-213 MUST BE ATTACHED) MAO, Pei-Ing, also MAO There Betty Name Office File LOS A17 181 791 c/o Fogg, 720 S. San Rafael Ave., Pasadena, Calif. 91105 Philip S. Date FACTUAL ALLEGATIONS 7/8/69 1. You are not a citizen or national of the United States 2. You are a native of China and a citizen of China ; 3. You entered the United States at Honolulu, Hawaii on January 17, 1968 ; (Date) 4. (See continuation sheet attached. ) 5. Supporting Attorney evidence of (briefly Record Itemize) THOMAS WATER Hou ISE no G-28 as of 3-17-70 Che See G-166 in file and SUBJECT's sworn statement of 52 The undersigned recommends: V/D without OSC OSC Charge(s) (Code) REGOJ, RAZEZ Trial Attorney Interpreter Chinese (Language) Prosecution: Violation W/A For the following reasons: Fees Qyan Signature Philip H. Smith Title Investigator Above recommendation 2-27-70 (Date) approved: James H.Durther (Signature) Suffering (Title) Imes. too Angeles (Office) OSC Iss. OSC serv. TD country Validity W/A Iss. W/A serv. Det; Rel; Prison; Hospital Approx. Hrg. Time VD prior hearing to ; Ext. Selective Service No., Address of Board; Classification; Ordered to report for Induction DETENTION DATA RELEASE DATA HEARING DATA Place Bond (amount) Place Expense of Parole Date Since Since Hour PROCESSING DATA Check column # 1 (when applicable) for action to be taken; column # 2 when action is taken #1 #2 PREPARE #1 #2 REQUEST (Continued) OSC W/A Canadian Consent V/D letter days Mexican Certificate of Nationality I-161 I-154 pp, or other evidence of nationality, from alien G-135 G-135a Record check Local police at G-135 b (to Other ) Detainer (I-247) to civil authority at I-217 (complete pp data) Fingerprint Charte for FBI Earliest release date Other NOTIFY: Prosecution Report to U.S. Atty. OI 103 reports to: REQUEST: Consulate C.O. file check Send I-530 Attorney of record Files from State Director, Selective Service Verification arrival FBI Stowaway entry Photographs (number) Detention Officer re: property arrangements"
}