{
  "anumber": "A17195429",
  "id": "A17195429_0088",
  "page_index": 88,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0088/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/21/2023, FAR EAST PLACEMENT AGENCY (HONGKONG AGENCY)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 40. Do you like pets? Yes 41. Age on leaving School 18 42. How many brothers and sisters? No 43. Have you any Diploma, Certificate or special experience for domestic or child care and duties? No 44. Are you willing and able to take full charge of children (if any) and house during employers absence Yes 45. If you attend church, please state, when No 46. Are you willing to work for employer of any religious denomination? Yes 47. Are you available for immediate employment? If not, when? Yes 48. How soon after a Visa has been issued can you travel? 2 weeks 49. Have you ever been refused a Visa? YES/NO. If yes- reason. No 50. Name and address of next of kin. husband (00633) 51. Have you any relative or friend in the USA. If yes, name No 52. Do you know of any reason whatsoever that would be likely to prevent you from remaining in the continuous employment of your employer for at least 2 years from the date you commence working for him? YES/NO. If yes, please state reasons. No 53. REFERENCES a. Present employer (confidential) Name Mr. Brook Benich Employed as General amah Address Arbuthnot Rd. ,3/A, Top Floor, Central, HK Length of employment 1945-up-to-date Length of Notice to be free 1 month b. Previous employers. Please give details of immediate previous employers, if this is not possible then referee's are acceptable. Name Employed as Address Length of employment Date left C. Name Employed as Address Length of employment Date left d. Personal referee. Name Chan Fran Occupation cook boy Address King's Park, West Hill St., No.2 I hereby warrant that the above information is true and correct in every respect and agree that same shall be basis of any contract between me and any employer in the U.S.A. whom FAR EAST PLACEMENT AGENCY may find for me whether directly or indirectly. 131 4 Applicants's Signature date 16/3/67 Witnessed By J. chi Address 11/F,Flat A, Lakeside bldg. INTERVIEW REPORT This applicant is a professional amah. She can do all kinds of domestic works, cooking, and take care of children. She is a very worthy amah, honest, capable and hard working amah. I am sure you will find joyful and satisfactory with her engagement. I have no doubt in recommending her to those who needs her service. She dosen't has reference letters for she has been working for Mr. Brook Benich from 1945 up to now. She is going together with her husband. Her husband is a very capable cook boy. They are a very cheerful couple. FAR EAST PLACEMENT AGENCY (U.S.A.) (HONGKONG AGENCY)"
}