{
	"anumber": "A17180748",
	"id": "A17180748_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATEMENT OF FACTS FOR PREPARATION OF PETITION, 363939"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1923, 1910, 1968, 2023, 6051, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 3 363939 ALIEN REGISTRATION Name LO. YUNG SING STATEMENT OF FACTS FOR PREPARATION OF PETITION SECTION OF LAW 8) 316a No. A- 17 180 748 (1) My full, true, and correct name is YUNG SING 10 (Full, true name, without abbreviations) (2) My present place of residence is 601 South Detroit Street, Los Angeles, L. A., Calif. 90036 (Number and street) (City or town) (County) (State) (ZIP Code) (3) I was born on December 25, 1910 in Kiang Sic. Kiu Kiang, China (Month) (Day) (Year) (City or town) (County district, province, or State) (Country) (4) I am Married and have 3 living children. The first name of my husband or wife is (our Yuk SUM (Single; married; divorced; widowed) we were married on June 12, 1961 at HONG KONG nee she born Chung was (Month) (Day) (Year) (City or town) (State or country) at CHINA on December 2. 1923 ; (City or town) (County, district. province, or State) (Country) (Month) (Day) (Year) entered the United States at San Francisco California on Feb. 12, 1968 for permanent residence in (City or town) (State) (Month) (Day) (Year) with me the United States and now resides apart from me at ; and was naturalized (Show full address if not living with you) on at Certificate No. (Month) (Day) (Year) (City or town) (State) or became a citizen by big her Alien Registration No. is A- 17 222 469 (5) I was lawfully admitted to the United States for permanent residence on Februar 12, 1968 ; under the name (Month) (Day) (Year) of LO, YUNG SING on the Pan American Airlines 846 at San Francisco. CA. (City) (State) (Name of vessel or other means of conveyance) de (6) I have resided continuously in the United States of America since since 02/22/1968 State of California where I now live since then 2-12-68 and continuously in the and during the past 5 years I have been physically present in the United States for an aggregate period of 6051 months. (7) I (have, have not) previously filed petition for naturalization No. on (Month) (Day) (Year) at in the (City) (State) (8) I wish the naturalization court to change my name to YUNG SING LO None (Give full name desired or state \"None\") (9) Since such lawful admission, I have not been absent from the United States (for a period or periods of 6 months or longer) except as follows (if none, state \"None\"): DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT (Month, day, year) OF CONVEYANCE PORT (Month, day, year) OF CONVEYANCE NONE (10) I have Thr ee children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), otherwise (No.) give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date (Country) Born (f) Port of Entry (g) Alien of Entry Registration No. (h) Now Living At- Lo Wen Chi Male China 7/15/44 Never been in the USA. Chana FOIA (b)(6) (10no other"
}
