{
  "anumber": "A17181791",
  "id": "A17181791_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0074/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1963,
        1960,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened EXPERIENCE 72023 14. (List the most important jobs related to alien's admission, starting with the most recent) (1) NAME AND ADDRESS OF EMPLOYER Mr. and Mrs. Gleen C. Johnson, c/o Morrison Knudsen Co., , Box 450 Boise, Idaho U.S.A. NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS Housekeeper May 1964 July 1964 Engineer DESCRIPTION OF WORK PERFORMED Child caring, ironing, laundering, cleaning, cooking, general housework (2) NAME AND ADDRESS OF EMPLOYER Mr. M. Danielsen, No. 23, Shihmen Dam Campsite NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS General housekeeper Jan. 1963 April 29, 1964 Engineer DESCRIPTION OF WORK PERFORMED Generall housework, washing, cleaning, ironing, child caring, cooking, set table. (3) NAME AND ADDRESS OF EMPLOYER Col. Jeannett Cavinese, No. 404, Tien Mao Road, Tien Mao, Taipei, Taiwan, NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS Houseservant July 1960 July 13,1961 U.S. Military Officer DESCRIPTION OF WORK PERFORMED Washing, ironing, cleaning, cooking, child caring, general housework (4) LIST NAMES AND ADDRESSES OF OTHER EMPLOYERS IN PAST FIVE YEARS AND DESCRIBE WORK PERFORMED FOR EACH 15. DECLARATION I CERTIFY that all of the statements made in this document are true, complete, and correct to the best of my knowledge and belief: Date March 22, 19 Signed Betty Betty Mao Mar Alien (Delete one) Agent en IF THIS FAR EAST-MAYFLOWER AGENCY AIWAN AGENCY) IS SUBMITTED BY A N NT OF ALIEN. GIVE AGENT'S COMPLETE ADDRESS 12. Lane 42. Sec. 2. Chung Shan N. Rd. Taipei. Taiwan"
}