{
	"anumber": "A17195429",
	"id": "A17195429_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, NARA, 9/21/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1980, 2023, 1971]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE OMB N2 43-R0079 LOS JUN 17 1980 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: Ns #038313 240 IMMIGRATION AND NATURALIZATION SERVICE 941-80 ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card. and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT.) Name NUI CHAN No. 1 - 17 195 - 429 Date: June 12th 1980 My name is: Nus CHAN (Print or type here your present full name only) I live at: IN CARE OF NAI PASCALL 790 FAIRFIELD CIRCLE (Print or type present apartment number, street address, and if appropriate in care of' PASADENA Los ANGELES CA 91106 (County) (State) (ZIP Code) (City) Other names I have used are: NONE TAI NG (Print or type here any other name you have ever used. including maiden name) My present is DOMESTIC HELP occupation Sex: Male Female (la) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No Yes No (1b) Can you read and write English? Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? (2) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To- STREET ADDRESS CITY AND STATE (a) may 1969 790 FAIRFIELD CIRCLE PASADENA CA PRESENT TIME (b) 19 19 (c) 19 19 (d) 19 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. OCCUPATION OR TYPE To- EMPLOYER'S NAME ADDRESS FROM- OF BUSINESS (a) may , 19 69 PRESENT TIME NAT POSCALL 790 FAIRFIELD CIRCLE International (b) 19 , 19 PASADENA CA Trade (c) 19 19 (d) 19 19 Yes No (4) Have you been out of the United States since you first arrived? If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY Bus PLACE OR PORT OF ENTRY THROUGH WHICH You DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE RETURNED TO THE UNITED STATES UNITED STATES Feb 1971 MARCH 1971 CHINA AIRLINES SAN FRANCISCO (5) How many times have you been married? ONE How many times has your husband or wife been married? ONE If either of you has been married more than once, fill in the following information for each previous marriage. Check one) How MARRIAGE DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS Daling MARRIED ENDED CITIZEN ALIEN (a) (b) (c) (d) (1) (OVER) Form N-400 (Rev. 10-1-73) Y"
}
