{
  "anumber": "A17182973",
  "id": "A17182973_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FOIA (b)(6), In re: YOH HAN LEE, File A17 182 973"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Brazil"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1957,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 Q. & A. statement by YOH HAN LEE (Cont'd.) In re: YOH HAN LEE, File A17 182 973 Q. What do you mean you couldn't wait? A. We couldn't wait. I told the inspector we coul wait FOIA (b)(6) Q. Now as a matter for the record, it is indicated in your file that a petition was filed in your behalf on May 2, 1957 by your wife, Mrs. Ming Lo Chin, May 2, 1967 was the date of the filing of the application. Is this the affidavit that you are referring to Sir? A. Certainly sir. I can't say that. Before I got the advice from the Consulate in Brazil, we thought that the file was everything approved. We got reference number three of the numbers and went through the medical examination, everything and we didn't know that one of the item was affidavit form and certainly the lawyer my lawyer he sent the affidavit to the Consulate yes but not through me. Well, it happened that we produced the affidavit papers beside these medical everything, and the Consulate told me that your affidavit was not sufficient, according to a financial point of view. Q. Then this affidavit that you are referring to is an affidavit of support. Is that correct sir? A. Yes, what I mean affidavit of support. Q. Now which American Consulate where was this American Consulate that told you this? A. That time, we were in Sao Paulo. Q. Were you residents of Sao Paulo? A. We were usually residents of Sao Paulo yes, but we were being I have been many times I have been many times because Sao Paulo the first time I mean the case the file applied during that time with my wife we were in Sao Paulo as a resident. Q. How long had you been living in Sao Paulo at that time, Sir? like A. Quite many years about eight to nine years something/that. Q. Now I note that your visitor's visa is issued by the American Consulate in Rio de Janeiro. Could you explain to me why the application for a visitor's visa was made at that Consulate? A. Yes, I can say that we were residents of Sao Paulo. We were advised by Sao Paulo Consulate, but that we got the tourist, because we were on vacation I can say that we were visiting some friends up there and at that time, we took the tourist visa from Rio de Janeiro. -4-"
}