{
	"anumber": "A17195429",
	"id": "A17195429_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Marital Status and Immigration Information Form, N-4 (000"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1987, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 21. What is your present marital status? Married Widowed Divorced Single 22. Complete the following regarding your husband or wife if you are currently married. First (given) name Date married (Month/Day/Year) 181 Date of birth (Month/Day/Year) Country of birth 11-10-17 China Place he or she entered the U.S. Date entered the U.S. (Month/Day/Year) His or her Alien Registration Number Present immigration status Honolulu Hawari NAtZEd Date naturalized (Month/Day/Year) Place naturalized Present address (street and number) City and State or country 4-11-1975 23. Complete the following if you were previously married Total number of times you have been One Name of prior husband or wife Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Year) How marriage ended (1st INS status Alien None Citizen Alien Citizen Alien Citizen 24. Complete the following if your present husband or wife was previously married. Total number of times your husband or wife has been married. , Name of prior husband or wife Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Yea How marriage ended INS status Alien None Citizen Alien Citizen Alien Citizen 25. Complete all columns for each of your children. (If child lives with you, state \"with me\" in Location column; otherwise, give the City and State of that child's residence.) Indicate your total number of children (21/13 Given name Date of birth Country of birth Date of entry Port of entry Location Alien Registration No Sex Wing Kong 6-11-40 Hong Kong 5-15-83 San Francisco Pasadena FOIA (b)(6) Male Female Male Ming Kong 7-26-47 Hong Kong Hong Kong Female Male Female Male Female Male Female Male Female Male Female 26. Complete the following with regard to each absence you have had from the United States for a period of six months or less since you entered for permanent residence. (If none, write \"None\".) Ship, airline, railroad or bus company, or other means used to return to the United States. Returned at (Place or port of entry) Date departed Date returned Japan Air line 06-1987 09-1987 Northwest Air line Las Angele Air Part 04-1986 -6-1986 27. Complete the following with regard to each absence you have had from the United States for a period of six months or more since you entered for permanent residence. (If none, write \"None\") Ship. airline, railroad or bus company or other means used to return to the United States. Returned at (Place or port of entry) O Date departed Date returned 1090 Form N-400 (12/05/86)N Page 2"
}
