{
	"anumber": "A17192274",
	"id": "A17192274_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17192274_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (English) ( (4-63), Screened by NARA, 6/30/22023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Japan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1937, 1934, 1938, 1948, 1931, 2023, 1933, 1964, 1932, 1947, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (English) (4-63) Screened by NARA, 6/30/2023 Page 2 21. I am submitting the following personal documents in support of and as part of my application Birth certificate Military record Promise of employment Police certificate(s) Evidence of support or own resources Medical record(s) Other (describe) Petition; Extra Photograph 22. Name and present residence of my wife/husband is (Give maiden name of wife) s SINDHU Sudha/Bhagwantrai Desai, 370, Bahanderkar Road, Matunga, Bombay. 19. 23. The names and addresses of my children under 21 years of age are FOIA (b)(6) 24. The names of members of my family who are immigrating with me are PRABHAVANTI G. DESAI, SUDHA B. DESAI, FOIA (b)(6) 25. The name and address of my father is (If deceased, so state, giving date) GULABSHANKER C. DESAI, 37D, BHANDARKER ROAD, MATUNGA, BOMBAY-19-DD. DECEASED - 11TH DECEMBER, 1964. 26. The maiden name and address of my mother is (If deceased, so state, giving date) MANIBEN , C/O. B.G. DESAI, 370, BHANDARKER ROAD, MATUNGA, BOMBAY-19-DD 27. The name and address of my next of kin in my home country is Friend P. M. DOSHI, GULAB MANSION, BEHIND ARORA CINEMA, MATUNGA, BOMBAY-19-D0 28. Since my sixteenth birthday my places of residence for 6 months or more have been City or town Province Country 1). Dates (From-To) BHAWNAGAR Calling or occupation GUJERAT INDIA 2). POONA 1931-1932 (approx). STUDENT MAHARASHTRA -do- 1932-1933 18 3). -do- CALCUTTA 4) TOKYO WEST BENGAL -do- 1934-1937 -do- - JAPAN 5) 1937-1938 HYDERABAD -do-- ANDHRA P. INDIIA 6) 1939-1947 11 BOMBAY MAHARASHTRA INDIA DentalSurgeon 1948 onwards 29. Since my sixteenth birthday I am or have been a member or affiliate of the following political, professional, vocational or social organizations Name and address Dates (From-To) Type of membership and - office held, if any - - 30. I speak, read, write the following languages (Include your native language) Language Speak Read 1) Write GUJERATI YES YES YES ENGLISH it # 88 @ @ HINDI \" II \" AND previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state) NO."
}
