{
  "anumber": "A17181791",
  "id": "A17181791_0147",
  "page_index": 147,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0147/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF ILLEGAL ALIEN APPREHENDED OR LOCATED, Form 1-213 ("
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 RECORD OF ILLEGAL ALIEN APPREHENDED OR LOCATED (See A.M. - 2790.31-.34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion F blk brn Med. MAO, Pei-Ing, aka MAO, Betty Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation China 26260 China A17 181 791 62 140 domestic worker United States Address (Residence) (Number) (Street) (City) (State) Scars or Marks c/o Fogg, 720 S. San Rafael Avenue, Pasadena, Calif. 91105 none Airline & Flight No. or Vessel of Arrival Passenger Boarded At F.B.I. No. Marital Status BA910, HHW, 1/17/68, P6-1 Taipei, Taiwan Single Married none Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location Other investigative same as U.S. efforts - fraud Birthdate Date of Action Location Code Status at Entry Status When Found xx0xx4x 10/27/14 7/8/69 LOS Immigrant Empl. Ind. City, Province (State) and Country of Birth AR Form: (Type & No.) Length of Time Illegally in U.S. Date & Hour I-151 Lifted App./Located Kiangsu, Shanghai, China A17 I81 791 Not Lifted over 1 year Visa Issued At Social Security Account Name Located (At/Nexr)C Taipei, Taiwan same Los Angeles 7/8/69 Date Visa Issued Social Security No. Send C.O. Rec. Check Located By 12/29/67 To: LOS Philip H. Smith, Investigator Immigration Record Criminal Record none none Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of Minor Children none none Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality. and Address, If Known Mao Guei-sun - deceased - China Lan Yun - deceased - China Property in U.S. Not in Immediate Possession Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) None Claimed See Form 1-43 Yes No Not Listed Listed, Code WEBAK, REGOJ, RAZEZ Name and Address of (Last) (Current) U.S. Employer From: To: Philip Fogg, 720 S. San Rafael Ave., Pasadena, Calif. June 1968 Present Narrative (Outline particulars under which alien located/apprehended and furnish details re time, place and manner of last entry) SUBJECT was admitted to the U.S. as a P6-1 immigrant at HHW on 1/17/68. SUBJECT was admitted as a sixth preference immigrant on the basis of a visa petition submitted on her behalf which reflected that she would work for her spon- soring employer as a domestic worker. The position was filled by the sponsoring employer prior to the SUBJECT's arrival in the U.S. The SUBJECT reports that the employment agency who arranged for her employment in the U.S. contracted for her to work for another family upon her arrival in the U.S. The SUBJECT reports that when to she obtained her visa she-intended working for her sponsoring employer but at one time of her admission to the U.S., agreed to work for another family because her position with the sponsoring employer had been filled. 1 An application has been submitted for the issuance of an Order to Show Cause alleging that the SUBJECT was not in possession of an approved labor certification at the time of her admission to the U.S. Philip H. Smith, Investigator If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from - File 1 - Statistics Officer: 1 - Intelligence 523(a) 19 at ( ). M. Disposition (Receiving Officer) Form I-213 (Rev. 3-1-68) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}