{
  "anumber": "A17182973",
  "id": "A17182973_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0074/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 Qo & A. statement by YOH HAN LEE (Cont'd.) In re: YOH HAN LEE, File A17 182 973 A. Through my very honest understanding, it was that and we think that through my understanding, we had the English way file approved -- the time was very short and the aim for coming up to this country, the first came to my mind, it was the problem FOIA (b)(6) and it is really true like that. I may I might make the mistake or error in the statement and that, but I don't think we are not criminal and I think we I honest and decent people. We came up here just as a tourist. Up to now, we have been here so many months and we haven't been to the government to charge I mean to these United States government. Q. Now sir, you stated you might have made a mistake. These as I see them were not mistakes, they were falsifications of the application and you stated that you had made them in order to expedite your visitor's visa. Is this correct? A. Sir, are you say that you saw for me -- the right from the applica- tion, you have seen some erroneous statement, then I answer you, yes. I might have made some erroneous statement. Q. Now sir. you have stated that vou basically were comino to the FOIA (b)(6) A. Yes sir, through my understand that already in your file, you have had letter issued by the doctor and would you please refer to your file further. &. FOIA (b)(6) A. That letter which you are reading now was issued by my lawyer and FOIA (b)(6) has a former letter to the lawyer that's why the lawyer wrote the letter to you and since you are asking about FOIA (b)(6) as according to the latest advice, I an bring with my original letter which is issued written by FOIA (b)(6) and which is in your hands now. Q. Yes the letter now presented by your Attorner. Mr. Bonanarte from FOIA (b)(6) united States for. IS that correct? -7-"
}