{
	"anumber": "A17195429",
	"id": "A17195429_0079",
	"page_index": 79,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0079/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, Form I-604A ( Application for Naturalization as a Citizen of the United States of America"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1942, 1943, 2023, 1957, 1940, 1920, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 21. (I am submitting the following personal documents in support as part of my application) (Birth certificate) (Military record) (Promise of employment) (Police certificate(s)) (Evidence of support or (Medical record(s)) (Other (describe)) resources) (Marriage certificate) See rs.552 22. (Name and present residence of my wife/husband is (Give maiden name of wife)) Lau Chuen Arbuthnot 3/A,T/F., Central, 23. (The names and addresses of my children under 21 years of age are) Nil 24. (The names of members of my family who are immigrating with me are) Lau Chuen 25. (The name and address of my father is (If deceased, so state, giving date)) Chan Yiu deceased on 1940 at Tungkoon, Canton, China 26. (The maiden name and address of my mother is (If deceased, so state, giv- date)) Chow Si deceased on 1942 at Tungkoon, Canton, China 27. (The name and address of my next of kin in Hong Kong or Macau is) Nil 28. (Since birth my places of residence for 6 months or have been (Give street address Hong Kong, Macau, and other cities)) (-) (Country,) (Province), (District), p(Heung), H(Village), (Street Address), (Dates(From-To)) (Occupation) Char Shan Village, Tungkoon, Canton, China 1915-1920 1 Kamberlyey Rd.,G/F.,HK 1920-1943 25 Water St. 7/F., HK 1943-1957 Arthbuthnot Rd. 3/A,T/F., 1957-Now 29. (Since my sixteenth birthday I am or have been a or affiliate of the following professional, vocational or social organizations) (Name and address) ( (Dates (From-To)) of membership and office held, if any) Nil 30. (I speak, read, write the following languages (Include your native languages)) (Languages) (Speak) it (Read) (Write) Chinese English 31. (I have previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state)) Nil 32. (United States immigration laws require that all prospective immigrants answer the following questions. This requirement does not imply that you are suspected, of being within any of the classes described in these questions. Your answers will assist the consular officer to establish your eligibility to receive a visa. If you are unable to answer any of these questions please explain your inability fully on a separate sheet of paper which you should attach to this form. Please bear in mind that whatever the nature of your answers to these questions, you are not necessarily ineligible to receive a visa. For example, if you were arrested and/or convicted for a minor offense, and the consular officer is able to establish that such offense was in fact a misdemeanor, your arrest and/or conviction would not necessarily make you ineligible (2) (a) (Give the correct answer to the following questions by circling 'Yes\" or \"No\") (Have you ever been arrested for, charged Yes No"
}
