{
  "anumber": "A17182973",
  "id": "A17182973_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FOIA ( (b)(6), A17 182 973"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 Q. & A. statement by YOH HAN LEE (Cont'd.) In re: YOH HAN LEE, File A17 182 973 A. FOIA (b)(6) ATT'Y: A. ATT'Y: Now on your application for a tourist visa, you indicate you had relatives from parts of Oregon, who are those relatives? A. You know that part of Oregon, he is my boy; he is my son. He study now. Q. (By Officer) Now sir, as your Attorney and you have stated on your application you did state that you were going to visit relatives in Portland, Oregon and you have clarified that is your son. Now at the time you entered the United States on April 21, 1968, you gave the inspector, who admitted you in New York City, the address of a Mr. Spack in Los Angeles, Is that correct? A Yes that's my wife she is working for him. Q. Now do you have anything else that you would like to add to this interview? ATT'Y Or have you seen your son in the United States you have been here? A. Mr. Bonaparte. ATT'Y: Have you yes or no, sir? A. Yes sir. Q. (By Officer) Is there anything else that you would like to add to the interview gentlemen? If necessary sir, would you be willing to return to this office and sign this transcription of the records. A. Yes I would be willing, yes sir. I hereby certify that to the best of my knowledge and belief the foregoing pages numbered 1 through 11 are a complete and accurate transcript of the above machine recoreded Question and Answer Statement. -11- Katherine E. deVlaming, DMT March 28, 1969"
}