{
  "anumber": "A17195429",
  "id": "A17195429_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FOR ALIEN EMPLOYMENT CERTIFICATION, 4-1301"
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1967,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "WHITE SECURITY Screened by NARA, 9/21/2023 Stephen Address TALCAT Budget Bureau No. 44-R1301 FOR. ALIEN EMPLOYMENT CE. ATION Expiration Date: 8/31/16 n THAT PART ฿ - JOB OFFER FOR ALIEN EMPLOYMENT (ES-5/5B) ARE IN SUPPORT OF THE APPLICATION FOR ADMISSION OF CHAN Nui & LAU Chuen (Name of Alien - If more than one and for same occupation, attach list) THE FOLLOWING INFORMATION IS SUBMITTED AS EVIDENCE OF AN OFFER OF EMPLOYMENT 1. NAME OF EMPLOYER (Full name of organization; if employer is an individual, give name with last name in capital letters) Mr. and Mrs. Nathaniel Paschall 2. ADDRESS (Number and Street) (Town or City) (State) (Zip Code) 790 Fairfield Circle, Pasadena, California 91106 3. BRIEF NON-TECHNICAL DESCRIPTION OF THE NATURE OF EMPLOYER'S BUSINESS OR ACTIVITY Household 4. SIZE OF ORGANIZATION (In terms of Annual Sales, Production Output, Persons 5. DATE BUSINESS OR ACTIV- 6. GEOGRAPHICAL AREA Served, etc.) ITY ESTABLISHED SERVED Private Home N/A S. California 7. PLACE WHERE ALIEN WILL WORK 8. AVERAGE NUMBER OF EMPLOYEES AT 9. NUMBER OF EMPLOYEES WHO WILL PER- PLACE WHERE ALIEN WILL WORK FORM SAME WORK AS ALIEN Private Home Two None 10. IS THE EMPLOYMENT 11. IS THE EMPLOYMENT 12. ARE ALIEN'S SERVICES SOUGHT SEASONAL? TEMPORARY? YES NO YES NO FOR A NEW JOB TO BE CREATED TO FILL AN EXISTING VACANCY 13. STATE SPECIFICALLY LENGTH OF TIME 14. HAVE YOU BEEN ABLE TO FIND IN THE U.S. ANY AVAILABLE PERSON CAPABLE OF YOU EXPECT TO EMPLOY ALIEN PERFORMING DUTIES OF THE JOB TO BE FILLED Indefinite YES NO 15. EXPLAIN THE CIRCUMSTANCES WHICH CAUSED NEED FOR ALIEN'S SERVICES This is a large home and family - both husband and wife are busy people with many activities outside the home and there is a real need for full-time domestic couple to 16. DESCRIBE EFFORTS YOU HAVE MADE IN YOUR OWN ORGANIZATION AND RECRUITMENT EFFORTS UNDERTAKEN TO FILL THE JOB By advertising in local newspaper - registering with Employment Dept. and Enploymentragencies, CERTIFICATION and Nationality Act as amended I hereby certify that there are no rnd Nationality Act as amended hereby certify that there Immigration Pursuant to the provisions of section 212(a)(14) of the Immigration Pursuant to the provisions of section 212(a)(14) of the are not 17. IF ALIEN IS NOT ADMITTED, HOW WILL YOUR NEEDS FOR THE JOB BE MET will not of workers of the aliens in conditions of in the workers It is virtually impossible to find experienced I reliable \"live-in\" help on local labor market. JAN 10 1969 AUG 8 1967 REVALIDATION (Data) (Certifying Officer) 18. NUMBER OF TIMES YOU HAVE MADE 19. NUMBER OF ALIENS 20. DO YOU INTEND TO FILE A PETITION (FORM 1-140) WITH IMMIGRATION JOB OFFERS FOR ALIEN EMPLOY- EMPLOYED AS A RE- AND NATURALIZATION SERVICE FOR ADMISSION OF ALIEN AS A PREFER- MENT SULT ENCE IMMIGRANT? none none YES NO (DO NOT WRITE IN THIS SPACE - CONTINUE ON REVERSE SIDE) NOV 13 68 * U.S. GOVERNMENT PRINTING OFFICE 1965 0-796-602 84-7 JUN 1 1967 DEC 9 '68 DEPT. OF EMPLOYMENT #008 1207 EAST GREEN STREET PASADENA, CALIFORNIA 91101"
}