{
  "anumber": "A17181791",
  "id": "A17181791_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0061/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1968,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 UNITED STX OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION I- 1485681 OF: (Family name) (First name) (Middle name) MAO Pei-Ing (Betty) 16 PORT OF ACTION OF SPECIAL INQUIRY OFFICER 170 HHW The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in and taken the United States at this port on under BA 910 Symbol (Name of vessel or flight No. of aircraft) and was inspected me U.S. by 592 6-1 Section of the Immigration and Nationality Act. JAN alamy ADMITTED Special Inquiry Officer. detained for further inquiry by special officer under Symbol UNITED ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN EMBASSY, facts stated in the application. IMMIGRANT CLASSIFICATION AT TAIPEI, TAIWAN. NONQUOTA (Symbol) QUOTA (Symbol) Dumad P6-1 (China) Donald E. Mudd VISA PETITION NO., 1F ANY Petition approved: June 21, 1967 (attached Vice Consul of the United States of America. IMMIGRANT VISA NO. QUOTA -5,695- ISSUED ON (Day) (Month) (Year) 29 December 1967 Passed a USPHS THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) Inspectori 28 April 1968 Date: Honoluius Hawaii NATIONALITY (If stateless, so state, and give previous nationality) 9 Chinese PASSPORT NO. 26260 UNITED STATE OR OTHER TRAVEL DOCUMENTS (Describe) STATISTICS Service No. ISSUED TO MAO, Pei-Ing Betty Tariff Item No. Form I-151 issued, Fee Paid $20 BY Ministry of Foreign Affairs, Taipei, Local Cy equiv. Taiwan. Sec. 212(a)(14) - Certification attached ON 31 August 1967 EXPIRES 31 August 1969 FORM 5-61 FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE"
}