{
  "anumber": "A17195429",
  "id": "A17195429_0098",
  "page_index": 98,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0098/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PLACEMENT AGENCY ( (U.S.A.) HONGKONG AGENCY, 220842"
    },
    "years": {
      "ms_years_nlp_v1": [
        1963,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ST PLACEMENT AGENCY (U.S.A.) HONGKONG AGENCY 506, COMMERCIAL HOUSE 35, QUEEN'S ROAD, C. HONG KONG. CABLES: \"GREATLAKES\" HONGKONG. TEL. 220842 November 26, 1968 State Employment Service 1207 E. Green Street ALIENS:- LAU CHUEN & CHAN Nul, Pasadena, Calif. 91101 REVALIDATION TO WHOM IT MAY CONCER SUBJECT: Alien Immigration Forms for Mr. Paschall Gentlemen: PETITIONED By: MeaMes N-PASCALL 790, FAIRFIELD CIRCLE PASADENA, CALIF. We have a problem here in Hong Kong as their original references are together Mr. with all of the forms which we submitted to the Immigration Department originally. December 1963 Since the regulations have been changed during the processing of this couple, we are unable to obtain the original references which the government already holds. We have been having the original references certified together with the Enclosed Statutory Declaration. However, the local courts will NOT certify photostatic copies of references which is all that we hold due to the situation already described above. We trust that ths explanation will assist you in processing this revalidation procedure. Both of these applicants are lifetime domestics and neither has ever pursued any other type of career orther than described by them. Yours verx truly, FAR EAST PLACEMENT GENCY Samuel Tarant J. Foster, forth Managing Director The best solution to this type of investigation would be to have the U.S. Consulate here in HK veryify the authenticity of these forms and to deny a visa if they think anything fraudulent has taken place. Certainly the Consulate here can check with the local references for verification. I might add, that this procedure should be followed in all Domestic applications, the local Consulate in any country should be the final authority as to the authenticity of a petition. solemnly and sincerely declare the well understand the English and Chinese languages and that have truly distinctly and audibly interpreted the contents and that I will truly and faithfully administer to him Declared at Hong this day of Before A Commissioner etc."
}