{
  "anumber": "A17195429",
  "id": "A17195429_0141",
  "page_index": 141,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0141/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Sixth Preference Petition Approved Under Section 2 Immigration and Nationality Act, as Amended., I-464"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 CADJ-7 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization vice Los Angeles, California REPORT OF SIXTH PREFERENCE PETITION APPROVED UNDER SECTION 203(a) (6) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED. File No.: A17 195 429 Date: October 27, 1967 Beneficiary: Petitioner: CHAN Nui Mr. & Mrs. Nathaniel Faschall Petitioner's address: 790 Fairfield Circle, Pasadena, California Nature of petitioner's business: Private Household Petitioner desires and intends to employ the beneficiary as a: Maid, General Petitioner's requirements for position: None Beneficiary's experience and qualifications: Employed as general maid by Mr. Brook Benich, Hong Kong from 1945 to present. Beneficiary's age: 52 Country of birth: China City and country of residence Hong Kong Beneficiary's marital status: Married Number of children: None Country of present residence of spouse and children, if any: Hong Kong It has been established that the beneficiary is capable of performing the work specified and that the work to be performed is not of a temporary or seasonal nature. Also, a certification pursuant to Section 212(a) (14) of the Act, as amended, has been issued by the Department of Labor. Therefore, the petition has been approved. I.I., , D.H. Soumie ADD/TC J. L. Todd q7 9/2 DISTRICT DIRECTOR Form I-464 Rev. 11-1-66"
}