{
  "anumber": "A17195429",
  "id": "A17195429_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION, A-15 196 429"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1975,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 3 ALIEN REGISTRATION Name NUI CHAN STATEMENT OF FACTS FOR PREPARATION OF PETITION No. 195 429 SECTION OF LAW (1) My full, true, and correct name is Nul CHAN (Full, true name, without abbreviations) (2) My present place of residence is 790 FAIRFIELD CIRCLE PASADENA LOS ANGELES CA 91106 (Number and street) (City or town) (County) (State) (ZIP Code) 3 (3) I was born on 6 15 in CANTON CHINA (Month) (Day) (Year) (City or town) (County, district, province, or State) (Country) (4) I am marned and have 2 living children. The first name of my husband or wife is (was) CHUEN (Single; married; divorced; widowed) we were married on 9 1939 at CANTON CHINA ; he or she was born (Month) (Day) (Year) (City or town) (State or country) at CANTON CHINA on 101 ; (City or town) (County, district, province, or State) (Country) (Month) (Day) (Year) entered the United States at 14.14.W 5 on 1 69 for permanent residence in (City or town) (State) (Month) (Day) (Year) with me the United States and now resides apart from me at ; and was naturalized (Show full address if not living with you) on spril 11 1975 at (Month) (Day) (Year) Las (City or Angeles town) (State) C.A. Certificate No. 9883032 or became a citizen by ; his or her Alien Registration No. is (5) I was lawfully admitted to the United States for permanent residence on 5 69 ; under the name (Month) (Day) (Year) of NUI CHAN at HHW on the B.O.A.C. (City) (State) (Name of vessel or other means of conveyance) (6) I have resided continuously in the United States of America since may ( 1969 and continuously in the State of CALIFORNIA where I now live since 5 years I have been physically present in the United States for an aggregate period of 133 may (st 1969 and during the past months. (7) I (have, have not) previously filed petition for naturalization No. on (Month) (Day) (Year) at in the (City) (State) (8) I wish the naturalization court to change my name to NUI CHAN LAU (Give full name desired or state \"None\") (9) Since such lawful admission, I have not been absent from the United States (for a period or periods of 6 months or longer) except as follows (if none, state \"None\") : DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES DATE VESSEL OR OTHER MEANS DATE VESSEL OR OTHER MEANS PORT PORT (Month, day, year) OF CONVEYANCE (Month, day, year) OF CONVEYANCE NONE (10) I have 2 children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), otherwise (No.) give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date (f) Port of Entry (g) Alien (Country) Born of Entry Registration No. (h) Now Living At WING KONG LAW M HONG KONG 6-11-40 HONG Konly KOHC- MING 7 LAU M HONG KONG 7-26-47 HONG KONG"
}