{
  "anumber": "A17195429",
  "id": "A17195429_0102",
  "page_index": 102,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0102/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATUTORY DECLARATION, A014785"
    },
    "years": {
      "ms_years_nlp_v1": [
        1963,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "0621 9267 STATUTORY DECLARATION KONG I,LAU CHUEN( 'IT )alias Ah Lau Chuen. Occupation: cookboy. 503m Residing at Arbuthnot Rd. , 3/A, Top Floor, Central, Hongkong. Holder of the Hongkong Identity Card A014785. 15 26 XI 68 15 do solemnly and sincerely declare that : at the presnet moment. am a cookboy in Hongkong STAMP DUTY PA PAID he and Shanghai Bank Corportation marked and A that I have been holding this job since 1963. The attached photostatic 'PASS' can prove my present career. I photo-copied it because I use this 'PASS' everyday whenever I am on duty. Anything one may care to ask about me, it is advisable for him to contact the Personnel Officer of Hongkong and Shanghai Bank Cor- poration in 1 Queen's Rd. C. Hongkong. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this 6 V 1968 day of through the interpretation of WONG CHUN KWONG Lan him the said WONG CHUN KWONG having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this docu- ment to the declarant, and that he would truly and faithfully interpret the declaration about to be adminis- tered to him/her. Before me, A Commissioner etc. I, WONG CHUN KWONG do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant Lau Chuen him/her. and that I will truly and faithfully interpret the declaration about to be administered to Declared at the Courts of Justice, Hong Kong this day of 26 Nev 1968 19 Before me. A Commissioner etc. Lau Chak What"
}