{
  "anumber": "A17182973",
  "id": "A17182973_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PETITION FOR NATURALIZATION, 358012"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1914,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE DUPLICATE UNITED STATES OF AMERICA (To accompany 358012 monthly report on Form N-4) PETITION FOR NATURALIZATION No. To the Honorable The U. S, District Los Angeles, Calif. at This petition for naturalisation, hereby made and filed under section 316a Immigration and Nationality Act, respectfully shows: (1) My full, true, and correct name is YOH HAN LEE (Full. true name. without abbreviation) (2) My present place of residence is 3426-Vinton Ave., #3 (Number and street) (City or town) (County) West Los Angeles State Galif. 90034 (ZIP Code) (3) I was born on (Month) (Day) January 9, 1914 (City or town) (County. district, province.brown Shanghai, China (Country (4) I am married, and have -6 living children. (5) I was lawfully admitted to the United States for permanent residence on April-5, 1968 19 and have not abandoned such residence. (6) My present nationality is China ALIEN REGISTRATION NO. A17--182--973-ca- (7) I have not heretofore made a petition for naturalization. (8) I pray that my name be changed to none (continued over) AFFIDAVIT OF WITNESSES The following witnesses, each being severally, duly, and respectively sworn, depose and say: (1) My name is Brian M. Jenkins I reside at 403 N. Oakhurst, Beverly Hills, Calif. and (Number and street) (City or town) (State) (2) My name is MiltonB. Jenkins I reside at (Number and street) 1840 So. Pandora, LA, Calif. (City or town) (State) I am a citizen of the United States of America: I have personally known and have been acquainted in the United States with the petitioner named in the petition for naturalization of which this affidavit is a part, since at least November 1, 1969 ; to my personal knowledge, based upon (Month) (Day) (Year) frequent observations and personal contacts with the petitioner within the State(s) of residence of the petitioner since said date, the petitioner has resided, imme- diately preceding the date of filing this petition, in the United States continuously since the date last mentioned; that the petitioner has been physically present in the United States for at least months of that period; and that petitioner has been a resident in the State in which the petition is filed during at least the last 6 months. I have personal knowledge that the petitioner is, and during all such periods has been a person of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happiness of the United States, and in my opinion the petitioner is in every way quali- fied to be admitted a citizen of the United States. I do swear (affirm) that the statements of fact I have made in the affidavit to this petition for naturalization subscribed by me are true to the best of my knowledge and belief: so HELP ME GOD. DRIVE M.Taxis (Signature of Witness) (Signature of Witness) WHEN OATH ADMINISTERED BY CLERK OR DEPUTY WHEN OATH ADMINISTERED BY DESIGNATED EXAMINER CLERK OF COURT Subscribed and sworn to (affirmed) before me by above-named peti- Subscribed and sworn to (affirmed) before me by above-named peti- tioner and witnesses in the respective forms of oath shown in said petition tioner and witnesses in the respective forms of oath shown in said petition and affidavit, and filed by said petitioner. in the office of the clerk of said and affidavit at this OF THE court at Los-Angeles, Calif day of A.D. 19 U.S. DISTRICT COURT day of 21974 Designated Examiner. this 12-Nov. 74A D. 19 CENTRAL I HEREBY CERTIFY That the foregoing petition for naturalization was by petitioner named herein filed in the office of the clerk of said court Clerk. By DISTINER COURT at this day of OF CALIFORNIA Deputy Clerk. DISTRICT A.D. 19 [SEAL] Clerk. By STATISTICS Deputy Clerk. Form N-405 (Rev. 7-1-70)"
}