{
  "anumber": "A17181791",
  "id": "A17181791_0065",
  "page_index": 65,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0065/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Chinese) ( (4-63), Screened by NARA, 9/2/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form FS-510 (Chi English) (4-63) 2) (a) Have you ever been placed in an almshouse Yes Noo (poorhouse or charitable institution)? (b) Are you a pauper, professional beggar or vagrant? (c) ? Are you now afflicted with a physical defect, disease or disability which may affect your ability to earn a living? (d) (Will you be able to support yourself financially in the United States?) (3) (a) Have you ever had one or more attacks of insanity? (b) Are you now or have you ever been afflicted with psychopathic personality, mental defect, fits, fainting spells, convulsions, a nervous breakdown or sexual deviation? (c) Are you now or have you ever been a nar- cotic or drug addict or chronic (d) you ever been treated in a hospital, institution or elsewhere for insanity or other mental disorder or narcotic addiction or alcoholism? (e) (Have you ever had any of the following:) (A) Tuberculosis in any form? (B) Leprosy? (C) Any other dangerous contagious disease? (4) (a) Are you a polygamist, do you practice olygamy, or do you advocate the practice of polygamy? (b) Are you or have you ever been a prostitute, procurer, or supported wholly or in part from the proceeds of prostitution? (c) Are you going to the United States to engage in an immoral sexual act, in prostitution, or other unlawful commercialized vice? (5) (a) is Have you previously applied for a visa to enter the United States either as an immigrant, or as a nonimmigrant? (If answer is \"Yes\" state where and when; whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued) (b) Have you been refused admission to the United States during the last twelve months? o (If the answer is \"Yes\" submit evidence that the Attorney Ceneral has consented to your reapplying for admission into the United States.) (c) Have you ever been (A) arrested and deported from the United States? o (B) voluntarily removed from the United States at United States government expense as a person who fell into distress? (C) removed from the United States as an alien enemy? (D) removed from the United states at Government expense in lieu of deportation? If the answer to any of the above questions is \"Yes\", submit evidence that that the Attorney General has con- sented to your reapplying for admission into the United States. (6) (a) Have you ever attempted to obtain by fraud or willful misrepresentation a visa or other documentation to enter the United States? (b) Have you ever obtained by fraud or willful misrepresentation a visa or other documentation to enter the United States? % (7) (a) ) Have ever registered with draft boardunder you a the selective service laws of the united States?(If ans- wer is \"Yes\", give date, place and classification) (b) Have you ever applied for relief from training and service in the Armed Forces of the States? (If answer is \"Yes\" ,furnish details) (c) Have you ever departed from or remained outside of the United States to avoid or evade miltary service in time of war or national emergency? (8) Can you, if you are over sixteen, read and understand some language or dialect? (9) Have you. for gain ever assisted another alien to enter the United States or try to enter Untied States in violation of the laws of the United States?"
}