{
  "anumber": "A17181791",
  "id": "A17181791_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0026/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information, TC/245"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1884,
        1937,
        1881,
        1970,
        1968,
        1955,
        1914,
        2023,
        1913,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325 REV. 4-1-67 Screened by NARA, 9/21/2023 TC/24,5 FORM APPROVED BUDGET BUREAU No. 43-R436 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE LOS INFORMATION* Immigration and Naturalization Service 6/1/70 SIO (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) MALE BIRTHDATE (MO-DAY-YR.) NATIONALITY ALIEN REGISTRATION NO. M.A.O BETTY PEI-iNG Oct 27,1914 (IF ANY) FEMALE CHINESE AMB1791 ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE (IF ANY) SHANGHAI - CHINA 568-88-3582 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE MAO, KWEi-SANG SHANGHAI - -CHINA 1881 FATHER MOTHER (MAIDEN NAME) SPOUSE (IF NONE, so STATE) FAMILY YANG, NAME LAN-YAN FIRST SHANGHAI - CHINA 1884 NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE, GIVE MAIDEN NAME) DIVORCED FORMER SPOUSES (IF NONE, so STATE) FAMILY NAME (FOR WIFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE Hsu . CHUNG-LANT 1913 1932SHANGASH 1937 SHNA CHIU, Sik KAN 1920 11952TAWAN 1955 TAWIN APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 720 (0) SOUTH SAN RAFAEL PASADENA CALIF USA JUNE 1968 PRESENT TIME 1243 SANTIAGO DRIUS NEWDORTHENCLE CALIF USA JAN 1968 JONE 968 LIENMO , HAPEI, AWAI N/AIPEI TAIWAN REPOTCHIAK JUNE 1964 JAN 68 LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR PHILIP 1066 PRESENT TIME 720 SOUTH SAN RAFAEL Domestic JUNE 1968 PASADENA CALIFORNIA DR MONACO 1243 SONTIAGODR. NEWPORT G DOMESTK UAN 1968 JUNe 1968 ColoNen CAUINESS, USARMY LETIPEL, TAILAY POMESTIC JUNE 1964 JAN 1968 LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN NATURALIZATION ADJUSTMENT OF STATUS YOUR NATIVE ALPHABET IN THIS SPACE: OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING JONE 1,1970 Betty Mas ROR H th OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT OR PETITIONER)"
}