{
	"anumber": "A17181791",
	"id": "A17181791_0087",
	"page_index": 87,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0087/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, Mackay, McGregor & Bennion"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 MACKAY, McGREGOR & BENNION ATTORNEYS AND COUNSELORS A. CALDER MACKAY ARTHUR McGREGOR 523 WEST SIXTH STREET SUITE 828 ADAM Y. BENNION RICHARD N. MACKAY LOS ANGELES, CALIFORNIA 90014 CHARLES J. HIGSON TELEPHONE BRUCE G. McGREGOR 626-7722 VICTOR L. WALCH April 25, 1967 To The American Consul Re: Mr. and Mrs. Erle P. Halliburton, Jr. 4507 Perham Road Corona del Mar, California Dear Sir: I am a partner in the law firm of Mackay, McGregor & Bennion, which specializes in the field of federal and state income, gift and estate taxes. During the last 18 years I have become closely associated with the business and financial affairs of Mr. Erle P. Halliburton, Jr. Based upon my own personal knowledge I can advise you that Mr. Halliburton, individually, owns property having a fair market value substantially in excess of $75,000.00 and that his annual income is substantially in excess of $25,000.00, all of which is derived from investments in real estate, securities and from certain trusts created for his benefit. Thus, he is financially responsible and fully capable of carrying out his undertaking toward the employ- ment of a domestic applicant from England or any other country and to discharge any and all other financial obli- gations now known or which may be incurred in the future. For your information, the social standing and character of Mr. and Mrs. Erle P. Halliburton, Jr. are ex- cellent. Included among their family are four wonderful children, namely, Duncan, Kathleen, Jennifer and Elaine (who is now in college). Accordingly, I can assure you that the nature of the employment is satisfactory. Very truly yours, Richard n. machay RNM:GR Richard N. Mackay"
}
