{
  "anumber": "A17181791",
  "id": "A17181791_0112",
  "page_index": 112,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0112/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Memorandum, Form G-29 (3-1-68"
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 OPTIONAL FORM NO. 10 MAY 1982 EDITION GSA FPMR (41 CFR) 101-11.0 UNITED STATES GOVERNMENT SEPTEMBER VISA NUMBER Memorandum Semuel Hozman, Special Inquiry Officer TO : Special Inquiry Unit, Los Angeles, California DATE: September 15, 1970 FROM : Trial Attorney, Sam I. Feldman Los Angeles, California SUBJECT: Betty MAO - A17 181 791; riding File FOIA (b)(6) (son) The Service does not desire to appeal the decision of the SIO. The Service does desire to file a brief in opposition to the appeal. The Service requests an extension of days to prepare its brief. Granted Denied date SIO The Service does oppose the motion for reconsideration or reopening. The Service does not oppose the alien's application for discretionary relief, provided, (see below) continued on the date of the/ hearing subject is employed as a Maid by Mr. Philip S. Fogg, Pasadena, California (note: revalidated Form ES-575B, etc). No Trial Attorney will appear in this case. Agency checks are not adverse. The following documents should be received in evidence as exhibits next in order to-wit: Form G-325A; 2 Forms I-134; Form I-486A with attachments; Forms ES-575A & B with attachments; subject's sworn statement of 4-18-69; Invigrant Visa, etc.; and copy of Form I-18% Return Visa number if case not completed on 9-30-70. Riding file should be sent the TC/I-130/23 subject's Section 245 application granted. Form G-29 (3-1-68) Benefits seldman Trial Attorney Buy U.S. Savings Bonds Regularly on the Payroll Savings Plan 8010-103"
}