{
  "anumber": "A17180748",
  "id": "A17180748_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1964,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION was OF: (Middle name) I- 1852406 (Family name) (First name) LO Yung Sing PORT OF ACTION OF SPECIAL INQUIRY OFFICER SFR 130 The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in and { no appeal taken the United States at this port on under appeal taken was inspected (Name of vessel by flight and SAN No. of aircraft) t PAA 846 Symbol or and me Section of the Immigration and DASSED P.H.S. FEB1 1/88 Nationality Act. SAN FRANCISCO GT CLASS: Special Inquiry Officer. detained for further inquiry by special officer under Symbol P6-1 ACTION ON APPEAL Section 203 casled the Immigration and ADMITTED Nationality Act EXCLUDED Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Consulate General facts stated in the application. IMMIGRANT CLASSIFICATION AT Hong Kong NONQUOTA (Symbol) QUOTA (Symbol) Luby H. Miles Roberty D Mile P6-1 VISA PETITION NO., IF ANY VP, 6/27/67, Los Angeles 5/10/68, P6, enclosed. Vice Consult of the United States of America. IMMIGRANT VISA NO. QUOTA 6849 China ISSUED ON (Day) (Month) (Year) 4 January 1968 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 3 May 1968 NATIONALITY (If stateless, so state, and give previous nationality) British PH TACHED PASSPORT NO. FOREIGN SERVICE 55931 OR OTHER TRAVEL DOCUMENTS (Describe) UNITED STATES OF AMERICA Service No. ISSUED STATISTICS TO LO Yung Sing Tariff Item No. Fee Paid $20 BY The British Passport Officer, Hong Kong. Local Cy equiv. Section 212(a) (14) ON 2 March 1964 Certification enclosed. EXPIRES 1 March 1969 FORM 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE FS-511 5-61 obtained gratis at Consular Offices of the United States of America FINGERPRINTED ON 1/4/68"
}