{
	"anumber": "A17181791",
	"id": "A17181791_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Employment Contract"
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 2761 EMPLOYMENT CONTRACT This contract for employment is made by and between Philip S. and Jean A., Fogg, herein called \"Employers\" and Betty Pei-ing Mao, herein called \"Domestic Help\". The parties hereto agree as follows: 1. Duties: The duties of Domestic Help will be to cook breakfast, lunch and dinner in Employers' home, as needed, and to make beds, dust household furnishings, vacuum rugs, do limited amount of washing with Employers' automatic washing equipment, and such other minor household duties as may be necessary. Tee 2. Wages: Employers agree to pay Domestic Help a wage of $330. per month plus private room and board, at no cost to Domestic Help, for a normal work week of 44 hours. Work in excess of 44 hours per week will be compensated for at a straight time rate of $1.75 per hour. 3. Hours: The weekly work schedule of 44 hours will be as follows: 7:30 to 11 A.M., 12 to 1:30 P.M., and 5 to 8 P.M. on Mondays, Tuesdays, Wednesdays, Fridays and Saturdays, and 4 to 8 P.M. on Sundays. Domestic Help will be free of work duties on every Thursday and on every other Sunday and will be free to leave Employers' premises at all such free times. Private room and board will be available for use of Domestic Help during non-working hours at no cost. 4. Money advanced: No money has been advanced to Domestic Help by Employers. 5. Termination: Domestic Help shall not be required to give more than two weeks' notice of intent to leave employment contracted for herein, and Employers must give Domestic Help at least two weeks notice before terminating employment. 6. Copy: A signed copy of this agreement has been furnished to Domestic Help. 7. Placement fees: Domestic Help has not paid, and is not obligated to pay, any monies for placement services for the employment covered by this agreement. Signed this first day of April, 1969: By Employers Domestic Help MAa Philip S. Fogg Betty Pei-ing Mao 1969 Jean A. Fogg"
}
