{
	"anumber": "A17180748",
	"id": "A17180748_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, 4220021 S.C. 15"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1910, 1960, 1952, 2023, 1967, 1944, 1961, 1930, 1920]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 4220021 S.C. 15 02890 HONG SEDKONG STATUTORY DECLARATION EP @ I, Fobook 8 27 1X 67 $ STAMP DUTY PAID Do solemnly and sincerely declare that; my name is LO YUNG (this is the only name I have ever used) the holder of Hong Kong Identi- ty Card NO. A075767, was born on 25th December 1910 in Kiukiang, Kiangsi, China, was married to CHUNG WAN HEANG GEA ) on 10th October 1930 in July 1944 in Kiukiang, Kiangsi, with whom we have contact since I Kiukiang, Kiangsi, China. We had a sort Lo WEN CHI( K born on 15th left China. I was divorced from CHUNG WAN HEANG on 24th March 1960, and used no other names, on 12th June 1961 in Hong Kong, at the same time subsequently married a divorced woman SUM YUK YING FREE ) who has adopted her two sons as my own and changed their first name from FOIA (b)(6) to FOIA (b)(6) They are both residing with us at the above address. My father LO BING HAN( ) died on 15th December 1920 in Kiukiang, Kiangsi, China, my mother WANG AH PORCHA ) died on 17th December 1966 in Kiukiang, Kiangsi. They were both buried in Kiukiang, Kiangsi, China. I have one natural son LO WEN CHI kth ) born on 75th July 1944 in Kiukiang. Kiangsi, and two adopted sons, FOIA (b)(6) FOIA (b)(6) I have no blood, step, adopted, nor half brothers and sisters, neither do I have any relatives in the United States of America. I have never applied for any visa, passport, or other documents to enter the United States of America. The exact date I left mainland China was 12th August 1952. Bush NINS Meng Hhad ALL the said FAN having been also first declared that Meng Huan he had truly, distinctly, and audibly interpreted the contents of this docu- ment to the declarant, and that he would truly and faithfully interpret the declaration about to be adminis- tered to him her. Before me, June A Commissioner etc. FAN I, Meng Huan do solemnly and sincerely declare that I audibly interpreted document the declarant he yough well understand the English and Chinese languages and that I have truly, distinctly, and the contents of this to and that I will truly and faithfully interpret the declaration about to be to him/her. Declared at the Courts of Justice, Hong Kong 27 SEP 1967 this day of , 19 first you Before me. Mark A Commissioner etc. GEORGE MON"
}
