{
	"anumber": "A17181791",
	"id": "A17181791_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, 443-R400.5"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1968, 1948, 1914, 2023, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 Form Approved Budget Bureau No. 43-R400.5 APPLICATION FOR STATUS AS PERMANENT RESIDENT NATURALIZATION FILE NO. FEE STAMP RVICE APPLICATION FOR THE BENEFITS OF SECTION: 245 203(a)(7) and Sec. 245, I&N Act JUN I 1014 AM '70 249, I&N Act Sec. 13, Act of 9/11/57 LOS ANGELES, Immigrant Nonimmigrant Visa Issued CALIF. at: on: (DO NOT WRITE ABOVE THIS LINE.) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check appropriate box) An immigrant visa is immediately available to me: A. other than as a refugee B. as a refugee under the proviso to Section 203(a)(7) of the Act. I have resided in the United States continuously since C. prior to June 30, 1948 D. prior to July 1, 1924. 2. My name is (First) (Middle) (Last) My alien registration number is BETTY PEI-ING MAO A 17 181 791 3. I reside in the United States at: (Apt. No.) (No. and Street) (City) (State) (ZIP Code) 720 SOUTH SAN RAFAEL PASADENA CAWE 91105 4. Date of Birth Place of Birth (City or Town) (County, Province, or State) (Country) I am now a citizen of (Country) OCT 27 1914 Shaughai ChiNA CHINA 5. I.last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) HONOLOLU NAWAII by (Name of vessel or other means of travel) as a immigrant, etc.) Jan (Visitor, student, 17 U.S. citizen, 1968 stowaway, BOAC - AIR immigrant 6. I am single married divorced widowed a. I have been married 2 times, including my present marriage, if now married. (If you are now married give the following:) b Number of times my spouse has been married c, Name of spouse Spouse d. My spouse resides with me apart from me at Address (Apt. No.) (Number and Street) (Town or City) (Province or State) (Country) a. I have 1 children, as follows: (complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise give city and state or country of child's residence. Name Sex Place of Birth Date of Birth at FOIA (b)(6) b. The following members of my family are also applying for permanent resident status: 8 NONE 8. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership in the United States or a foreign country, and the periods and places of such membership. (If you have never been a member of any organization state \"None.\") NONE 2 Da 5r I have have not been charged with a violation of law (other than miner traffic violations). (If you have ever been charged with a violation of law, give date and place and nature of each charge and the final result., I have have not requested exemption or discharge from training or service in the Armed Forces United States. Residential of the (If you have ever requested exemption or discharge from training or service in the Armed Forces of the United States, give date and place of your request, the reason for such request, and specify to whom it was made.) Form I-485 (Rev. 2-10-67) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Page 1)"
}
