{
  "anumber": "A17181791",
  "id": "A17181791_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/21/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Monaco",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1968,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Qo Are you presently employed as a domestic worker by the Fogg family? A. Yes. Q. How many days a week do you work? A, Five and one-half days. Q. And how much do you earn? A. In the beginning, the starting salary was $250.00; now, after they consider my work satisfactory, increased to $300.00 per month. Q. Why didn't you go to work for Mr. and Mrs. Halliburton? A. At first, Mr. and Mrs. Halliburton wanted me to work for them but, due to Mrs. Halliburton's expecting a baby, they wanted to cancel the arrange- ment with me to work for them. And, on January 15, in Taiwan, the agency told me that, since that is the case, I might as well go to work for Mr. Monaco, and they said it was quite all right to do so. Q. When you applied for your visa (December 29, 1967) by whom did you think you would be employed in the United States - Mr. and Mrs. Halliburton or the Monaco family? A. Naturally, at that time, I didn't even know Mr. and Mrs. Monaco. I intended at the time to work for Mr. Halliburton. Q. Who informed you that the Halliburtons would not have a position for you? A. The agency in Taiwan was informed by the agency in the United States by long-distance telephone, and that caused the alarm to both of the agents in Taiwan and myself. Q. Did someone in the Far East Employment Agency in Taiwan tell you that the Halliburton family did not have a position for you? A. Yes. Q. And on what date were you informed? A. January 15, 1968 - the year I came. Q. Did this person at the agency tell you that they would place you in another home, then? A. Yes. On January 15, I signed the contract. Q. Did you sign a new contract on January 15, 1968? A. Yes; the new contract was sent by the United States employment agency to Taiwan for me to sign. That was two or three days before I came. Q. And this new contract was signed in Taiwan, is that correct? A. Yes. Q. And under this new contract, were you to work for the Monaco family? A. Yes. - 4 -"
}