{
	"anumber": "A17195429",
	"id": "A17195429_0076",
	"page_index": 76,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0076/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 9/21/2023 UNIT TATES OF AMERICA 16 IMMIGRANT VISA AND ALIEN REGISTRATION OF: I- 1887019 (Family name) (First name) (Middle name) CHAN Nui PORT OF HAW 120 ACTION OF SPECIAL INQUIRY OFFICER I certify that the immigrant named herein arrived in The immigrant herein was (admitted) (excluded) and taken the United States at this port on under BOAC 900 Symbol (Name of vessel or and was inspected by me U.S. MONOZING U.S. flight and No. of dircraft) 1 1969 Section of the Immigration and Nationality Act. P.H.S APPROVED 133 MAY pl Special Inquiry Officer. detained for further inquiry by special officer under Symbol ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act EXCLUDED Immigrant Inspector DATE This visa is issued under Section 221 of the Immigra- Consulate General tion and Nationality Act, and upon the basis of the AMERICAN facts stated in the application. Hong Kong IMMIGRANT CLASSIFICATION AT NONQUOTA (Symbol) QUOTA (Symbol) P6-1 VISA PETITION NO., IF ANY VP, 10/25/67, Los Angeles Ellen Vice K. Consul of the United States of America. 1/10/70, P6, enclosed. IMMIGRANT VISA NO. QUOTA 16095 China ISSUED ON (Day) (Month) (Year) 12 March 1969 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 11 July 1969 NATIONALITY (If stateless, so state, and give previous nationality) Chinese PASSPORT PHOTOGRAPHY NO. OR OTHER TRAVEL DOCUMENTS (Describe) Certificate of Identity No. C 110055 STATES OF Service No. ISSUED CHAN Nui Tariff Item No. TO Fee Paid $20 The H.K. Immigration Officer, Hong Kong. BY Local Cy equiv. Sec. 212(a)(14) certification enclosed. ON 10 March 1969 EXPIRES 9 March 1972 FORM STATISTICS FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE 5-61 FORM I-151 Issued"
}
