{
  "anumber": "A17182973",
  "id": "A17182973_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded By N/A"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "23 ESTA UM DOS SEUS PAIS NOS E.U.A.I Sim Não 24 DECLARE ONDE E APROXIMADAMENTE QUANDO PELA ULTIMA VEZ SOLICITOU VISTO PARA os E. U.A nunca solicitei 25 'REQUIRE CASO VISTO FOI CONCEDIDO VISTO FOI NEGADO o PEDIDO FOI ABANDONADO 26 ALGUMA VEZ SOLICITOU UM VISTO DE IMIGRAÇÃO PARA os E. U. A.P Sim Nio 27 HA QUANTO TEMPO RESIDE NO PAÍS EM QUE A SOLICITAÇÃO DO VISTO ESTA FEITAP 11 anos 28 PAÍSES EM QUE MOROU POR MAIS DE UM ANO NOS ÚLTIMOS 5 ANOS E DATAS APROXIMADAS DE TAL RESIDÊNCIA PAISES DATAS APROXIMADAS Rio de Janeiro - Brasil. 29 ENDERÊÇO PARA o QUAL DESEJA QUE o SEU PASSAPORTE VISADO SEJA ENVIADO? Pessoalmente. ad NOTA IMPORTANTE: A Lei dos Estados Unidos proibe 1 concessão de um visto de visit temente ou por tempo indeterminado nos E. U. A. A pessoa admit só poderá participar de atividades para as quais o visto foi conced a emissão de qualquer visto à pessos portadora de doenças contagio doença mental de natureza grave; ou que'cents o hábito de usar mesmos; ou pessoa com antecedentes criminais, inclusive que tenha ou is foi membro do Partido Comunista ou de qualquer organizad inadmissibilidade centram sido anteriormente anulados. Caso qual recomends 10 que And se apresente persoalmente no nono escritório seu requerimento umi declaração aôbre 09 fator que lhe dizem resp cason é possivel Que tais restrições sejam dispensadas Etta e outras telefonando, escrevendo ou vindo pessoalmente a Esid escritório. 91 LEU E COMPREENDEU A INFORMAÇÃO CONSTANTE DO aim 32 POR ACASO ESTARA o REQUERENTE INCURSO EM ALG 30 DESTE FORMULÁRIO Sim Não (EM CASO POSITIVO CUMPRE DECLARA-LAS 6 ANEXA-LAS A ESTE FORMULÁRIO) 33 - Um visto concedido a quem quer que conscientemente tenha fornecido informação falsa no seu requerimento, está sujeito a cancelamento, quer antes quer depoit da chegada aos Estados Unidos. A pessoa que tiver fornecido tal informação, não será considerada admissível para receber um visto no futuro. 34 - Certifico.que as respostas darlas neste formulário são corretas, no melhor de meu entendimento e de minha convicção. Compreendo também, que a posse de um visto por st mesmo não dd direito à entrada de seu portador hos E.U.A., se ao chegar a um pôrto deste pais for considerada inddmissivel. Loe Data got Assinatura NÃO USE ESTE ESPAÇO PARA USO DO. ESCRITÓRIO)"
}