{
	"anumber": "A17182973",
	"id": "A17182973_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT—WITNESS, Form I-263W ( (3-27-67)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 300 No. Los Angeles, Los Angeles, California 90012 RECORD OF SWORN STATEMENT--WITNESS Office: Los Angeles, California File No: A17 182 973 Statement by: Mr. Yo Han LEE In the case of: Mr. Yo Han LEE At: Los Angeles, California Date: March 12, 1969 Before: Larry L. Pinkerton, Immigrant Inspector (Name and Title) In the English language. Interpreter None used. (INTERVIEW CONDUCTED IN THE PRESENCE OF SUBJECT'S ATTORNEY: Bonapart Ronald H.) I am an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. I desire to take your sworn statement regarding your application for permanent residence and your visa which you used to enter the United States. Q. Any statement you make must be given freely and voluntarily. questions Xax xhisxtime? and may be used against you or any other person in Immigration and Naturalization Service proceedings. Are you willing to answer my questions at this time, sir? Yes. (Statement by Officer) Will you stand and raise your. right hand. please) Q. Do you swear that all the statements you are about to make will be the truth, the whole truth and nothing but the truth, so help you God? A. I do. Q. Sit down please. Do you understand the meaning of the word perjury? A. I don't understand Q. For a matter of explanation, perjury is the willfully and knowingly giving of a false statement in an official proceeding before an author- ized officer. You are informed that if you give false testimony at this proceeding, you may be prosecuted for perjury. The penalty for which is a fine of not more than $2,000.00 or imprisonment for not more than five years or both said fine or imprisonment. Do you understand, sir? A. Your statement on such explanation now, I understand that. Q. Now Mr. Lee do you understand and speak sufficient English to feel at ease in a statement taken in the English language? A. I think I can do that. Form I-263W (3-27-67)"
}
