{
	"anumber": "A17181791",
	"id": "A17181791_0051",
	"page_index": 51,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0051/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATEMENT OF WORK EXPERIENCE AS HOUSEHOLD EMPLOYEE, 2761"
		},
		"years": {
			"ms_years_nlp_v1": [1961, 2023, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 STATEMEN WORK EXPERIENCE AS HOUSEHOLD MESTIC 2761 Page 2 The UNITED STATES DEPARTMENT OF LABOR requires that, in order to qualify for alien employ- ment. certification as a Household Domestic Service Worker, the applicant must have had one year of paid work experience in household domestic service. As evidence that the person to whom the job offer is made has had the required experience, it is necessary that present or previous employers (or if not possible, others who have personal knowledge) complete the following questionnaire, or provide the same information in a separate statement. EMPLOYMENT INFORMATION CONCERNING BETTY PEI-ING MAO (insert name of employee) 1. Name of Employer: Col. and Mrs Roy B. Caviness while living in Taipei, Taiwan 2. Address of Employer: present address: 3442 Sleepy Hollow Rd. Falls Church, Va. 3. When did this person work for you? Give dates employment started and ended by month, day and year: I'm sorry, my memory for dates is not good. Betty started working for me mid year in 1959 !till we left in July 1961. 4. Show hours of work each day: Mon. Tues. Wed. Thur. Fri. Sat. Sun. time began, time ended and HOURS total hours worked each day WORKED 8-10 8-10 8-10 off 8-10 8 8 of the work week. TIME BEGAN appr 7:30 AM except on Sat & Sun Appr.9 Was this schedule worked TIME every week while in your After dinner ENDED employ? If not, state how many weeks each month: Betty worked as Amah to children, and house keeper. Her schedule was flexiable as we were. 5. State wages paid, by day, week or month: I do not remember as my husband did this however, probably app. $100.00 which was average in Taipei, Tawan. 6. Describe the duties performed. Indicate the type of equipment and appliances used, if any. Betty did everything as was needed - she used all appliances as vvaecum, elect. mixer, elec. oven, she also cooked on the cooks day off. She is completely compitent in the kitchen, and often did the laundry when the laundry Amah was off. She is intelligent and can use any modern appliance. Betty Pei- Ing Mao is completely trustworthy, compitent, amaible, a delightful person to have in the house and should by all means be allowed to remain in the states. I recomend her without reservation. If not the employer, the person completing this questionnaire must identify himself and explain how he had knowledge of the applicant's work experience Signature Employer signature Air 24,1969 Date DETAIL Signature Address 9/1/19 Date A statement not in the English language must be accompanied by a translation, certified by the translator as to the accuracy of the translation and as to his competency to translate. After completion, this form should be attached to the ES 575A (Statement of Qualifications of Alien) and submitted, along with the other documents, for processing."
}
