{
	"anumber": "A17182973",
	"id": "A17182973_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CITY OF LOS ANGELES NOTICE TO APPEAR, 81 38397"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CITY OF LOS ANGELES Screened by NARA, 8/18/2023 NOTICE TO APPEAR W July DATE 2 19B TIME No. 1805 81 38397 e NAME FIRST. MIDDLE. LAST) RESIDENCE ADDRESS LEE you HAN CITY 3731 MENTONE WLA BUSINESS ADDRESS CITY 3777 So MAIN LA DRIVER'S LICENSE NO E-05/555 GLit STATE 1-7-14 BIRTHDATE SEX 5 WEIGHT M F HAIR 8/K BIK EYES 120 VEHICLE LIC. NO. STATE YEAR 514629 MAKE Colif PASSENGERS MO FO Ched BODY STYLE 66 SNU Yellow COLOR REGISTERED OWNER OR LESSEE SAME ADDRESS OF OWNER QR LESSEE CITY VIOLATION (S) 1 22/0/Bc2 VC-3 VC DESCRIPTION OF VIOLATION(S) ARAUE CONTRARY to INK APPROX. SPD. PF./MAX. SPD. VEH. SPD. LIMIT DIV. OF OCCUR. CITY OF To 35 WL/ LOS ANGELES H Slympic LOCATION OF VIOLATION(S) BLud And ON Sawtalle BLud I CERTIFY UNDER PENALTY OF PERJURY THAT THE N FOREGOING IS TRUE AND CORRECT. EXECUTED AT THE PLACE AND ON THE DATE SHOWN ABOVE. OFCR 6 LYTTE 7174 SER. # W E DIVISION, WLAND DETAIL UNAVAILABLE DATES Q-1/ho 910 S WITHOUT ADMITTING GUILT. I PROMISE TO APPEAR AT THE TIME AND PLACE CHECKED BELOW X SIGNATURE BEFORE & DEPUTY CLERK OF THE MUNICIPAL COURT. 1633 PURDUE AVE WEST ON OR BEFORE July 19 73. ORAT A THURSDAY NIGHT SESSION OF THE MUNICIPAL COURT. 1945 SO. HILLST LOS ANGELES. ON OR BEFORE ABOVE DATE JUVENILE COURT. TRAFFIC DIVISION. 1725 MAIN ST.. SANTA MONICA. ON 19 BETWEEN 8:30 A.M. AND 11:00 A M OR 1:30 P.M. AND 3:30 P.M. ACCOMPANIED BY PARENT OR GUARDIAN READ REVERSE SIDE EXHIBIT A FORM A D BY JUDICIAL COUNCIL OF CALIFORNIA, 6-68, 0513(b)"
}
