{
  "anumber": "A17181791",
  "id": "A17181791_0151",
  "page_index": 151,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0151/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "COMMENT, A-2"
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 COMMENT A review of file reveals that it nearly parallels some of the decisions that have come down on labor certification cases, but the knowledge of the change in employer before entering the U.S. would seem to make her excludable as not having a valid labor certification. A parallel case, FOIA (b)(6) was processed under the labor certification bit in that she secured the visa and subsequently was advised by Far-East that the first employer died or was ill so she signed another contract just before she entered the U.S. Leone handled the case and at the first hearing set it over advising that if a second certification was secured that he would terminate and certify to the BIA. This case is heing held over until such time as a decision is reached in the FOÍA (b)(6) case. 7/9/69 B.R. Senson B,R. Pearson, Sup. Investigator The above case was checked out this date and noted that the last hearing was held on Nov. 10, 1969. At that time the second ES 575 for the present employers had been disapproved by the USES. As a result SUBJECT was ordered deported. Since that time WAS advised that on the appeal a new certification was being made. An appeal to the deportation charge had been made but withdrawn when the notice of the issuance of the second certification was made. In that case with the 6th preferance being current, their lawyer decided it was easier to go for adjustment than to attempt to appeal and hope for a reversal of the deportation. Under these circumstances an OSC should be submitted in SUBJECT case. 11/24/69 B.R, Pearson, Sup. Inv. LOS 7/9/69 A17 181 791 A - 2"
}