{
  "anumber": "A17182973",
  "id": "A17182973_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1974
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "medium"
      },
      "marital_status": {
        "marital_status_llm_v1": "Married"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1974
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "3426 Vinton Ave, #3, Los Angeles, California"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "Screened by NARA, 8/18/2023 a TO BE FORWARDED TO No. 9881268 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Delilion No. 358012 AlienRegistration No A17 182 973 DUPLICATE Personal,description of holder's of date of naturalization: Date of birth January 9, 1914 isea Me le ; complexion Medi colorobeyes Brown color of hair Black height 5 feel 6 inches; weight 125 pounds; visibledistinclivemarks None. Maritalstatus Marr led Country of formernationality. China. I certify that the description, above given is hue, and hereto, is a likeness of m HanLee Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that ala termofthe District Court,of The United States held pursuant to lawal Los Angeles on December 20, 1974 the Gourthaving foundshal ***YOH HAN LEE*** ther/residing at 3426 Vinton Ave. #3, Los Angeles, California inlandstoreside, permanonlyying the United. States when sorequired by the Naturalization Laws ofthe United. States), had in other respects, complied with the applicable provisions of such naturalization laws, and was entilled lobe Seal admitted socitisenships thereupon ordered that such person be and (s)hewas admilled as a cilixen a the United States of America. Intestimony whereof thesealof, the courtis hereunto affixed this 20th in day of December in the year of our. Lord nineleen hundred and Seventy-four EDWARD M. KRITZMAN IT IS PUNISHABLE BY U. S. LAW TO COPY, Glerkofthe U.S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S. C 1mg Deputy Clerk."
}