{
	"anumber": "A17181791",
	"id": "A17181791_0186",
	"page_index": 186,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0186/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES GOVERNMENT Memorandum, A17 181 791"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1962]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OPTIONAL FORM NO. 10 5010-106 MAY 1962 EDITION GSA GEN. REG. NO. 27 UNITED STATES GOVERNMENT Memorandum A17 181 791 TO : Assistant District Director, Investigations DATE: March 21, 1969 Los Angeles, California FROM E92 E. J. Strapp, Assistant District Director Travel Control, LosAngeles, California SUBJECT: MAO Pei-Ing (Betty) - Possible Visa Fraud Attached hereto is file relating to subject alien, which includes approved sixth preference visa petition filed by Mr. and Mrs. Erle Halliburton. It appears from the correspondence in the file that the alien may not have intended to work for Mr. and Mrs. Halliburton at the time of her entry into the United States. Her present employer is Philip S. Fogg. On March 19, 1969, I referred the case of WAI Chut (A18 438 344) to you for investigation of possible visa fraud since his employment contract with Mr. Philip S. Fogg had been cancelled and the Far East Placement Agency had arranged a new contract for his employment with Mr. and Mrs. Elliott Handler prior to his departure from Hong Kong. A sixth preference petition filed by Erle Halliburton in behalf of FOIA (b)(6) is now pending. In view of the number of cases in which beneficiaries of sixth preference petitions, filed through Far East Placement Agency, have been placed with employers other than the petitioner, this matter is referred to you for whatever action you deem necessary. FILE NO! mao, Pei-mg (Betty 417181791 AREA G-23 Line No.. E 503-2- (Last, (IN CAPS), First, Middle) NAME Investigation Warranted ASSIGNED TO Date Assigned Classification approved by you Call-up Received Trans. In 3.25.69 (Date) Investigations Control Card Form G-600A (Rev. 6-1-66) Work Copy"
}
