{
  "anumber": "A17182973",
  "id": "A17182973_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Q. & A. statement by YOH HAN LEE ( (Cont'd.), In re: YOH HAN LEE, File Al7 182 973"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Brazil"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 Q. & A. statement by YOH HAN LEE (Cont'd.) In re: YOH HAN LEE, File A17 182 973 A. This is the very poor reason we came up here and furthermore yes sir. Q. Now I note that the time you obtained your visitor's visa, you stated that it was important that you come to the United States FOIA (b)(6) the interview, Sir? A. Well I am pretty sure of that, otherwise we wouldn't provide the first letter and now the second letter and even that you may confirm with FOIA (b) (6) in fault if you wish. Q. No I am at the present time, more interested in the letter you had prior to your departure from Brazil stating that he only had certain time that that was immediately available, making it necessary for you to expedite your entrance into the United States. Do you have the letter or any indication of this? A. We don't have that indication of this of which you are asking in talking to me at the moment now. We don't have that. We understood that that arrangement was made verbally. &. A. FOIA (b)(6) Q. Sir the question was did you ever have any letter of appointment or confirmation that it was necessary for you to be in the United States on a certain date or within a certain time limit in order to be able to FOIA (b) )(6) A. We don't have that, I told you the first answer, we don't have any indication about that because at that time, we were advised by the Consulate, our file was approved. We don't have any special invita- tion written by FOIA (b)(6) here to make our trip here and that's the reason. Q. Now sir, earlier in your statement, you informed me that the reason you expedited your application for a visitor's visa, was that you had to be in the United States within a certain time limit in order to obtain FOIA (b)(6) What I am asking is what time limit or what indication of this time limit did you have? -8-"
}