{
	"anumber": "A17195429",
	"id": "A17195429_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM 1-31 ( (Rev. 3-1-74)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "China", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITESCISEAE JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the she FEE STAMP Immigration and Nationality Act Use typewriter or print in block letters with ball -point pen. 213.796.6701 issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME CHAN NUI IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- (No. and Street) (Apt. No.) mit you wish to have extended MAILING ADDRESS 790 FAIRFIELD CIRCLE ALIEN REGISTRATION NUMBER IN U.S. (City) (State) (ZIP Code) PASADENA CA 91106 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT A- 17195409 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 3-6-1915 CHINA CHINA BLACK BLACK HEIGHT 5 FEET 2 INCHES VISIBLE MARKS AND SCARS NONE 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFF ICE WHICH WHICH ADJUSTMENT OF STATUS CHAN NUI GRANTED ADJUSTMENT WAS GRANTED HHW 05-01-69 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel. Airline, etc.) PAN BOAC Andmis FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME CHAN YA YIU CHEUNG HA mul 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHAN NUI HONOLULU 3-23-75 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: KOREAN AIRLINE 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Los AN GELES 11/15/75 2 moNThs NAME OF TRANSPORTATION COMPANY IF DEPARTURE TO BE BY VESSEL, GIVE NAME OF VESSEL PAN AMERICAN Antmo FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. HONG KONG HONOLULU 2-4-75 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT 11-8-74 (City and State) IS ATTACHED Los ANGELES CALIF IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE 11-8-75 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: NAME and ADDRESS OF EMPLOYER HOUSE KEEPER SOCIAL SECURITY ACCOUNT NUMBER 790 FAIRVIELD CIRCLE 551-94-5538 PASADENA CA 91106 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District (Country) 790 FAIRFIELD CIRCLE PASADENA LA. 11. COUNTRIES TO BE VISITED (List 847. BLOCK 9. 8in each country) FLOOR. NGAU TALL Kok R/E KOWLOON, H.K. HONG KONG 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): LAWFULL IISF INITIALS PLEASURE P6-1 RECEIVED TRANS IN RET'D TRANS. OUT FORM 131 (Rev. 3-1-74)Y OVER OCT 1975 OCT 29 Party COMPLETED"
}
