{
  "anumber": "A17190805",
  "id": "A17190805_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17190805_0035/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, Form 1-34 ( (Rev 5-1-64)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1956,
        1911,
        2023,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/30/2023 TED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service Budget Bureau No. 43-R423 AFFIDAVIT OF SUPPORT (Fill in with typewriter or print in block letters in ink) Grace Chinn 8241/2 North Sanborn Avenue I. Residing at (Name) (Street and number) Los Angèles California U.S.A., 90029 (City) (State) (Country) being duly sworn depose and say: 1. Dec-22-1911 I was born on at Canton, China . Also, answer either a, b or c, as appropriate. (Date) (City) (Country) (a) If a United States citizen through naturalization, give number of certificate of naturalization 8,814,235 dated June 7, 1965, at Seattle, Washington; and hold U.S. Passport (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship No. FOIA (b)(6) issued to me April 26, 1966, at Los Angeles, California If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number 2. That I am 56 years of age and have resided in the United States since June 18, 1956 3. That this affidavit is executed in behalf of the following person(s) at present residing at 7 To-Kwa-Wan Road, Mezzanine Floor, Kowloon, Hong Kong MARRIED OR RELATIONSHIP TO NAME SEX AGE COUNTRY OF BIRTH SINGLE DEPONENT (Mrs.) CHAN Ho Chung-Wah fem 83 China widow my mother 924917 Miss CHAN So-Hing fem 60 China single sister Miss CHAN So-Laan) fem 46 China single sister waitress Lily Restaurant 4. (a) That I.am employed as, or engaged in the business of with 803 North Broadway (Name of concern) Los Angeles, Calif and derive a net annual income of $ 4000.00 at (b) That I have on deposit in savings (Address) banks in this country $ 9297.37 (c) That I have other personal property, the reasonable value of which is $ (d) That I have stocks and bonds in the amount of $ . market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at valued at $ with mortgages or other encumbrances thereon amounting to $ , (f) That I have life insurance in the sum of $ 3,000.00 , cash surrender value of $ 500.00 (g) That if self- employed, I attach a copy of my last income tax return or report of commercial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) Form I-134 (Rev 5-1-64)"
}