{
	"anumber": "A17229681",
	"id": "A17229681_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17229681_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Personal Documents Submission Form, FS-510 ( (English) (4-63)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1943, 1968, 1929, 1964, 1950, 1927]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (English) (4-63) Page 2 21. I am submitting the following personal documents in support of and as part of my application Birth certificate Military record Promise of employment Police certificate(s) Evidence of support or own resources Medical record(s) Other (describe) 22. Name and present residence of my wife/husband (Give maiden wife) philos name of of parafoot 866 QUEENS AVENUE MAiDEN NAME OF WiFE LONDON a ONTARIO CANADA JEAN -MARY- PACE 23. The names and addresses of my children under 21 years of age are NONE 24. The names of members of my family who are immigrating with me are WIFE = MRS JEAN MARY CLEARY, 25. The name and address of my father is (If deceased, so state, giving date) JOHN -CLEARY DECEASED = 11Th JUNE 1943 16 NEWPORT MON ENGLAND. 26. The maiden name and address of my mother is (If deceased, so state, giving date) ALICE - FOX DECEASED 19th SEPTEMBER 1966 NEWPORT MON ENGLAND. 27. The name and address of my next of kin in my home country is Miss K. CLEARY 18 MOUNTJOY PLACE NEWPORT MON ENGLAND 28. Since my sixteenth birthday my places of residence for 6 months or more have been City or town Province Country Dates (From-To) Calling or occupation NEWPORT- MONNOUTHSHIRE ENGLAND 1927 - 1929 STEEL WORKER SERVED 11x BRITISH ABMY-ENCLAND FAR FAST - 1929-1950 SOLDIER RICHMOND - SURREY I ENGLAND 1950 - 1964 VEHICLEASSEABLER LONDON - ONTARIO - CANADA 1964 - 1968 = VEHICLE ASSEMBLER MILITARY RECORDS ATTACHED. 29. Since my sixteenth birthday I am or have been a member or affiliate of the following political, professional, vocational or social organizations Type of membership and Name and address Dates (From-To) office held, if any NONE 30. I speak, read, write the following languages (Include your native language) Language Speak Read Write ENGLISH YES YES YES 31. I have previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state) DAYS iN Los ANGELES CALIFORNIA TH JUNE 1966 TO THJUNE 1966 VACATION-HONEY - MOON. ()"
}
