{
  "anumber": "A17212360",
  "id": "A17212360_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, OMB No. 4-R0079"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1968,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE OMB No. 43-R0079 APPLICATION TO FILE PETITION FOR NATURALIZATION FEE STAMP Mail or take IMMIGRATION AND NATURALIZATION SERVICE (See INSTRUCTIONS, page 5. BE SURE YOU UNDERSTAND EACH QUESTION BEFORE YOU ANSWER IT.) I ALIEN REGISTRATION I desire to file a petition for naturalization in the Destrict (Show the exact spelling of your name as it appears on your alien registration UNITED STATES FEDERAL COURT receipt card, and the number of your card. If you did not register, so state.) Name WONG, YUK (Name of Court) No. 1717 212 360 Court at hosAngeles, California Date: Dec 12, 1972 (City) (State) My name is: yok WONG (Print or type here your present full name only) cal live at: 1027 MORAGA DRIVE (Print or type present apartment number, street address, and if appropriate \"in care of' Los ANGELES L. 17 Calisornia 90049 (City) (County) (State) (ZIP Code) Other names I have used are: None 2 (Print or type here any other name you have ever used, including maiden name ) My present occupation is Cook Sex: Male Female (1a) Was your father or mother ever a United States citizen? (If \"Yes\" explain fully separately) Yes No (1b) Can you read and write English? Yes No (1c) Can you speak English? Yes No (1d) Can you sign your name in English? Yes No (2) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To- STREET ADDRESS CITY AND STATE (a) may , 1968 PRESENT TIME 1027 moragal Drive Las angles Calif (b) , 19 19 (c) 19 19 (d) 19 19 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) may 1968 PRESENT TIME W. STUNSTON 1029 morage IN. residence (b) 19 , 19 Los angeles retired (c) 19 19 (d) 19 , 19 (4) Have you been out of the United States since you first arrived? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES 5-17-71 5-23-71 American AIRLINES New YORK, NEW YORK Q2 How many times has your mlcnada husband wife been married? (5) How many times have you been married? or If either of you has been married more than once, fill in the following information for each previous marriage. ( Check one) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX How MARRIAGE PERSON MARRIED WAS CITIZEN ENDED ALIEN (a) (b) (c) (d) Form N-400 (Rev. 6-1-71)N (1) (OVER)"
}