{
  "anumber": "A17212360",
  "id": "A17212360_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: Alien Employment Certification Form, Form Number: 306.878"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(10) FOR DEPARTMENT USE ONLY: 88 IND. CODE OCC. TITLE Maid, General (Dom. Serv. OCC. CODE 306.878 21. NAME OF JOB OFFERED 22. NUMBER OPENINGS TO BE 23. DAILY WORK SCHEDULE (HOURS) FILLED 'Live-in' Cook/Housekeeper One 9 24. TOTAL HOURS PER WEEK 25. RATE OF PAY 26. IF THE JOB IS UNIONIZED, GIVE NAME AND NUMBER OF LOCAL $200 per month plus 50 room and board N/A 27. OCCUPATIONAL TITLE OF PERSON WHO WILL BE ALIEN'S 28. TYPE AND DEGREE OF SUPERVISION 29. NUMBER OF OTHER EM- ALIEN WILL RECEIVE PLOYEES ALIEN WILL IMMEDIATE SUPERVISOR SUPERVISE Housewife Minimum None 30. DESCRIBE FULLY THE JOB TO BE PERFORMED, INCLUDING DUTIES, WORKING CONDITIONS, AND EQUIPMENT OPERATED. All general housework - laundry, ironing - all cooking. 31. STATE IN DETAIL THE EDUCATION AND TRAINING REQUIRED FOR PROFICIENCY IN JOB. (Specify degrees and major fields of study re- quired. Specify apprenticeship. trade school or other training required). Minimum education only required for this unskilled work - one year's experience is all that is required. 32. STATE MINIMUM EXPERIENCE REQUIREMENTS OF JOB. INDICATE ACCEPTABLE EXPERIENCE IN RELATED JOBS. - As question 31 above - 33. DESCRIBE SKILLS, KNOWLEDGES AND ABILITIES REQUIRED FOR PROFICIENCY IN JOB. - As question 31 above- 34. SPECIFY ANY OTHER SPECIAL REQUIREMENTS SUCH AS LANGUAGES, LICENSES, PHYSICAL REQUIREMENTS. Good health - able to pass physical exam - language requirement - able to understand and interpret instructions from English speaking employer. 35. DECLARATION OF EMPLOYER: I certify that I have examined the contents of this form and the statements are true and correct to the best of my knowledge and belief, Mis H SIGNATURE play TITLE Housewife Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using cument in the submission of this Job Offer For Alien Employment. (U.S. Codes, Title 18, Sec. 1001) of A.D. 19 ed and sworn to (affirmed) before me this (S ure of Administering Officer) (Title"
}