{
  "anumber": "A17211293",
  "id": "A17211293_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17211293_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, 17 211 293"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/10/2023 MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California Status as a lawful permanent resident of the United States is accorded: File No. A17 211 293 NAME Sex KAMLABEN DAYARAM PANCHAL F ADDRESS 2001 N. Linwood Avenue, Santa Ana, California 92701 NATIONALITY 1616 DATE OF BIRTH PLACE OF BIRTH India 1/25/13 India COUNTRY TO WHICH CHARGEABLE as any) PREFERENCE: (If any) PRIORITY DATE Immediate Relative REMARKS Section 201 (b) NONPREFERENCE: Individual section 212(a)(14) certification issued; Blanket section 212(a)(14) certification issued; Section 212(a)(14) certification not required because As of MAY 16 1968 at Los Angeles, California (Month) (Day) (Year) (Place) Class of admission (insert coding symbol) Z-2 (IR-5) IR-0 (2) the requirements of the following provision of law having been fulfilled. Sec 203 (h) of the I & N Act Sec. 2 of the Act of 11/2/66 Sec 13 of the Act of 9/11/57 Sec 244 ( ) ( ) of the I & N Act Private Law no. of the Sec 245 of the I & N Act Congress session Sec 249 of the I & N Act Sec. 1 of the Act of 11/2/66 (Other law - Specify) (Applicable in all cases) Date MAY 16 1968 Recommended by glenn w, Fodbunter Immigration Officer Date MAY 16 1968 Approved District Director FOR USE BY VISA CONTROL OFFICE Andra H. W. F2 B26Z Date CLOSING ACTION REQUIRED Foreign State I-151 Preference Category Number FORM 2-202 sensor G-188 G-361 G-153 Month of Issuance 1-530 Signed (Visa Office, Dept. of State) Date Form I-357 delivered dob CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service Form I-181 (Rev. 11-2-66) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION DNATURALIZATION SERVICE"
}