{
  "anumber": "A17210305",
  "id": "A17210305_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (German) - 4, Screened by NARA, 7/1/23"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1958,
        1935,
        1952,
        2023,
        1933,
        1951,
        1964,
        1932,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (German) 4-63 Screened by NARA, 7/11/2023 Page 2 19. Meine endgültige Anschrift in den Vereinigten Staaten (My final address in the United States is) 475 No. Oxford are Los Pngeles 90004 Clif. 20. Ich besitze an persönlichem Vermögen (My personal financial resources are) (a) Bargeld (Cash) D.M. 2500.00 $1000 (c) Haus- und Grundbesitz (Wert) (Real estate) (value) (b) Bank- und Sparkassenguthaben (Bank deposits) # 4,000.00 (d) Anderes (Other) 21. Ich lege als Unterlage und Bestandteil meines Antrags die folgenden Dokumente bei (I am submitting the following personal doc- uments in support of and as part of my application) Geburtsurkunde (Birth certificate) Militärdienstzeugnis (Military record) Anstellungszusage (Promise of employment) Führungszeugnis (Police certificate(s)) Nachweis über Unterhalt oder eigene Mittel Gesundheitszeugnis (Medical record(s)) (Evidence of support or own resources) Andere (Other) (describe) divorce Olificate 22. Name und gegenwärtige Anschrift des Ehepartners (bei der Ehegattin auch der Madchenname) (Name and present residence of my wife/husband is) (Give maiden name of wife) 23. Namen my of age anna und Josefin, Anschriften meiner Kinder 45 unter Bachstelzenweg 21 Jahren (The names and addresses Koln. of children under 21 years are) Constanze Zimmermann, 45 Bach ste73anweg 1581n-Vogelsang 24. Namen meiner Familienangehörigen, die zusammen mit mir auswandern (The names of members of my family who are immigrating with me are) anna Josefin 25. Name meines Vaters. Seine Anschrift (falls verstorben, wann) (The name and address of my father is) (If deceased, so state, giving date) Ernest Josefi deceased behwern 1933/1935. 26. Madchenname meiner Mutter. Ihre Anschrift (falls verstorben, wann) (The maiden name and address of my mother is) (If deceased, so state, giving date) Amelia Yerschon deprased 27. Name und Anschrift meines nächsten Verwandten im Heimatland (The name and address of my next of kin in my home country is) none Shanghain China aug1931- Mar 1932 Melbourne Victoria australia Mar 1932 Nov 1950 Painter Johannesburg S.Africa Nov1950 - Mar. 1951 Painter Salisbury S.Rhodesia Mar 1951 - Qug 1951 Painter Vancouver B.G. Canada Nov 195% - Mar 1964 Painter Cologne Rhein W. Cermany May 1964 39. Selt Vollendung meines 16. Lebensjahres war ich bzw. bin ich noch gegenwärtig Mitglied oder mittelbarer Angehöriger der folgen- den politischen, fachlichen, beruflichen oder geselligen Vereinigungen (Since my sixteenth birthday I am or have been a member or affiliate of the following political, professional, vocational or social organizations) Name und Anschrift Zeitdauer (von-bis) Angehörigkeitsverhältnis und etwaige Funktionsposten (Name and address) (Dates (From-To)) (Type of membership and office held, if any) Painters Union Loeae 138 1952-1958 Vancouver, B.e Painters Union Love 116 Present 30. Ich kann die 'folgenden Sprachen sprechen bzw. lesen oder schreiben (einschließlich der Muttersprache) (I speak, read, write the Los Angeles following languages) (Include your native language) Sprache Sprechen Lesen Schreiben (Language) (Speak) (Read) (Write) English Yes Yes Yes Terman yes YPS No. 31. Ich war bereits früher in den Vereinigten Staaten zu folgenden Zeiten (anzugeben ist Jahr, sowie Art des Visums oder Status) (I have previously been in the United States during the following periods) (Give year and type of visa or status (If never, so state)) Jahr Art des Visums oder Status 1952 vislor visa Montreal och nie in den Vereinig Sta"
}