{
	"anumber": "A17210305",
	"id": "A17210305_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative,, NARA Form No. 1024."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 12. Fill in this block only if you are petitioning for your wife or husband or child [see instruction No. 9 (e)]. I married my on at (Wife) (Husband) (Month) (Day) (Year) (City) by (State) (Country) (Civil) (Church) (Proxy) (Common law) ceremony or marriage. How many times have you been married? How many times has your husband or wife been married ? If either of you have been married more than once, fill in the following information for each previous marriage. Date married Date marriage ended Name of person to whom married Sex How marriage ended (Death or divorce) (a) (b) (c) 13. Fill in this block only if you are petitioning for a brother or sister. The parents of the prospective immigrant the same as my parents. (Are) (Are not) (If you answered \"are not\") give the following: The prospective immigrants father is (Full name) and mother is they were married on , 19 , (Full name) at They previously married, as follows: (City) (State) (Were) (Were not) Date married Date marriage ended Name of husband or wife Sex How marriage ended (Death or divorce) I am able to and will support the immigrant(s) for whom I petition, if necessary, to prevent such immigrant(s) from becom- ing a public charge. I do swear that I know the contents of this petition signed by me and that the statements therein are true and correct. NOTE.-If you are outside the United States, your statements must be sworn to before an American consular officer. better Sdena (Signature tas of metitioner) Jack (Sea inst ction hack No. 7) Subscribed and sworn to before me this 12th day of at Los Angeles, May A. D., 19. 54 balif [SEAL] My commission expiresMy Commission Expires July 5,- 1957 (Signature of officer administering oath) \"Notary\" (Title) nt 16-52883-7 4"
}
