{
	"anumber": "A17220615",
	"id": "A17220615_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17220615_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 FEDERAL BUREAU OF INVESTIGATION, UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 OCCUPATION EMPLOYER (If U.S. Government, indicate military (give serial number) or civilian employing agency.) LABORER UNK NOWN STRAWBERRY FARM ON LA PALMA ST. ANAHKIM CALIF. RESIDENCE OF PERSON FINGERPRINTED 325 Juliana St., Anaheim Cal. CURRENT ARREST OR RECEIPT DATE ARRESTED CHARGE OR OFFENSE DISPOSITION OR SENTENCE OR RECEIVED (If code citation is used it should be accompanied by charge) (List FINAL disposition only. If not now avail- able, submit later on FBI Form R-84 for comple- tion of record.) 4/6/72 DEPORTATION PROCEEDINGS FOR INSTITUTIONS USE ONLY Sentence expires If arrest fingerprints sent FBI previously and FBI # unknown, furnish arrest # Date If COLLECT wire reply or COLLECT telephone reply is desired indicate here: Wire reply Telephone reply Telephone Number including area code INSTRUCTIONS 1. FORWARD ARREST CARDS TO FBI IM- MEDIATELY AFTER FINGERPRINTING FOR MOST EFFECTIVE SERVICE. 2. TYPE or PRINT all information. 3. Note amputations in proper finger squares. Please Paste Photograph in This Space 4. REPLY WILL QUOTE ONLY NUMBER AP. Since photograph may become detached indicate PEARING IN THE BLOCK MARKED name, date taken, FBI number, and arrest number on \"YOUR NUMBER.\" reverse side whether attached to fingerprint card or submitted later. 5. Indicate any additional copies for other agencies in space below-give their com- plete mailing address including zip code. SEND COPY TO: 1-413a (Rev. 8-12-69) GPO : 1970 O - 378-070"
}
