{
  "anumber": "A17229681",
  "id": "A17229681_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17229681_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 447-R150.2."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1911
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(English) Form Approved. Budget Bureau No. 47-R150.2. 63) DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa if $5.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be ground for your prosecution and/or deportation. I hereby apply for an immigrant visa and alien registration at the United States CONSULATE at WINDSOR-ONTARIO-CANADA - and state the following facts: 1. My family name is My first name is My middle name is CLEARY JOHN, EDWARD 2. My full name in native alphabet (If other than Roman letters are used) is AS ABOVE. 3. Other names I have used or by which I have been known are (If married woman, give maiden name) NONE 4. The date of my birth is 5. My place of birth is (Day) (Month) (Year) (City or town) (Province) THEN SANDIA (Country) 19TH ND 2 1911 QUETTA. How = PAKISTAN 6. My age is 7. My present calling or occupation is 3 56 YEARS MOTOR VEHICLE ASSEMBLER 8. My present address is 866 QUEENS AVENUE LONDON ONTARIO CANADA 9. My sex is 10. My marital status is MARRIED MALE Single (never married) Married Widowed Divorced Separated Male Female Including my present marriage, I have been married Two times. 11. My nationality is BRITISH 12. My personal description is 13. I have the following visible marks of identification (a) Color of hair (c) Height TATTOO ON RIGHT FORE ARM. DARK-BROWN 5 feet 6 inches NAME iN HEART (b) eyes BLUE Color of (d) Complexion FAIR BERYL. 14. My purpose in going to the United States is To TAKE up OCCUPATION AND LATER BECOME U.S.A. CiTiZEN. 15. I intend to remain in the United States permanently or (Give length of 16. I intend to enter the United States at the port of time) BY C.N.R. SARNIA - PORT HUROH. PERMENTLY 17. with I (Do) (Do Not) OBTAIN have a ticket to RAILWAY my final destination TickETS AFTER RECEIVING VISA. 18. (a) I am going to the United States to join the following person (Give name 18. (b) I am sponsored by the following person and/or organization (Give and address and relationship, if any) address if different from (a)) MRS M. PACE MOTHER MRS M. HOCKENBERRY INLAW! SISTER INLAW 1341 SOUTH AVENUE-LOS-ANGELES CALIFORNIA 90042 U.S.A 19. 1361 My SOUTH AVENUE Los-ANGELES CALIFORNIA U.S.A final address in the United States is 20. My personal financial resources are (a) Cash ARROX 1 600. DOWLARS (c) Real estate (value) NONE (b) Bank deposits 659DOLLARS CANADIAN (d) Other NONE THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}