{
  "anumber": "A17212360",
  "id": "A17212360_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Employment Contract, 3511 West Sixth Street, Los Angeles, Calif. 90005"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "3 LAST 503 Per or flower STREET Placement Agency 3511 WEST SIXTH STREET 5840 GEARY STREET LOS ANGELES, CALIF. 90005 SAN FRANCISCO, CALIF. 94121 Far East Affiliate PHONE: 387-5196 PHONE: 387-2057 FAR EAST PLACEMENT AGENCY 506. COMMERCIAL HOUSE 35, QUEEN'S ROAD, C. HONG KONG EMPLOYMENT CONTRACT This contract for employment is made by and between the following: Mrs. Helen Halsey / herein called 'Employer' and Wong Yuk herein called 'Domestic Help The parties hereto agree as follows: 1. TERM: The employer hereby employs the Domestic Help to render services to the Employer at the residence of the Employer for a period of twenty-four (24) months, beginning twenty-four hours after Domestic Help arrives at the residence of the Employer to take up duties, subject to the services rendered being satisfactory. 2. PERFORMANCE: Domestic Help agrees to perform her/his duties with diligence and to the best of her/his abilities, and at all times, on and off duty, to conduct herself/himself in a proper and respectable manner, and Employer agrees to treat Domestic Help in a proper manner. 3. DUTIES: The duties and conditions of employment shall be as set forth in the document referred to as the WORK ORDER, which is attached hereto and made a part of this Contract. The Employer and the Domestic Help acknowledge that they have read this order and fully understand its terms. 4. SALARY: The Employer agrees to pay the Domestic Help her/his salary on the 1st and on the 15th of each month. The rate of salary per month, plus full board and lodging is as follows: $200 first six months, $225 second six months, $250 after 12 months; $275 after 18 months It is further understood and agreed that, upon successful completion of twelve (12) months service, the employee will receive a one-week vacation with full pay (if the employee so elects, an extra week's pay will be awarded in lieu of a vacation). 5. TERMINATION OF CONTRACT If the Employer or Domestic Help should wish to terminate the Contract without sufficient reason, it is agreed and understood that any such dispute will be placed before the Labor Commissioner of the State of California. 6. LABOR LAWS AND SOCIAL SECURITY: The Employer agrees to comply with all existing labor laws and Social Security deductions of the State of California and of the United States 7. SICKNESS: In the event the Domestic Help becomes ill, the Employer shall provide food and accommodations and salary for a total period of fifteen (15) days during the term of this Contract, but the Employer shall have no responsibility for costs of medical attention for the Domestic Help. Upon arrival in the United States, The Domestic Help agrees to promptly join a recognized group providing medical and hospital insurance for the duration of the Contract. EMPLOYER: Mr. Mrs. x Idelen Halley Address: 1114 Calle Vista Drive, Beverly Hills, California Subscribed and sworn to before me on DECEMBER 14 14 1966 STATE OF CALIFORNIA County of Los Angeles Danuel for said Fostu (SEAL) Notary Public in and County and State DOMESTIC HELP Signed: Wong yuk Dated: 10-12-66 22/12/66 Address: 78, Lok Shan Rd. 7/F, Block 17, Hong Kong. (See reverse side for Work Order)"
}