{
  "anumber": "A17211295",
  "id": "A17211295_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17211295_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Adjustment of Status,, I-452A."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2001,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/10/2023 11 Deportation proceedings have have not been instituted against me in the United States. (If deportation proceedings have ever been instituted against you, give the date and place of hearing, the charge, and the final result.) 12. I have have not been a participant in a designated exchange program. (If you have been a participant, show dates of arrival and departure from U.S. (If you have checked Block A or B of Item 1, complete items 13 and 14.) 13. I do do not intend to seek gainful employment in the United States. If you intend to seek gainful employment in the United States, state the occupation you intend to follow. 14. An immigrant visa is now available to me because: a. I have a priority on the consular waiting list at the American Consulate at as of (City) (Date) immediate relative b. A visa petition according me status was approved by the district director at Los ANGELES on JAN 2,1968 preference (Place) (Date) c. A visa petition has not been approved in my behalf but I claim eligibility for preference status because my spouse my parent is the beneficiary of a visa petition approved by the district director at (City) on (Date) d. I am claiming preference status as a refugee under the proviso to Section 203(a)(7) of the Act who has been continuously phys- ically present in the United States for at least the past two years. (If you check this item, you must execute and attach Form I-590A to this application.) e. Other (explain) 15. (If you have checked Block C or D of Item 1, complete this item.) A. I first arrived in the United States at on by means of (Port) (Date) was I was not inspected by an immigration officer. (Name of ship or mode of travel) B. I entered the United States under the name and I was destined to (Name at time of entry) I was coming to join (City and State) (Name and relationship) have C. Since my first entry I have not been absent from the United States. (If you have been absent, attach a separate statement listing the port, date and means of each departure from and return to the United States.) 16. I have have not heretofore filed an application for the status of a permanent resident. (If you have ever filed such application, give the date and place of filing and final disposition.) 3 17. Completed Form G-325A (Biographic Information) is attached Completed Form G-325A (Biographic Information) is not at- as part of this application. tached as applicant is under 14 years of age. 18. IF YOUR NATIVE ALPHABET IS IN OTHER THAN Signature of Applicant: ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: Dayaram Ranchhody Panchal Date of Signature: 2/20/68 19. (Signature of person preparing form, if other than applicant.) I Address of person preparing form, if other than applicant declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any 2001 N. LINWOOD AVE knowledge. SANTA ANA CALIFORNIA Jay Sachet Date: 2/12/68 Occupation: CIVIL ENGINEER Application not to be signed below until applicant appears before an officer of the Immigration and Naturalization Service for examination) I, Dayaram Rachhodj PAN, swear (affirm) that I know the contents of this application subscribed by me including the attached documents, that the same are true to the best of my knowledge, and that corrections numbered to were made by me or at my request, and that this application was signed by me with my full, true name: THINDINED / COOHHINHY WHATHIVE Dayaram Ranchhodji Panchal. (Complete and true signature of applicant) Subscribed and sworn to before me by the above-named applicant TOS ANGELES, CALIFORNIA on APR 23 1968 (Month) (Day) (Year) gleum (Signature and title of officer) (Page 2)"
}