{
  "anumber": "A17212360",
  "id": "A17212360_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN EMPLOYMENT CERTIFICATION, ES-575B"
    },
    "years": {
      "ms_years_nlp_v1": [
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "made Signed. and Budget Bureau No. 44-R1301 OR ALIEN EMPLOYMENT CER CATION Expiration Date: 8/31/66 ART B - JOB OFFER FOR ALIEN EMPLOYMENT (ES-575B) allofax IN SUPPORT OF THE APPLICATION FOR ADMISSION OF WONG Yuk (Name of Alien - If more than one and for same occupation, attach list) THE FOLLOWING INFORMATION IS SUBMITTED AS EVIDENCE OF AN OFFER OF EMPLOYMENT 1. NAME OF EMPLOYER (Full name of organization; if employer is an individual, give name with last name in capital letters) Mrs. Helen HALSEY 2. ADDRESS (Number and Street) (Town or City) (State) (Zip Code) 1114, Calle Vista Drive, Beverly Hills, California. 3. BRIEF NON-TECHNICAL DESCRIPTION OF THE NATURE OF EMPLOYER'S BUSINESS OR ACTIVITY Household 4. SIZE OF ORGANIZATION (In terms of Annual Sales, Production Output, Persons 5. DATE BUSINESS OR ACTIV- 6. GEOGRAPHICAL AREA Served, etc.) ITY ESTABLISHED SERVED Private Home N/A S. California 7. PLACE WHERE ALIEN WILL WORK 8. AVERAGE NUMBER OF EMPLOYEES AT 9. NUMBER OF EMPLOYEES WHO WILL PER- PLACE WHERE ALIEN WILL WORK FORM SAME WORK AS ALIEN Private Home One None 10. IS THE EMPLOYMENT 11. IS THE EMPLOYMENT 12. ARE ALIEN'S SERVICES SOUGHT SEASONAL? TEMPORARY? YES NO YES NO FOR A NEW JOB TO BE CREATED TO FILL AN EXISTING VACANCY 13. STATE SPECIFICALLY LENGTH OF TIME 14. HAVE YOU BEEN ABLE TO FIND IN THE U.S. ANY AVAILABLE PERSON CAPABLE OF YOU EXPECT TO EMPLOY ALIEN PERFORMING DUTIES OF THE JOB TO BE FILLED 52 weeks per year YES NO 15. EXPLAIN THE CIRCUMSTANCES WHICH CAUSED NEED FOR ALIEN'S SERVICES Because of the size of the home - to allow for Mrs. Halsey's charity obligations and for reasons of travel when necessary. It needs someone to maintain the home. 16. DESCRIBE EFFORTS YOU HAVE MADE IN YOUR OWN ORGANIZATION AND RECRUITMENT EFFORTS UNDERTAKEN TO FILL THE JOB By advertising in local newspaper - registering with Employment Dept. and employment agencies. 17. IF ALIEN IS NOT ADMITTED, HOW WILL YOUR NEEDS FOR THE JOB BE MET It is virtually impossible to find experience - reliable 'live-in' help on local labor market. 18. NUMBER OF TIMES YOU HAVE MADE 19. NUMBER OF ALIENS 20. DO YOU INTEND TO FILE A PETITION (FORM 1-140) WITH IMMIGRATION JOB OFFERS FOR ALIEN EMPLOY- EMPLOYED AS A RE- AND NATURALIZATION SERVICE FOR ADMISSION OF ALIEN AS A PREFER- MENT SULT ENCE IMMIGRANT? 0 YES ALIEN EMPLOYMENT DETERMINATION NO (DO NOT WRITE IN THIS SPACE TINUE ON REVERSE accordance SIDE). with section 212(a) (14) of the Immigration and Nationality Act, as amended: certified not certified Keason if not certified: availability of U. S. Workers JAN 16 1967 adverse effect on U. S. Workers (date) Regional Administrator, Bureau of Employment Security"
}