{
	"anumber": "A17221191",
	"id": "A17221191_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION AND INSTRUCTIONS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1897, 1820, 1956, 1891, 1906, 2023, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 INFORMATION AND INSTRUCTIONS 1. APPLICATION-Form N-585. Persons desiring a search of the records of this Service shall submit the completed application, in duplicate, to the nearest office of the Immigration and Naturalization Service except in those cases where naturalization data is desired relating to a naturalization that occurred between September 21, 1906, and April 1, 1956. In these cases the form should be sent to the Immigration and Naturalization Service, 119 \"D\" Street, N.E., Washington, D.C. 20536. 2. CONSENT REQUIRED. The subject of a Service record may consent in writing to another person's ob- taining information to which the subject would be entitled. A block is provided in the application form where such consent is shown. Information from visa petitions may be furnished upon application of the petitioner or beneficiary, but an application by a third person requires the petitioner's written consent. 3. COPIES. Copies cannot be furnished of a certificate of arrival, declaration of intention to become a citizen, or certificate of naturalization or citizenship because U.S. Code, Title 18, Sec. 1426(h) prohibits their reproduction. 4. FEES. (a) Basic Charges, A single fee of $3.00 shall be charged for a search of the records of the Im- migration and Naturalization Service. The fee is required for the search and is not returnable. When the in- formation requested relates to two or more persons, groups, or things, the search for each is a separate ser- vice and an additional fee or fees shall be submitted. In addition, fees are chargeable for searching time or for monitoring time as prescribed by 8 CFR 103.7. Searching time, generally, is considered as covered by the basic fee of $3.00; however, additional charges shall be imposed for unusual requests that result in expenditure of considerable time. Charges for monitoring shall be assessed when the requester's examination requires assignment of an employee specifically for that purpose. (b) Copies. A fee of 25 cents per page, with a minimum fee of 50 cents, shall be paid for copies of Ser- vice records, but no charge (other than the basic search fee of $3.00) shall be required for the first page of a record. (c) Manner of submission. If this application is mailed, DO NOT SEND CASH Attach a check or a United States postal money order (or, if outside the United States, an international money order) made payable to \"Immigration and Naturalization Service, Department of Justice.\" An applicant residing in the U.S. Virgin Islands shall make his remittance payable to \"Commissioner of Finance of the Virgin Islands,\" and if residing in Guam, to \"Treasurer, Guam.\" 5. NATURALIZATION RECORDS. If naturalization occurred prior to September 27, 1906, the subject's place of residence at the time of naturalization must be furnished. Such records rarely contain information regar- ding members of the naturalized person's family. 6. ARRIVAL RECORDS. Some passenger lists of the Bureau of Customs dating from 1820 are maintained by the General Reference Section, the National Archives, Washington, D.C. 20408. Inquiries concerning these records should not be made on this form nor submitted to this Service but should be forwarded directly to that agency with sufficient information for an adequate search, i.e. /approximate dates of travel, name under which the person arrived, name of vessel, and port of entry and embarkation. This Service has records of arrivals at the port of New York since June 16, 1897, and at certain other ports since 1891. Our records of arrivals prior to July 1, 1924, do not contain birthdates but merely show age at time of entry. 7. CERTIFICATE OF BIRTH DATA FROM IMMIGRATION AND NATURALIZATION RECORDS. A Certificate of Birth Data may be issued for a fee of $3.00 to foreign-born children under twenty-one years of age who: (a) Have been admitted to the United States for permanent residence, whether or not they have since become naturalized, or (b) Are citizens of the United States and have been issued a Certificate of Citizenship by the Service. The parent, guardian, or other adult having a legitimate interest in a person who is under fourteen years of age may file an application on such person's behalf. Where documentary evidence is presented to show the child's name has been legally changed, the cer- tification may be issued in the child's new name."
}
