{
	"anumber": "A17220615",
	"id": "A17220615_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17220615_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, I-210"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968, 621, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 300 N. Los Angeles St. PLEASE REFER TO THIS FILE NUMBER Los Angeles, Calif. 0621 Wife: Simona SALDIVAR-Bermodes Silverio BARRIOS-Ureno FOIA (b)(6) January 31, ,1968 Children : 1018 N. Patt St, Anaheim, Calif. Required Departure Verified at Sp I-94 on 31061 to CO R-84 to FBI 8 100 1972 G-189 prepared G-143 to R.O. Please note the below checked action which has been taken in your case I-161/I-154 closed File closed In accordance with a decision made in your case you are required to depart from the United States at your own expense on or before February 10,1968 Midnight You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. Failure to depart on or before the specified date may result in the withdrawal of voluntary departure and steps being taken to effect your deportation. If you are unable to depart by the date stated above, an additional period of time may be granted if, prior to the above date, you appear at this office with confirmed arrangements for your departure. Your application for an extension of time in which to depart from the United States has been . You are required to depart on or before . Failure to depart may result in the withdrawal of the privilege of voluntary departure. You must notify this office on or before of the arrangements you have made to effect your departure, including the date, place and manner. If there is a bond outstanding in your case, you are warned that to expedite cancellation of the bond and return of the collateral posted, you must make advance arrangements with this office to have your departure witnessed by an officer of this Service. AT THE TIME OF YOUR DEPARTURE, DO NOT FAIL TO SURRENDER FORM I - 94, IN ACCORDANCE WITH INSTRUCTIONS ON THE REVERSE OF THAT FORM. Very truly yours, Aller L. Gerhardt By: 771 CPI*CHU DISTRIC X DIRECTOR FOR IMMIGRATION AND NATURALIZATION USE ONLY Departed: Port \"Spe Date merig I-530 submitted To after I-94 stamped 12-10-68 Via I-161 prepared I-156 prepared Form I-210 (Rev. 5-22-67) UNDER DOBILT ANGELES"
}
