{
	"anumber": "A17224552",
	"id": "A17224552_0051",
	"page_index": 51,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17224552_0051/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, FORM G-325 A REV. 4-1-67"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan"]
		},
		"years": {
			"ms_years_nlp_v1": [1897, 1929, 2023, 1890, 1915]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"nationality": {
				"nationality_llm_v1": "Pakistan"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 A REV. 4-1-67 Screened by NARA, 7/10/2023 LOS FORM APPROVED T/C E 245 BUDGET BUREAU No. 43-R436 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE INFORMATION Immigration and Naturalization Service 3/1/68 (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) BIRTHDATE (MO-DAY-YR.) MALE NATIONALITY ATE). ALTEN REGISTRATION NO. BXBX CHOUDHRY BIBI FEMALE 1-1-1915 PAKISTAN a17224552 (IF ANY) ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (IF ANY) NONE JULLUNDUR, PAKISTAN FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER CHOUDHRY ABDULLA CA 1890 JULLUNDUR, PAKISTAN MOTHER (MAIDEN NAME) CHOUDHRY HAFISA CA 1897 JULLUNDUR, PAKISTAN SPOUSE (IF NONE, so STATE) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE, GIVE MAIDEN NAME) 7-8-07 JULLUNDUR BAHAWALPUR AXMAXXKKAK CHOUDHRY ASMATULLAH PAKISTAN MAY 1929 PAKISTAN FORMER SPOUSES (IF NONE, so STATE) FAMILY NAME(FOR WIFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 160 Mohallah Choudhrian Bahawalpur, Bahawalnur Pakistan - 54 PRESENT TIME 5376 has Augeles, Cal Present LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR NONE PRESENT TIME LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) HOUSEWIFE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN NATURALIZATION ADJUSTMENT OF STATUS YOUR NATIVE ALPHABET IN THIS SPACE: OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW Feb 26, 68 bb FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT OR PETITIONER)"
}
