{
  "anumber": "A17224552",
  "id": "A17224552_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17224552_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151, Form I-151"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1970,
        1968,
        1941,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CH/TC-I-9 Screened by NARA, 7/10/2023 LUKE Form approved 8-12-71 Budget Bureau No. 43-R040.7 Applicant: Do Not Fill in This Block FILE NO. APPLICATION BY LAWFUL PERMANENT RESIDENT ALIEN FOR ALIEN REGISTRATION RECEIPT CARD, FORM I-151 Fee Required Fee Not Required (Please read instructions on the reverse) Fee Stamp 01235 5106 checked no Fee taken 198 I apply for an Alien Registration Receipt Card (Form I-151), and attach any previously issued Form I-151 or other evidence of registration now in my possession. My Alien Registration Number is 17 224 652 1. Reason for Application (Please check appropriate blocks.) (?) My alien registration receipt document was lost destroyed on or about 8 Nov 1970 under the following circumstances: (date) I Lost my residence card in Mexical B,Cfa Mex. (If my document is recovered, I will surrender it to the Immigration and Naturalization Service.) (b) My name has been changed. (c) My present Form I-151 is mutilated. (If you checked \"(a)\", \"(b)\" or \"(c)\", above, a $10.00 jee is required; see Instruction Number 6 on the reverse.) (d) My evidence of alien registration (e) I never received Form I-151. is on a form other than Form I-151. (f) My present Form I-151 is in poor con- (g) I am required by Section 262(b) of the Immigration and dition because of improper lamination. Nationality Act to be registered and fingerprinted after my 14th birthday. 2. Name (Last) (First) (Middle) 3. Nationality GARGIA HERNANDEZ MARIO Mexicon 4. Admitted to U.S. at (City) (State) 5. Date of Admission (Mo.)(Day)(Yr.) 6. Date ofBirth(Mo.) (Day) (Year) minno CALIF. 28 February,1968 12 Sep,1941 7. Means of Arrival (Name of Vessel, or Airline 8. Destination in U.S. at Time of Admission 9. Place of Birth (City) (Province or State) and Flight No., etc.) On Car.\" Pacoima Calif. (Country) Michancandyi Jal.Mex.< 10. Name Used When Registered as an Alien (If same as present, write 11. Name Used When Lawfully Admitted for Permanent Residence (If \"same.\") same as present, write \"same.\") Same 12. Address in the U.S. (Street, City end State ZIP Code) 13. Address outside U.S. if temporarily abroad (Street, City, Country) 13600 Davency St. Facoima Calif. Same 14. Dates of Absences From the U.S. of 1 Year or Longer, Since Lawful Admission for Permanent Residence 15. Date of Last Departure from U.S. None 16. (If you intend to use Form I-151 as a document for travel within the next six weeks, give the date of your expected departure, list each country to be visited, and be sure to read Instruction 7 in regard to the limitations on use of Form I-151 for travel in or through certain countries.) a. Date of Proposed Departure b. Countries to be Visited 17. Signature of Person Preparing the Form if Other Than Applicant 18. Signature of Applicant I DECLARE that this application was prepared by me at the I CERTIFY that the information above is true and correct to the request of the applicant and is based on all information of which I best of my knowledge and belief. have any 27 Jul,1971 Maine Jul,1971 Signature Signature Mo Address Date Signed Date Signed Form I-90 UNITED STATES DEPARTMENT OF JUSTICE (Rev. 2-16-70) Immigration and Naturalization Service"
}