{
  "anumber": "A17210305",
  "id": "A17210305_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECEIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED AS SECURITY, Form I-301"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        2952,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 Form I-301 U. 8. DEPARTMENT OF JUSTICE IMMIGRATION AND INATURALIZATION SERVICE (Rev. 12-19-47) RECEIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED AS SECURITY (To be held in Immigration and Naturalization Oficia duplicate copy to be retained by the Depository) Departure bond 1600-301324 Los Angeles California Jan. 29, 2952. (City) (State) (Date) The undersigned hereby acknowledges receipt from EDGEMATION R. LARDON, District Director, Imigration and Naturalisation vice, Los Angeles, California, for Joy Lacks, surety. of the United States bonds/notes hereinafter described, deposited by him to the order of the Attorney General, as security on bond dated January 28, 1952 , filed with J. Nelson, Chief, Border Patrol Section , on behalf of the (Name of immigration and naturalization officer and title) alien Stohaol Josefi 46 , years of age, native of India not Said United States bonds/notes are assigned (State form of assignment, if registered) COUPON OR TITLE OF BONDS/NOTES TOTAL FACE AMOUNT DENOMINATION SERIAL NUMBER INTEREST DATES REGISTERED California 13 U. S. Treasury Bond to 54 inc. 8500. 2/2 217623 0 June 15th and 1967-72 Series 6-15-52 December 15th Orig 43cc to Fiscal 1-28-52 JR (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely affix same hereto) The above-described United States bonds/notes will be returned only to or on the written order of the Attorney General, or his successor in office, or an officer of the Department of Justice, designated by either, and upon the presentation and surrender of the original of this receipt. This receipt is executed in duplicate and is not assignable. (Signature of depository)"
}