{
  "anumber": "A17212360",
  "id": "A17212360_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Sixth Preference Petition Approved Under Section 2 of the Immigration and Nationality Act, as Amended."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1962,
        1967,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CADJ-7 UNITED STATES DEPARTMENT OF JUSTICJ migration and Naturalization Service Los Angeles, California REPORT OF SIXTH PREFERENCE PETITION APPROVED UNDER SECTION 203(a) (6) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED. File No.: A17 168 103 Date: May 22, 1967 Beneficiary: Petitioner: WONG Yuk Mrs. Helen Halsey Petitioner's address: 1114 Calle Vista Drive, Beverly Hills, California 90210 Nature and size of petitioner's business: Private Household Petitioner desires and intends to employ the beneficiary as a: Maid Petitioner's requirements for position: One year's experience as a maid. Beneficiary's experience and qualifications: Employed as maid from 1959 to November 1962 by Mrs. Betty Kendall, Hong Kong, B.C.C. and as maid from October 1966 to date by Mr. Milldecan, Hong Kong, B.C.C. Beneficiary's age: 52 Country of birth: China City and country of residence Hong Kong, B.C.C. Beneficiary's marital status: Single Number of children: Country of present residence of spouse and children, if any: It has been established that the ben eficiary is capable of performing the work specified and that the work to be performed is not of a temporary or seasonal nature. Also, a certification pursuant to Section 212(a) (14) of the Act, as amended, has been issued by the Department of Labor. Therefore, the petition has been approved. I.I. T.W. Laughlin DISTRICT DIRECTOR ADD/TC/ J.L. Todd Form I-464 (4-1-66)"
}