{
	"anumber": "A17229681",
	"id": "A17229681_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17229681_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "GENERAL REGISTER OFFICE CERTIFIED COPY, 278381"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1953, 1947, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "278381 GENERAL REGISTER OFFICE Application Number:- CERTIFIED COPY of an Entry in an Army Register Book of Marriages. This ma any appear of the Certified extract from Army Book 113 (Register of Marriages) of the British Army of the Rhine for the six months ended 30th Jun. 1948 reported from the Military Station at G.H.Q. 2nd Echelon B.A.O.R. Date and Place Name Surname Rank or Residence at the Fathers Name Rank or Profession No. of marriage and Nationality Age Condition Profession time of marriage and Surname of Father 13 Twentyfirst John Edward 36 Bachelor 791546 Active Service John Cleary November Cleary W/Bdr. R.A. Abroad B.A. O. R. (deceased) 1947 (Irish Eire) H.Q. R. A. at Hilden 2 Div. Germany 25 Heiligen Str. Clerk in Widow of Ignaz Geiger Anna Marie 34 Childrens Hilden Tax Office Dietrich Josef Nurse Rheinland (German) Dietrich Germany in accordance with Section 22 of the Foreign Marriage Act 1892 by me Married in the Church of St. James Hilden Rheinland according to the Rites and Ceremonies of the Roman Catholic Church This marriage John Edward Cleary in the Albert Simpkins Francis Bernard McKeever was solemnized presence between us Anna Marie Dietrich of us C.F./R.C. Friedrich Johann Stromenger CERTIFIED to be a true copy of an Entry relating to the marriage of John Edward Cleary and Anna Marie Dietrich. deposited in the GENERAL REGISTER OFFICE, SOMERSET HOUSE, LONDON. GIVEN at the GENERAL REGISTER OFFICE, SOMERSET HOUSE, LONDON, under the Seal of the said Office, this 3rd RECISTER day of November 195 8. The statutory fee for this certificate is 3s. 9d. Where a search is necessary to find the entry, a search fee is payable in addition. The Births and Deaths Registration Act, 1953 (sec. 34) and the Marriage Act, 1949 (sec. 65) together provide that any certified copy of an entry purporting to be sealed or stamped with the seal of the General Office shall be received as evidence of the birth, death or marriage to which it relates without any further or other proof of the entry, and no certified copy purporting to be given in the said Office shall be of effect unless it is sealed or stamped as aforesaid. ON. - Any person who (1) falsifies any of the particulars on this certificate, or (2) uses a falsified certificate as true, knowing it to be false, is liable to prosecution. AND COM 7 (S.13398) Wt.34738/634 3M 8/57 Hw.-RE-60"
}
