{
	"anumber": "A17221191",
	"id": "A17221191_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS, NARA, 8/25/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 INSTRUCTIONS I. FILING THE APPLICATION: This application and supporting documents should be filed at the American Consulate at which you are applying for a visa. If you are in the United States and applying for status as a permanent resident, you should file the application and documents with the office of the Immigration and Naturalization Service having jurisdiction over your place of residence. II. FEE: A fee of twenty-five dollars ($25), payable in United States currency, must accompany this application if it is filed pursuant to Section 212(h) or (i) of the Immigration and Nationality Act, as amended (relating to aliens who are inadmissible under Section 212(a)(9), 212(a)(10), 212(a)(12) or 212(a)(19)). The fee is required for filing the application and is not returnable regardless of action taken thereon. If you mail this application, attach money order or check. DO NOT SEND CASH OR POSTAGE STAMPS. Remittance should be made payable to \"Immigration and Naturaliza- tion Service, Department of Justice\"; except that if residing in the Virgin Islands, remittance should be made payable to \"Commissioner of Finance of the Virgin Islands\" and if residing in Guam, remittance should be made payable to \"Treasurer, Guam\". If this application is filed pursuant to Section 212(g) of the Immigration and Nationality Act (re- lating to aliens afflicted with tuberculosis, mentally retarded aliens, or aliens who have a history of mental illness) no fee is required. III. APPLICANTS WITH TUBERCULOSIS: AN ALIEN AFFLICTED WITH TUBERCULOSIS SHALL SUBMIT: A. A statement by a state, territorial, or local health department, or by a recognized hospital or other institution en- gaged in the treatment of tuberculosis. (Unless the United States Public Health Service has established that the hospital or other institution is satisfactory for the treatment of tuberculosis, a statement made by such an institu- tion must bear an endorsement by ahealth department affirming its recognition of the institution for that purpose.) The statement must include: 1. Name and address of the hospital or institution where the alien will be treated. 2. Affirmation that upon arrival at such hospital or institution the alien will be placed in inpatient or outpatient status as determined by the responsible local physician. 3. Affirmation that (1) financial arrangements for charges which might be made for the alien's care have been made by a sponsor or other responsible individual; or (2) the alien has established eligibility under the De- pendents Medical Care Act of June 7, 1956 (70 Stat. 250; 37 U.S.C. 401) 4. Agreement to supply any treatment and observation required for proper management of the alien's condition, in conformity with accepted local standards of medical practice. 5. Agreement to submit to the United States Quarantine Station, Rosebank, Staten Island, New York 10305: (a) An initial report giving a clinical evaluation of the alien, including necessary X-ray films, within 30 days after the alien's arrival at the hospital or other institution; or if, within 30 days after receipt of notice from the United States Public Health Service that the alien has arrived in the United States, he has not reported to to the hospital or other institution, a report stating this fact; (b) A report of final disposition of the case. B. Assurance that upon admission into the United States he will go direct to the hospital or other institution specified; will submit to such examinations, treatment, isolation, and medical regime as may be required; and will remain un- der the prescribed treatment or observation, whether on an inpatient or outpatient basis, until discharged. C. Assurance that, if applicable to his case, he will comply with the provisions of \"Sanitary Measures for Travel of Aliens with Known or Suspected Tuberculosis\" a copy of which is to be furnished to him. IV. MENTAL CONDITIONS: AN ALIEN WHO IS MENTALLY RETARDED OR WHO HAS A HISTORY OF MENTAL ILL- NESS SHALL ATTACH TO THE APPLICATION A STATEMENT THAT HE HAS ARRANGED FOR SUBMISSION OF A MEDICAL REPORT, AS FOLLOWS, TO THE OFFICE WHERE THIS FORM IS FILED: The medical report shall contain a complete medical history of the alien, including details of any hospitalization or institutional care or treatment for any physical or mental condition; findings as to the current physical condition of the alien, including reports of chest X-ray examination if the alien is 11 years of age or over, of serologic test for syphilis if the alien is 15 years of age or over, and other pertinent diagnostic tests; and findings as to the current mental condition of the alien, with information as to prognosis and life expectancy and with a report of a psychiatric examination conducted by a psychiatrist who shall, in case of mental retardation, also provide an evaluation of the intelligence. For an alien with a past history of mental illness, the medical report shall also contain available information on which the United States Public Health Service can base a finding as to whether the alien has been free of such mental illness for a period of time sufficient in the light of such history to demonstrate recovery. The medical report will be referred to the United States Public Health Service for review and, if found acceptable, the alien will be required to submit such additional assurances as the United States Public Health Service may deem ne ary in his particular case."
}
