{
	"anumber": "A17210305",
	"id": "A17210305_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS INFORMATION CONCERNING THE FILM OF A PETITION BY A UNITED STATES CITIZEN FOR ISSUANCE OF IMMIGRANT VISA, 16-62883-7"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 INSTRUCTIONS AM INFORMATION CONCERNING THE FILL OF A PETITION BY A UNITED STATES CITIZEN FOR ISSUANCE OF IMMIGRANT VISA (Under Section 101 (a) (27) (A), 203 (a) (2), or 203 (a) (4) of the Immigration and Nationality Act) 1. Classes of aliens who may be issued a nonquota immigrant a.-(Section 101 (a) (27) (A).) A wife or husband or unmar- ried child under 21 years of age. (See the exceptions in instruction No. 4 below.) 2. Allocation of quota visas.-Section 203 (a) of the Immigration and Nationality Act of 1952 provides: \"Immigrant visas to quota immigrants shall be allotted in each fiscal year as follows: \"(1) The first 50 per centum of the quota of each quota area for such year, plus any portion of such quota not required for the issuance of immigrant visas to the classes specified in paragraphs (2) and (3), shall be made available for the issu- ance of immigrant visas (A) to qualified quota immigrants whose services are determined by the Attorney General to be needed urgently in the United States because of the high education, technical training, specialized experience, or exceptional ability of such immigrants and to be substantially beneficial prospectively to the national economy, cultural interests or wel- fare of the United States, and (B) to qualified quota immigrants who are the spouse or children of any immigrant described in clause (A) if accompanying him. [Do not use this form for such cases.] \"(2) The next 30 per centum of the quota for each quota area for such year, plus any portion of such quota not required for the issuance of immigrant visas to the classes specified in paragraphs (1) and (3), shall be made available for the issu- ance of immigrant visas to qualified quota immigrants who are the parents of citizens of the United States, such citizens being at least 21 years of age. \"(3) The remaining 20 per centum of the quota for each quota area for such year, plus any portion of such quota not required for the issuance of immigrant visas to the classes specified in paragraphs (1) and (2), shall be made available for the issuance of immigrant visas to qualified quota immigrants who are the spouses or the children of aliens lawfully admitted for permanent residence. [Do not use this form for such cases.] \"(4) Any portion of the quota for each quota area for such year not required for the issuance of immigrant visas to the classes specified in paragraphs (1), (2), and (3) shall be made available for the issuance of immigrant visas to other qualified quota immigrants chargeable to such quota. Qualified quota immigrants of each quota area who are the brothers, sisters, sons, or daughters of citizens of the United States shall be entitled to a preference of not exceeding 25 per centum of the immigrant visas available for issuance for each quota area under this paragraph.\" 3. Who may submit a petition for issuance of immigrant visa.-Except as stated in instruction No. 4, a citizen of the United States may submit a petition on behalf of a wife, husband, children (regardless of age), a parent or parents, or brother or sister. A separate petition, in duplicate, must be filed for each beneficiary who is a brother or sister, or a son or daughter over 21 years of age or married. A wife, husband, unmarried children under the age of 21 years, and a parent or parents may be included in a single petition. If more than one beneficiary is included in a single petition and the applications for visas will be made at more than one American Consulate, a copy of the petition shall be submitted for each consulate at which the applications will be made. If petitions are filed for several beneficiaries who are members of the same family group, whether included in a single petition or in separate petitions, such petitions need be accompanied by only a single set of the documents referred to in these instructions. A petition which includes more than one beneficiary shall be accompanied by a single fee of $10. Separate petitions for a brother or sister, or son or daughter over 21 years of age or married, shall be accompanied by a separate fee on a separate remittance for each petition. 4. Petitions which cannot be approved.-Approval cannot be given to petitions on behalf of- (a) a parent, unless the United States citizen petitioner is at least 21 years of age, (b) an adoptive parent, (c) a stepparent, unless the marriage creating the status of stepparent occurred before the citizen stepchild reached the age of 18 years, (d) an adopted child, (e) a stepchild, unless the child had not reached the age of 18 years at the time the marriage creating the status of step- child occurred, (f) a child born out of wedlock, unless the child was legitimated under the law of the child's residence or domicile, or under the law of the father's residence or domicile, whether in or outside the United States, and such legitimation took place before the child reached the age of 18 years, and the child was in the legal custody of the legitimating parent or parents at the time of such legitimation. (This paragraph does not apply if the petitioner is a mother petitioning for a son or daughter under section 203 (a) (4) of the Act.) (g) a wife or husband by reason of any marriage ceremony where the contracting parties thereto are not physically present in the presence of each other, unless the marriage shall have been consummated, (h) a prospective wife or husband. 5. Form of petition.-A petition by a United States citizen for issuance of immigrant visa must be made on Form I-133, in duplicate. Copies may be obtained from any office of the Immigration and Naturalization Service or American Consulate abroad. 6. Preparation of petition.-The petition must be typewritten or printed legibly with pen and ink. If the space provided in the form is insufficient to answer a question fully, you should attach a sheet of paper containing your answer which should be numbered to correspond with the question. 16-52883-7 5"
}
