{
  "anumber": "A17231918",
  "id": "A17231918_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17231918_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFIED COPY of an ENTRY OF MARRIAGE, WB 054381"
    },
    "years": {
      "ms_years_nlp_v1": [
        1946
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "WB 054381 [Printed by Authority of the Registrar-General.} CERTIFIED COPY of an ENTRY OF MARRIAGE. M. Cert. R.B.D. &M. The Stampary Fee for this Certificate is 2s.6d., together with Id. Shirt Daty. Where a search is necessary to Pursuant to the Marriage Acts, 1811 to 1939. find the Search Fee is payable in addition. Insert in this Registration District Margin any Notes which 946 Marriage Solemnized at The Registra Office Crowbonorgh in the appear in the original entry. District of 1 clefefieth in the Columns 2 3 4 County of ray 6 Sund 7 3 No. When Married. Name and Surname. Age. Condition. Rank or Profession. Residence at the time of Marriage. Father's Name and Surname. Rank or Profession of Father. The truered Fifer Roy sefford Janet Le Voi Husband of Enid motor 27 English 24 (revenuR Roae Fredgick acford Managing Le Voi 184 april years formerity yorde (Heavy Transform he Voi Director spinnted 1946 Benyl Irma 39 The triored Wife of Robert 24(General Affred must family Nightingal follow yearshing East Enisted (Deceased) Peterson Engineer Married in the Register Office according to the Rites and Ceremonies of the by Licence before by me, D.A. Barn This Marriage Roy of Le. Voi. in the Sr Mitcheee was sciennized Presence between us, Preye Irma Nightingale of us, George Chilman Review L. Nye Register Defent Supt Registrar I, S. Barry Registrar for the District of in the do hereby certify that this is a true copy of the in Register Book of Marriages for the said District, and that such Register Book County of East Silver DOW legally in my custody. 184 5 WITNESS MY HAND this 5th day of apine ,1946 D.A. Barr Any person who (1) falsifies any of the particulars on this Registrar. or (2) uses it as true, knowing it to be falsified, is liable cution."
}