{
	"anumber": "A17220615",
	"id": "A17220615_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17220615_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. INS. INFORMATION SHEET FOR REQUEST FOR EXTENSION OF VOLUNTARY DEPARTURE TIME, A19 915 239"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 A19915239 Argaia A19 915 239 FOIA (b)(6) U.S. INS. INFORMATION SHEET FOR REGUEST FOR EXTENSION OF VOLUNTARY DEPARTURE TIME The following information must be furnished before the request can be considered: 1. ALIEN'S NAME: Silverio Barreas FILE #: 2. ALIEN'S 3252 Jusianna anaheem PRESENT ADDRESS: (street) (city) (zip code) 3. ALIEN'S TELEPHONE 0.635-91143 SOCIAL SECURITY #: 548-8216.25 4. ALIEN'S SPOUSE's NAME: Seimana Saldings CITIZENSHIP: no 5. ALIEN's SPOUSE'S IMMIGRATION STATUS. IF PERMANENT RESIDENT, A#: 6. NUMBER OF ALIEN'S CHILDREN: (U.S.Citizen: ); (Illegal: ; (Other: ) 7. IS ALIEN ATTEMPTING TO IMMIGRATE INTO THE U.S.? (YES: ( NO: ) Name of Person or Organization assisting: Jose mantoja 8. HAS I-130 PETITION, OR FORM I-550 BEEN FILED? (YES: ) (DATE: ); (NO: ) 9. TO WHICH AMERICAN CONSULATE WAS FORM DIRECTED: Guadalajara 10. HAS A PRIORITY DATE BEEN RECEIVED? (YES: ) (DATE: ); (NO: ) 11. DOES ALTEN, SPOUSE, OR CHILDREN RECEIVE COUNTY OR STATE AID, OR WELFARE? MO 12. HOW LONG HAS ALIEN BEEN EMPLOYEL IN U.S.?: 2 mom MONTHLY INCOME: 13. NAME AND ADDRESS OF ALIEN'S EMPLOYER: Sitozi BROS 3078 West,orange 14. FOR WHICH YEARS HAVE STATE & FEDERAL INCOME TAX FORMS BEEN FILED?: 1972 (attach cookes of Forms for the years filed) 15. IS ALIEN IN POSSESSION OF A VALID PASSPORT? (YES: ; (NO: ); EXPIRATION DATE 16. DOES ALIEN INTEND TO DEPART FROM U.S. ? (YES: ); (NO: ) 17. IF ABOVE ANSWER IS YES, FURNISH THE DATE OF INTENDED DEPARTURE: 18. WHAT IS ALIEN'S REASON FOR REQUESTING EXTENSION OF VOLUNTARY DEPARTURE? 19. SIGNATURE OF ALIEN: u HAND DELIVER THIS FORM WITH REQUIRED ATTACHMENTS TO RECEPTIONIST, ROOM 8024 (Do Not Write in Block Below) U.S. INS. OFFICE REMARKS: DEP - 3/21/72."
}
