{
  "anumber": "A17211293",
  "id": "A17211293_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17211293_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/10/2023 ITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 300 North Los Angeles Street REFER TO THIS FILE NO Los Angeles, California 90012 March 19, 1968 A17 211 295 MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENTS our medical examination will be given-at: Location U, S. Public Health Service Mrs. Kamlaben Dayaram Panchal 825 So. Beacon Street, San Pedro. Calif Date Time 2001 N. Linwood Avenue Monday, April 15, 1968 - 8:45 A.M. Santa Ana, California 92701 The Immigration examination will be held at: Location 300 North Los Angeles Street ROOM 8024 Los Angeles, California Date Time Tuesday, April 23%, 1968 - 8:30 A.M. INSTRUCTIONS FOR MEDICAL EXAMINATION In connection with your application, it will be necessary for you to take a medical examination. An ap pointment has been made for you to he examined by a doctor of the U.S. Public Health Service at the time and place given above. If you do not speak English, you must bring a person of your own sex who can Act as interpreter. You should obtain items 1 and 2 below at once. a hospital or clinic 1. X-ray film (size 14\" X 17\") of your chest, taken and interpreted at/on the attached list. (Film and reading not to be more than 7 months old.) (Not necessary for child 10 years of age or under.) 2. Report of serologic test for syphilis. (Report not to be more than 30 days old.) (Not necessary for child 14 years of age or under.) 3. The above tests are at your expense. If you do nct obtain such tests promptly, the Public Health Service cannot complete your medical examination. 4. SEE ATTACHED INSTRUCTIONS INSTRUCTIONS FOR IMMIGRATION EXAMINATION An appointment has also been made for an examination before an Immigration officer at the time and place given above. See below for items (if any are necessary) which you MUST BRING WITH YOU: Please bring evidence*that you have registered with Selective Service Please bring letter of employment or a properly executed Affidavit of Support Please bring two passport type photographs size 11/2 X 11/2\" Please bring marriage certificate and/or divorce records of prior marriage ASK TO SEE INSPECTOR TODHUNTER YOU SHOULD ANTICIPATE THAT THIS MATTER MAY TAKE FROM ONE TO TWO HOURS gwt/dob Forra I-486 (Rev. 5-25-66)"
}