{
	"anumber": "A17221191",
	"id": "A17221191_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR A SEARCH OF THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE, NARA, 8/25/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Budget Bureau No. 43-R0104 Immigration and Naturalization Service APPLICATION FOR A SEARCH OF . ME RECORDS OF Fee Stamp THE IMMIGRATION AND NATURALIZATION SERVICE TAKE OR MAIL TO - Immigration and Naturalization Service Convenience the govt TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSON TO WHOM INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED UNDER THE LINE BELOW. (See Instruction 2 on reverse) PERSON CONSENTING NAME AND ADDRESS 617 E Adams Blvd Los Angeles Ce 90011 SIGNATURE OF PERSON CONSENTING x WAI 01 NG 1 SPECIFIC INFORMATION DESIRED 2 STATE Proof PURPOSE of age FOR WHICH at DESIRED time of entry and marriage SSA / 12 benefits IF INFORMATION IS FOR SOCIAL SECURITY BENEFITS SHOW SOCIAL SECURITY NO : 550-94-1034 DATA FOR IDENTIFICATION OF THE RECORD 3. FAMILY NAME GIVEN NAME MIDDLE NAME 4. ALIEN REGISTRATION NUMBER Ko Wai Oi A 17221191 5. OTHER NAMES USED, IF ANY 6. NAME USED AT TIME OF ENTRY none Ng, Wai oi 7. PLACE OF BIRTH 8. DATE OF BIRTH 9. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES China 9-30-11 10. PORT OF ENTRY 11. DATE OF ENTRY 12. NAME OF VESSEL OF ENTRY Hong Kry OR OTHER MEAN$ HHW 5-6-69 PAN AM GIVE THE FOLLOWING INFORMATION IF THE PERSON WAS NATURALIZED 13. NAME ON NATURALIZATION CERTIFICATE 14. CERTIFICATE NUMBER 15. NATURALIZATION DATE 16. ADDRESS AT TIME OF NATURALIZATION 17. NAME AND LOCATION OF NATURALIZATION COURT 18. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY X WAI 01 NG INS OFFICE: DATE: 4/15/76 THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON AT. Cigarett C8A . NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. NATURALIZATION IN (COURT) ON (DATE) by go AT (LOCATION) . DATE OF BIRTH . ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE . COPIES ATTACHED AS REQUESTED SIGNATURE TITLE FORM (REV 9-1-71) Y"
}
