{
	"anumber": "A17221191",
	"id": "A17221191_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0037/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title of the image, Screened by NARA, 8/25/2023, Form number, NARA Form No. 14"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 1956, 1960, 1911, 1945, 2023, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 21. am submitting the following personal documents in support of and as part of my application) (Birth certificate) (Military record) (Promise of employment) (Police certificate(s)) (Evidence of support or (Medical record(s)) (Other (describe)) own resources) (Marriage certificate) see Jssi 22. (Name and present residence of my wife/husband is (Give maiden name of wife)) NG Do 617 E. ADAMS BLVD.. Los ANGELES CALIF 90011, U.S.A. 23. (The names and addresses of my children under 21 years of age are) NG YUK LIN DAUGHTER 24. (The names of members of my family who are immigrating with me are) NG YUK LIN 25. M) (The name and address of my father is (If deceased, so state, giving date)) KO CHUN PAK DECEASED 1ST MAR. 1945 SUN Wul, CHINA 26. (, ) (The maiden name and address of my mother is (If deceased, so state. giv- ing date)) LAM Yau WOR DECEASED 51 TH MAY 1945 SUN WUI, CHINA. 27. (The name and address of my next of kin in Hong Kong or Macau is) NG CHEUNG Woo SON, 341 DES VOEUX RD. W. 3RD/FL.HONG KONG. 28. (Since birth my places of residence for 6 months or more have been (Give street address in Hong Kong. Macau, and other cities)) (Country,) (Province), (District), #(Heung), H(Village), (Street Address), Dates(From-To)) (Occupation) CHINA KWONGTUNG SUN Wul Ku JAN HEUNG NAR FUK VIL. 9/1911-1928/3 CHINA KWONGTUNG SUN Wul Ku JAN HEUNG MAN LAU VIL. 3/1928-1956/3 Hang KONGY 8 LEUNG YEE FONG. GR/FL. SAI YING POON 3/1956-1960/1 \" If 14 FIRST ST.. 2ND/FL. SAI YING POON 1/1960-1964/8 11 \" 341 DES Voeux RD., W. 3RD/FL. 8/1964-DATE. 29. (Since my sixteenth birthday I am or have been a member or aftiliate of the following political, professional, vocational or social organizations) (Name and address) (Dates (From-To)) of membership and office held, if any) -NIL- 30. (I speak, read, write the following languages (Include your native languages)) (Languages) (Speak) it(Read) (Write) CHINESE YES No No 31. (I have previously been in the United States during the following periods (Give year and type of visa or status) (If never, so state)) -NIL- 32. (United States immigration laws require that all prospective immigrants answer the following questions. This requirement does not imply that you are suspected, of being within any of the classes described in these questions. Your answers will assist the consular officer to establish your eligibility to receive a visa. If you are unable to answer any of these questions please explain your inability fully on a separate sheet of paper which you should attach to this form. Please bear in mind that whatever the nature of your answers to these questions, you are not necessarily ineligible to receive a visa. For example, if you were arrested and/or convicted for a minor offense, and the consular officer is able to establish that such offense was in fact a misdemeanor, your arrest and/or conviction would not necessarily make you ineligible for a visa.) (Give the correct answer to the following questions by circling 'Yes\" or \"No\") (a) (Have you ever been arrested for, charged Yes No indicted fors or convicted crime or other offense?) (b) (Have you ever been confined in a civilian prison or Jail?)"
}
