{
	"anumber": "A17210305",
	"id": "A17210305_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Naturalization,, 16—52883-7"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023, 1922]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 7. Execution of petition.-You must sign the petition in your full, true, and correct name. The petition must be made under oath. If you are in the United States, your statements may be sworn to- (a) before an officer of the Immigration and Naturalization Service, without payment of fee, or (b) before a notary public or other officer authorized to administer oaths for general purposes; in such cases, the official seal or certificate of authority to administer oaths must be affixed. If you are outside the United States, the petition must be sworn to before a consular officer of the United States. 8. Submission of petition.-If you are residing in the United States, send the completed petition, in duplicate, to the office of Immigration and Naturalization Service located nearest to your place of residence. If you are residing outside the United States, mail the petition to the Commissioner of Immigration and Naturalization, Washington 25, D. C., United States of America. In all cases where the beneficiary of the petition is an unmarried child approaching the age of 21 years, the petition must be submitted in sufficient time for action to be completed on the petition and for the child to obtain the immigration visa and reach the United States before the date on which he will attain the age of 21 years. 9. Documents to be submitted.- (a) If you are a citizen by reason of birth in the United States, submit (1) your birth certificate, or (2) if birth certificate is unobtainable, copy of your baptismal certificate under seal of the church, showing place of birth (baptism must h occurred within 2 months after birth), or (3) if birth or baptismal certificate cannot be obtained affidavits of two United States citizens who have personal knowledge of your birth in the United States. (b) If you were born outside of the United States, became a citizen through the naturalization or citizenship of a parent, and have not been issued a certificate of citizenship in your own name, submit (1) a copy of your birth or baptismal certificate; (2) a certified copy of your parent's birth certificate, if your parent was born in the United States; (3) a copy of your parents' marriage certificate; and (4) documentary evidence of the legal termination of any prior mar- riages of either of your parents. (c) If you became a United States citizen through the naturalization or citizenship of your husband or a former husband, and have not been issued a certificate of citizenship in your own name, submit (1) documentary proof of your lawful mar riage; (2) a certified copy of your husband's birth or baptismal certificate, if he was born in the United States; and (3) documentary evidence of the legal termination of any prior marriage entered into by you or your husband. (d) If your naturalization, or that of the person through whom you claim citizenship occurred within 90 days immediately preceding the filing of the petition for issuance of immigrant visa, or if the naturalization occurred prior to September 27, 1906, the naturalization certificate must accompany the petition. (e) If you are of the female sex and married prior to September 22, 1922, you must submit evidence of the citizenship of your husband at the time of such marriage. (f) If petition is submitted on behalf of a wife or husband, it must be accompanied by a certificate showing marriage to the beneficiary and documentary proof of legal termination of any and all previous marriages of both wife and husband. (g) If petition is submitted on behalf of a child, proof of marriage of the parents of such child and birth certificate of the child must accompany the application. (h) If petition is submitted on behalf of a brother or sister, your own birth certificate and the birth certificate of the beneficiary showing a common mother must accompany this application. If the petition is on behalf of a brother or sister having a common father and different mothers proof of marriage of your parents must accompany this application. (i) If petition is submitted on behalf of a parent, your own birth certificate and marriage certificate of your parents must accompany this application. (j) If the prospective immigrant for whom you are petitioning has ever been deported, ordered deported, granted voluntary departure in lieu of deportation, been excluded from admission into the United States, or removed under section 28 of the Immigration Act of 1917, or section 250 of the Immigration and Nationality Act, the facts concerning such proceeding must accompany the petition form in a separate statement showing the date and reason for such proceeding, the port of departure and the residence address of the prospective immigrant at the time the proceeding was instituted. 10. Penalties.-Title 18, United States Code, section 1540, provides: \"Whoever knowingly makes under oath any false statement with respect to a material fact in any application, affidavit, or other document required by the immigration laws or regula- tions prescribed thereunder, or knowingly presents any such application, affidavit, or other document containing any such false statements, shall be fined not more than $2,000 or imprisoned not more than 5 years, or both.\" Title 18, United States Code, section 1426 (h), provides: \"Whoever, without lawful authority, prints, photographs, makes, or executes any print or impression in the likeness of a * * * certificate of naturalization or citizenship, or any part thereof, shall be fined not more than $5,000 or imprisoned not more than 5 years, or both.\" 11. FEE.-A fee of ten dollars ($10) must accompany this petition. Remittances should be made payable to the \"Treasurer of the United States.\" If residing in the Virgin Islands, remittances should be drawn in favor of the \"Commissioner of Finance of the Virgin Islands.\" If residing in Guam, remittances should be drawn in favor of the \"Treasurer, Guam.\" Please do not submit cash fee or postage stamps. A postal, express, or bank money order, or equivalent is preferred. U. S. GOVERNMENT PRINTING OFFICE 16-52883-7 For sale by the Superintendent of Documents, U. S. Government Printing Office, Washington 25, D. C. 6"
}
