{
  "anumber": "A17210305",
  "id": "A17210305_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition by United States Citizen for Issuance of Immigrant Visa, Form I-133"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 Form I-133 Form approved. UNITED STATES DEPARTMENT OF JUST Budget Bureau No. 43-R029.7. IMMIGRATION AND NATURALIZATION SERVI File No. (Rev. 7-2-53) PETITION BY UNITED STATES CITIZEN FOR ISSUANCE OF IMMIGRANT VISA IMPORTANT.-Do not use this form unless you are a United States citizen and are petitioning for your wife, husband, child (regardless of age), parent, brother, or sister. See instruction No. 4 for cases in which petitions cannot be approved. This form must be typewritten or printed legibly with pen and ink, and submitted in duplicate, unless you are petitioning for more than one beneficiary (see instruction No. 3), in which case a copy for each Consulate at which applications for visas will be made must be submitted. If you are residing in the United States, send the completed petition, in duplicate, to the office of the Immigration and Naturalization Service located nearest to your place of residence. If you are residing outside the United States, mail the petition to the Commissioner of Immigration and Naturalization, Washington 25, D. C., United States of America. You must answer ALL of the numbered questions and all other questions which may be applicable. Attach the required remittance in the sum of $10. (See instruction on last page.) (NOT TO BE FILLED IN BY PETITIONER) Action by District Director at Approved Disapproved Date (Signature of District Director) ON APPEAL OR CERTIFICATION Approved Disapproved Date (Signature of Chairman, Board of Immigration Appeals) Remarks: NOTICE TO DEPARTMENT OF STATE: Considered, and the Secretary of State is hereby respectfully informed that the persons on whose behalf the petition is filed is entitled to the status indicated: Nonquota status under section 101 (a) (27) (A) of the Immigration and Nationality Act, as to beneficiary No. Preference status under section 203 (a) (2) of the Immigration and Nationality Act, as to beneficiary No. Preference status under section 203 (a) (4) of the Immigration and Nationality Act, as to beneficiary No. Petition was filed on (Signature) (Title) (PETITIONER NOT TO WRITE ABOVE THIS LINE) IMMIGRATION AND NATURALIZATION SERVICE: Sema Joy Josefi Lacks I, , (Full name; if married woman, also show maiden name) whose residence in the United States is at 1229. No. New Hampshire , Los Angeles 29, California , (If none, state \"None\") None and whose residence abroad is at , Shanghai (If none, state \"None\") China July 20, 1913 was born at on , and (City) (State or country) am a citizen of the United States and request the Commissioner of Immigration and Naturalization to approve my petition for issuance of immigrant visa for the person named below and to notify the Secretary of State of the classification of such person. 1. Location of American consulate(s) to which application for visa (s) will be made: Vancouver, B. Co, Canada 16-52888-7 1"
}