{
  "anumber": "A17212360",
  "id": "A17212360_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1930,
        1915,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ALIEN EMPLOYMENT CERTI CATION Budget Bureau No. 44-R1301 Expiration Date: 8/31/66 A - STATEMENT OF QUALIFICATIONS OF ALIEN (ES-575A) IDENTIFYING AND PERSONAL DATA capital letters) (First name) (Middle name) (Maiden name, if alien is a married woman) OF ALIEN WONG YUK 2. ALIEN'S BIRTHDATE 3. BIRTHPLACE (City or town) (State or Province) (Country) 4. PRESENT NATIONALITY OR CITI- ZENSHIP 26th Apr. 1915 Amoy Fukien China Chinese 5. PRESENT ADDRESS (Number and Street) (City or town) (State or Province) (Country) 78, Lok Shan Rd., 7/F, Block 17, Hong Kong 6. ADDRESS IN UNITED STATES WHERE ALIEN WILL RESIDE 1114 Calle Vista Drive, Beverly Hills, California 7. KIND OF WORK ALIEN IS SEEKING 8. IF ALIEN IS SEEKING CHANGE OF CLASSIFICATION GIVE TYPE OF VISA NOW HELD General amah 9. EDUCATION AND TRAINING DEGREES OR NAMES AND ADDRESSES OF SCHOOLS, FIELD OF STUDY FROM TO CERTIFICATES COLLEGES OR UNIVERSITIES RECEIVED Amoy Middle School Chinese subject 1930 1932 Fukien, China SPECIAL QUALIFICATIONS AND SKILLS 10. DESCRIBE SPECIAL QUALIFICATIONS POSSESSED (List any certificates or licenses that give evidence of alien's abilities. For example, as re- quired for employment in occupations such as architect, engineer, lawyer, physician, surgeon, teacher). None 11. DESCRIBE ANY SPECIAL SKILLS ALIEN POSSESSES AND PROFICIENCY IN THE USE OF TOOLS, MACHINES OR EQUIPMENT. None 12. GIVE ANY ADDITIONAL INFORMATION CONCERNING ALIEN NOT GIVEN ELSEWHERE WHICH WOULD HELP ESTABLISH ALIEN'S QUALIFI- CATIONS. None 13. LIST DOCUMENTS ATTACHED WHICH ARE SUBMITTED AS EVIDENCE THAT ALIEN POSSESSES THE EDUCATION, TRAINING, EXPERIENCE AND ABILITIES REPRESENTED. (MAKE NO ENTRY IN THIS SECTION - FOR DEPARTMENT USE ONLY) (SEE OVER)"
}