{
  "anumber": "A17210305",
  "id": "A17210305_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA, FORM FS-552"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Australia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 FORM FS-552 6-6-60 DEPARTMENT OF STATE STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA 400 8 CERTIFICATE REGARDING DOCUMENTS REQUIRED BY 22 CFR 42.111 (b) OF THE 1. WHICH ARE UNOBTAINABLE I, the undersigned Vice Consul of the United States of America in and for the consular district of have determined that the document(s) indicated below is (are) unobtainable by Michael JOSEFI , an applicant for an immigrant yisa) for the following reasons: The document(s) is (are) considered to be unobtainable because it (they) cannot be procured without causing to the applicant or a member of his family actual hardship, other than normal delay or inconvenience. He (she) does not wish to attempt to obtain such document(s) from the present Communist or Communist- controlled government of his (her) native country, for personal and/or political reasons. There is attached in lieu of the required document(s): (a) A certificate from the appropriate authority showing that in this particular case the missing document was never properly recorded, together with: (b) (describe the secondary evidence and give your reasons for accepting it) Has not lived in australia since 1950 German and Canadian certificates are clear Background investigation negative Date 9/22/67 Richard L. Baguall (signature) (SEAL) Unobtainable documentation: Birth certificate Police certificate(s) from australia Military record Marriage certificate Death certificate Divorce decree (other, describe)"
}