{
	"anumber": "A17210305",
	"id": "A17210305_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510, German 4-63, Screeneded by NARA, 7/11/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (German) 4-63 Screened by NARA, 7/11/2023 Page 4 (8) Können Sie, falls Sie über 16 Jahre alt sind, irgendeine Sprache oder Mundart lesen und verstehen? (Can you, if you Yes No are over sixteen, read and understand some language or dialect?) Ja Nein (9) Haben Sie jemals gegen Bezahlung einem anderen Nichtamerikaner bei seiner gesetzwidrigen Einreise in die Ver- einigten Staaten oder Versuch einer Einreise Hilfe geleistet? (Have you for gain ever assisted another alien to enter Ja Nein the United States or try to enter the United States in violation of the laws of the United States?) (10) Sind Sie ein früherer Austauschbesucher und haben Sie sich nach Ihrer Abreise von den Vereinigten Staaten weniger als zwei Jahre außerhalb derselben aufgehalten? (Are you a former exchange visitor who has not resided abroad for Ja. Nein two years following your departure from the United States?) (11) Sind Sie oder waren Sie jemals (Are you now or have you ever been) (a) Anarchist? (an anarchist?) Ja Nein (b) Befürworter der Gegnerschaft jeglicher staatlichen Ordnung? (an advocate of opposition to all organized govern- ment?) Ja Nein (c) Befürworter des Kommunismus? (an advocate of Communism?) Ja Nein (d) Mitglied oder mittelbarer Angehöriger der Kommunistischen Partei, einer ihr angeschlossenen Verbände, einer Or- ganisation, die den Kommunismus befürwortet oder kommunistisch beherrscht oder gelenkt ist oder den gewalt- samen Umsturz jeder staatlichen Ordnung betreibt, oder Mitglied einer ähnlichen Organisation? (a member of, or affiliated with, the Communist Party or affiliated organization, an organization advocating Communism or a Com- Nein munist-dominated or controlled organization or an organization advocating the overthrow by force of all organized government or any other similar organization?) (ANMERKUNG: Bei Bejahung dieser Fragen ist eine Erklärung über die Daten und die Art Ihrer Betätigung oder Zu- gehörigkeit beizulegen.) (If the answer to any of the above questions is Yes, explain, giving dates and nature of activ- ities or membership.) (12) Beabsichtigen Sie, von Kanada, Mexiko oder einer den Vereinigten Staaten benachbarten Inseln aus innerhalb von zwei Jahren nach Ihrer dortigen Ankunft in die Vereinigten Staaten einzureisen? (Falls JA, so nennen Sie bitte die Verkehrs- linie, mit der Sie im betreffenden Land angekommen sind oder dorthin zu reisen beabsichtigen.) (Do you intend to enter the United States from Canada, Mexiko or an island adjacent to the United States within two years after arrival Ja Nein in such country or island?) (If answer is Yes, give the name of transportation company by which you entered or intend to enter such country or island.) 33. Wurde Ihnen beim Ausfüllen dieses Antrags geholfen? (Falls JA, so nennen Sie bitte Namen und Anschrift des Betreffenden, der diese Hilfe leistete, unter Angabe seines Verhältnisses zu Ihnen, ob Verwandter, Bekannter, Anwalt, Reiseburobediensteter, oder sonst.) Were you assisted in completing this application?) (If so, give name and address of person or persons assisting you indicating whether relative, friend, attorney, travel agent, or other) Name (Name) Anschrift (Address) Bei der Beantwortung der nachstehenden Ziff. 34 und 35 wird Ihnen der Konsulatsbeamte behilflich sein. (DO NOT WRITE BELOW THE FOLLOWING LINE. The consular officer will assist you in answering the following parts 34 and 35) 34. Der Ausschluß von der Erteilung eines Visums oder der Zulassung wegen Ziff. 32, Punkt ist auf mich nicht anwendbar, und zwar aus folgenden Gründen: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 32 for the following reason:) 35. Ich erkläre, daß ich Anrecht auf Vorzug innerhalb der Einwanderungsquote habe. (I claim to be a preference quota immigrant under the quota.) Ich erkläre, daß meine Einwanderung nicht auf eine Quote anzurechnen ist. (Nonquota immigrant.) Ich begründe dies mit folgendem (My claim is based on the following facts) Ich habe zur Kenntnis genommen, dass ich mein Visum am Orte, wo ich in die Vereinigten Staaten einzureisen beabsichtige, By 40s they's 6t dem Beamten der amerikanischen Einwanderungsbehörde aushändigen muss, und dass der Besitz eines Visums an sich mir nicht das Recht auf Zulassung in die Vereinigten Staaten gewährt, falls es sich dann herausstellen sollte, dass ich die von den Einwanderungs- gesetzen vorgeschriebenen Voraussetzungen für die Zulassung nicht erfülle. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inad- missible under the immigration laws.) Ich bin mir bewusst, dass jede von mir bei dieser Antragstellung wissentlich gemachte falsche oder irreführende Angabe oder vorsätzliche Verheimlichung eines wesentlichen Tatbestandes meine unwiderrufliche Ausschliessung aus den Vereinigten Staaten nach sich ziehen kann und, falls ich bereits in die Vereinigten Staaten zugelassen worden bin, mich der Strafverfolgung und Deportierung, oder beides, aussetzen würde. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may sub- ject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecu- tion and/or deportation.) Ich, unterzeichneter Antragsteller für ein amerikanisches Einwanderervisum schwöre hiermit (erkläre hiermit an Eidesstatt), dass sämtliche in diesem Antrag enthaltene Angaben-einschliesslich der unter Ziffer 32 eingekreisten Punkte-von mir gemacht wurden und nach meinem Wissen und Gewissen der vollständigen Wahrheit entsprechen. Sodann schwöre ich (erkläre ich an Eidesstatt), dass, falls mir die Einreise in die Vereinigten Staaten gewährt wird, ich keine Handlungen begehen werde, die dem öffentlichen Interesse ent- gegenwirken oder das Wohlergehen oder die. innere und äussere Sicherheit der Vereinigten Staaten gefährden würden, oder eine Tätig- keit aufnehmen werde, die von den amerikanischen Gesetzen über Spionage, Sabotage und Aufruhr untersagt ist oder zersetzend auf die staatliche Sicherheit einwirkt oder zum Ziel hat, unter Anwendung von gewaltsamen oder anderen verfassungswidrigen Mittel sich gegen die Regierung der Vereinigten Staaten aufzulehnen, die Regierung an sich zu reissen, oder sie zu stürzen; oder als Mitglied, mittelbarer Angehöriger oder Mitwirkender an einer Organisation teilzunehmen, die nach des Gesetzes über die Bekämpfung von staatsfeindlichen Umtrieben (Subversive Activities Control Act of 1950) der Registrierung untersteht. Die Bedeutung der vorstehenden Erklärungen 1st mir völlig klar, nachdem ich bei Ungewissheit jeweils die nötige Belehrung verlangt und erhalten habe. (I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the encircling of items in part 32, and are true and complete to the best of my knowl- edge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be pre- judicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with, or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to SEP 1957 Unterschrift des Antragstellers (Signature of Applicant) Vor mir am 19 unterzeichnet und beeidigt. (Subscribed and sworn to before me this day of 19 SERVICE NO. TA TEM NO. Pickard Begnall $5.00 EQUIV. Konsul der Vereinigten Stast von Amerika (Consular Officer) RICHARD L. BAGNALL 9968 American Vice Consul"
}
