{
	"anumber": "A17212360",
	"id": "A17212360_0055",
	"page_index": 55,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0055/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, 74"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1835, 1957, 1967, 1947, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "STATUTORY DECLARATION HONG KONG I, WONG YUK ( to H ) occupation: general amah residing 03 78, Lok nan Rd. , 7/F., Black 17, Hong Kong. Holder of Hong Kong Identity Card A591241 € STAMP do solemnly and sincerely declare that to the best of my knowledge, inforamtion Pand DUTY belief I was born on 26th April,1 1915 at Fukin, Amoy, China. I was hot married yet. My father Wong Ping Fai tx deceased on 1947 at Fukin, Amoy, China My mother Shiu Chau E deceased on 1957 at Fukin, Amoy, China My brother Wong Cheong Pak 78, Lok Shan Rd., 7/F. Black 17,HK I have never don't have any blood relatives or relationship in the United States. I have never applied for a visa or other documentation to enter the United States. The last time I left the mainland China Was on 1949. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this 8 JUL 1966ay of through the interpretation of ShRick the said Shufnich having been also first declared that he had truly, distinctly, and audibly interpreted the contents of this docu- ment to the declarant, and that he 3. would truly and faithfully interpret the declaration about to be adminis- tered to him/her. Before me, becker K.C. CHEUNG A Commissioner etc, I, SHUM PUI CHILLIN , do solemnly and sincerely declare that I well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted the contents of this document to the declarant Wong Yuk and that I will truly and faithfully interpret the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong this 18 JUL 1967 day of , 19 Before me. been Commissioner etc."
}
