{
	"anumber": "A17210305",
	"id": "A17210305_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0002/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ALIEN STATUS VERIFICATION, WR 6 (9/75"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 STATE OF CALIFORNIA - HEALTH AND WELFARE AGENC DEPARTMENT OF BENEFIT PAYMENTS Required Form No Substitute Permitted ALIEN STATUS VERIFICATION Instructions on Reverse Side ENTER ADDRESS OF INS OFFICE FOR COUNTY USE ONLY UNITED STATES DEPARTMENT OF JUSTICE CASE NAME IMMIGRATION AND NATURALIZATION SERVICE 300 NORTH LOS ANGELES STREET CASE Michael NUMBER Tosafi LOS ANGELES, CALIFORNIA 1913-4206721 REFERRAL TO INS (CHECK ONE) DATE AND INITIAL FIRST REFERRAL NOT REQUIRED FOLLOWUP 3-15-220M ALIEN INFORMATION - TO BE COMPLETED FOR EVERY ALIEN ALIEN'S NAME MIDDLE MAIDEN SEX NAME AT TIME OF ENTRY (MAIDEN OR ALIAS) JoseFil LAST FIRST Michael MALE FEMALE CURRENT SOCIAL SECURITY NUMBER michael DATE OF ENTRY (MONTH, DAY, YEART Josafe 5154 SummeR Blood ADDRESS 553862804 11-24-67 BIRTHDATE (MONTH, DAY, YEAR) FATHER'S NAME FIRST MIDDLE PORT OF ENTRY 10-14-05 Josefe LAST Ernest MMN. LA Ca BIRTHPLACE MOTHER'S NAME LAST FIRST MIDDLE DESTINATION IN U.S. AT TIME OF ENTRY India or Gresh Eerohope ameha MMN LAC DOCUMENTATION - INS FORM I-151: A 17210305 CITIZEN OF WHAT COUNTRY AND NUMBER: OTHER Canada CERTIFICATION/AFFIDAVIT - CHECK ONE BOX BELOW ONLY IF YOU DO NOT HAVE INS DOCUMENTS I CERTIFY THAT: Named alien is in the country legally and entitled to remain indefinitely; OR Named alien is not under order for deportation; OR Named alien is married to a person in the U.S. who is not under order for deportation; OR Affidavits of two U.S. citizens attesting to named alien's continuous residence in the U.S. for five or more years have been submitted to the County Welfare Department. I understand that the welfare department may forward this information to the United States Immigration and Naturalization Service for verification, that the Immigration and Naturalization Service may furnish information to the welfare department, and that I (if parent or caretaker) and alien must cooperate with INS in verifying named alien's status or alien will be ineligible for assistance. I certify under penalty of perjury that the information contained on this form relating to the named alien is true to the best of my knowledge. SIGNATURE RELATIONSHIP TO ALIEN DATE AND PLACE OF SIGNATURE VERIFICATION - FOR INS USE ONLY According to the records of the Immigration and Naturalization Service (INS), the subject alien: Is legally present in the United States. That is, either lawfully admitted for permanent residence, or otherwise permanently residing in the United States under color of law as defined by the following categories: - A refugee lawfully in the U.S. - A parolee lawfully in the U.S. for an indefinite period. - A person granted indefinite voluntary departure in lieu of deportation. - A person granted an indefinite stay of deportation. Is NOT legally present in the United States in accordance with the foregoing criteria; Failed to comply with a notice to appear at an INS office to discuss his status; Refused to provide information needed by INS to establish his status; Clarification of alien's status is in process - resubmit WR 6 in 60 days. SIGNATURE OF INS OFFICIAL ENTER ADDRESS OF COUNTY WELFARE DEPARTMENT METRO NORTH FAMILY DISTRICT 2910 West Beverly Blvd. TITLE EVERETTE it. GAVIN Los Angeles, Ca. 90057 Supervisory Criminal Investigator DATE FEB 25 1978 WR 6 (9/75)"
}
