{
  "anumber": "A17221191",
  "id": "A17221191_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "American Consulate General, Hong Kong BCC, A17 221 191"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1928,
        1937,
        1968,
        2023,
        1967,
        1964,
        1961,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 A17 221 191 FOIA (b)(6) TC/China American Consulate General, Hong Kong BCC September 9, 1968 John L. Todd, Assistant District Director, Travel Control Immigration and Naturalization Service, Los Angeles, California Visa petitions in behalf of Wai-01 Ko Ng-A17 221 191; Yuk Lin Ng- FOIA (b)(6). The petitioner, Do Ng-A17 196 600, first entered the United States at San Pedro, California on August 15, 1937 as a derivative citizen of the United States. He admitted alienage on September 13, 1967 at Los Angeles, California and was lawfully admitted for permanent residence pursuant to provisions of Section 249 on November 29, 1967 at Los Angeles, California. Attached you will find a copy of state- ment made by the petitioner at the time of his admission of alienage and you will note that such testimony is consistent with the instant claim. The petitioner has submitted secondary evidence which is attached and consists of the following items: signature specimen form and recent individual photograph; three air letters directed to the petitioner by the beneficiary postmarked from 1961 to 1967 and certified as being consistent with the instant claimed relationship; 11 receipts for articles sent to the beneficiaries by the petitioners bearing post- marks from 1964 to 1968; four receipts for money orders in the amounts of $200.00 each dated from 1964 to 1965 reportedly depicting money sent to the beneficiary by the petitioner; affidavit executed by Dr. Robert Eng attesting to personal knowledge of the relationship as claimed by the petitioner; similar declaration executed by Look Ng attesting to personal knowledge of the relationship as claimed by the petitioner; statutory declaration executed by Sit Sui Ng attesting to knowledge of the relationship as claimed by the petitioner; similar statutory de- claration executed by Ng Hop Yuen attesting to similar knowledge; similar statutory declaration executed by Shep Chung Yan attesting to similar personal knowledge of the relationship as claimed by the peti- tioner. The petitioner testified on April 27, 1968 that he and the first named subject beneficiary were married for the first and only marriage for either party on March 1, 1928. He testified that the second named subject beneficiary was the third child born as issue of such marriage. The petitioner stated that he was born in Mun Lak village, Ku Cheng market, Sun Wui, K.T., China. Such village appears on page 91 of the Sun Wi Index Book. Report of interview of the peti- tioner is attached. On the basis of the interview, sworn testimony of the petitioner, review of his file, the allegations contained in the petitions, and the supporting evidence, it is concluded that the petitioner has established his claim to lawful permanent residence in the United of"
}