{
	"anumber": "A17220615",
	"id": "A17220615_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17220615_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Impersonation or Use of Altered/Fraudulent Document and/or Notice of Lifted I-186 and Request for Vindication, SW-409"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 AFile REPORT OF IMPERSONATION OR USE OF ALTERED/FRAUDULENT DOCUMENT AND/OR NOTICE OF LIFTED I-186 AND REQUEST FOR VOIDANCE TO: OIC San Xsidro, Calif. 1. PORT: SYS 2. FILE # A19979063. DATE: 3-19-70 4. Intercepted by: J. Charles , agency IMM on PEDESTRIAN X VEHICULAR lane 5. TRUE NAME OF ALTEN: BARRIOS-Urena, Silvero 6. PLACE OF BIRTH: 7. DATE OF BIRTH: 6-20-12 MARITAL STATUS: \"arried 8. DESCRIPTION: Height Weight Hair Eyes Marks or scars 9. ALLEGED RESIDENCE: Calle B Razon # 90 C Hgo, Ti juana B.C. Mov. 10. Presented Form I- 186 (Revised 8-7 66 ) Number 2425763 Issued at SYS on 4-29-66 lla. Document was lifted because: Subject was referred to the Public Health Service for Xray and was discovered to have ATT Pulmonary YOU ARE INADMISSIBLE In THE UNITED STATES UNDER SEOTION 212(A)(6) OF THE IMMIGRATION AND NATIONALITY AOT # THAT YOU HAVE REEN CERTIFIED BY U.S. PUBLIC HEALTH SERVICE AS BEING AFFLICIED WITH TUBERCULOSIS. 11b. Document issued in name of and altered as follows: 12. Altered or fraudulent document obtained at: on in the following manner: 13. Altered or made by: Physical description: Price paid 14. Criminal record of subject: 15. Immigration record, or in U.S. previously: 16. DISPOSITION: RELEASED TO INVEST. for possible prosecution (Signature) (Immigrant Inspector) Reviewed and approved. (Signature) W.A. Rule (Supervisory Immigrant Inspector) SW-409 (Rev. 4-19-66)(10)"
}
