{
  "anumber": "A17221191",
  "id": "A17221191_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AMIGRANT VISA AND ALIEN REGISTRATION, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 UNITED ST ; OF AMERICA MMIGRANT VISA AND ALIEN REGISTRATION or. I- 1888758 (Family name) (First name) (Middle name) NG KO Wai Oi PORT OF ACTION OF SPECIAL INQUIRY OFFICER aka KO Wai Oi The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in the United States at this port on and{ no appeal taken under appeal taken PAHTWO Symbol (Name of vessel or flight No. of aircraft) and was inspected by me and U. S. IMMIGRATION Section of the Immigration and HONOLULU, MAWAII 492 Nationality Act. MAY 6 1969 ADMITTED Pa.1 Special Inquiry Officer. (CLASS) detained for further inquiriey special officer under Symbol ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act EXCLUDED Src. Inspector DATE 1/22/191 This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Consulate General facts stated in the application. IMMIGRANT CLASSIFICATION AT Hong Kong NONQUOTA (Symbol) QUOTA (Symbol) P2-1 VISA PETITION NO., IF ANY VP 9/9/68, Los Angeles Samuel Karp P2, enclosed. American Consul of the United States of America. IMMIGRANT VISA NO. QUOTA 15138 China ISSUED ON (Day) (Month) (Year) 7 March 1969 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 6 July 1969 NATIONALITY (If state/ess, so state, and give previous nationality) Chinese PASSPORT OGHAI H AT ASPED NO. FOREION SERVICE Passport waived under 22 CFR 42.6(c) OR OTHER TRAVEL DOCUMENTS (Describe) UNITED STATES OF AMERICA Service No. ISSUED Tariff Item No. Fee Paid $20 V TO BY Local Cy equiv. Sec. 212 (a) (14) not ON semmarily required STATISTICS EXPIRES FORM FS-511 5-61 FORM I-151 Issued 16-74587-2 U.S. GOVERNMENT PRINTING OFFICE"
}