{
	"anumber": "A17220615",
	"id": "A17220615_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17220615_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, Form I-213 ( (Rev. 5-1-71)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31-.34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion SALDIVAR E BARRIOS, SIMONA BLK BRN MEDIUM Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation MEXICO United States Address 73-27/1484 Mexico A19 925 239 LOS (Residence) laboror (Number) (Street) (City) (State) Scars or Marks 325 Juliana St. Anahoim Californ none visible Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Single Married 3/28/72 POE SYS w/ I-386 3-2 visitor (15 days) Seporated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension Jeres 200. Maxioo Birthdate Date of Action Location Code (At/Near) Date & Hour 11/28/16 4/6/72 LOS City, Province (State) and Country of Birth LOS AR Form: (Type & No.) 4/6/72 2pm By Lifted Juares Chin. Mexico I-186 Lost Not Lifted Visa Issued At licks, Social Security Account Name Status at Entry Status When Found Date Visa Issued Simona S. Parrios T/V other Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. To: Immigration Record 545 86 4906 LOS Criminal Record over one year one prior claimed Analléim. Cal. 1970 Name, Address, and Nationality of Spouse (Moiden Nome, if appropriate) N/C Number & Nationality of Minor Children Silverio Barrios Ureno LOS Ill Alien 4 Mox CO Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known Juan Zac. Mexico Petra Zac. Mexico Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 Yes No Not Listed Listed, Code RAZAZ Name and Address of (Last) (Current) U.S. Employer From: To: Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last entry, and elements which establish admin- istrative and/or criminal violation. Indicate means and route of travel to interior.) he above described subject is a citizen of Mexico, she has never been admitted to the United States for permanent residency. The subject last entered the United States as set forth above for the purpose of finding employment. he subject entered with her four children and they are presently attending school here in the United States. he subject's huband who is also here in the United States illegally, entered the United States in June 1971. The Subject has no equity in the United States,, and is being extended a I-210 letter until 5/6/72. Children. FOIA (b)(6) PER INSTRUCTIONS OF INVESTIGATOR E. EDWARDS. (If space insufficient, show \"continued\" and continue on reverse, from bottom up): OCKET Received (sub ject and documents) (report of interview) CONTROLLES, (Signature and Title) DISTRIBUTION from 1 Stat. 1 A File UNDER Officer: above 1 A File A19 915 232 April 6, 1972 at 2:20 P ). M. , Disposition I-210 letter issued til 5/6/72 12mm (Receiving Officer) Williams Form I-213 (Rev. 5-1-71)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
