{
  "anumber": "A17210305",
  "id": "A17210305_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form I-387"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 Form I-337 (Old 637) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (Rev. 7-1-48) BOND CONDITIONED FOR DEPARTURE OF AN ALIEN TEMPORARILY ADMITTED UNDER THE IMMIGRATION ACT OF 1924 AS A TOURIST OR VISITOR FOR BUSINESS OR PLEASURE (NOTE.-Instructions on Form I-308 should be strictly followed in preparing this bond) 1600-101324 MICHAEL JOSEFI (Name of alien) January 28, 1952 , 19 Examined and approved as to legal form and execution, and accepted. melso R Immigration and Naturalization Officer in Charge. Chief Border Patrol Section KNOW ALL MEN BY THESE PRESENTS: 1 That we, Joy Lacks, surety 2 Residing at 1549 North Western Avenue, Hollywood, California 3 and 4 Residing at 5 are held and firmly bound unto the people of the United States of America in the full and just sum 6 of Five Hundred dollars ($ 500, ), as liquidated damages and not as a penalty, to be paid 7 to the United States of America, for which payment, well and truly to be made, without relief from valuation or 8 appraisement laws, we bind ourselves and each of us, our heirs, executors, administrators, successors and assigns, 9 jointly and severally, firmly by these presents. 10 Sealed with our seals and dated this 28th day of January 19 52 , 11 WHEREAS, Michael Josefi an alien, aged 46 years, native 12 of India who arrived at the port of Montreal Quebec, Canada 13 per unknown on the unknown day of unknown 19 14 has applied for permission to enter or remain temporarily in the United States as (Insert \"tourist,\" \"visitor for 15 a visitor for pleasure business,\" or \"visitor for pleasure,\" stating nature of visit or tour and kind of business) 16 17 18 19 20 and by such application has agreed to abide by the laws and regulations and the conditions imposed thereunder as 21 the condition to his admission (or to the extension of the period of his admission), 22 Now, THEREFORE, the conditions of this bond are such that if the said alien is admitted temporarily as a 23 tourist or visitor for business or pleasure (or is granted an extension of the period of his admission for such 24 purpose or purposes), and if the said alien shall actually depart permanently from the United States without ex- 25 pense thereto upon his failure to comply with the conditions of his admission day (or of the extension of the period a date twen ty -nine 26 of his admission) and in any event on or before from date of admission or such subsequent date as may 27 by proper order be fixed in extension of such date and if the immigration officer in charge of the port of 28 unknown shall receive from the above-bounden obligors at least five (5) days prior to 29 such departure information as to the date thereof and name or designation of the vessel or other means of con- 30 veyance by which the alien shall depart 31 32 33 34 then this obligation to be void; otherwise to remain in full force and virtue. 16-61581-1"
}