{
	"anumber": "A17221191",
	"id": "A17221191_0055",
	"page_index": 55,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0055/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION REGARDING TUBERCULOSIS IN ALIEN APPLICANTS, NARA, 8/25/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 BARLOW SANATORIUM AND HOSPITA INFORMATION REGARDING TUBERCULOSIS IN ALIEN APPLICANTS No alien who has an abnormal chest x-ray at the time of immigration, or has had pulmonary tuberculosis can be admitted to the United States without meeting the following requirements: 1. An alien applying for an immigrant visa to the United States must agree to have the status of his or her tuberculous condition evaluated upon arrival in this country. 2. A statement must be given by a director or staff physician of a hospital recognized by the U.S. Public Health Service as an institution for the treatment of tuberculosis that the necessary medical evaluation and treatment will be supplied. 3. The alien must go directly to the specified hospital upon arrival in this country. 4. Prior to admission, the sponsor or other responsible individual must sign an affidavit that financial arrangements for the alien'scare have been made with the hospital. 5. Assurance must be given that the alien will submit to such exam- inations, treatment, isolation, and medical regimen which might be required, whether on an in-patient or out-patient basis, until discharge. 6. Responsibility for paying for any care that may be required must be assumed by either the sponsoring relatives of the alien or any other person assuming such responsibility. These aliens, like all others, must give assurance that they will not become public charges. Therefore, before the Barlow Sanatorium and Hospital, which is an approved hospital, can agree to accept such a person for study and treatment, if the latter is necessary, financial arrangements must be clearly under- stood and arranged in advance. Recognizing that most of the aliens coming to the United States do not have a large amount of money, the Barlow Sanatorium and Hospital partially subsidizes the cost of both diagnostic examinations and treatment, should the latter be necessary. The charges must be definitely understood before the agreement to accept the applicant is signed by the hospital. The diagnostic evaluation for persons who appear to have inactive disease usually requires one week or less in the hospital as an in-patient and includes followup for one year as an out-patient. The total cost to the patient is $350.00. This sum must be paid on admission. The applicant must realize, however, that if the tuberculosis is active and communicable, he or she must agree to be treated at his or her own expense or at the expense of his or her sponsor or family. Treatment cannot be given at public expense. The length of treatment ranges from 10 weeks to 6 months or longer. Be assured that with modern medications tuberculosis is very successfully treated."
}
