{
  "anumber": "A17210305",
  "id": "A17210305_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Public Voucher for Refunds, Standard Form No. 1048"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952,
        1967,
        2023,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 MEMORANDUM 1600-101324 Standard Form No. 1048 Form approved by Comptroller General U.S. PUBLIC VOUCHER Serial No. 237 September 20, 1927 FOR REFUNDS D.O. Voucher No. . U. S. Department of Justice, Imuigration & Naturalization Service (Department or Establishment, Bureau or Office) Location: Los Angeles, California Special Deposit, Bail, Departure and PAID BY Appropriation or Fund: Public Charge Bonds Joy Lacks To 1549 North Western Avenue Los Angeles 27, California Address (FOR USE OF PAYING OFFICE) Deposit received from the above-named depositor on January 28 , 19.52 for alien MICHAEL JOSEFI has been applied as herein stated and the balance indicated is returned herewith: Amount of deposit $ 500.00 Applied as explained in \"Remarks\" below Balance authorized to be refunded $ 500.00 Remarks: Form I-94 (c) T-2034877 issued to the alien at the time of his admission into the United States has been returned stamped by Canadian Immigration February 24, 1952, Douglas, B. D. , thus verifying his departure from the United States, therefore, bond posted in his behalf has been cancelled. oil DETROIT TO 7-24-53 Herman R. Landon April 24 19 52 (Memorandum- District Director Date , Do not sign) By: Title Certifying Officer Check No. , dated for $ { on Treasurer of the U. S. in favor of payee named above. Refund by (Signature File Cash, $ on of payee) $500. U.S. Treas. Bond, 1967-72 Series, Serial NeMomorandum- 217623 Do C. not sign) with 7/28/5442 Other method, $ No. 13 to 54 inc., commencing 6-15-52 attached. coupons (Describe) s. GOVERNMENT PRINTING OFFICE 16-9488"
}