{
	"anumber": "A17211293",
	"id": "A17211293_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17211293_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF APPROVAL OR REVALIDATION OF VISA PETITION, Form I-171"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1967, 2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/10/2023 ITED STATES DEPARTMENT OF JUST Immigration and Naturalization Service Los Angeles Calif. NOTICE OF APPROVAL OR REVALIDATION OF VISA PETITION 417-231-295 File Number: A172111.293 Date: January 2. 1968 day Dayaram Panchal Date Petition filed: October 13, 1967 2001 Na Linwood Ave. Date to which Santa Ana, Calif. Petition is valid: L Classification: 201(b) Please note the items below which are indicated by \"X\" marks concerning the visa petition filed by you in behalf of your mother and father The petition has been approved and forwarded to the United States Consulate at which the beneficiary or beneficiaries will apply for a visa. Any inquiry concerning the issuance of a visa should be directed to the Consulate at The petition has been revalidated and forwarded to the United States Consulate at which the benefi- ciary or beneficiaries will apply for a visa. Any inquiry concerning the issuance of a visa should be directed to the Consulate at It is indicated that the beneficiary does not require a visa to enter the United States. Notice of ap- proval of the petition has been forwarded to the intended United States port of entry. Please notify this office immediately of any change in the intended port of entry. The petition has been approved. No notice of approval of the petition has been sent to a United States Consulate or port of entry as it has not been indicated that the beneficiary(ies) will apply for visa(s) or for admission to the United States. The petition states that the beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident. The enclosed form (1-485) should be completed and sub- mitted by the beneficiary in accordance with the instructions contained therein. The petition has been revalidated. No notice of revalidation of the petition has been sent to a United States Consulate, as it has not been indicated that the beneficiary (ies) will apply for visa (s), If you become naturalized as a citizen of the United States and an immigrant visa has not yet been issued to the beneficiary, notify this office immediately, giving the date of your naturalization. This information may expedite the issuance of a visa to the beneficiary. If the petition was in behalf of your son or daughter, also advise whether that person is still unmarried. You are required to notify this office promptly if the employment or training specified in this petition is terminated before the expiration of the authorized stay in the United States of the beneficiary (ies) occurs. You are requested to advise the beneficiary (ies) that the acceptance of employment or training not specified in this petition will be a violation of the nonimmigrant status of the beneficiary (ies). Upon arrival in the United States, the initial period of admission of the beneficiary (ies) of your non- immigrant visa petition may not exceed the date to which the petition is valid. The temporary stay of the beneficiary (ies) named in your petition is extended to REMARKS: Very truly yours, DISTRICT DIRECTOR Form I-171 (Rev. 8-5-66)"
}
