{
	"anumber": "A17211293",
	"id": "A17211293_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17211293_0031/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "INDIA"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 A REV. 4-1-67 Screened by NARA, 7/10/2023 TC/245 FORM APPROVED UNITED STATES DEPARTMENT OF JUSTICE LOS 3-6-68 MAR 8 1968. BUDGET BUREAU No. 43-R436 BIOGRAPHIC INFORMATION A17 211 298 150 Immigration and Naturalization Service NAZA9 (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) BIRTHDATE (MO-DAY-YR.) NATIONALITY ALIEN REGISTRATION NO. MALE PANCHAL KAMLABEN D FEMALE 1/25/13 INDIA p (IF ANY) I-465086 ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (IF ANY) NONE BULSAR 2 INDIA FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER MISTRI DAYABHAI \"BULSAR, INDIA - DECEASED MOTHER (MAIDEN NAME) MISTRI GUNGA BULSAR, INDIA 2 INDIA SPOUSE (IF NONE, so STATE) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE, GIVE MAIDEN NAME) Mrs. PANCHAL DAYARAM 5/16/09 BULSAR, INDIA 2/10/24 BULSAR FORMER SPOUSES (IF NONE, so STATE) NONE FAMILY NAME(FOR WIFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 2001 M. LINWOOD AVE SANTA ANA CALIF U.SA 6/26 67 PRESENT TIME 33 MAHALAXMI SOCIETY ELLIS-BRIDGE AHEMEDABAD GUJARAT INDIA JUNE 55 6/26 67 I LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR NONE PRESENT TIME LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN NATURALIZATION ADJUSTMENT OF STATUS YOUR NATIVE ALPHABET IN THIS SPACE: OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING 2/21/68 x frinicial E4121H Y416 OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT OR PETITIONER) COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) (ALIEN REGISTRATION NUMBER) PANCHAL KAMLABEN DAYARAM A17 211 295 (OTHER AGENCY USE) (INS USE) LOS T/C /245 Check of FBI files 3/6/68 upon data submitted located no identifiable based IDATE) to information be partinent to your inquiry. Not arrest considered as clearance. To check FBI Identification Division. Fingerprints records request must be submitted to are necessary FORM 325A (2) Rec. Britive check."
}
