{
  "anumber": "A17210305",
  "id": "A17210305_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( German - 463, FS-510"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1958,
        1935,
        1952,
        1906,
        2023,
        1933,
        1931,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (German) 4-63 Screened by NARA, 7/11/2023 Page 2 19. Meine endgültige Anschrift in den Vereinigten Staaten (My final address in the United States is) 475 No. Oxford are Los Pngeles 90004 Clif. 20. Ich besitze an persönlichem Vermögen (My personal financial resources are) (a) Bargeld (Cash) D.M. 2500.00 $1000 (c) Haus- und Grundbesitz (Wert) (Real estate) (value) (b) Bank- und Sparkassenguthaben (Bank deposits) $4,000.00.0.5 (d) Anderes (Other) 21. Ich lege als Unterlage und Bestandteil meines Antrags die folgenden Dokumente bei (I am submitting the following personal doc- uments in support of and as part of my application) Geburtsurkunde (Birth certificate) Militärdienstzeugnis (Military record) Anstellungszusage (Promise of employment) Führungszeugnis (Police certificate(s) Nachweis über Unterhalt oder eigene Mittel Gesundheitszeugnis (Medical record(s)) (Evidence of support or own resources) Andere (Other) (describe) divorce Otificate 22. Name und gegenwärtige Anschrift des Ehepartners (bei der Ehegattin auch der Madchenname) (Name and present residence of my wife/husband is) (Give maiden name of wife) 23. Namen Anschriften meiner Kinder unter 21 Jahren (The names and addresses of my 21 years of age are) anna und Josefin, 45 Bachstelzenweg, Koln. children Vogelsang under FOIA (b)(6) 24. Namen meiner Fammenangenorigen, que zusammen mit mir auswangern (The names of members of my family who are immigrating with me are) anna Josefin 25. Name meines Vaters. Seine Anschrift (falls verstorben, wann) (The name and address of my father is) (If deceased, so state, giving date) Ernest Josefi deceased between 1933/1935. 26. Madchenname meiner Mutter. Ihre Anschrift (falls verstorben, wann) (The maiden name and/address of my mother is) (If deceased, so state, giving date) Amelia Yerschon deprased 27. Name und Anschrift meines nächsten Verwandten im Heimatland (The name and address of my next of kin in my home country is) none 28. Selt Vollendung meines 16. Lebensjahres habe ich für die Zeit von sechs Monaten oder länger die folgenden Wohnsitze gehabt (Since my sixteenth birthday my places of residence for 6 months or more have been) Ort Kreis/Landesteil/Bundesland Land Zeitdauer (von-bis) Beruf oder Beschäftigung (City or Town) (Province) (Country (Dates (From-To)) (Calling or occupation) Shanghain China 1906-March1926 Student manifa Pil. March1926 -ppril 1927 Store Clerk Shanghain Phina Qpril Sydney N.S.W. Qustralia Sppr, 1927 april Melbourne Victoria Qustralia april 19290wg 1931 Painter 39. Selt Vollendung meines 16. Lebensjahres war ich bzw. bin ich noch gegenwärtig Mitglied oder mittelbarer Angehöriger der folgen- den politischen, fachlichen, beruflichen oder geselligen Vereinigungen (Since my sixteenth birthday I am or have been a member or affiliate of the following political, professional, vocational or social organizations) Name und Anschrift Zeitdauer (von-bis) Angehörigkeitsverhaltnis und etwaige Funktionsposten (Name and address) (Dates (From-To)) (Type of membership and office held, if any) Painters Union Lorae 138 1952.1958 Vancouver, B.C Painters Union Love 116 Present 30. Ich sprechen bzw. lesen oder schreiben (einschließlich der Muttersprache) (I speak, read, write the following languages) (Include your native language) Sprache Sprechen Lesen Schreiben (Language) (Speak) (Read) (Write) English Yes Yes Yes German yes Yes No. 31. Ich war bereits früher in den Vereinigten Staaten zu folgenden Zeiten (anzugeben ist Jahr, sowie Art des Visums oder Status) (I have previously been in the United States during the following periods) (Give year and type of visa or status (If never, so state)) Jahr Art des Visums oder Status 1952 vylor Usa Montreal och nie in den Vereinig Sta"
}