{
	"anumber": "A17221191",
	"id": "A17221191_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, A719210"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States", "Australia"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 1956, 1835, 1911, 1968, 1934, 1948, 2023, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 GO. STATUTORY DECLARATION ORE30 I, KO Wai Oi ( ) alias NG KO Wai Oi 12 ), housew HONGA Residing at 341, Des Voeux Rd. W., 3/F, Hong Kong and holder of Hong Kong Identity Card No. A719210 STAMP OFFICER =03.00 do solemnly and sincerely declare that: 23 X1158 $ 9 c 1. I do not have any other name than those listed above. 2. To>the best of my knowledge, belief and information I was Boen Sun Wui (), Ku Jan Heung Nar Allage ( Digit # on 3. I was married to NG Do () alias NG Wah Cho # joi 30th Sept., 1911. and KWAN Luen Chi A in China (7E) Kwangtung Sun Wui (), Ku Jan Heung ( It ), , Man Lau Village ( FSFF ) on 1st March, 1928 according to the Chinese customary rites & ceremonies 4. My husband is now residing at 617E. Adams Blvd., Los Ang., Calif., 90011, U.S.A. 5. My blood father is KO Chun Pak My blood mother is LAM Yau Wor tt to 712 ) Both of them were deceased. 6. Out of the above mentioned marriage I have the following children:- a. NG Cheung Woo ), son, who was born on 27th Sept., 1934 in China and is now residing at 341, Des Voeux Rd. W., 3/F, Hong Kong. b. NG Yuk Hing y E sep), daughter, who was born on 23rd Dec., 1936 in China and is now residing at 480' Hea St., Coburg Victoria, Australia. C. NG Yuk Lin daughter, who was born on 29th Jan., 1948 in China and is now residing at 341, Des Voeux Rd. W., 3/F, Hong Kong. 7. I have not any brother or sister, halfbrother or halfsister, adopted brother or adopted sister, stepbrother or stepsister. 8. I have not any blood relatives or relatives through adoption in the United States except my husband who has been mentioned above. 9. My parents and my husband have not any brother or sister, halfbrother or halfsister, step- brother or stepsister, adopted brother or adopted sister. 10. The above mentioned marriage is my only marriage. 11. I have not applied for a visa, passport or other documentation to enter the United States. 12. The precise date that I last left Mainland of China was 1956. And I make this solemn declaration conscientiously believing the same to be true and by virtue of the provisions of the Statutory Declarations Act, 1835. Declared at the Courts of Justice, Hong Kong, this 3 DFC 1968 day of through the interpretation of CONSULATE UNITED STATES GENERAL OF AMERICA OF THE the said it 1968 having been also first declared that he had truly, distinctly, and audibly HONG KONG interpreted the contents of this document to the declarant, and that he would truly and faithfully interpret the declaration about to be administered to him/her. Before me. January PONG WING SAD A Commissioner etc. I, well understand the English and Chinese languages and that I have truly, distinctly, and audibly interpreted Ngkwoklun do solemnly and sincerely declare that I the contents of this document to the declarant Kowaiou and that I will truly and faithfully interpret. the declaration about to be administered to him/her. Declared at the Courts of Justice, Hong Kong this day of 23 DEC 1968 , 19 Nokwoklun Before me A Commissioner etc. FONG WING SAD"
}
