{
	"anumber": "A17229681",
	"id": "A17229681_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17229681_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFIED COPY, S.R.28092/4"
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1911, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CERTIFIED COPY of an Entry in an Army Register Book of Births deposited in the GENERAL REGISTER OFFICE, 1966 AUG 8 PM 3 : 27 SOMERSET HOUSE, LONDON. (1) PHOTO STATIC Copy (1.) ORIGINAL Copy Application Number :S.R. 28092/48 Certified extract from Army Book 112 (Register of Births) of the No. 5 Mountain Battery R.G.A. for the six months ended June 30th 1911 reported from the Military Station at Jutogh Baptismal Name Rank and Name and Signature Signature Name if Date and Surname and if a Maiden Description Date and of Officer added after Place of Name Nationality Soldier Surname and Residence Place of Registering Registration No. Birth if any Sex of Father Rgl.No. of Mother of Informant Registration the Birth of Birth 8 Nineteenth Boy John Battery Alice Certificate Eleventh H.R. Cook John February Cleary Q.M.Sergt. Cleary from Capt. J.W. April Major R.G.A. Edward 1911 (Irish) No.1750 formerly Scott R.A.M.C. 1911 Comdg. No. 5 M.B. Quetta Fox i/c Stn. Family Jutogh R.G.A. Hospl. Quetta 19.2.11 ORIGINALSEAN AND COMPARED CERTIFIED to be a true copy of an Entry relating to the Birth of John Edward Cleary deposited in the GENERAL REGISTER OFFICE, SOMERSET HOUSE, LONDON. AIN 00'S$ S'N GIVEN at the GENERAL REGISTER OFFICE, SOMERSET HOUSE, LONDON, under the Seal of the said Office, the 15thday of February 1948. REGI ON WELL ON sum of two shillings and sixpence, exclusive of Inland Revenue Stamp (54 & 55 Vict., c. 39) of one penny, is payable for every certified copy of an entry of birth, marriage or death, in addition to any fee required to be paid for a search in the indexes to enable the entry to be traced. (6 & 7 Wm. IV., c. 86, S. 37). MS pue tificate is issued in pursuance of and subject to the following Acts :-6 & 7 Will. IV., cap. 86, sec. 38; 24 & 25 Vict., cap. 98 sec. 36; 3 & 4 Geo. V., cap. 27, sec. 3, 5 & 6. DEPARTMENT & 7 Will. IV., cap. 86, sec. 38, enacts That all Certified Copies of Entries, purporting to be Sealed or Stamped with the Seal of the General Register Office, shall be received as evidence of the Birth, Death ONE ich the same relates, without any further or other proof of such Entry; and no Certified Copy purporting to be given in the said Office shall be of any force or effect which is not Sealed or Stamped as aforesaid.' PENNY"
}
