{
  "anumber": "A17210822",
  "id": "A17210822_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210822_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Panama",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968,
        1885
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/6/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R068.11 APPLICATION TO EXTEND TIME OF TEMPORARY STAY IMPORTANT PLEASE READ ATTACHED INSTRUCTIONS BEFORE FILLING OUT APPLICATION. TYRE OR PRINT IN INK WITH BLOCK LETTERS IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTIONS 79 ON THIS FORM USE A SEPARATE SHEET ANDIDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. PART I 1. FAMILY NAME (Capital Letters) First Name Middle Name FILE NUMBER MEYER ESTHER 2. OTHER NAMES (Include all other past and present names: a married woman must give her maiden name.) NEE RUBIN. 3. MAILING ADDRESS IN U.S. (Number and Street) (C/O) 136 So PALM DRIVE, BEVERLY (City \"HILLS (Zone) (State) CAUF 90212 4. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 10-19-1885 INDIA INDIA 5. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS OF LAST ARRIVAL 7-5-66 HONOLULU PANAM 6. PASSPORT NUMBER PASSPORT ISSUED BY (Name of Country) PASSPORT EXPIRES ON I-321947 INDIA 11-30-1968 7. MARITAL STATUS IF MARRIED, GIVE NAME AND ADDRESS OF SPOUSE WIDOW - JOSEPH NAMES AND ADDRESSES A. OF MEYER CHILDREN SON, 136 So PALM DRIVE, BEVERLY Hills, AUF 90212 8. OCCUPATION SOCIAL SECURITY NUMBER NONE 9. (Insert \"HAVE\" or \"HAVE NOT\") I BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. GIVE THE FOLLOWING: NAME AND ADDRESS OF EMPLOYER OR BUSINESS KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED 10. MEANS AND SOURCE OF SUPPORT WHILE IN THE UNITED STATES By MY SON - J. A. MEYER 11. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES: NAME RELATIONSHIP 136, So PALM DR. BEVERLY Hill CAUI 90212 ADDRESS JOSEPH A MEYER ONLY SON FOIA b)(6) 12. DATE ON WHICH AUTHORIZED STAY EXPIRES 13. DATE TO WHICH EXTENSION IS REQUESTED JAN 5, 1968 JULY 5, 1968 OR TILL AS LONG TRAVEL AS / CAN 14. REASON FOR COMING 10 THE UNITED STATES To BE WITH MY ONLY Son, HIS KIFE AND MY GRANDCHICDRON 15. To REASON BE FOR WITH REQUESTING MY EXTENSION SON AND GRANDCHILDREN -THEY ARE THE ONLY LIVING RELATIONS / HAVE TO LOOK AFTER ME IN MY OLD AGE AND FAILING HEALTH 16. I ATTACH WRITTEN STATEMENT OF CESARS -SINAI MEDICAL CENTER DATED 12-07-67 IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE, AND I MAKE IT PART OF THIS APPLI- CATION. (See paragraph 7 of instructions.) 17. DATE ON WHICH I WILL DEPART FROM U.S. NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. OF DEPARTURE 18. (Insert \"AM\" or \"AM NOT\") I AN NOT IN POSSESSION OF A TRANSPORTATION TICKET FOR MY DEPARTURE. I certify that the above is true and correct. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT. SIGNATURE OF APPLICANT Esther meyer I declare that this document was prepared by me at the request of the applicant and is based on all information of which have any knowledge SIGNATURE DATE 12-20-67 Ja hare CITY AND STATE ADDRESS: 136 So PALM DR. DATE: BEVERLY Hius CALIFORNIA BEVERLY HILLS, CALIF 90212 12-20-67 Form 1-539 (Rev. 11-1-64) Special Instructions for Students: After you have completed PART I, PART II must be completed by an authorized school official."
}