{
	"anumber": "A17210305",
	"id": "A17210305_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17210305_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ANtrag auf Erteilung eines Einwanderungsvisums und die Ausländermanmeldung, 4 Form Approved, Budget Bureau No. 4-7 R 150.2."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 German) Form Approved. Budget Bureau No. 47-R 150.2. DER AUSWARTIGE DIENST DER VEREINIGTEN STAATEN VON AMERIKA ANTRAG AUF ERTEILUNG EINES EINWANDERUNGSVISUMS UND DIE AUSLANDERANMELDUNG ANWEISUNG: Dieses Formblatt ist in ZWEI EXEMPLAREN augzufertigen, und zwar in Maschinenschrift oder, falls mit der Hand geschrieben, in deutlicher Druckschrift. SAMTLICHE Fragen, soweit sie zutreffen, müssen beantwortet werden. Fragen, die nicht zu- treffend sind, müssen entsprechend bezeichnet werden. Sollte für dieBeantwortung einer Frage auf dem Formblatt nicht genügend Platz sein, so kann die Beantwortung mit Angabe der entsprechenden Bezugsziffer auf einem besonderen Blatt in zwei Exemplaren vorgenommen werden. Die Zusatzblätter sind dem Antragsformular beizuheften. Das Formblatt ist NICHT ZU UNTERZEICHNEN, bevor der Konsulatsbeamte die Weisung dazu erteilt hat. Die Antragsgebühr für das Einwanderungsvisum beträgt $ 5.00. Diese Ge- bühr ist bei der Vorladung zum Konsulat in US-Dollar, in einheimischer Währung zum entsprechenden Wert oder mittels von einer Bank ausgestellten Schecks zu entrichten. WARNUNG: Falsche Angaben oder die Verheimlichung wesentlicher Tatsachen können für den Betreffenden die unwiderrufliche Aus- schließung aus den Vereinigten Staten zur Folge haben. Solte sich trotz genehmigter Einreise später ergeben, daß diese an Hand von falschen Angaben erwirkt wurde, so kann eine strafrechtliche Verfolgung oder die Ausweisung, oder beides, erfolgen. Ich stelle hiermit einen Antrag auf Einwanderungsvisum und die Ausländeranmeldung beim (bei der) U.S. in und mache hierzu die nachstehenden Angaben: (I for alien Consulate General hereby apply an immigrant visa and registration at the United States at Frank fort, Main and state the following facts:) 1. Familienname (My family name is) Rufname (My first name is) Andere Vornamen (My middle name is) Josefin Michael NM 2. Volle Namensangabe in der Sprache des Herkunftslandes (falls die Sprache ein anderes als das lateinische Alphabet verwendet) (My full name in native alphabet (If other than Roman letters are used) is) none 3. Andere Namen, deren sich der Antragsteller bedient hat oder unter denen er bekannt ist (bei verheirateten Frauen der Madchen- name) (Other names I have used or by which I have been known are (If married woman, give maiden name) 4. Geburtsdatum (The date of my birth is) 5. Geburtsort (My place of birth is) none Tag Monat Jahr Stadt/Ort Kreis/Landesteil/Bundesland Land (Day) (Month) (Year) (City or town) (Province) (Country) 14 10 1905 Bombay India 6. Alter (My age is) 7. Ich bin gegenwärtig (Beruf oder Beschäftigung) (My present calling or occupation is) 61 Painter and Decorator 8. Gegenwärtige Anschrift (My present address is) Koln- Boeklemund Venloer Str. 1410. 9. Geschlecht (My sex is) 10. Zivilstand (My marital status is) Männlich Weiblich Ledig (nie verheiratet gewesen) Verheiratet Verwitwet Geschieden Getrenntlebend (Male) (Female) (Single (never married)) (Married) (Widowed) (Divorced) (Separated) male Einschließlich meiner jetzigen Ehe bin ich mal verheiratet gewesen (Including my present marriage, I have been maried 2. times.) 11. Staatsangehörigkeit (My nationality is) Canadian. 12. Personalbeschreibung (My personal description is) 13. Sichtbare besondere Merkmale (I have the following visible marks of identification) (a) Haarfarbe (Color of hair) (c) Größe (Height) Grey 8 CHT (in.) 5. m (ft.) (b) Augenfarbe (Color of eyes) (d) Hautfarbe (Complexion) Operation Sear on left leg. Grey medium 14. Zweck der Reise nach den Vereinigten Staaten (My purpose in going to the United States is) To Immigrate. 15. Ich beabsichtige in den Vereinigten Staaten dauernd oder vor- 16. Ich beabsichtige, in die Vereinigten Staaten in (Hafen oder übergehend (Zeitangabe) (I intend to remain in the United Grenzübertrittsstelle) (I intend to enter the United States at States permanently or) (Give length of time) the port of) Permanently trouseal Detroit zu verbleiben einzureisen 17. Ich besitze eine (keine) Fahrkarte nach meinem endgültigen Bestimmungsort (I (Do) (Do not) have a ticket to my final destination) 18. (a) In den Vereinigten (sister) Staaten begebe ich Mrs mich zu Joy Lacks 18. (b) Die Bürgschaft stellt für mich folgende Einzelperson bzw. 475 N. Oxford Pre Los Angeles good (Name) Organisation (Anschrift ist anzugeben, wenn diese anders als unter (a) lautet: (I am sponsored by the following person (Anschrift) CIF, and/or organization) (Give address if different from (a)) (etw. Verwandtschaftsverhältnis) (I am going to the United States to join the following per- son) (Give name and address and relationship, if any) mrs Joy Lacks, (sister) DIESES FORMBLATT IST GRATIS BEI KONSULATEN DER VEREINIGTEN STAATEN VON AMERIKA ERHALTLICH."
}
