{
  "anumber": "A17221191",
  "id": "A17221191_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0041/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Sify Status of Alien Relative for Issuance of Immigrant Grant Visa, Form No. 4-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1967,
        2023,
        1911,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 Form approved. Budget Bureau No. 43-R401.4. PE' ON TO Date filed Fee stamp SIFY STATUS OF ALIEN RELATIVE FOR 1/31/68 ISSUANCE OF IMMI- Remarks GRANT VISA (Read this form and the attached instructions carefully before filling in petition) To THE SECRETARY OF STATE: The petition was filed on 1/31/68 The petition is revalidated: The petition is approved for status under section 203(a)(2) Remarks: See attached memoran- dum. Approval conditioned (District Director) (District Director) upon compatability of blood Los Angeles, California of petitioner and that of (District) (District) beneficiary spouse and bene- September 9, 1968 ficiary daughter. (Date) (Date) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. 2. Name $410.00 R Block I.-Information About Petitioner No (First name) (Middle name) (Last name) If you are a married woman, give your maiden name 3. I reside in United States at 617 E. Adams Blvd Lostangeles. Colit 90011 (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) Address abroad (if any) (Number and MYN Lolity with 4. I wäs born Nov. (Date) 9, 1911 (City SUN Wo: District or town) (State Province) Kwangt (Province) tj (Country) Chipa (Country) or 5. If you are a citizen of the United States, give the following: TIT Et X a. Was your citizenship acquired through birth in the United States, through naturalization, through parentage, or through marriage? (1) If acquired through naturalization, give number of naturalization certificate and date and place of naturalization: ENq mun LAK(V) 91 Ku Chieng mkt of (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate: (b) If not, submit evidence of citizenship in accordance with Instruction 3a(2). LAWFUL ADMISSION VERIFIED b. Have you or any person through whom you claim citizenship ever lost United States citizenship? 2-6 I-157 If so, attach detailed explanation on separate sheet. 6. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: A- 1-31-68 ha INITIALS 17196600 b. Date, place, and means of admission for lawful permanent residence Nov, 291 1967 Las Angeles Class 2-6 CONSULATE GENERAL U C. Have you ever lost status as a lawful permanent resident alien? No UNITED STATES OF AMERICA If so, explain: SEP1 1968 (If you are married to a citizen of the United States, read instruction 1b carefully) Form I-130 (Rev. 1-16-67) UNITED STATES DEPARTMENT OF JUSTICE-Immigration and Naturalization Service HONG KONG G-180 SENT FEB 1968"
}