{
  "anumber": "A17221191",
  "id": "A17221191_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17221191_0042/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Alien Relative"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1928,
        1971,
        1911,
        1968,
        1934,
        1948,
        2023,
        1936,
        1965
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "No. Mooring D/N Centifica Block II.-Information Screened by NARA. About 8/25/2023 Alien Beneficiary Hages -old 7yrd Ceremonies SAT ets it's 7. Name of alien WAi-Oi K (First name) NOOR Fook Village Ko Wai 09 (Last (Middle initial) Ng 12221191 name) If this petition is for a married woman, givesher maiden name. 8. Alien was born Sept (Date) 30,1911 A San (City town) Woi District (State Province) Kwangtung (Country) China or or 9. a. Relationship of alien to petitioner Wrife b. Is the alien related to you by adoption? No 10. Alien's marital status (Check appropriate block) Married Widowed Divorced Single a. Name of alien's spouse, if married, and date and country of birth Do Ng BORN Nev. 1911 MUN Low Village, SUN Woi District Kuantung China b. Names, birthdates and countries of birth of alien's children, if any Chung Sept 27, 1934 Kmoolvang China; yur Hing NO Dec 23, 1936 China; Yuk Lin Ng JANUARY29, 1948 Kwantung China C. 11. If this petition is for your spouse or child, give the following: Los Angeles (alif USA 90011, you at Nig (daughte).) Sam Chung Wen Ng Full address of alien's spouse and children, if any Do Ng. (Spouse) 6178 Adams Blvd 3ad Floor 341 Des Voeox Rd. West HongKong a. Date and place of your present marriage March by 1928, MuslawKillage b. Number of your prior marriages hone C. Number of prior marriages of spouse None d. Last address at which you and your spouse resided together Nathan Nathan Road (Apt. No.) Kouloon Hong KONG (Number and street) From (Town or city) (State or Province) (Country) 12. If this petition is for a child, a. Is the child married? b. Is the child your (Month) adopted 1948 (Year) child? To If (Month) so, give (Year) the 1948 names, dates, and places of birth of all other children adopted by you. If none, so state / the 21 5 IBAT 13. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 14. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner Lin Daughter 15. Have you ever filed a petition for this alien before? NOR No If so, give place and date of filing and result: 16. Has this alien ever been in the United States? No Has this alien ever been deported from the United States? No If so, give to Alien Registration Number, and date and place where deportation hearing was held: 17. Address in the United States where alien will reside 6/7 E. Adams Blvd Lostencel (490011 18. a. Address at which alien 1965 is presently residing 3rdFloor (Apt. No.) 341 (Number Des and Voeck street) (Town RdWost or city) (State) Ho ng Kong (ZIP Code, if in U.S.) Since (Month) (Year) b. If alien is in the United States, give the following: Name and address of present employer Date alien began this employment (Month) (Day) (Year) 19. Check the appropriate box below and furnish the information required for the box checked: a. Alien will apply for a visa abroad at the American Consulate in (City in foreign country) Hong (Foreign country) Long b. Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at , (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Block III.-Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Subscribed and sworn to (affirmed) before me this 31st Signature of petitioner (See Instruction No. 5) K. Do mg day of January A.D. 1968 at [SEAL] My commission expires CHESTER F. HUIE Notary Public Cal. COM EXP. MAY 23. 1971 - LOS ANGELES CO. (Signature of officer administering oath) (Title) Block IV. Signature of Person Preparing Form, if Other Than Petitioner Patro St. Los Angeles Call 90014 CHASTER F. declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any wledge THE COUNTY OF LOS ANGELES, STATE OF CALIFORNIA (Signature) (Address) (Date) 2"
}