{
	"anumber": "A17202075",
	"id": "A17202075_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17202075_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY VISIT,"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Iran", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1897, 1971, 1968, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-P068.11 APPLICATION TO EXTEND TIME OF TEMPORARY on Vo. No. 3844-8 IMPORTANT Date JAN 19 1968 $ 1000 PLEASE READ ATTACHED INSTRUCTIONS BEFORE FILLING OUT APPLICATION. TYPE OR PRINT IN INK WITH BLOCK LETTERS IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTIONS SLB C HECKED ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. PART I 1. FAMILY NAME (Capital Letters) First Name Middle Name FILE NUMBER FRAMJEE SHEHROO KEKI NONE 2. OTHER NAMES (Include all other past and present names; a married woman must give ber maiden name.) KARANJIA (maiden name) A17202075 3. MAILING ADDRESS IN U.S. (Number and Street) 1108 VIA NOGALES (City) PALOS VERDES EST. (Zone) 90274. (State)CALIF (C/O)MRS. D. IRANI 4. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP AUGUST 9 1897 INDIA INDIA 5. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS OF LAST ARRIVAL A4G 7th 1966 HONOLULU PAN AMERICAN 6. PASSPORT NUMBER PASSPORT ISSUED BY (Name of Country) PASSPORT EXPIRES ON I -255779 INDIA MARCH 9 1971 7. MARITAL STATUS IF MARRIED, GIVE NAME AND ADDRESS OF SPOUSE WIDOW K. D. FRAMJEE (deceased) NAMES AND ADDRESSES OF CHILDREN BAPSY IRANI 1108 UIA NOGALES, PALOS VERDES ESTATES, CALIF. 90274. 8. OCCUPATION SOCIAL SECURITY NUMBER HOUSE WIFE NONE 9. (Insert \"HAVE\" or \"HAVE NOT\") HAVE NOT BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. GIVE THE FOLLOWING: NAME AND ADDRESS OF EMPLOYER OR BUSINESS JAN 12 1968 JAN / 20 1968 KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED 10. MEANS AND SOURCE OF SUPPORT WHILE IN THE UNITED STATES MR. DARIUS IRAN, (Son in law) UNDER DOCKET CONTROL AT LOS 11. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES: NAME RELATIONSHIP ADDRESS BAPSY IRANI DAUGHTER 1108 VIA NOGALES PALOS VERDES EST CAUF. 90274. 12. DATE ON WHICH AUTHORIZED STAY EXPIRES 13. DATE TO WHICH EXTENSION IS REQUESTED 2 FEBRUARY 7 1968 AUGUST 7 1968 14. REASON FOR COMING TO THE UNITED STATES VISIT DAUGHTER AND GRANDCHILDREN 15. REASON FOR REQUESTING EXTENSION EXTEND VISIT WITH AUGHTER AND FAMILY. 16. I ATTACH WRITTEN STATEMENT OF NOT APPLICABLE DATED IN SUPPORT OF THIS APPLICATION I BELIEVE SUCH STATEMENT TO BE TRUE, AND I MAKE IT PART OF THIS APPLI- CATION. (See paragraph 7 of instructions.) 17. DATE ON WHICH I WILL DEPART FROM U.S. NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. AUGUST 7 1968 OF DEPARTURE PAN AMERICAN LOS ANGELES 18. (Insert AM\" or \"AM NOT\") I AM IN POSSESSION OF A TRANSPORTATION TICKET FOR MY DEPARTURE I certify that the above is true and correct. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT. SIGNATURE OF APPLICANT I declare that this document was prepared by me at the request of the applicant and Shehroo K Framjee is based on all information of which I have any knowledge. SIGNATURE DATE gan. 7th 1968. CITY AND STATE Palos Verdes Estates ADDRESS: DATE: California 90274 Form 1-539 (Rev. 11-1-64) Special Instructions for Students: After you have completed PART I, PART II must be completed by an authorized school official."
}
