{
  "anumber": "A17212360",
  "id": "A17212360_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EMPLOYER'S WORK ORDER, 00505"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "EMPLOYER'S WORK ORDER No. 00505 DESCRIPTION OF FAMILY DESCRIPTION OF HOME Husband's Name (None) No. of Stories 1 Rms. 6 Baths 4 Wife's Name: Mrs. Helen Halsey Will employee have private room ?Yes Bath ? Yes Children's names and ages None If other, describe TRANSPORTATION Home Address: 1114 Calle Vista Dr. Briefly describe the public transportation Beverly Hills, Calif. facilities to your home: Business Address: Bus is short walk from home. Also, shops are within walking distance CR 61847 Tel: Home OR Bus If no public transportation facilities are avail- Occupation: Husband able, what arrangements will you make for Occupation: Wife Housewife employee's transportation No. and Type of Pets None EMPLOYEE REQUIREMENTS AND DUTIES Type of employee(s) desired Cook-Housekeeper If you employ other help, describe None Will employee wear uniforms Yes Do you supply? Yes May the employee smoke ? No Describe duties with children None Describe Housework Requirements All housework Describe Cooking Requirements All cooking Do you require an advanced cook X good cook plain cook willing to learn X Will employee set dinner table ? Yes Serve at dinner table for family Yes guests Yes Do you have automatic washer-dryer? Yes dishwasher Yes Describe laundry requirements including hand laundering mostly all hand laundry mostly personal - other wash is sent out Describe type and amount (in hours) ironing about 2 hours weekly Do you require employee to be able to take complete charge of home during your absence for periods longer than a day? Yes Do you require the employee to be able to swim? not important Drive ? not important What time will employee normally start work each day 7:30 Finish 7:30 - 8:00 What is average amount of hours for employee's duties per day? about eight Do you agree to a daily rest period of one and one-half hours minimum completely off duty Yes The minimum off-duty per week is one and one half days or equivalent. The usual off-day is every Thursday and every other Sunday. Does this suit the routine of your home ? Yes If not, describe the days employee will be off duty Do you understand that on the employee's days off you are not entitled to ask her (him) to per- form any duties? Yes REMOVE CARBON PAPER BEFORE USING OTHER SIDE OF THIS FORM (See reverse side for Contract)"
}