{
  "anumber": "A17655095",
  "id": "A17655095_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17655095_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Block II – Information About Alien Beneficiary, K-450"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Hungary",
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1942,
        1903,
        1929,
        1904,
        1931,
        1933,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Block II.-Information About Alien Beneficiary me K-450 7. Name of alien Ilona Ellanor Klein NR (First name) (Middle initial) (Last name) If this petition/is for a married woman, give he maiden name Klein Nagyhalasz, Szabolcs, Hungary 8. Alien was born Oct. 20, 1904 (Date) (City or town) (State or Province) (Country) mother 9. a. Relationship of alien to petitioner b. Is the alien related to you by adoption? no 10. Alien's marital status (Check appropriate block) Married Widowed Divorced Single a. Name of alien's spouse, if married, and date and country, of birth Armin Klein Oct. 4, 1903 Ramocssahaza, Szabolcs, Hungary b. birthdates and of birth of alien's children, if William Klein Aug. 16, 1929 Names, countries any Mrs. Beatrice Binsky - Mar. 7, 1944 Lloyd Klein - Nov. 20, 1942 Mr.s. Rose Schwarz Jan 27,1931 - Mrs. M. Widlus - June 4, 1933 all born in Canada, C. Full address of alien's spouse and children, if any 855 Alexis Nihon Blvd Montreal, 9, Quebec, Canada 11. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse d. Last address at which you and your spouse resided together (Apt. No.) (Number and street) From To (Town or city) (State or Province) (Country) (Month) (Year) (Month) (Year) 12. If this petition is for a child, a. Is the child married? b. Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 13. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 14. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner Armin Klein - Stepfather 15. Have you ever filed a petition for this alien before? no If so, give place and date of filing and result: 16. Has this alien ever been in the United States? yes no Has this alien ever been deported from the United States? If so, give Alien Registration Number, and date and place where deportation hearing was held: 339 Ormsby Road, Akron, Ohio 17. Address in the United States where alien will reside 18. a. Address at which alien is presently residing 855 Alexis Nihon Blvd. Montreal, Quebec, Canad 1959 (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code, if in U.S.) Since (Month) (Year) b. If alien is in the United States, give the following: Name and address of present employer Date alien began this employment (Month) (Day) (Year) 19. Check the appropriate box below and furnish the information required for the box checked: a. Alien will apply for a visa abroad at the American Consulate in Montreal, Canada (City in foreign country) (Foreign country) b. Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at , (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in Montreal Canada (City in foreign country) (Foreign country) Block III.-Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 5) Martha Aidline Subscribed and sworn to (affirmed) before me this 16 day of nov A.D. 1966 at cleveland, ohio [SEAL] My commission expires walter L. Zajac 8mm. (Title) Insp (Signature of officer administering oath) Block IV. Signature of Person Preparing Form, if Other Than Petitioner I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any dge. (Signature) (Address) (Date) 2"
}