{
	"anumber": "A17655095",
	"id": "A17655095_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17655095_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 447-R150.2."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Hungary", "Canada", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "est of glish) M Approved. Budget Bureau No. 47-R150.2. DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa if $5.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be ground for your prosecution and/or deportation. I hereby apply for an immigrant visa and alien registration at the United States Consulate General phillip at Montreal, Quebec, Canada. and state the following facts: 1. My family name is My first name is My middle name is Klein Eleanor Ilona 2. My full name in native alphabet (If other than Roman letters are used) is 3. Other names I have used or by which I have been known are (If married woman, give maiden name) Klein (born Klein, first marriage to Klein, second marriage to Klein) 4. The date of my birth is 5. My place of birth is (Day) (Month) (Year) (City or town) (Province) (Country) 20 Oct. 1904 Nagh Halasz Szabolc Hungary 6. My age is 7. My present calling or occupation is 62 Saleslady 8. My present address is 855 Alexis Nihon Blvd., St. Laurent 9, Quebec, Canada. 9. My sex is 10. My marital status is Single (never married) Married Widowed Divorced Separated Male Female Including my present marriage, I have been married two times. 11. My nationality is Canadian 12. My personal description is 13. I have the following visible marks of identification (a) Color of hair (c) Height Brown 5 feet 3 inches (b) Color of eyes (d) Complexion Brown Medium 14. My purpose in going to the United States is to join my daughter and her family. 15. I intend to remain in the United States permanently or (Give length of 16. I intend to enter the United States at the port of time) Permanently Any legal port 17. I (Do) (Do Not) have a ticket to my final destination Do not 18. (a) I am going to the United States to join the following person (Give name 18. (b) I am sponsored by the following person and/or organization (Give and address and relationship, if any) address if different from (a)) Dr. and Mrs. Morris Widlus, 339 Ormsby Road, Mrs. Martha Widlus Akron 13, Ohio. My daughter and her husband. 19. My final address in the United States is c/o Dr & Mrs.Morris Widlus, 339 Ormsby Road, Akron 13, Ohio. 20. My personal financial resources are $50,000.00 (a) Cash (c) Real estate (value) (b) Bank deposits $4,000.00 Canada Savings Bonds $3,000.00 (d) Other THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
