{
	"anumber": "A17748805",
	"id": "A17748805_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17748805_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF EXCHANGE VISITOR UNDER SECTION 101(a)(15)(J) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED, FORM DSP-66"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1961, 1964, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "PAGE 2 CERTIFICATE OF EXCHANGE VISITOR UNDER SECTION 101(a)(15)(J) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED I, TRAN THI - DAY hereby certify as follows: (Print or type name) 1. I seek to enter or remain temporarily in the United States for a maximum anticipated stay of 13 weeks for the (Months or years) purpose of (Degree, certificate, or other objective toward which program will be directed. Doctors of medicine should indi- cate medical speciality): Elementary education tour of inspection 2. I understand that I will be permitted to engage only in those activities described in Item 8 on page 1 of this form. 3. I will be financially able to support myself during my stay in the United States. (State source and amount of support, in- cluding stipends and allowances from Program sponsor.) 4. (To be completed ONLY if application is being made for extension of stay or Program transfer. Use continuation sheet if necessary.) I entered the United States on and have engaged in the following activities under the spon- (Date) sorship of the institutions shown: 5. I have have not been in the United States previously as an exchange visitor. (If you have been in the United States previously as an exchange visitor, show total length of time: ) 6. If the objective of my program is to acquire skills or knowledge, it is my belief that there will be opportunities for using such skills or knowledge upon my return to the country of my nationality or last residence. 7. I understand that the following conditions are applicable to exchange visitors: (a) Extensions of Stay and Program Transfers: The initial period of stay in the United States authorized for an exchange visitor may not exceed one year. An exchange visitor whose authorized stay expires before the completion of his pro- gram may apply for an extension of stay by submitting a current Form DSP-66 (Part I only) to the appropriate office of the Immigration and Naturalization Service between fifteen and thirty days before the expiration of his authorized stay. An exchange visitor who wishes to transfer to another Exchange-Visitor Program to further his original program objec- tive must submit Form DSP-66 (Parts I and II), executed by both his prospective and current sponsors, to the appropri- ate office of the Immigration and Naturalization Service. In either case, Page 2 must be completed and signed by the exchange visitor. An application for an extension of stay or Program transfer will not ordinarily be approved if the pur- pose is to undertake a new program objective. (b) Limitations on Stay: GRADUATE NURSES - 2 years; DOCTORS OF MEDICINE - 5 years for internships and residencies; MEDICAL TECHNOLOGISTS, MEDICAL RECORD LIBPARIANS, MEDICAL RECORD TECHNICIANS, X-RAY TECHNI- CIANS, AND OTHER PARTICIPANTS IN SIMILAR CATEGORIES - length of the approved training program plus a maxi- mum of 18 months for practical experience, not exceeding a total of 3 years; STUDENTS as long as they pursue sub- stantial scholastic programs leading to recognized degrees or certificates. Students whom the sponsor recommends for practical training will be permitted to remain for such purpose for an additional period of up to 18 months after receiving their degrees or certificates; RESEARCH SCHOLARS - 3 years; GUEST TEACHERS AND INSTRUCTORS 2 years; BUSINESS AND INDUSTRIAL TRAINEES - 18 months. (c) Documentation Required for Admission or Readmission as an Exchange Visitor: To be eligible for admission or readmis- sion to the United States, an exchange visitor must be in possession of and present the following: (1) A valid nonimmi- grant visa bearing classification J-1, unless exempt from nonimmigrant visa requirements; (2) A passport valid for six months beyond the anticipated period of admission, unless exempt from passport requirements; (3) A properly executed Form DSP-66 Form DSP-66 must be surrendered to a United States immigration officer upon arrival in the United States, except in the following circumstances: An exchange visitor who departs temporarily from the United States and seeks to reenter as an exchange visitor during the period of his previously authorized stay must present at the port of arrival upon his return a duplicate of the last-Form DSP-66 issued to him. Such duplicate must be obtained from his Program sponsor. If found admissible, the exchange visitor will be permitted to retain the duplicate copy of Form DSP-66 and use it for subsequent entries during the balance of his previously authorized stay. (d) Change of Status: Exchange visitors are expected to leave the United States upon completing their program and are not eligible to change their status while in the United States to any other nonimmigrant category except, if applicable, that of official or employee of a foreign government or an international organization or member of the family or attendant of such official or employee. (e) Two-Year Foreign Residence Requirement: Section 212(e) of the Immigration and Nationality Act provides as follows: \"No person admitted under section 101(a)(15)(J) or acquiring such status after admission shall be eligible to apply for an immigrant visa, or for permanent residence, or for a nonimmigrant visa under section 101(a)(15)(H) until it is estab- lished that such person has resided and been physically present in the country of his nationality or his last residence, or in another foreign country for an aggregate of at least two years following departure from the United States: Provided, That such residence in another foreign country shall be considered to have satisfied the requirements of this subsection if the Secretary of State determines that it has served the purpose and the intent of the Mutual Educational and Cultural Exchange Act of 1961: Provided further, That upon the favorable recommendation of the Secretary of State, pursuant to the request of an interested United States Government agency, or of the Commissioner of Immigration and Naturalization after he has determined that departure from the United States would impose exceptional hardship upon the alien's spouse or child (if such spouse or child is a citizen of the United States or a lawfully resident alien), the Attorney General may waive the requirement of such two-year foreign residence abroad in the case of any alien whose admission to the United States is found by the Attorney General to be in the public interest: And provided further, That the provisions of this paragraph shall apply also to those persons who acquired exchange visitor status under the United States Information and Educational Exchange Act of 1948, as amended.\" dail Saigon 18-9-1967 (Signature of Applicant) (Place) (Date) FORM DSP-66 874-047 U. S. GOVERNMENT PRINTING OFFICE 1964 o 702-214 (83) 11-63"
}
