{
  "anumber": "A17748805",
  "id": "A17748805_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17748805_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REFERENCE REQUEST - FEDERAL RECORDS CENTERS, NSN 7540-00-682-6423"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "REFERENCE REQUEST - FEDERAL RECORDS CENTERS NOTE: Use a separate form for each request. SECTION I - TO BE COMPLETED BY REQUESTING AGENCY ACCESSION NO. AGENCY BOX NUMBER RECORDS CENTER LOCATION NUMBER 69A 3349 54 OF I4418134 DESCRIPTION OF RECORD(S) OR INFORMATION REQUESTED BOX FOLDER (include file number and title) A 17748805 K This is a special project that Record's REMARKS Manager is working on. Please return all files or OF11's to Record's Supervisor. NATURE OF SERVICE FURNISHED COPY OF PERMANENT TEMPORARY RECORD(S) ONLY OTHER WITHDRAWAL LOAN OF RECORD(S) REVIEW (Specify) SECTION II--FOR USE BY RECORDS CENTER REMARKS RECORDS NOT IN CENTER CUSTODY RECORDS DESTROYED WRONG ACCESSION NUMBER - PLEASE RECHECK WRONG BOX NUMBER - PLEASE RECHECK WRONG CENTER LOCATION - PLEASE RECHECK ADDITIONAL INFORMATION REQUIRED TO IDENTIFY RECORDS REQUESTED MISSING (Neither record(s), information nor charge card found in container(s) specified) RECORDS PREVIOUSLY CHARGED OUT TO (Name, agency and date): DATE SERVICE TIME SEARCHER'S REQUIRED INITIALS 5-15-08 AD SECTION III -FOR USE BY RECORDS CENTER NAME OF REQUESTER TELEPHONE NO. FTS DATE MA, Chi 703 285-6212 RECEIPT OF RECORDS NAME AND ADDRESS USCIS OF AGENCY (Include 2675 PROSPERITY AVENUE Requester please sign, date and return this form, for file item(s) listed above, ONLY if the block to right street FAIRFAX, VA 22031 has been checked by the Records Center. address, building, room no. and ZIP SIGNATURE DATE Code) (In Washington, D.C. area also include STOP number) NSN 7540-00-682-6423 PREVIOUS EDITION USABLE OPTIONAL FORM 11 (Rev. 7-87) NATIONAL ARCHIVES AND RECORDS ADMINISTRATION 36 CFR 1228.162"
}