{
  "anumber": "A17748805",
  "id": "A17748805_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17748805_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF ELIGIBILITY FOR EXCHANGE VISITOR STATUS, Form DSP-66"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1967,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form Approved DEPARTMENT OF STATE Budget Bureau No. 47-R144.2 BUREAU OF EDUCATIONAL AND CULTURAL AFFAIRS CERTIFICATE OF ELIGIBILITY FOR EXCHANGE VISITOR STATUS (Authorized by regulations promulgated under provisions of Public Law 87-256) PART I - It is hereby certified as follows: 1. THE ORGANIZATION (SPONSOR) NAMED BELOW HAS SELECTED THE EXCHANGE VISITOR NAMED BELOW TO PARTICIPATE IN THE EXCHANGE-VISITOR PROGRAM DESCRIBED IN ITEM 7, PAGE 1 OF THIS FORM 2. NAME OF EXCHANGE VISITOR 3. DATE OF BIRTH Mrs. Tran Thi DAY July 20, 1915 I 4. NATIONALITY 5. PLACE OF BIRTH Vietnamese An Binh Dong, My Tho, Dinh Tuong 6. SPONSOR (Name and address) USATD/Saigon-Vietnam 7. EXCHANGE VISITOR PROGRAM NO. G-II-17 , DESIGNATED BY THE SECRETARY OF STATE ON IS STILL VALID AND CURRENTLY IS OFFICIALLY DESCRIBED AS FOLLOWS (Insert here the exact wording of the program description as contained in the latest notification letter received from the Secretary of State.) A program to bring specialists in the fields of industry, commerce, agriculture, and public administration from the various AID countries to the United States for training, observation and consultation for short periods of time. Index File No. : To: By: 8. THE EXCHANGE VISI TOR NAMED HEREIN WILL ENGAGE IN THE FOLLOWING ACTIVITIES UNDER THE PROGRAM (Describe briefly with sufficient Cclarity to enable the appropriate officials to determine that the activities are within the scope of the Exchange-Visitor Program de- scribed in Item 7 above) Hamlet School 9. THIS CERTIFICATE COVERS THE FOLLOWING PERIOD (The period covered by the following dates may not exceed one year, notwithstanding the fact that sponsorship beyond that period may be contemplated in accordance with the limitations listed in Item 7(b), page 2 of this form) From (Month, day, year) Sept. 20. 1967 To (Month, day, year) 13 weeks 10. THE SPONSOR UNDERTAKES THE FOLLOWING FINANCIAL OBLIGATIONS FOR THIS EXCHANGE VISITOR (Specify exact amounts wher- ever possible, indicating period covered. Include any financial arrangements for travel expenses.) Travel costs and maintenance allowance are borne by AID/W 11. IF THIS IS A DUPLICATE CERTIFICATE ISSUED TO A RETURNING EXCHANGE VISITOR AS DESCRIBED IN ITEM 7(c) ON PAGE 2 OF THIS FORM, THE EXPIRATION DATE OF THE EXCHANGE VISITOR'S AUTHORIZED STAY AS IT APPEARS ON FORM 1-94 IN HIS POS- SESSION IS (Month, day, year) 12. THE SPONSOR HAS NAMED THE UNDERSIGNED AS RESPONSIBLE OFFICER OF THE EXCHANGE-VISITOR PROGRAM DESCRIBED IN EM 7 ABOVE AND HAS SO NOTIFIED THE BUREAU OF EDUCATIONAL AND CULTURAL AFFAIRS, DEPARTMENT OF STATE, WASHINGTON, D. C. HONOLULU HAWAINE For Immigration Official ADDITIONAL 13. SIGNATURE OF RESPONSIBLE OFFICER (Also print or type name and title) SEP 21 1967 Have a Hubs CLASS J - / Jan 15/68 Harold A. Hudson, Asst. Training Officer 14. DATE Sept. 14, 1967 PART II - (To be completed by releasing sponsor in case of Program transfer) I, the undersigned Responsible Officer of Exchange-Visitor Program No. sponsored by am of the opinion that the transfer of the exchange visitor named above to Exchange-Visitor Program No. is necessary or highly desirable in view of the purpose for which the exchange visitor was admitted to the United States and is in conformity with the objectives of the Mutual Educa- tional and Cultural Exchange Act of 1961. SIGNATURE OF RESPONSIBLE OFFICER (Also print or type name and title) DATE FORM DSP-66 11-63"
}