{
  "anumber": "A17984698",
  "id": "A17984698_0081",
  "page_index": 81,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0081/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "To Classify Preference Status of Alien on Basis of Profession or Occupation, 4-140"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form approved Budget Bureau No. 43-R418.6 TI TO CLASSIFY DATE FILED FEE STAMP PREFERENCE STATUS OF RECEIVED ALIEN ON BASIS OF PROFESSION OR 15 DEC 1967 OCCUPATION Consulate of the United States of America THuons, Medics for The status petition under was section filed on 203(a) July 21,1967 TO THE The SECRETARY petition is approved OF STATE The petition is revalidated to Approval expires: 6-27-68 Sec. 212(a)(14) certification attached. Sec. 212(a)(14) certification attached. Blanket Sec. 212(a)(14) certification issued. Blanket Sec. certification issued. REMARKS foo DISTRICT DIRECTOR RRosenberg DISTRICT DIRECTOR DISTRICT DATE DISTRICT DATE Los Angelia 12/7/67 PETITIONER IS NOT TO WRITE ABOVE/THIS LINE Read this form and the attached instructions carefully before filling in petition Petition is hereby made to classify the status of the alien beneficiary named herein for issuance of an immigrant visa as (\"X\" one) A THIRD PREFERENCE IMMIGRANT-Ar alien who is a member of the professions, or who because of his exceptional ability in the sciences or arts will substantially benefit prospectively the national economy, cultural interests or welfare of the United States. (Sec. (a) (3) Immigration and Nationality Act, as amended.) If this box is checked, the alien or a person on his behalf, must complete only Part I, below. A SIXTH PREFERENCE IMMIGRANT-A alien who is capable of performing skilled or unskilled labor, not of a tempo- rary or seasonal nature, for which a shortage of employable and willing persons exists in the United States. (Sec. 203 (a) (6), Immigration and Nationality Act, as amended.) If this block is checked, alien's prospective employer must complete Parts I and II below. (If you need more space to answer fully any questions on this form, use a separate sheet, identify each answer with the number of the corresponding question and sign and date each sheet.) PART I INFORMATION CONCERNING ALIEN BENEFICIARY 1. NAME (Family name in capita) letters) (First name) (Middle name) (Maiden name, if alien is a married woman) WONG-Song Ramon Fong 2. BIRTHDATE 3-3-12 3. BIRTHPLACE (City or town) (State or province) (Country) 4. PRESENT NATIONALITY OR CITIZENSHIP Canton, China Mexico 5. PRESENT ADDRESS (Number and street) (City or town) (State or province) (Country) (ZIP Code, if in U.S.) 251 Morelos Mexicali B. C. Mexico 6. ADDRESS IN THE UNITED STATES WHERE ALIEN WILL RESIDE (City) (State) 452 Main Street, EL Centro, California SND 7. PROFESSION OR OCCUPATION Chinese Cook 8. DOES BENEFICIARY INTEND TO ENGAGE IN HIS PROFESSION OR OCCUPATION IN THE UNITED STATES? YES NO. IF NO, EXPLAIN 9. TO YOUR KNOWLEDGE, HAS A VISA PETITION EVER BEEN FILED ON BEHALF OF THIS BENEFICIARY BASED ON HIS PROFESSION OR OCCUPATION? YES NO. If \"Yes,\" give name of each petitioner and date and place of filing. 10. HAS THIS BENEFICIARY EVER BEEN IN THE 11. ALIEN REGISTRATION NUMBER, IF ANY UNITED STATES? (\"X\" ONE) YES NO Local Passport 12. TO YOUR KNOWLEDGE, HAS THIS BENE- 12A. IF YOU MARKED \"YES,\" GIVE THE DATE AND PLACE WHERE HIS DEPORTATION FICIARY EVER BEEN DEPORTED FROM THE HEARING WAS HELD. UNITED STATES? (\"X\" ONE) YES NO 3. NAME (Last name) (First name) (Middle name) BENEFICIARY'S Wong - Song Chan Yuk! Lin SPOUSE COUNTRY OF BIRTH DATE OF BIRTH PRESENT ADDRESS (No. and Street) (City or town) (State or Province) (Country) China not known Toi Sun, Hong Kong, BT 14. NAME (Show M or S for married, or single) M.S BIRTHDATE COUNTRY OF BIRTH ADDRESS BENEFICIARY'S CHILDREN FORM I-140 (Rev. 1-15-67) UNITED STATES DEPARTMENT OF JUSTICE - IMMIGRATION AND NATURALIZATION SERVICE (Page 1)"
}