{
  "anumber": "A17984698",
  "id": "A17984698_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Sworn Statement in Affidavit for Naturalization,"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form I-215W (3-27-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM AFFIDAVIT-WITNESS IN RE: Wong Ramon Fong Song FILE NO A17984698 EXECUTED AT El entro, Coky DATE Dec. 5, 1968 Before the following officer of the U.S. Immigration and Naturalization Service: Poyuis- in the english language. Interpreter used. I, Loo. Tong Hay- , acknowledge that the above-named officer has identified himself to me as an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement regarding Wong Ramon Fong Song He has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth, the whole truth, and nothing but the truth, so helpme, God. Being duly sworn, I make the following statement: My chinese name is Loo, Tony Hay - I am a citizen of the United States by naturalez store in I Santa have identified ana Caly the in form 1942 ES 575 in the fels of Wong, Raymond Fong My bookkeeper agreed to find for Song as the one I signed to bring him to the United me a States chinese to work for THexicali ms because I could not get one from cook in He recommended 9th Wong Ramon Fong Song De and Aschood I angeles. the forms ES.575 of tes my $100.00 bookkeeper week Mr. necochea 6 days signed Calexico, Caly I agreed to pay him per of of hours day. de never reported to me he had or my entered resturant the I heard and was marketing an angeles am 8 per later from Mr. De Hocochea in that Hell United States I on his usa because I never EXHIBIT \"B\" llng the truth when he said my resturant. I have never seen Los Angeles, California, report of 12/11/68 intention of working for me, Los Angeles Files Nos. (1) A17 984 698 (2)A18 435 377 Exhibit Identification Form G 166-B (1 1-54) FP1-LPC-4-68-55C-3714"
}