{
	"anumber": "A17984698",
	"id": "A17984698_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM, I-215W ( (3-27-67)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 Form I-215W (3-27-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM AFFIDAVIT--WITNESS FILE NO. A18 435 377 IN RE: WONG, Ramon Fong Song EXECUTED AT Los Angeles, California DATE November 21, 1968 Before the following officer of the U.S. Immigration and Naturalization Service: Betty M. Hansen, Immigrant Inspector in the Chinese language. Interpreter H. H. Hee used. Tpishan Hakying Dialect George S. Lee, Esq., also present , acknowledge that the above-named officer I, has identified himself to me as an officer of the United States Immigration and Naturalization Service Ramon Fong Song Wong authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement regarding petition filed in behalf of Yuk-Lin Chan Wong He has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth, the whole truth, and nothing but the truth, so helpme, God. Being duly sworn, I make the following statement: I entered the United States at Calexico, California, on April 2, 1968. Following my entry into the United States I stayed overnight at 452 Main Street, El Centro, California, and then came directly to Los Angeles. My address has been 855 Cleveland Street, Room 21, Los Angeles, California, since my entry. I am self-employed at the present time. I have a partnership with my brother Wong Chun Mui in the \"La Gran Muralla\" Restaurant in Mexicali, Mexico, and I receiver money from that partnership for my living. The only employment I have had in the United States has been as substitute cook from May to June 1968 at \"Far East Terrace\", Lankership Blvd, North Hollywood. My alien registration receipt card was mailed to the 452 Main Street, El Centro, address, and Mr. Tong Loo forwarded it to me here in Los Angeles. If the petition is approved for my wife, I have sufficient funds to support her in the United States, including a savings account in the bank in Calexico with a present balance of $5,866.24. EXHIBIT \"A\" Ramon Fong Song Wong Los Angeles, California, report of 12/11/68 es, Les Angeles Files Nos. (1) A17 984 698 tH HEE WITNESSED BY: (2)A18 435 377 H.H.Hee, Interpreter Exhibit Identification Form G 166-B (1 1-54) FPI-LPC-4-68-55C-3714"
}
