{
	"anumber": "A17984698",
	"id": "A17984698_0045",
	"page_index": 45,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0045/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Q & A Statement of Wong, Ramon Fong Song, A17 984 698"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 Q & A Statement of Wong, Ramon Fong Song 1-8-69 A17 984 698 Q Did Mr. Loo ever visit you in your business or home in Mexicali? A He had never visited with me in my business in Mexico and neither my residence there. Q Assuming that the signature of Mr. Loo on the Form 575 is legitimate and is a true signature, what was the basis for this 575 and why did you present it at the time that you applied for your visa? BY ATTORNEY LEE: There is nothing to show he presented it. I believe it is the petitioner who presents that form. INVESTIGATOR GUIO: Q The 575 is made in two parts, one by the petitioner, the other by the alien seeking entry. This has both parts A and B. The signature of Mr. Wong, I believe, is affixed at the bottom of one of the parts. That is Mr. Wong's signature, is it not? A Yes, that is my signature. Q What was the purpose for your signing and submitting that Form I-575? A For the purpose of coming over to work for the Holly Cafe at E1 Centro. Q Your file reflects that you are the beneficiary of an approved visa petition under Section 203(a)(6) of the Immigration and Nationality Act, the approval valid to June 27, 1968, addressed to T. H. Loo and giving your name of Ramon Fong Song Wong as the beneficiary Does that reflect your name and the approval of the petition? BY ATTORNEY LEE: We can stipulate to the fact that that document was sent to the petitioner. The beneficiary had no way of knowing it was sent to him. INVESTIGATOR GUIO: Q He does know he was the beneficiary of an approved visa petition filed by Mr. Loo. Why did Mr. Loo file an application for approval of your- self to enter the United States under the 6th preference? A Because he needed me to work in his restaurant. Q Did you pay him any money to file an application for petition for you? A No. Q Did you pay anyone any money for that petition? A I paid approximately $100 U.S. to the person by the name of F.De Nechochea for his services in filling out the necessary document and form for me, including the fee for the visa application. - 4 -"
}
