{
  "anumber": "A17984698",
  "id": "A17984698_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0040/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Sworn Statement in Affidavit for Naturalization, I-215W ("
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form I-215W (3-27-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM AFFIDAVIT-WITNESS IN RE: Wong Ramon Fong Song FILE NO. A17984698 Before the following officer of the U.S. Immigration and Naturalization Service: Poyuis- EXECUTED AT Ef Centro, Caky DATE Dec. 5, 1968 in the english. language. Interpreter used. I, Loo. Tong Hay - , acknowledge that the above-named officer has identified himself to me as an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement regarding Wong Ramon Fong Song He has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth, the whole truth, and nothing but the truth, so helpme, God. Being duly sworn, I make the following statement: My chinese name is Loo, Tony Hay - I am a citizen of the United States by naturalize store in Santa ana Caly in 1942 I have identified the form ES 575 in the file of Wong, States Raymond Fong to my bookkeeper agreed to find for Song as the one I signed to bring him to the United me a chinese work forms. THexicali msa because I could not get one from cook in He recommended 9th Wong Ramon Fong Song De and I angeles. the forms ES.575 of tes my bookkeeper week Mr. Archaca Necochea 6 days signed Calexico, Caly. I agreed to pay him $100.00 me or per resturant of I heard States and was smartering an I am 8 per later from Mr. De Neechea in that keel States I of hours day. de never reported to he had my entered the unable the man or He is not telling the truth havenever seen United to identify his pictures on his usa because when he never said him. that I think he never had any intention of working for me, met he stayed over night in my resturant. I Inves tigator"
}