{
  "anumber": "A17984698",
  "id": "A17984698_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0041/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT, A17 984 698"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service RECORD OF SWORN STATEMENT Office: Los Angeles, California File No. A17 984 698 Statement by: WONG, Ramon Fong Song In the case of WONG, Ramon Fong Song At: 300 N. Los Angeles St. Los Angeles, California Date: Jan. 8, 1969 Before: P. 0. Guio, Investigator In the Chinese language Interpreter: H. H. Hee Also present: George S. Lee, Attorney Stenographer: Leona C.L. Bolduan BY INVESTIGATOR GUIO: Let the record show that Mr. Wong is being represented by Mr. George S.Lee, attorney of his choice, and that a G-28 has been appropriately filed. Q Mr. Wong, I wish to take a statement from you regarding your entries into the United States. This will be under oath with penalties of perjury. Are you willing to make a statement at this time? A Yes. Q Inasmuch as you are being represented by your attorney, Mr. Lee, your rights under the Constitution will not be explained to you as he is more familiar with those than you are. Would you please stand and raise your right hand to be sworn. (complies) Do you solemnly swear that all the statements you are about to make will be the truth, the whole truth and nothing but the truth, so help you God? A Yes I do. Q What is your full, true and correct name? A My true and correct name is WONG, CHUN SHUM. My marriage name, WONG, KUN KEE, my English name, RAMON WONG. Q It is noted that you use the name WONG, FONG SONG. A That is a different dialect. ? Your Form I-151 apparently was EXHIBIT G SONG, which is not your true name, UN SUM. uring my life in Mexico and I have Los Angeles report of 1/14/69 A17 984 698 Exhibit Identification Form G 166-B 1-54) FPI-LPC-4-CB-55C-3714"
}