{
  "anumber": "A17984698",
  "id": "A17984698_0076",
  "page_index": 76,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0076/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1967,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 UNITED STAT F AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION I- 3111159 (Family name) (First name) (Middle name) WONG Ramon Fong Song or PORT OF AKA : Wong Chun Son ACTION OF SPECIAL INQUIRY OFFICER CAL-162 The immigrant herein was (admitted) (excluded) I certify that the immigrant named herein arrived in the United States at this port on and taken under ON FOOT IMM. & NATZ. SERVICE Symbol (Name of Nox ,34 and was inspected by me ADDMITTED APR2 - 1968 & Section of the Immigration and Nationality Act. CLASS' P- 6 TO Indef I Special Inquiry Officer. detained for further inquiry by special officer under Symbol ACTION ON APPEAL Section of the Immigration and ADMITTED Nationality Act EXCLUDED A17-984-697 Immigrant Inspector. DATE This visa is issued under Section 221 of the Immigra- Consulate General tion and Nationality Act, and upon the basis of the AMERICAN facts stated in the application. IMMIGRANT CLASSIFICATION ATTijuana, B. Cfa., Mexico NONQUOTA (Symbol) QUOTA (Symbol) memer Prillips P-6 BX6 Spencer Phillips VISA PETITION NO., IF ANY approved at Los Angeles VICE-CONSUL OF THE UNITED of The United States of America. California on December 7, 1967 STATES OF AMERICA IMMIGRANT VISA NO. 625 QUOTA 8, 444 the (Chinese) ISSUED ON (Day) (Month) (Year) MAR 25 1968 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) JUL 241968 meg NATIONALITY (If stateless, so state, and give previous nationality) Chinese by birth, Mexican by Naturalization MEXICAN PASSPORT PHG TACHED NO. 2302 FOREIGN SERVICE OR OTHER TRAVEL DOCUMENTS (Describe) UNITED STATES OF AMERICA Service No. ISSUED TO Ramon Wong Fong Song Tariff Item No. Fee Paid $20 STATISTICS Prov. ppt. issued BY Local Cy equiv. at Mexicali, B. C. FORM I-151 ISSUED SEC. 212(a)-14- Certification attached ON July 13, 1967 EXPIRES MAY 4 31968 July 12, 1969 FORM 5-61 FS-511 16-74687-2 U.S. GOVERNMENT PRINTING OFFICE"
}