{
	"anumber": "A17984698",
	"id": "A17984698_0091",
	"page_index": 91,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0091/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Alien Employment Certification, Form ES-575B"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 In REPLY REFER TO U.S. DEPARTMENT OF LABOR PHONE 556-5624 BUREAU OF EMPLOYMENT SECURITY 450 Golden Gate Avenue, Room 10210 P. O. Box 36017 UNITED STATES EMPLOYMENT SERVICE UNEMPLOYMENT INSURANCE SERVICE San Francisco, California 94102 DATE: June 27, 1967 Mr. T. H. Loo Holly Cafe 452 Main St. El Centro, California Dear Sir: Re: Application for Alien Employment Certification for Ramon Wong Fong Song The Department of Labor has made a determination in the above request. Final action has been taken as follows: XXXX) Form ES-575 has been certified and is enclosed with the supporting documents. All en- closures should be submitted to the Immigration and Naturalization Service District Office either with your petition (Form I-140) or for consideration of alien's application for adjustment of status. 2. Form ES-575 has been certified and forwarded to the Consulate at which the alien has indicated he will file a visa application. The Consular Officer will inform the alien of the additional documents to be submitted and steps to be taken in order to apply for an immigrant visa. 3. Form ES-575B has been certified and is enclosed. This letter and the certified form should accompany Forms ES-575A which you may subsequently file with the local office of the State Employment Service for aliens you desire to employ under this certification. 4. Form ES-575A has been favorably acted upon by the Department of Labor and is enclosed for submission to the Immigration and Naturalization Service or, if not enclosed, has been forwarded to the Consular office for further consideration under the previously certified job offer (Form ES-575B). 5. Form ES-575A could not be acted upon favorably by the Department of Labor for the reason indicated on the Form or given in the advisory statement attached to the Form which is enclosed for return to the alien. 6. On the basis of information available to us, we cannot issue the certification required by Section 212 (a) (14) of the Immigration and Nationality Act, as amended. Reason: Available job market information will not warrant a certification of unavail- ability of workers in the U.S. Remarks: Mr. Loo, Since Mr. Song was born in China, it will be necessary for you to file a petition (I-140) with the immigration Service, 300 North Los Angeles St., Los Angeles, Sincerely yours, California Certifying Officer CC: State ES-Agency BES FL 71.48 (Rev. 3-67)"
}
