{
	"anumber": "A17984698",
	"id": "A17984698_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Investigation, G-166A ( (REV. 6-1-66)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 ED STATES DEPARTMENT OF JUS IMMIGRATION AND NATURALIZATION SERVICE REPORT OF INVESTIGATION ADMINISTRATIVE PAGE TITLE FILE NUMBER (1) WONG, Ramon Fong Song (1) Al7 984 698 (2) WONG, Yuk Lin Chan (2) A18 435 377 REPORT NUMBER DATE PLACE CENTRAL OFFICE AND REGIONAL REFERENCES 1 1/14/68 LOS CONTROL OFFICE TRANSFERRED TO: G-23 LINE TYPE OF INVESTIGATION LOS 503 REPORTABLE FRAUD, Visa, Deportation DATE AND PLACE OF BIRTH NATIONALITY DATE, PLACE AND MANNER OF ENTRY (1) 3/3/12 Canton, China (1) Chine (1) 4/2/68 CAL. Perm. Res. (2) 4/11/12 Kwangtung, China (2) China (2) Applicant. DISTRIBUTION REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE l - File A17 984 698 1/27/69 SIGNATURE 1 - File A18 435 377 B.R. Peasure 2 - Application for OSC NAME AND TITLE B.R. Pearson Supervisory General Investigator REVIEWED AND APPROVED (SEE COMMENT) DATE PLACE SIGNATURE NAME AND TITLE APPROVED (REGIONAL OFFICE) DATE NAME AND TITLE SIGNATURE STATUS OF INVESTIGATION PENDING PENDING INACTIVE XX CLOSED REFERRED TO CONTROL OFFICE This investigation is predicated upon a request of the Travel Control Section when their interview of RAMON WONG indicated that he had not accepted employment with the person who had petitioned his entry as a sixth preference immigrant and had submitted form ES 575 in his behalf. OSC applied for. I do (do concur that an order to show cause be issued in this case. BKR George K. Rosenberg District Director THIS PAGE IS NOT TO BE DISTRIBUTED OUTSIDE THE IMMIGRATION AND NATURALIZATION SERVICE FORM G-166A (REV. 6-1-66) FPI-LPC-9-68-22M-4051"
}
