{
	"anumber": "A17984698",
	"id": "A17984698_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, ES 575"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "China"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1968, 1969, 2023, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 DETAILS The file of SUBJECT RAMON WONG holds immigrantVisa # 625 issued under class P -6 at the American Consulate in Tijuana, BC Mexico on March 25, 1968. The visa reflects entry at Calexico, California on April 2, 1968. It also shows birth March 3, 1912 in Hoy San, Canton, China. The visa also shows SUBJECT RAMON WONG has been a resident of Mexico since 1924. He is the beneficiary of a sixth preference Visa application and approved form ES 575 as a Chinese cook. The visa petition and form ES 575 were submitted by T. H. L00, owner of the Holly Cafe at 452 Main Street, El Centro, California. After admission for permanent residence, SUBJECT RAMON WONG filed form I 130 for Visa issuance to his wife SUBJECT WONG, YOU LIN CHAN, presently residing in Hong Kong. The petition shows SUBJECT YUK WONG was born April 11, 1912, in Do Hung Village, Hoy Shan, Kwangtung, China, and is a citizen of China. During the interview looking toward approval of the Visa petition, SUBJECT RAMON WONG revealed that he had never been employed by the person who had petitioned his entry, and this investigation was requested. An affidavit was taken from SUBJECT RAMON WONG on November 21, 1968, copy attached as Exibit \"A\" That affidavit reflects that he entered the United Ex \"A\" States April 2, 1968. spent one night at the restaurant of Mr. LOO, Tong the signer of his Visa petition, then travelled to Los Angeles where he has resided since that entry. The affidavit indicates that he has never been employed by Mr. L00, Tong in his restaurant, that his only employment has been as a substitute cook for the \"FAR EAST TERRACE\" restaurant on Lankershim Boulevard, North Hollywood, California. On December 5, 1968 Mr. LOO, TONG HOY, owner of the Holly Cafe at 452 Main St, El Centro, signed an affidavit, copy attached as Exibit \"B\" Ex. \"B\" In that affidavit he testified that he executed form ES 575 and the application for sixth preference in good faith, that he needed a Chinese cook and SUBJECT RAMON WONG had been recommended by his bookkeeper, Mr. DE NECCOCHEA of 213 Second Street, Calexico, California. Mr. LOO further stated that SUBJECT RAMON WONG is unknown to him, that he never reported for employment, in fact, never reported or visited after his admission at Calexico, California on April 2, 1968. Mr. LOO stated that his bookkeeper had informed him that SUBJECT RAMON WONG had been admitted/ On December 9, 1968 Mr. FONG, CHOON JAY, Chef in charge of the kitchen of the \"FAR EAST TERRACE\" was interviewed. He stated that SUBJECT RAMON WONG had been employed by them for six or seven days in May or June of 1968 as a \"cook's helper\" and had quit his employmentat that restaurant. Mr. FONG stated that SUBJECT RAMON WONG had been employed as the holder of social security card number 573 88 1221 -2- Los Angeles, Calif A17 984 698 January 14, 1969"
}
