{
  "anumber": "A17984698",
  "id": "A17984698_0094",
  "page_index": 94,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0094/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION, ES-575B"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 FORK E9-575 Budget Bureau No. 44-R1301 APPLICATI FOR ALIEN, EMPLOYMENT CERTI ATION Expiration Date: 8/31/66 PART B - JOB OFFER FOR ALIEN EMPLOYMENT (ES-575B) 2870 IN SUPPORT OF THE APPLICATION FOR ADMISSION OF Ramon Wong Fong Song (Name of Alien - If more than one and for same occupation, attach list) THE FOLLOWING INFORMATION IS SUBMITTED AS EVIDENCE OF AN OFFER OF EMPLOYMENT 1. NAME OF EMPLOYER (Full name of organization; if employer is an individual, give name with last name in capital letters) T. H. Loo Dba HOLLY CAFE, p. O. box 1108, EL Centro, California 2. ADDRESS (Number and Street) (Town or City) (State) (Zip Code) 452 Main Street EL Centro California 3. BRIEF NON-TECHNICAL DESCRIPTION OF THE NATURE OF EMPLOYER'S BUSINESS OR ACTIVITY Restaurant Cafe, Chinese and American Dishes 4. SIZE OF ORGANIZATION (In terms of Annual Sales, Production Output, Persons 5. DATE BUSINESS OR ACTIV- 6. GEOGRAPHICAL AREA Served, etc.) ITY ESTABLISHED SERVED Mexicali & Annual Sales $83,397.94 55. Imperial Co. 7. PLACE WHERE ALIEN WILL WORK 8. AVERAGE NUMBER OF EMPLOYEES AT 9. NUMBER OF EMPLOYEES WHO WILL PER- PLACE WHERE ALIEN WILL WORK FORM SAME WORK AS ALIEN 452 Main, El Centro, Cal. from 5 to 8 one 10. IS THE EMPLOYMENT 11. IS THE EMPLOYMENT 12. ARE ALIEN'S SERVICES SOUGHT SEASONAL? TEMPORARY? YES NO YES NO FOR A NEW JOB TO BE CREATED TO FILL AN EXISTING VACANCY 13. STATE SPECIFICALLY LENGTH OF TIME 14. HAVE YOU BEEN ABLE TO FIND IN THE U.S. ANY AVAILABLE PERSON CAPABLE OF YOU EXPECT TO EMPLOY ALIEN PERFORMING DUTIES OF THE JOB TO BE FILLED permanent f YES NO 15. EXPLAIN THE CIRCUMSTANCES WHICH CAUSED NEED FOR ALIEN'S SERVICES Chinese cook might recire soon and must break new one 16. DESCRIBE EFFORTS YOU HAVE MADE IN YOUR OWN ORGANIZATION AND RECRUITMENT EFFORTS UNDERTAKEN TO FILL THE JOB asked friends and must obtain the services of one recommended as trust- worthy as a turnover hurts the business. CERTIFICATION Pursuant to the provisions of section 212(a)(14) of the Immigration and Nationality Act as amended I hereby certify that there are not sufficient U C and the employment of the aliens 17. IF ALIEN IS NOT ADMITTED, HOW WILL YOUR NEEDS FOR THE JOB BE, MET and working conditions of workers the U. / will do the job personally until one is found. JUN 28 1967 (Date) (Certifying Officer) 18. NUMBER OF TIMES YOU HAVE MADE 19. NUMBER OF ALIENS 20. DO YOU INTEND TO FILE A PETITION (FORM 1-140) WITH IMMIGRATION JOB OFFERS FOR ALIEN EMPLOY- EMPLOYED AS A RE- AND NATURALIZATION SERVICE FOR ADMISSION OF ALIEN AS A PREFER- MENT SULT ENCE IMMIGRANT? o o YES NO (DO NOT WRITE IN THIS SPACE - CONTINUE ON REVERSE SIDE) So 6-12-7"
}