{
  "anumber": "A17984698",
  "id": "A17984698_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0054/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM, Form I-215W ( (3-27-67)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1968,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form I-215W (3-27-67) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM AFFIDAVIT-WITNESS IN RE: WONG, Ramon Fong Song FILE NO. A17 984 698 EXECUTED AT El Centro, alifornia DATE December 5, 1968 Before the following officer of the U.S. Immigration and Naturalization Service: P.O. Guio in the English language. Interpreter used. I, LOO Tong-Hay , acknowledge that the above-named officer has identified himself to me as an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement regarding WONG, Ramon Fong Song He has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth, the whole truth, and nothing but the truth, so helpme, God. Being duly sworn, I make the following statement: My Chinese name is LOO, Tong Hay, I am a citizen of the United States by naturalization in Santa Ana, California in 1942. I have indentified the form ES-575 in the file of WONG Ramon Fong Song as the one I signed to bring him to the United States to work forme. My bookkeeper agreed to find me a Chinese cook in Mexicali because I could not get one from Los Angeles. He recommended Mr. WONG Ramon Fong Song and I signed the forms ES-575 after my bookkeeper, Mr De NECOCHEA of Calexico, California. I agreed to pay him $100.00 per week of 6 days, 8 hours per day. He never reported to me or my resturant. I heard later from Mr De Necochea that he had entered the United States and was in the United States. I am unable to identify his picture on his visa because I never met the man. He is not telling the truth when he said that he stayed over night in my resturant. I have never seen him. I think he never had any intention of working for me Original signed Original signed T.H. LOO P.O. Guio, Investigator"
}