{
	"anumber": "A17984698",
	"id": "A17984698_0050",
	"page_index": 50,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17984698_0050/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RAMON WONG FONG SONG"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 Q & A Statement of Wong, Ramon Fong Song 1-8-69 A17 984 698 Q O.K. that is fine, that might indicate that you have a physical indication of what the restaurant looks like, but doesn't indicate you met Mr. Loo, talked with him, or visited the restaurant in person. A I did call him over the phone, but I did not talk to him in person because he was too busy , having no time to talk to me. I found out his private phone of his restaurant from the waitress. At the time he was at home. Q Inasmuch as you have already testified that you met Mr. Loo three or four times, why is it that he testified in a sworn statement that you never reported to him or to his restaurant, that he was unable to identify a picture of you because he had never seen you in person? A I asked Mr. F. De Nechochea to inform Mr. Loo that I am going to Los Angeles. Q Why have you testified that you met him three or four times but now you state you have not met him at all but contacted him through Mr. Nechochea? A I consider talking through the telephone with him just as meeting him personally. Q Did you ever have any intention of going to work for Mr. Loo in the Holly Cafe? A Yes actually I planned to work for him. Q Would you tell us again the capacity in which you worked at the Far East Terrace? A I do not know what capacity was the man I substituted for, but however I was asked to prepare the noodle, Wun Tun, and the soups. Q How do you explain the fact that the chief cook in that restaurant states that you were hired sorely as a cook's helper? A Actually there is no definite job that is mentioned, he just asked me to work there. Q Do you wish to admit at this time that you have never met Mr. Loo? A Yes, I admit I haven't met him, but I have talked over the phone with him. Q Will you sign the stenographer's notes to indicate your presence here today? A Yes. (Signature) \"RAMON WONG FONG SONG I CERTIFY the foregoing to be a true and correct transcript of my stenographic notes contained in the file. Leona CL Breddan Leone C. L. Bolduan, Stenographer - -"
}
