{
	"anumber": "A18018390",
	"id": "A18018390_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18018390_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Block II – Information About Alien Beneficiary, G-180"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1923, 1942, 1943, 1940, 1961, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1961 Block II.-Information About Alien Beneficiary NRSX 6 196 7. Name of alien James Yee Wo (First name) (Middle initial) (Last name) If this petition is for a married woman, give her maiden name 8. Alien was born January 20, 1900, Toyshan District, Kwangtung Province, Chinaa (Date) (City or town) (State or Province) (Country) 9. a. Relationship of alien to petitioner Brother b. Is the alien related to you by adoption? No 10. Alien's marital status (Check appropriate block) Married Widowed Divorced Single a. Name of alien's spouse, if married, and date and country of birth Yee Yip also known as Yip Yee Wo. also known as Yee Yip Wo; born in China Sept. 22, 1923 b. Names, birthdates and countries of birth of alien's children, if any 4 children: Stently Yee Tong. born in China 1923; Joan Yee Woo, born in Trinidad 1940; Francis Yee Wd, born in Trinidad 1942; Catherine Yee Wo, born in Trinidad 1943. C. Full address of alien's spouse and children, if any My brother's wife is with him in the U.S. All his children are in Trinidad. 111. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse d. Last address at which you and your spouse resided together (Apt. No.) (Number and street) From To (Town or city) (State or Province) (Country) (Month) (Year) (Month) (Year) 12. If this petition is for a child, a. Is the child married? b. Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 13. If this petition is for a brother or sister, are both your parents the same as the alien's parents? Yes If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 14. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner Yee Yip Wo, my brother's wife. 15. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: 16. Has this alien ever been in the United States? Yes Has this alien ever been deported from the United States? No If so, give Alien Registration Number, and date and place where deportation hearing was held: 17. Address in the United States where alien will reside 28 Harvard St., Boston, Mass. 18. a. Address at which alien is presently residing 28 Harvard Street, Boston, Mass. (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code, if in U.S.) Since (Month) (Year) b. If alien is in the United States, give the following: Name and address of present employer Not employed. Date alien began this employment (Month) (Day) (Year) 19. Check the appropriate box below and furnish the information required for the box checked: a. Alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) b. Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at Boston. Mass. (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Block III.-Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 5) Jeremy wich Subscribed and sworn to (affirmed) before me this 16 day of A.D. 19. 68 at Botn [SEAL] Mv commission expires Juin 21974 (Signature of officer administering oath) Notom (Title) Path Lenaker O.Comell Block IV.-Signature of Person Preparing Form, if Other Than Petitioner 1 declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (Signature) (Address) (Date) 2"
}
