{
	"anumber": "A18029489",
	"id": "A18029489_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, Form J-486 ("
		},
		"years": {
			"ms_years_nlp_v1": [1969]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE John F. Kennedy Federal Building REFER TO THIS FILE NO May 12, 1969 Government Center, Boston, Mass. 02203 A18 029 489 (TC ECR) MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENTS Your medical examination will be given at: Location United States Public Health Mr. Vidya S. Pahwa Service, 77 Warren St., Brighton, Mass. Date Time 6 Conant Street West Concord, Mass. 01781 June 3, 1969 3:30 P.M. The Immigration examination will be held at: Location Am. 702 J.F. Kennedy Federal Bldg., Government Center, Boston, Mass. Date Time June 3, 1969 11:15 a.m. INSTRUCTIONS FOR MEDICAL EXAMINATION In connection with your application, it will be necessary for you to take a medical examination. An ap- pointment has been made for you to be examined by a doctor of the U. S. Public Health Service at the time and place given above. If you do not speak English, you must bring a person of your own sex who can act as interpreter. BRING WITH YOU to the medical examination the following checked items. (Obtain these items at once.) 1. X-ray film (size 14\"X17\") of your chest, taken and interpreted at an accredited hospital or clinic. (Film and reading not to be more than 7 months old.) 2. Report of serologic test for syphilis. (Report not to be more than 30 days old.) 3. INSTRUCTIONS FOR IMMIGRATION EXAMINATION An appointment has also been made for an examination before an Immigration officer at the time and place given above. See below for items (if any are necessary) which you MUST BRING WITH YOU: cc: USPHSH Worm I-486 (Rev. 5-25-66)"
}
