{
	"anumber": "A18029489",
	"id": "A18029489_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa Grant Visa"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2 Form approved. RECEIVED Budget Bureau No. 43-R401.4. PETITION TO Date filed Fee stamp CLASSIFY STATUS OF ALIEN RELATIVE FOR JAN 24 1969 ISSUANCE OF IMMI- BOS 1389 GRANT VISA U. S. Immigration & Naturalization JFK Fed. Bldg. (Read this form and the attached instructions carefully before filling in petition) Boston, Mass. To THE SECRETARY OF STATE: nic LLCG COLLECT 1/24/69 The petition is revalidated: The petition was filed on The petition is approved for status under section 201 (b) Remarks: A18029489 APR District Director) (District Director) (District) (District) BOSTON. MASS. (Date) (Date) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) RECEIVED 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) pay The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. 18 FEB-51965 The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. Immigration 32 Naimulation Travel Contabili Block I.--Information About Petitioner Boston, 2. Name YASH PAL PAHWA (First name) (Middle name) (Last name) If you are a married woman, give your maiden name NONE 3. I reside in the United States at 6, CONANT STREET, WEST CONCORD MASSACHUSETTS 01781 (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) Address abroad (if any) NONE (Number and street) (City or town) (Province) (Country) 4. I wäs born NOVEMBER 3, 1936 RAWALPINDI, PUNJAB, PAKISTAN (Date) (City or town) (State or Province) (Country) 5. If you are a citizen of the United States, give the following: a. Was your citizenship acquired through birth in the United States, through naturalization, through parentage, or through marriage? NATURALIZATION (1) If acquired through naturalization, give number of maturalization certificate and date and place of naturalization: 9102902 JAN 20 1969 BOSTON MASS. (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate: (b) If not, submit evidence of citizenship in accordance with Instruction 3a(2) b. Have you or any person through whom you claim citizenship ever lost United States citizenship? NO If so, attach detailed explanation on separate sheet. 6. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: A- b. Date, place, and means of admission for lawful permanent residence C. Have you ever lost status as a lawful permanent resident alien? If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) Form I-130 (Rev. 10-1-67) UNITED STATES DEPARTMENT OF JUSTICE-Immigration and Naturalization Service 12-207-209"
}
