{
  "anumber": "A18029489",
  "id": "A18029489_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPORT of Third Preference Petition Approved Under Section 2 Immigration and Nationality Act, as Amended"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1908,
        1970,
        1968,
        1969,
        1931
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "NITED STATES DEPARTMENT OF JUSTI CADJ-7 Immigration and Naturalization Service Boston, Massachusetts REPORT OF THIRD PREFERENCE PETITION APPROVED UNDER SECTION 203(a) (3) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED. It has been established that: the beneficiary is a qualified member of the professions. the beneficiary, because of exceptional ability in the sciences or the arts, will substantially benefit prospectively the national economy, cultural interests or welfare of the United States. A certification pursuant to Section 2120 (a) (14) of the Act, as amended, has been issued, if required. Therefore, the petition has been approved. Name of Beneficiary File No. A18 029 489 Vidya Sagar PAHWA Date Petition Filed Date to Which Petition is Valid July 29, 1968 January 26, 1970 Occupation Civil Engineer Degrees, diplomas or certificates issued to beneficiary: Type of Degree Issuing Institution Place Date Certificate in Thomason College of Roorkee, India 1931 Engineering Civil Engineers (Now- University of Roorkee) Beneficiary's experience: Not applicable Beneficiary's exceptional ability in the sciences or the arts: Not applicable Beneficiary's city and state of intended residence: West Concord, Massachusetts Beneficiary's year of birth: 1908 Country of birth: Pakistan City and country of residence: West Concord, Massachusetts, USA Beneficiary's marital status: Married Number of minor unmarried children: None Not married Country of present residence of spouse and minor unmarried children, if any: USA D. I. Walsh, II E. J. Golden, SII DISTRICT DIRECTOR Date of Report January 27, 1969 Form I-463 (Rev. 5-1-68)"
}