{
	"anumber": "A18029489",
	"id": "A18029489_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REPORT of Third Preference Petition Approved Under Section 2ment Service, Form I-463"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1931, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEP. VT OF JUSTICE CADJ-7 Immigration and N ation Service REPORT OF THIRD PREFERENCE PETITION APPROVED UNDER SECTION 203(a) (3) OF THE IMMIGRATION AND NATIONALITY ACT, AS AMENDED. File No.: A 18 029 489 Date: January 27, 1969 Beneficiary: Occupation: Vidya Sagar PAHWA Civil Engineer Degrees, diplomas or certificates issued to beneficiary: Type of Degree Issuing Institution Place Date Certificate in Thomason College of Roorkee, India 1931 Engineering Civil Engineers (Now - Univ. of Roorkee) (U.S.Equivalent: Bachelor's degree in Civil Engineering) Beneficiary's experience: not applicable Beneficiary's exceptional ability in the sciences or the arts: not applicable Beneficiary's city and state of intended residence: West Concord, Mass. Beneficiary's age: born 1908 Country of birth: Pakistan City and country of present residence: West Concord, Mass, USA Beneficiary's marital status: married Number of children: three Country of present residence of spouse and children, if any: Two in USA and one in India It has been established that: the beneficiary is a qualified member of the professions. D.I.Walsh, I.I. the beneficiary, because of exceptional ability in the sciences or the arts, E.J.Golden, S.I.I. will substantially benefit prospectively the national economy, cultural interests or welfare of the United States. A certification pursuant to Section 212 (a) (14) of the Act, as amended, has been issued, if required. Therefore, the petition has been approved. DISTRICT DIRECTOR Form I-463 (Rev. 3-1-67)"
}
