{
  "anumber": "A18029489",
  "id": "A18029489_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "THE FERTILIZER CORPORATION OF INDIA LTD. GORAKHPUR DIVISION"
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        1968,
        1957,
        1964,
        1967,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Telegram: \"FERTILIZER\" Gorakhpur Telephones 697 & 638 Gorakhper THE FERTILIZER CORPORATION OF INDIA LTD. GORAKHPUR DIVISION Regd. Office & Head Office: F-43 SOUTH EXTENSION AREA PART i. RING ROAD, NEW DELHI THE 5 - SEP 1968 Other Units / Divisions: DIFI P. O. FERTILIZER FACTORY SINDRI (BIHAR) NAYA NANGAL (PUNJAB) TROMBAY (MAHARASTRA) NAMRUP (ASSAM) Our Ref. No. GP/PF-89 (121) 16414 GORAKHPUR (U.P.) DURGAPUR (WEST BENGAL) Your Ref. No. SERVICE CERTIFICATE TO WHOM SO EVER IT MAY CONCERN This is to certify that Shri V.S. Pahwa s/o Late Iala Ladha Ram has worked in this Organisation. I) As Executive Engineer (Civil) in the scale of Pso 600-40-1000- 50/2-1150 We e.f. 8.9. 1956 to 10. 12. 1957 in the Nongal Unit, Naya Nangal (Punjab). ii) As Public Health Engineer in the scale of Rso 1300-50-1600 W.e.f. 11.12.1957 to 24.90 1961 in the Nangal Unit. iii) As Dy.Chief Engineer (Public Health) in the scale of Rso 1300-50-1600 W.3.0. 25.9. 1961 to 14.5 1964 in the Trombay Unit, Bombay. iv) As Dy. Chief Engineer (Public Health) in the scale of Rs. 1300-50-1600 We3ef. 15.5. 1964 to 15.3 3. $1967 in the Gorakhpur Unit, Gorakhpur U.P. Last pay drawn by him was Pso 1600/- + Pio 150/- as Special Pay. He was superannuated W.e.f. 15th March 19 67 after attaining the Age of 59 years. During his stay in this Organisation his work & conduct was found satisfactory. BUILDING Shri V.S. Pahwa, JOHN FEDERATION 02203 Miny A. N. NE8, c/o Shri V.P. Pahwa, Employee Officer. F.C.I. Colony, GORAKHPUR UNIT. BOSTON, organial seen & 12/08/68 the usu"
}