{
	"anumber": "A18018390",
	"id": "A18018390_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18018390_0037/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form G-135, United States Department of Justice Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1962, 1960, 1968, 1955, 1967, 1964, 1900, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form G-135 Agency Name Check (Rev. 10-1-65) Office Boston, Mass. UNITED STATES DEPARTMENT OF JUSTICE File No. Immigration and Naturalization Service A-18 018 390 (DEP) Date February 13, 1968 FBI Ident. Number (LAST NAME) (FIRST NAME) (MIDDLE NAME) DATE OF BIRTH PRESENT NATIONALITY YEE James Wo January 20, 1900 U.K. & Col. PLACE OF BIRTH Toishan Dist. MARITAL STATUS OTHER NAMES USED (Maiden name, names by former marriages, former names changed legally Tai On Village, China SINGLE WIDOW(ER) or otherwise, aliases, nicknames, etc. Specify which, and show dates used.) MALE FEMALE MARRIED DIVORCED HEIGHT WEIGHT COLOR YEE SOOT WO, marriage name COLOR IDENTIFYING MARKS EYES HAIR numerous moles 65\" 165 bro grey on face IF MARRIED, WIDOWED, OR DIVORCED,GIVEFULLNAMEAND DATEAND PLACE OF BIRTHOF SPOUSE OR FORMER SPOUSE. INCLUDE WIFE'S MAIDEN NAME. GIVE DATES AND PLACES OF ALL MARRIAGES OR DIVORCES. Spouse: YEE YIP cit. U.K. & Co. born in Bak Nai Deng, Toishan, China married March 12, 1960 in Trinidad PARENTS NAMES (Last name) (First name) DATE AND PLACE OF BIRTH (If known) ADDRESS Father YEE Ho China deceased Mother YEE Fong Shee China 11 ORGANIZATIONS (Include any societies, clubs, etc., with which now or previously affiliated) None RESIDENCE LAST (5) (7) YEARS (Street & No., RFD, etc.) (City, state and country) FROM TO 53 Main Rd., Point Fortin, Trinidad, W. I. 1952 12/1965 Broadway, Boston 12/1965 9/1966 106 Tyler St., Boston 9/1966 2/1967 28 Harvard St., Boston 2/1967 Present EMPLOYMENT LAST (5) (7) YEARS (Employer's name) (Number, street, city, state) FROM TO Retired LAST ADMISSION TO U.S. (Date, port and status) 12-19-61 PRIOR ENTRIES AND DEPARTURES (Dates and ports or if numerous, list years when previously in U.S.) B-2, N.Y.C., PAA 220 3 - 1955, in transit, 1962, 1964 as visitor PREVIOUS REPORTS FURNISHED BY FBI: U.S. PASSPORT NO. (If known) SOCIAL SECURITY # YES NO If yes, attach list of reports. - None REASON FOR REQUEST ARMED FORCES SERIAL # DEPORTATION ADM. TO U. S. AND BRANCH OF SERVICE BENEF. PB #: NATURALIZATION ADJ OF STATUS SPONSOR PB # FOR RELIEF OF Assistant Commissioner Investigations BAL WAS DISTRIBUTION: (check appropriate block) MIL AIR USAF ARMY STATE STATE PERS RESERVE PERS OTHER PERS (1) (P.P.) (S.Y.) (2) FBI MID PROV. OSI ONI FBI SEE O.I. 328.1 FOR MAILING ADDRESS G-2 MAR. IDENT (USAF) (USN) SEE O.I. 105 FOR RB MAILING ADDRESS (3) FILE COPY"
}
