{
  "anumber": "A18029489",
  "id": "A18029489_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF APPROVAL OF VISA PETITION, I-171B"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1970,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Boston, Massachusetts 02203 Name of Beneficiary File No. A18 029 489 Vidya Sagar PAHWA Date Petition Filed Date to Which Petition is Valid July 29, 1968 January 26, 1970 Civil Encineer NOTICE OF APPROVAL OF VISA PETITION (for classification under Section 203 (a) (3) of the Immigration and Nationality Act, as amended) filed in behalf of the above-named beneficiary. Please note the items below which are indicated by \"x\" marks concerning this petition. Your petition for third preference classification has been approved by this Service and forwarded to the United States Consulate at This completes all action by this Service on the petition. This Service has nothing to do with the actual issuance of visas. Visas are issued only by a United States Consul who is under the jurisdiction of the U.S. Department of State. Under the law, only a limited number of visas may be issued by that Department during each year, and they must be issued strictly in the chronological order in which petitions were filed for the same classification. When the beneficiary's turn is reached on the visa waiting list, the United States Consul will inform him and consider issuance of the visa. The petition has been approved. The petition states that the beneficiary is in the United States and will apply to become a lawful permanent resident. The enclosed application for this purpose (Form I-485) should be completed and submitted by the beneficiary in accordance with the instructions contained therein. (If the beneficiary had previously submitted Form I-485 which was returned to him, he should resubmit that form.) The petition has been approved. The beneficiary will be informed of the decision made on his pending application to become a lawful permanent resident (Form I-485). The petition has been approved. The petition states that the beneficiary is in the United States and will XXXXXXX apply for adjustment of status to that of a lawful permanent resident. A visa number is not presently available; therefore the beneficiary may not apply for adjustment of status to that of a permanent resident at the present time. When a visa number becomes available he will be requested to apply. XXXXXX REMARKS: You are hereby granted to 1/26/70 within which to effect your voluntary departure from the U. S. The above also Very truly yours, applies to your wife. Passport enclosed with original documents. DISTRICT DIRECTOR Date of Approval of Petition January 27, 1969 G-361 to Quota OR NAME AND ADDRESS OF PETITIONER Mr. Vidya Sagar Pahwa 6 Conant Street West Concord, Massachusetts 01781 Form I-171B (5-1-68) THIS NOTICE TO BE MAILED TO THE ATTORNEY OR REPRESENTATIVE, IF ANY."
}