{
	"anumber": "A18018390",
	"id": "A18018390_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18018390_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1896, 1964, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form approved. RECEIVED Budget Bureau No. 43-R401.4. PETITION TO Date filed 10 C FEEPAID NO.68.157-1 CLASSIFY STATUS OF ALIEN RELATIVE FOR FEB 29 1968 Immigration and Naturalization Service ISSUANCE OF IMMI- BOSTON, MASS. M & F GRANT VISA U. S. Immigration & Naturalization Date 3-1-68 Verified 07 JFK Fed. Bldg. (Read this form and the attached instructions carefully before filling in petition) To THE SECRETARY OF STATE: 7/29/68 The petition is revalidated: The petition was filed on The petition is approved for status under section 203(a)(s) U.S. APPROVED INS Remarks: (District Director) (District Director) 2-5-70 (District) BOSTON, MASS. (Date) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) RECEIVED 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: ChedMAR 71968 The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. Immigration & Naturalization II The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States forepermanent residence. Boston. Mass. Block I.-Information About Petitioner 2. Name Yee Que Wah (First name) (Middle name) (Last name) If you are a married woman, give your maiden name 414 Tremont St. Boston, Mass. 02116 3. I reside in United States at (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) Address abroad (if any) (Number and street) (City or town) (Province) (Country) 4. I wäs born November 24, 1896 Toyshan District, Kwangtung Province, (Date) (City or town) (State or Province) (Country) (China 5. If you are a citizen of the United States, give the following: a. Was your citizenship acquired through birth in the United States, through naturalization, through parentage, or through marriage? Through Naturalization (1) If acquired through naturalization, give number of naturalization certificate and date and place of naturalization: Certificate No. 8675408, dated: March 9, 1964, in Boston, Mass. (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate: (b) If not, submit evidence of citizenship in accordance with Instruction 3a(2). b. Have you or any person through whom you claim citizenship ever lost United States citizenship? No. If so, attach detailed explanation on separate sheet. For Statistics 6. If you are a lawful permanent resident alien of the United States, give the followin on Minda a. Alien Registration Number: A b. Date, place, and means of admission for lawful permanent residence C. Have you ever lost status as a lawful permanent resident alien? If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) Form I-130 UNITED STATES DEPARTMENT OF JUSTICE-Immigration and Naturalization Service (Rev. 1-16-67)"
}
