{
	"anumber": "A18029489",
	"id": "A18029489_0056",
	"page_index": 56,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0056/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, A18 029 489"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE John Fitzgerald Kennedy Federal Building Government Center--Boston, Massachusetts 02203 October 23, 1968 A18 029 489 Institute of International Studies RECEIVED International Services and Research Staff Comparative Education NOV 1 81968 Office of Education Citca ct D.strict Director Department of Health, Education and Welfare Im grand and Naturalization Service 7th and D Streets, S. W. JFK Tederal Building Beston, Mass. Washington, D. C. 20202 Re: Vidya Sagar PAHWA (India) Gentlemen: Enclosed are documents (including certified English translations of documents in 5 foreign language. 11 any) relating to the foreign education of the subject. Please provide uo with an advisory interpretation of the level and major field of educational attainment of the subject, in terms of education in the United States. Please return our enclosures. Your cooperation in this matter will be sincerely appreciated. Very truly yours, 11/6/68 U. S. EQUIVALENCY : REMARKS: We need the following: 1) High School Certificate 2) Intermediate Certificate ficato Enclosures 3) B.E. Degree Hekin D Khame (K.2.21) Hakim I. Khan Specialist for the Middle East, North Africa, and South Asia Comparative Edu all on Branch International Services and Research Staff Institute I Form I-522 1 Studies Office of Edu, (Rev. 5-10-68)"
}
