{
  "anumber": "A18018390",
  "id": "A18018390_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18018390_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT, I-263B"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT Moston, Massachusetts A-18 018 390 Office: File No.: Statement by: JAMES WO YEE In the case of: JAMES WO YEE At: Boston, Massachusetts Date: February 8, 1968 Before: John A. McNamara, Investigator (Name and Title) Chinese Katherine Wong (USINS) In the language. Interpreter used. I am an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. I desire to take your sworn statement regarding a matter for which you may be prosecuted, to wit: your immigration status. Before we ask you any questions, you must understand your rights. You have the right to remain silent. Anything you say can be used against you in court. You have the right to talk to a lawyer for advice before we ask you any questions and to have him with you during questioning. You have this same right to the advice and presence of a lawyer, even if you cannot afford to hire one. We have no way of furnishing you a lawyer, but one will be appointed for you, if you wish, if and when you go to court. If you decide to answer questions now without a lawyer present, you will still have the right to stop answering at any time. You also have the right to stop answering at any time until you talk to a lawyer. Q. Do you wish to have a lawyer or any other person present to advise you? A. Yes, and he is present. He is Lenahan Connell, 31 Milk Street, Boston, Massachusetts. Q. Are you willing to answer my questions at this time? A. Yes. Q. Do you swear that all the statements you are about to make will be the truth, the whole truth and nothing but the truth, so help you God? A. I do. Form I-263B GPO 954-702 (8-2-66)"
}