{
  "anumber": "A18029489",
  "id": "A18029489_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PETITION TO CLASSIFY PREFERENCE STATUS OF ALIEN ON BASIS OF PROFESSION OR OCCUPATION, 4-140"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        1946,
        1908,
        1970,
        1968,
        1938,
        1969,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved Budget Bureau No. 43-R418.6 PETITION TO CLASSIFY DATE FILED RECEIVED FEE STAMP PREFERENCE STATUS OF MASS. ALIEN ON BASIS OF PROFESSION OR OCCUPATION JUL 29 12 04 PM '68 The petition was filed on July 29, 1968 TO THE The SECRETARY petition is approved OF STATE The petition is revalidated to for status under section 203(a) 3 Approval expires: January 26, 1970 Sec. 212(a)(14) certification attached. Sec. 212(a)(14) certification attached. U.S. APPROVED INS Blanket Sec. 2(a)( 4) certification issued Blanket Sec. 212(a)(14) certification issued. JAN 27 1969 RECEIVED REMARKS file DISTRICT DIRECTOR DISTRICT DIRECTOR A 18029489 Bos DATE w Ninn PC DISTRICT DISTRICT DATE BOSTON, MASS. S Immi PETITIONER IS NOT TO WRITE ABOVE THIS LINE Read this form and the attached instructions carefully before filling in petition Mass. Boston Petition is hereby made to classify the status of the alien beneficiary named herein for issuance of an, immigrant visa as (\"X\" one) A THIRD PREFERENCE IMMIGRANT-An alien who is a member of the professions, or who because of his exceptional ability in the sciences or arts will substantially benefit prospectively the national economy, cultural interests or welfare of the United States. (Sec. Immigration and Nationality Act, as amended.) If this box is checked, the alien or a person on his behalf, must complete only Part I, below. A SIXTH PREFERENCE IMMIGRANT-An alien who is capable of performing skilled or unskilled labor, not of a tempo- rary or seasonal nature, for which a shortage of employable and willing persons exists in the United States. (Sec. 203 (6), Immigration and Nationality Act, as amended.) If this block is checked, alien's prospective employer must complete Parts I and II below. (If you need more space to answer fully any questions on this form, use a separate sheet, identify each answer with the number of the corresponding question and sign and date each sheet.) PART I-INFORMATION CONCERNING ALIEN BENEFICIARY 1. NAME (Family name in capital letters) (First name) (Middle name) (Maiden name, if alien is a married woman) PAHWA, VIDYA SAGAR 2. BIRTHDATE 3. BIRTHPLACE (City or town) (State or province) (Country) 4. PRESENT NATIONALITY OR CITIZENSHIP March 7, 1908 D.G. Khan Punjab, Pakistan Indian 5. PRESENT ADDRESS (Number and street) (City or town) (State or province) (Country) (ZIP Code, if in U.S.) 6 Conant Street West Concord, Massachusetts U.S.A. 01781 6. ADDRESS IN THE UNITED STATES WHERE ALIEN WILL RESIDE (City) (State) 6 CONANT STREET, West Concord Massachusetts 01781 7. PROFESSION OR OCCUPATION Public Health Engineer ie, Engineer civil, sanitary & 8. DOES BENEFICIARY INTEND TO ENGAGE IN HIS PROFESSION OR OCCUPATION IN THE UNITED STATES? YES NO. IF Plumbing 9. TO YOUR KNOWLEDGE, HAS A VISA PETITION EVER BEEN FILED ON BEHALF OF THIS BENEFICIARY BASED ON HIS PROFESSION OR OCCUPATION? YES NO. If \"Yes,\" give name of each petitioner and date and place of filing. 10. HAS THIS BENEFICIARY EVER BEEN IN THE 11. ALIEN REGISTRATION NUMBER, IF ANY UNITED STATES? (\"X\" ONE) YES NO NONE 12. TO YOUR KNOWLEDGE, HAS THIS BENE- 12A. IF YOU MARKED \"YES,\" GIVE THE DATE AND PLACE WHERE HIS DEPORTATION FICIARY EVER BEEN DEPORTED FROM THE HEARING WAS HELD. N A UNITED STATES? (\"X\" ONE) YES NO 13. NAME (Last name) (First name) (Middle name) BENEFICIARY'S PAHWA, HIRA DEVI SPOUSE COUNTRY OF BIRTH DATE OF BIRTH PRESENT ADDRESS (No. and Street) (City or town) (State or Province) (Country) Pakistan August 8, 1912 6 Conant St., W.Concord, Mass. USA 14. NAME (Show M or S for married, or single) M.S. BIRTHDATE COUNTRY OF BIRTH ADDRESS YASH PAL PAHWA M Nov. 3, ,1936 Pakistan 6 Conant St. W. Concord Mass BENEFICIARY'S Dr. ASHOK KUMAR M Sept. 16 1938 Pakistan 12679 Tikoma, Utica, Mich. CHILDREN PERVEEN KUMAR PAHWA S Aug. 13, 1946 Pakistan 4/53 Roopnagar, India FORM I-140 (Rev. 1-15-67) UNITED STATES DEPARTMENT OF JUSTICE-IMMIGRATION AND NATURALIZATION SERVICE (Page 1)"
}