{
	"anumber": "A18029489",
	"id": "A18029489_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PART III—OATH OR AFFIRMATION OF PETITIONER OR AUTHORIZED REPRESENTATIVE, I-360"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "PART III-OATH OR AFFIRMATION OF PETITIONER OR AUTHORIZED REPRESENTATIVE 35. This petition was prepared by: (\"X' one) the petitioner another person. If petition was prepared by another person, Item 37 below must \"also\" be completed. The petition may be subscribed and sworn to or affirmed only by the following persons: In third preference cases- by the beneficiary himself, or by the person filing the petition on the beneficiary's behalf. If the petition is being filed by a person on behalf of the alien beneficiary, Item 36 below must be completed by that person. In sixth preference cases- by the employer who desires and intends to employ the beneficiary. If the employer is an organization the petition must be signed, subscribed and sworn to or affirmed by a high level officer or employee of the organization. I swear (affirm) that I have examined the contents of this petition and the accompanying documents and that the statements in this petition and the accompanying documents are true and correct to the best of my information and belief. NAME VIDYA SAGAR PAHWA SIGNATURE (Print petitioner's full, true, and correct name) (Petitioner's full, true, and correct name) TITLE Subscribed and sworn to (affirmed) before me this day of A.D. 19 68 at [SEAL] My commission expires 1975 (Signature of officer administering oath) (Title) 36. DECLARATION OF PERSON FILING PETITION FOR THIRD PREFERENCE ON HAIF OF ALIEN BENEFICIARY I declare that I'have been requested and authorized by the alien beneficiary to file this petition on his (her) behalf. (Signature) (Address-Number Street, City, State and ZIP Code) (Date) 37. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (Signature) (Address-Number Street, City, State and ZIP Code) (Date) TO PETITIONER: DO NOT FILL IN THIS BLOCK-FOR USE OF IMMIGRATION OFFICER a. Corrections numbered ( ) to ( ) were made by me or at my request. (Date) (City) (Signature of petitioner or authorized member of petitioner's organization) (Title) b. The person whose signature appears immediately above was interviewed under oath and affirmed all allegations contained herein. (Date) (City) (Signature and Title) INSTRUCTIONS Failure to follow instructions may require return of your petition and delay final action 1. HOW TO PREPARE PETITION. erence petition is approved, the beneficiary's spouse, and his a. Print legibly in ink or use a typewriter. unmarried children under 21 years of age, if accompanying or b. Submit one copy only for each alien beneficiary. following to join him, will automatically be eligible for the same preference status as the beneficiary. 2. WHO MAY FILE A PETITION. a. Third preference petition. A petition to accord an alien a 5. CERTIFICATION BY THE SECRETARY OF LABOR. third preference classification for issuance of an immigrant visa a. General. A third or sixth preference alien may not be may be filed by the alien himself or any person on his behalf. admitted to the United States unless the Secretary of Labor has The alien must be a member of the professions, or a person certified that (a) there are not sufficient workers in the United who because of his exceptional ability in the sciences or arts States who are able, willing, qualified, and available at the time will substantially benefit prospectively the national economy, of application for a visa and admission to the United States and cultural interests, or welfare of the United States. at the place to which the alien is destined to perform such b. Sixth preference petition. A petition to accord an alien a skilled or unskilled labor, and (b) the employment of such sixth preference classification for issuance of an immigrant visa alien will not adversely affect the wages and working conditions may be filed by any person or organization desiring and intend- of the workers in the United States similarly employed. ing to employ within the United States an alien who is capable Application for the certification of the Secretary of Labor (or of performing specified skilled or unskilled labor, not of a his designated representative) must be made on Labor Depart- temporary or seasonal nature, for which a shortage of employ- ment Form ES-575A, or Form ES-575A and B, in accordance able and willing persons exists in the United States. with the Instructions for Completion of Application for Alien Employment Certification. The forms and instructions may be 3. WHERE TO SUBMIT THE PETITION. obtained from any Immigration and Naturalization Service a. Outside United States. A person executing the petition out- office, consular office, or state employment service office. side the United States must take the completed petition to the The Department of Labor has published in Part 60, Title 29, nearest Immigration and Naturalization Service officer or Ameri- Code of Federal Regulations, three lists (Schedules) of occupa- can Consular officer. That officer will administer the oath or tions. \"Schedule A\" is a list of occupations for which the affirmation and furnish the address of the office of the Immigra- Secretary of Labor has issued a blanket certification. \"Schedule tion and Naturalization Service in the United States to which B\" is a list of occupations for which the Secretary of Labor the petition should be sent by the petitioner. will not issue the required certification for the reason that suf- b. In United States. A person executing the petition in the ficient workers are available in the United States or the admission United States must take or mail the completed petition to the of aliens for employment in such occupations will adversely office of the Immigration and Naturalization Service having affect wages and working conditions of workers in the United jurisdiction over the intended place of residence of a third pref- States similarly employed. \"Schedule C\" is a list of occupa- erence alien, or over intended place of employment of a sixth tions for which individual certifications are required, but for preference alien. which no Job Offer for Alien Employment (Form ES-575B) is 4. SPOUSE AND UNMARRIED CHILDREN UNDER 21 YEARS required by the Department of Labor. Information concerning Schedules A, B and C may be obtained at principal offices of OF AGE OF BENEFICIARY. the Immigration and Naturalization Service, consular offices and Do not submit petitions for beneficiary's spouse or unmarried offices of the state employment service. children under 21 years of age. When a third or sixth pref- b. Third preference petition. An alien (or a person on his"
}
