{
  "anumber": "A18029489",
  "id": "A18029489_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXPERIENCE, APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION (U.S. Code, Title 18, Sec. 1001)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        1951,
        1957,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "EXPERIENCE 16. (List the most important jobs related to alien's admission, starting with the most recent) (1) NAME AND ADDRESS OF EMPLOYER Fertilizer Corporation of India F.43 South Ext ing NAME OF JOB Delhi India. DATE STARTED DATE LEFT KIND OF BUSINESS Design, execu- Public Health Engineer/Dy C. E. Dec 1957 DecI967tion, Engineering. DESCRIPTION OF WORK PERFORMED vision ofconstruction Survey, 01, layout, inviting tenders, award of work& super Apartments, homes, administrative offices, hostels, hospital, club, and parks water-supply, drainage, sewerage, fire systems and roads and pathways in tilizer factories. Designing water, draiage sewerage& plumbing of above. (2) NAME AND ADDRESS OF EMPLOYER tilities including fire mains in factories and apartments. Nangal Fertilizers and Chemicals (P) ltd, now Ferti- Cor of India F.43 South NAME OF JOB DATE STARTED DATE LEFT New PRIND OF BUSINESS Design and Executive Engineer Civil & PH Sept I956 Dec 1957 execution of eng, ing job DESCRIPTION OF WORK PERFORMED Design, layout, inviting tenders, award of work, supervision of construc- tion of water supply utility including pumping, clarification, filtration, sto age, chlorination, demineralization and distribution, sewerage and drainage utilities in factory and homes. Maintenance of above. (3) NAME AND ADDRESS OF EMPLOYER Municipal Corporation Delhi India. NAME OF JOB DATE STARTED DATE LEFT KIND OF BUSINESS Assistant Engineer Jun 1951 Sept 1956 Town and muicipal eng- DESCRIPTION OF WORK PERFORMED ineering Layout and supervision of const of apartments school buildings, highways parks. Designing, layout, inviting tenders and supervision of construction of watersupply, drainage, and sewerage works in DelhiIndia. Maintenance of water, sewerage and drainage services and public conveniences in Delhi India. (4) LIST NAMES AND ADDRESSES OF OTHER EMPLOYERS IN PAST FIVE YEARS AND DESCRIBE WORK PERFORMED FOR EACH 17. \"X\" THE APPROPRIATE BOX BELOW AND FURNISH THE INFORMATION REQUIRED FOR THE BOX MARKED. Alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at Boston Massachusetts. (City) (State) 18. DECLARATION I DECLARE that all of the statements made in this document are true, complete, and correct to the best of my knowledge and belief. Date JULY 26, 1968 Signed Vidya (Alien (Delete one) Agent of Alien) DECLARATION OF AGENT OF ALIEN.- (If this form is submitted by an agent of the alien, the Jagent must sign and give his complete address.) I have read the notice on the face side of this form and am aware that section 1001 of Title 18 of the United States Code provides a fine of not more than $10,000 or imprisonment for not more than five years or both for knowingly and willfully falsifying, concealing or covering up by any trick, scheme, or device a material fact, or making any false, fictitious or fraudulent statements or representations, or making or using any false writing or document knowing the same to contain any false, fictitious or fraudulent statement or entry. I accordingly declare that to the best of my knowledge and belief the matters represented in this form, supplement thereto, and accompanying documents are true and correct. DATE SIGNATURE ADDRESS Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false document in the submission of this APPLICATION FOR ALIEN EMPLOYMENT CERTIFICATION (U.S. Code, Title 18, Sec. 1001) U.S. GOVERNMENT PRINTING OFFICE 1966-O-242-216 For sale by the Superintendent of Documents, U.S. Government Printing Office, Washington, D.C. 20402 - Price $1.00 per pad"
}