{
	"anumber": "A18029489",
	"id": "A18029489_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18029489_0049/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: United States Department of Justice Immigration and Naturalization Service\\nForm Number: G-325A REV. 4-1-67"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 4969, 1908, 1968, 1934, 1969, 1941, 1963, 1967, 1964, 1939, 1965]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' dy chief eng', 'engineer']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "INDIAN"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 A REV. 4-1-67 MAR 25 1969 FORM APPROVED BUDGET BUREAU No. 43-R436 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE INFORMATION Immigration and Naturalization Service (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) PAHWA MALE BIRTHDATE (MO-DAY-YR.) NATIONALITY ALIEN REGISTRATION NO. VIDYA SAGAR FEMALE MARCH 7,1908 INDIAN (IF ANY) ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. V. S. .PAHWA D.G.Khan, Pakistan (IF ANY) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER Pahwa Ladharam Date not known. Shorkot, Pakistan. Not alive MOTHER (MAIDEN NAME) Pahwa Ratan Devi. Date not known. Chitorgarh India. Not alive SPOUSE (IF NONE, so STATE) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (FOR WIFE, GIVE MAIDEN NAME) 1912 Multan Hira Hira Aug 8, Mianwali Pak May 15, 1934 Pak,. FORMER SPOUSES (IF NONE, so STATE) None FAMILY NAME(FOR WiFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION / OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 6, Conant Street West Concord Mass U.S.A. June 1968 PRESENT TIME 4/53 ROOpnagar Delhi Delhi India: March 1967 May 1968 Bungalow Type A Fertilizer Colony Gorakhpur U.P. India Sept 1965 Mar 1967 Shahi Building Ist Floor Cinoma Street Gorakhpur U.P. India July 1964 Aug 1965 Fertilizer Colony Chembur Bombay Maharashtra India Dec 1963 June 1964 LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) Steamer Pt Aden Aden ARABIA Aden Aden Apl 1939 Mar 1941 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR Anderson Nichols & Co Inc 150 Causeway St Boston Engineer Sept 68 PRESENT TIME Mass J.S.A. Greenloaf Associates 31 Parkway Cambridge Engineer Jul 68 Mass U.S.A. Sept 68 Fertilizer Cor Of India Gorakhpur U P India LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. \"INCLUDE ALL INFORMATIQNREQUESTED ABOVE.) Dy Chief Eng Jul 64 Mar 67 Fertilizer Cor of India Bombay pee 63 Jun 64 Air Ministry Aden THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN. NATURALIZATION ADJUSTMENT OF STATUS YOUR NATIVE ALPHABET IN THIS OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW Vidya SPACE: Lagarlation FOR KNOWINGLY AND WILLFULLY FALSIFYING Jan 20, 4969 OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT OR PETITIONER) This reply is result of check of FBI investigative files. To check arrest manada request must be submitted to COMPLETE THIS BOX (FAMILY NAME) FBI Identification Division. Finger- (GIVEN NAME (MIDDLE NAME) prints particular (ALIEN REGISTRATION NUMBER) PAHWA are necessary for check, SAGAR A18-077-489 Name (OTHER AGENCY USE) (INS USE) REFER TO DATA RE ASHOK KUMAR WHICH WAS SENT THE DETROIT Office Code BOS 020 Type of Case: Sec. 245 OFFICE OF INS ON, LOCALRASIS Date 3/50/69 manuglated 1/4/68strant (2) Rec. Br. FORM G-325A"
}
