{
	"anumber": "A18591348",
	"id": "A18591348_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, A18 5913448"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1948, 1902, 1940, 1932, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "A18 591 348 Form Approved Budget Bureau No. 43-R400.5 APPLICATION FOR STATUS AS PERMANENT RESIDENT FEE STAMP RECEIVED FILE NO. 9346 70 MAY25 PH2 N.J. APPLICATION FOR THE BENEFITS OF SECTION: 245 203 and Sec. 245, I&N Act I&NS. NEWARK. 249, I&N Act Sec. 13, Act of 9/11/57 ABOVE THIS LINE.) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED THE MORE NUMBER SPACE TO OF ANSWER (DO NOT FULLY WRITE ANY QUESTION ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER IN INK.) WITH THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check box A, B, C, or D) An immigrant visa is immediately available to me: A. other than as a refugee B. as a refugee under the proviso to Section 203(a)(7) of the I&N Act, as amended. I have resided in the United States continuously since C. prior to July 1, 1924. D. a date on or after July 1, 1924, but before June 30, 1948. (First Name) My alien registration number is Sex (Middle Name) MALE 2. My name is (Last in capital letters) ADA NONE FEMALE WACHSBERG (City) (State) (ZIP Code) 3. I reside in the United States at: (Apt. No.) (No. and Street) 128 WEST 32 ST. BAYONNE NEW JERSES 07002 Place of Birth (City or Town) (County, Province, or State) (Country) I am now a citizen of (Country) 4. Date of Birth KIEV Russia UNITED STATES MARCH 24,1902 5. I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) NEW YORK, NEW YORK APPRULIMEATELE 1905 as a (visitor, student, exchange visitor, temporary worker, crewman, parolee, etc.) by (Name of vessel or other means of travel) UNKNOWN was My noninimigrant visa was issued bv the United States Consul at (City) (State) on (Month) (Day) (Year) I inspected. was not N.YC, N.Y unknown - 1405 6. I am single married divorced widowed a. I have been married ONE times, including my present marriage, if now married. (If you are now married give the following: b. Number of times my spouse has been married C. Name of spouse ONE SAMUEL NACHSBERG d. My spouse resides with me apart from me at Address (Apt. No.) (Number and Street) (Town or City) (Province or State) (Country) 7. a. I have 2 children, as follows: (complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise give city and state or country of child's residence. Name Sex Place of Birth Date of Birth Now Living at OEENA HEISLER FE BAYONNE, N.J. AUG-13/1932 BELLE HARBOR, N.Y. ABLEHE KATZ FE BAYONNE, No.I. JAM. 1940 NEW PORK, b. The following members of my family are also applying for permanent resident status: NONE 8. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership in the United States or a foreign country, and the periods and places of such membership. (If you have never been a member of any organization, state \"None.\") WOHEH'S GROUP JEWISH HOSPITAL, JERSEY CITY,N.T. HAOASSAHT BAYONHES, SISTERHOOD JEMPLE ENGNUE BAYORKHE 9. I have have not heretofore filed an application for the status of a permanent resident. (If you have ever filed such application, give the date and place of filing and final disposition.) Form I-485 (Rev. 4-1-69) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Page 1)"
}
