{
  "anumber": "A18537888",
  "id": "A18537888_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18537888_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, 8"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(PLEASE TEAR OFF HERE BEFORE SUBMITTING PETITION) INSTRUCTIONS Not all of these instructions relate to the type of case which concerns you. Please read carefully those which do relate. Failure to follow instructions may require return of your petition and delay final action. 1. Eligibility. A petition may be filed by a citizen of the United States or a lawful permanent resident thereof to classify the status of specified alien relatives as follows: a. By a citizen of the United States: Except as noted in paragraph 2, a citizen of the United States may submit a petition on behalf of a spouse, child (regardless of age), parent (if the citizen is at least 21 years of age), brother or sister. b. By a lawful permanent resident alien: Except as noted in paragraph 2, an alien lawfully admitted to the United States for permanent residence may submit a petition on behalf of a spouse or an unmarried child regardless of age. 2. Petitions which cannot be approved. Approval cannot be given to petitions on behalf of- a. A parent, unless the United States citizen petitioner is at least 21 years of age. b. An adoptive parent, unless the relationship to the United States citizen petitioner exists by virtue of an adoption which took place while the child was under the age of 14, and the child has thereafter been in the legal custody of, and has resided with, the adopting parent or parents for at least 2 years. C. A stepparent, unless the marriage creating the status of stepparent occurred before the citizen stepchild reached the age of 18 years. d. An adopted child, unless the child was adopted while under the age of 14 and has thereafter been in the legal cus- tody of, and has resided with, the adopting parent or parents for at least 2 years. The same petitioner may not petition for more than two such children unless necessary to prevent separation of brothers and sisters. e. A stepchild, unless the child was under the age of 18 years at the time the marriage creating the status of stepchild occurred. f. A wife or husband by reason of any marriage ceremony where the contracting parties thereto were not physically present in the presence of each other, unless the marriage shall have been consummated. g. A prospective wife or husband. 3. Supporting documents. The following documents must be submitted with the petition. a. To prove United States citizenship of petitioner (where petition is for relative of a citizen). (1) If you are a citizen by reason of birth in the United States, submit (a) your birth certificate, or (b) if birth cer- tificate is unobtainable, copy of your baptismal certificate under seal of the church, showing place of birth (bap- tism must have occurred within 2 months after birth), or (c) if birth or baptismal certificate cannot be obtained, affidavits of two United States citizens who have personal knowledge of your birth in the United States. (2) If you were born outside the United States and became a citizen through the naturalization or citizenship of a parent or husband, and have not been issued a certificate of citizenship in your own name, submit evidence of the citizenship and marriage of such parent or husband, as well as termination of any prior marriages. Also, if you claim citizenship through a parent, submit your birth certificate and a separate statement showing the date, port, and means of all your arrivals and departures into and out of the United States. (Do not make or submit a photostat of a certificate of citizenship. See Instruction No. 8.) (3) If your naturalization occurred within 90 days immediately preceding the filing of this petition, or if it oc- curred prior to September 27, 1906, the naturalization certificate must accompany the petition. Do not make or submit a photostat of such certificate (see Instruction No. 8). b. To prove family relationship between petitioner and beneficiary. (1) If petition is submitted on behalf of a wife or husband, it must be accompanied by a certificate of marriage to the beneficiary and proof of legal termination of all previous marriages of both wife and husband. (2) If a petition is submitted by a mother on behalf of a child (regardless of age) the birth certificate of the child showing the name of the mother must accompany the petition. If petition is submitted by a father or step- parent on behalf of a child (regardless of age) certificate of marriage of the parents, proof of termination of their prior marriages, and birth certificate of the child must accompany the petition. (3) If petition is submitted on behalf of a brother or sister, your own birth certificate and the birth certificate of the beneficiary, showing a common mother, must accompany the petition. If the petition is on behalf of a brother or sister having a common father and different mothers, marriage certificate of your parents, and proof of termination of their prior marriages must accompany the petition. 3 (over)"
}