{
	"anumber": "A18591348",
	"id": "A18591348_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0024/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325 ( (REV. 9-1-69)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1970, 1904, 1935]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 (REV. 9.1-69 form Approved Budget Bureau No. 43-R434 BIOGRAPHIC NEW UNITED STATES DEPARTMENT OF JUSTICE INFORMATION SEC. 249 Immigration and Naturalization Service DATE: JUL 1970 (Family name) (First name) (Middle name) BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. MALE (If any) WACHSBERG ADA FEMALE MARCH 29 1904 JEWISH NONE ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) WACHSBERG IDA KIEV RUSSIA 142-38-3836 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER PECKER BENJAMUN KIEV RUSSIA BAYONNE, N.J. U.S.A. MOTHER (Maiden name) PE KOREN, ESTHER KIEV RUSSIA DEAD SPOUSE (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (For wife, give maiden name) WACHSERC 54004E4 5/5/03/HEW YORK, U.S.A JUNE 1935 NEW YORK FORMER SPOUSES (If none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NOHE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 128WEST 32 ST BAYONNE NEW JERSEY u. S. A JAN. 19542 PRESENT TIME Show below last foreign residence of more than one year if not shown above. (Include all information requested above.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION(Specify) MONTH YEAR MONTH YEAR NONE PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): Cada Wacksberg April 15 1970 PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
