{
  "anumber": "A18591348",
  "id": "A18591348_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A18 591 34"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        1905
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE A18 591 348 Place Status as a lawful permanent resident of the United States is accorded: File No. NAME Sex WACHSBERG, Ada Female ADDRESS 128 West 3rd St., , Bayonne, NJ NATIONALITY DATE OF BIRTH PLACE OF BIRTH Russia 32 3-29-04 Russia COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE: (If any) PRIORITY DATE Z-3 REMARKS NONPREFERENCE: Individual section 212(a)(14) cer tification issued; Blanket section 212(a)(14) certification issued; Section 212(a)(14) certification not required because As of June 15, 1905 at NYC (Month) (Day) (Year) (Place) Class of admission (insert coding symbol) Z-3 the requirements of the following provision of law having been fulfilled. Sec 203 (h) of the I & N Act Sec. 2 of the Act of 11/2/66 Sec 13 of the Act of 9/11/57 Sec 244 ( ) ( ) of the I & N Act Private Law no. of the Sec 245 of the I & N Act Sec 249 of the I & N Act Congress session Sec. 1 of the Act of 11/2/66 (Other law - Specify) (Applicable in all cases) July 21, 1970 R Date Recommended by Immigration Officer Date July 21, 1970 Approved Dominch District Director to Rinalda FOR USE BY VISA CONTROL OFFICE pow Date Foreign State Preference Category Number Month of Issuance STATISTICS Signed (Visa Office, Dept. of State) Date Form I-357 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D. .C. 20520 for allocation of Immigrant visa number. State Director, Selective Service Form I-181 (Rev. 11-2-66) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION ANDNATURALIZATION SERVICE"
}