{
  "anumber": "A18591348",
  "id": "A18591348_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form N-25 ( (Rev. 8-1-61)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1916,
        1908,
        1884,
        1970,
        1905,
        1910,
        1911,
        1914,
        1904
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved Budget Bureau No. 43-R 073.5 UNITED STATES DEPARTMENT OF JUS, ICE IMMIGRATION AND NATURALIZATION SERVICE DATE Clerk of the Aug. .12.1970 FILE NO. COUNTY COURT A 18 591 348- N 600 Hudson County NAME OF APPLICANT Jersey City N.J. NAME OF ALLEGEDLY NATURALIZED PERSON APPROXIMATE DATE OF NATIVE OF NATURALIZATION BENNE PECKER Dec. 14. 1916 Russia The person named above is alleged to have been naturalized in your court. If your records show that this person was naturalized, please fill out the blocks as completely as your records permit. If no naturalization record is found write \"No Record\" above your signature. However, if a Declaration of Intention was filed please fill in the lower block. If the subject's signature is available, please make one tracing on thin paper and return it with this report. The information is requested for the official use of this Service. Sincerely, NAME OF NATURALIZED PERSON AS SHOWN IN COURT RECORDS DATE OF NATURALIZATION Benne Pecker Dec. 14. 1916 PETITION NO. CERTIFICATE NO. COURT (Title and Location) Vol. 41 Hudson County 9353 Page 63 712247 Common Pleas Court Jersey City N.J. DATE AND PLACE OF BIRTH (or age) FORMER ALLEGIANCE 8/5/1884 Kive Russia Russia PLACE OF RESIDENCE OCCUPATION 239 Broadway Bayonne N. J. o Tailor DATE, PLACE AND MANNER OF ARRIVAL IN THE UNITED STATES March. 1. 1905 at New York N.Y. on the Patricia NAMES OF WITNESSES Bayonne Louis Barack 724 Broadway Bayonne N.J. (Rienzi Badugan 33 East-34th St.N.J. MARITAL STATUS NAME OF SPOUSE Married Esther NAMES OF CHILDREN, DATES AND PLACES OF BIRTH Ida March. l. 1904 at Keve Russia (Louis March. 4. 1908 Bayonne N.J. Narry Aug. 3. 1910 at Bayonne N.J. ( Leon Manch. 12. 1914 Bayonne N.J. (Note on Leon petition marked as deceased0 OTHER INFORMATION APPEARING ON RECORD None DECLARATION OF INTENTION FILED (Date) August. 5. 1911 AGE OR DATE OF BIRTH Signature of and Title person. August. 5. 1884 DATE August. 12. 1970 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form N-25 (Rev. 8-1-61) Exhilif"
}