{
  "anumber": "A18591348",
  "id": "A18591348_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Government Printing Office: 1969 of —337-977"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Cuba",
        "Mexico",
        "Dominican Republic",
        "Haiti",
        "Netherlands",
        "United States",
        "Bahamas",
        "Barbados",
        "Bermuda",
        "Jamaica"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1969,
        1948,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "acceptable); insurance records or letters on insurance company stationery a member of one of the classes of \"special immigrants\" listed in section showing the name and address of the insured and the date showing the of the Immigration and Nationality Act, as amended. (The classes lifetime of the policy; church, union or lodge records on official stationery of \"special immigrants' include certain former citizens of the United States; and bearing the organizational seal, if any, and giving specific dates in their certain ministers of religious denominations, and certain employees or honorably records showing your membership in the organization; letter from business retired former employees of the United States Government abroad.) firms on letterhead paper showing specific dates of business dealings with If you are a nonpreference alien who has checked box \"A\" in item 1 of this you and indicating your address of the period in question; notarized let- application, and you are performing or seek to perform skilled or unskilled labor, ters from landlords indicating the landlord's present address and the you are subject to the requirement contained in section 212(a)(14) of the Immi- beginning and termination dates of your residence at the particular prem- gration and Nationality Act, as amended, of obtaining a certification from the ises; marriage certificate of present and any previous marriages, and Secretary of Labor that there are not sufficient workers in the United States documents showing how many previous marriages were terminated; bills, who are able, willing, qualified, and available to perform such skilled or un- letters or receipts from your gas, electric, water or telephone company skilled labor, and your employment will not adversely affect the wages and showing the dates during which you received service from it. working conditions of workers in the United States similarly employed. NOTE: Women unemployed since marriage and unable to furnish evi- To apply for the Secretary of Labor's certification, you must follow this dence in their own names may furnish evidence in the names of their procedure: parents or other persons with whom they have been living if affidavits of (a) Submit Form ES-575A with this application if you are a member of a the parents or other persons are submitted attesting to residence with them. profession or a person with exceptional ability in the sciences or arts; or if you If any of the documents are lengthy or bulky, only the pertinent parts are qualified and will be employed in an occupation currently listed by the should be attached. Secretary of Labor on Schedule \"A\" or Schedule \"C\"-Precertification List (2) Affidavits of creditable witnesses, preferably citizens of the United (29 CFR 60). The Form ES-575A must be filled out in accordance with the States, who have personal knowledge of and can vouch for the continuity instructions for completion of that form and must be accompanied by the of your residence in the United States. Where practicable, such affidavits documentary evidence of your qualifications specified in paragraph C. below. shall be executed on Form I-488 (Affidavit of Witness). (b) If you are not within the classes of aliens described in paragraph 10(a) NOTE: If entry occurred prior to July 1, 1924, a record of lawful admis- above, you must fill out Form ES-575A in accordance with the instructions sion may be created as of the date of such entry. Therefore, if you have for the completion of that form and send it with documentary evidence of resided continuously in the United States since a date prior to July 1, 1924, your qualifications specified in paragraph (c) below to your employer or pros- it is very important to furnish evidence establishing that fact. pective employer. He must complete Form ES-575B and must send it, with 6. INTERVIEW.-When you are requested to appear for interview you will Form ES-575A and documentary evidence of your qualifications, to the local be required to bring with you your temporary entry ermit (Form I-94, AR- office of the State employment Service. When and if a certification is issued RIVAL DEPARTURE RECORD), and your PASSPORT. to your employer, it should be submitted with your application, together with 7. ALIENS INELIGIBLE FOR ADJUSTMENT UNDER SECTION 245.- the Forms ES-575A and ES-575B and the documentary evidence of your You are ineligible for adjustment of status under section 245, Immigration and qualifications. (c) The following documentary evidence of your qualifications must be Nationality Act, as amended, if: (a) You were born in any country of the Western Hemisphere or the submitted with your application for a labor certification: islands of Saint Pierre, Miquelon, Cuba, the Dominican Republic, Haiti, (1) School Records-If eligibility is based in whole or in part on Bermuda, the Bahamas, Barbados, Jamaica, the Windward and Leeward higher education or attendance at a technical or vocational school, attach Islands, Trinidad, Martinique and other British, French, and Netherlands certified copy of school record. The record must show period of attendance, major field of study, and degrees or diplomas awarded. territory or possessions in or bordering on the Caribbean Sea. However, if you are a native or citizen of Cuba who was inspected and (2) License or Other Official Permission to Practice a Profession-It you are a member of a profession, attach a copy of the license or other official admitted or paroled into the United States subsequent to January 1, 1959 and have been physically present in the United States for at least two years; permission granted you to practice the profession in the country where you or if you are the spouse or minor unmarried child of such native or citizen have been found qualified to practice that profession, if a license or other of Cuba with whom you are residing in the United States and were yourself permission is required in that country. inspected and admitted or paroled into the United States subsequent to Jan- (3) Evidence of Exceptional Ability in the Sciences or the Arts-If your uary 1, 1959 and have been physically present in the United States for at eligibility is based upon exceptional ability in the sciences or the arts, docu- least two years, you are eligible to apply for adjustment of status under the mentary evidence supporting the claim should be submitted. Such evidence Act of November 2, 1966, and you may apply for adjustment on Form I-485A. may testify to the universal acclaim and either national or international (b) You entered the United States as a member of the crew of a vessel or recognition accorded you; show that you have received a nationally or inter- aircraft, or were destined to join a vessel or aircraft in the United States as a nationally recognized prize or award or won a nationally or internationally recognized competition for excellence for a specific product or performance member of the crew when you arrived in the United States. (c) You were not admitted or paroled into the United States following or for outstanding achievement; or testify that you are a member in a na- tional, or international association of persons which maintain standards of inspection by a United States immigration officer. (d) You are or have been an exchange alien, and have not either complied membership requiring outstanding achievement as judged by recognized national or international experts in the specific discipline or field of with the two-year foreign residence requirement of section 212(e), Immigra- endeavor. tion and Nationality Act, or been granted a waiver of that requirement. (4) Affidavits and Published Material your eligibility is based on If you are ineligible under (a), (b) or (c) above, but have resided in the technical training or specialized experience, documentary evidence sup- United States continuously since prior to June 30, 1948, you may still apply porting the claim should be submitted. The recommended forms of evidence on this form to have a record of lawful admission for permanent residence are affidavits or published material. created under section 249, Immigration and Nationality Act. Affidavits-Thes must be made by independent sources, such as your former 8. IMMEDIATE RELATIVE AND PREFERENCE ALIENS.-If you are employers or recognized experts familiar with your work, and must: the spouse or minor unmarried child of a United States citizen, or if you are the (a) Identify the affiant, showing the capacity in which he is testifying; parent of a United States citizen who is at least 21 years of age, you are classi- (b) Give the place and the dates during which you gained your experience; fiable as an immediate relative; a visa petition must be filed in your behalf (c) Describe in detail the duties performed, tools used, supervision exercised unless your United States citizen spouse, parent or son or daughter is unable or over you and exercised by you. A mere statement for example that you were unwilling to file the petition for a reason other than the cost or inconvenience of employed as a baker is not adequate; and doing so. (d) Show the date on which the affidavit was signed. If a visa petition is required to establish immediate relative or preference Published Material- status, it must have been approved prior to filing this application. (a) Copies of material published by or about you may be submitted. (b) The material must be identified as to date, place and name of publi- 9. IMMEDIATE AVAILABILITY OF IMMIGRANT SA.-Information cation. as to immediate availability of an immigrant visa may be obtained at the nearest If you are a nonpreference alien performing or seeking to perform work in a office of this Service. category of employment for which the Secretary of Labor has determined that 10. CERTIFICATION OF THE DEPARTMENT OF LABOR.-Th he cannot now issue a certification (as listed in Schedule B, Part 60, Title 29, instruction applies to you only if: you checked box \"A\" in item 1 of the ap- Code of Federal Regulations), you are considered ineligible for adjustment of plication, and you are performing or seek to perform skilled or unskilled your status under section 245 of the Immigration and Nationality Act, as labor, and you are seeking adjustment as a nonpreference alien. You are amended. considered to be a nonpreference alien if you are not the beneficiary of a currently Information concerning the categories of employment currently listed in valid visa petition approved by the Immigration and Naturalization Service to Schedules A, B and C, Part 60, Title 29, Code of Federal Regulations, may be accord you a preference or immediate relative classification, and you are not obtained at principal offices of the Immigration and Naturalization Service. WARNING: If you contemplate departing from the United States to any country, including Canada or Mexico, before a decision is made on your application, consult with the office of the Immigration and Naturalization Service processing your case before departure, since a departure from the United States may result in a denial of your application. Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false docu- ment in the submission of this application. U.S. GOVERNMENT PRINTING OFFICE 1969 F-337-977 GPO 963-108 (Page 4)"
}