{
	"anumber": "A18537888",
	"id": "A18537888_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18537888_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative,, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "(4) If petition is submitted in behalf of a mother, your own birth certificate showing the name of your mother must accompany the petition. If petition is submitted on behalf of a father or stepparent your own birth certifi- cate and marriage certificate of your parents must accompany the petition, as well as proof of termination of prior marriages of your parents. (5) If either the petitioner or the beneficiary is a married woman, marriage certificate(s) must accompany the petition. However, when the relationship between the petitioner and beneficiary is that of a mother and child (regardless of age), the mother's marriage certificate need not be submitted if the mother's present married name appears on the birth certificate of the child. (6) If the petitioner and the beneficiary are related to each other by adoption, a certified copy of the adoption decree must accompany the petition. C. If the beneficiary is in the United States, submit his passport and Form I-94, Arrival-Departure Record, with the petition. d. Documents in general. (1) All supporting documents must be submitted in the original. If you desire to have the original returned to you, and if copies are by law permitted to be made, you may submit photostatic or typewritten copies. Photostatic copies unaccompanied by the original may be accepted if the copy bears a certification by an immigration or consular officer that the copy was compared with the original and found to be identical. A foreign document must be accompanied by a notarized translation, certified by the translator as to the accuracy of the translation and as to his competency to translate. (Do not make a copy of a certificate of naturalization or citizenship.) 4. Preparation of petition. A separate petition for each beneficiary must be typewritten or printed legibly, with pen and ink (one copy only). (If you need more space to answer fully any questions on this form, use a separate sheet, identify each answer with the number of the corresponding question, and date and sign each sheet.) 5. Execution of petition. You must sign the petition in your full, true, and correct name and affirm or make it under oath. a. In the United States the petition may be sworn to or affirmed before an immigration officer without the payment of fee, or before a notary public or other officer authorized to administer oaths for general purposes, in which case the official seal or certificate of authority to administer oaths must be affixed. b. Outside the United States the petition must be sworn to or affirmed before a United States immigration or consular officer. C. A member of the Armed Forces of the United States, either in the United States or abroad, may swear to or affirm the petition before an officer of the Armed Forces authorized to perform notarial acts under Article 136, Uniform Code of Military Justice. His wife or other dependent, abroad only, may swear to or affirm the petition in like manner. 6. Submission of petition. If you are residing in the United States, send the completed petition to the office of the Immi- gration and Naturalization Service having jurisdiction over your place of residence. If you are residing outside the United States consult the nearest American consulate as to the foreign office of this Service designated to act on your petition. If you are a United States citizen petitioning for an immediate relative classification in behalf of your unmarried child, the petition must be submitted in sufficient time for action to be completed on the petition and for the child to obtain a visa and reach the United States before the date on which he will be 21 years of age. 7. Fees. A fee of $10, payable in United States currency, must accompany this petition. The fee is required for filing the petition and is not returnable regardless of the action taken. If you mail this petition, attach money order or check. DO NOT SEND CASH. Money order or check should be drawn on a United States bank to the order of \"Immigration and Naturalization Service, Department of Justice.\" If residing in Guam, draw remittance in favor of the \"Treas- urer, Guam.\" If residing in the Virgin Islands, draw remittance in favor of the \"Commissioner of Finance of the Virgin Islands.\" 8. Penalties. Title 18, United States Code, section 1546, provides: \"Whoever knowingly makes under oath any false state- ment with respect to a material fact in any application, affidavit, or other document required by the immigration laws or regulations prescribed thereunder, or knowingly presents any such application, affidavit, or other document con- taining any such false statements, shall be fined not more than $2,000 or imprisoned not more than 5 years, or both.\" Title 18, United States Code, section 1426 (h), provides: \"Whoever, without lawful authority, prints, photographs, makes, or executes any print or impression in the likeness of a certificate of naturalization or citizenship, or any part thereof, shall be fined not more than $5,000 or imprisoned not more than 5 years, or both.\" U.S. GOVERNMENT PRINTING OFFICE: 965-O-790-974 For sale by the Superintendent of Documents, U.S. Government Printing Office, Washington, D.C., 20402 4"
}
