{
	"anumber": "A18961437",
	"id": "A18961437_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325 ( (Rev. 10-1-82) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1884, 2023, 1878]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' housekeeper', 'coc heper']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "Mexico"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Department of Justice OMB No. 1115-0066 nigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE NUMBER dE GONZALEZ EDUWIGIS ARIAS FEMALE 10-06-14 MEXICO 418 961 437 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (hone) EDUWihis OSORNIO MEXICO - MEXICO (If any) 556 06 5055 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER ARIAS PASCASIO 2/22/1878 QUERETARO-MEXICO - DECEASED MOTHER(Maiden name) OSORNIO, HILARIA 1/6/1884 QUERETARO MEXICO- DECEASED HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OP (For wife, give maiden name) WIFE NONE FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE MONZALEZ PERFECTO 4/15/01 4115169 GEORGETOWN TX 3/16/72 MILWAUKEE wiscopsin APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 408 5. BURLINGTON Ave #216 L.A CALL FORNIA USA 5 83 PRESENT TIME 105 So WESTMORKLAND#: L.A CAli FORNIA USA II 80 5 83 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR AvenidA VASLO de Quiroga 1096 MEYILO MEXICO MEXICO 10 14 9 69 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE. so STATE LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Asociacion NACIONAL pro-personas MAYORAS COOK HELPER 9 83 9 PRESENT TIME 85 122 ALAMAT WD, CA 90057 PAUL JABARA HOUSEKEEPER 4 81 9 83 8029 HEMET PL . V.A, CA 90046 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY): STATUS AS PERMANENT RESIDENT Eduwigin IF YOUR NATIVE LPRABET IS IN Arias OTHER THAN ROMAN LETTERS. de WRITE Jonalez YOUR NAME IN YOUR NATME ALPHABET 12/23/86 IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) GONZALEZ EDUWINIS ARIAS A-18 961 437 MAY - 400 25 (data), Form G-325 (Rev. 10-1-82) Y (1) Ident."
}
