{
  "anumber": "A18961437",
  "id": "A18961437_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1914,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES FORM APPROVED, IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 APPLICATION FOR VERIFICATION OF JAN 17 4 22 FEE STAMP LAWFUL PERMANENT RESIDENCE OF AN ALIEN no document FILE Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, submitted Mexico, D. F. I request that the American Consul at be furnished a verification of my lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 15. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: Arias de Gonzales, Eduwiges A-18 961437 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 18218 Wakecrest Drive- Malibu, Calif. 90265 Oct. 6, 1914 5. FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) Pascasio Arias Mexico, D. F. 7. MOTHER'S MAIDEN NAME: 8. I AM NOW A CITIZEN OF: (Country) Hilaria Osornio Mexico INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. PORT OF ARRIVAL: ARIAS DE GONZALES, EDUWIGIS Laredo, Texas 11 DATE OF ARRIVAL: (Month) (Day) (Year) 22. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No., etc.) Sept. 29, 1969 Afoot 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: 14. AT THE TIME OF LAST LAWFUL ADMISSION TO THE U.S. I ENTERED WITH XAN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD Perfecto Gonzales, husband, Milwaukee Wisconsin, U. S A. A PERMIT TO REENTER OTHER (EXPLAIN) AND I HAVE NOT BEEN ABSENT FROM THE UNITED STATES SINCE. 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH Jose Rogello Humberto Lopez Arias Feb. 20,1942 Mexico, D.F. RELATIONSHIP ADDRESS son Av. Ricarte #89- Col Tepeyac Insurgentes, Mexico, D. F. FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that the subject named above was was not lawfully admitted for permanent residence as shown. symbol for entries Aria after 30/24. Insert LAWFUL ADMISSION VERIFIED INS Office: Los Angele, Calif Marie de la Torrel Date: 1/17/72 Verifier: Contact Representative, USINS FORM I-550 (REV. 6-1-69) G-360 SENT 08-31-72bg"
}