{
  "anumber": "A18961437",
  "id": "A18961437_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0030/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "WISCONSIN STATE BOARD OF HEALTH ORIGINAL CERTIFICATE OF DEATH, 2015"
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1910,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 WISCONSIN STATE BOARD OF HEALTH State Filing Date State Death No. ORIGINAL CERTIFICATE OF DEATH Local Registrar's No, 2072 1. PLACE OF DEATH 2 USUAL RESIDENCE (Where deceased lived. If institution: residence before admission.) a. COUNTY a. STATE Wisconsin b. COUNTY MILWAUKEE Milwauke Please Cooperate. Use black ink to b. CITY, TOWN, OR LOCATION c. IS PLACE OF DEATH YES c. CITY, TOWN, OR LOCATION d. IS RESIDENCE YES improve a photo- INSIDE CITY OR static copy of this TOWN LIMITS? NO Milwaukee INSIDE CITY OR WAUWATOSA TOWN LIMITS? NO record for legal purposes. Type if d. HOSPITAL OR INSTITUTION e. LENGTH OF e. STREET (If rural, give mailing address)- f. IS RESIDENCE ON A FARM? possible. (If not in hospital, give street address) STAY 1b ADDRESS 2250 No. 16 St. YES NO MILWAUKEE COUNTY GENERAL HOSPITAL 1 day 3. NAME OF 3. (First) b. (Middle) e. (Last) 4. DATE (Month) (Day) (Year) DECEASED OF (Type or Print) GUADALUPE C. GONZALES DEATH December 9, 1966 5. SEX 6. COLOR OR RACE 7. MARRIED NEVER MARRIED 8. DATE OF BIRTH 9. AGE (In years IF UNDER 1 YEAR IF UNDER 24 HRS. last birthday) Months DIVORCED July 5, 1910 Days Hours Mins. Female Caucasian WIDOWED 56 10a. USUAL OCCUPATION (Give kind of work done 10b. KIND OF BUSINESS OR INDUSTRY 11. BIRTHPLACE (State or foreign country) 12. CITIZEN OF WHAT Reserved for during most of working life, even if retired) Own Home Texas COUNTRY? Coding USA Housework Hospital 13. FATHER'S 14. MOTHER'S NAME Pual Cavzos MAIDEN NAME Eulalia Guardiola 15. WAS DECEASED EVER IN U. S. ARMED FORCES? 16. SOCIAL SECURITY NO. 17. INFORMANT RELATIONSHIP Residence (Yes, no, or unknown) (If yes, give war or dates of service) None Perfecto Gonzales: Husband no 17a. NAME OF HUSBAND OR WIFE, IF ALIVE 17b. AGE OF HUSBAND OR WIFE, IF ALIVE Age Perfecto Gonzales 63 years 18. CAUSE OF DEATH (Enter only one cause per line for (a), (b) and (c).) INTERVAL BETWEEN PART L DEATH WAS CAUSED BY: Ace, Co. IMMEDIATE CAUSE (a) myocridial Refertion ONSET AND DEATH Acc. Place Conditions, if any, DUE TO (b) Arterindustic Heart Decease which gave rise to above cause (a), stating the under- lying cause last. DUE TO (c) Local Cause of death PART II. OTHER SIGNIFICANT CONDITIONS CONTRIBUTING TO DEATH BUT NOT RELATED TO THE TERMINAL DISEASE CONDITION 19. WAS AUTOPSY GIVEN IN PART I (a) Deeletes melletees PERFORMED? YES NO 20a. ACCIDENT 20b. DESCRIBE HOW INJURY OCCURRED. (Enter nature of injury In Part I or Part II of item 18.) 20c. TIME OF Hour, Month, Day, Year SUICIDE INJURY s.m. HOMICIDE p.m. 20d INJURY OCCURRED 20a. PLACE OF INJURY (e. in or about home, 20f. CITY, TOWN, OR LOCATION COUNTY STATE WHILE AT NOT WHILE farm, factory, street, office blds, etc.) WORK AT WORK the December 9, 1966 December 9, 1966 her 21. I attended deceased from to and last alive December 9, 1966 on Death occurred at 11:15 P.M. m on the date stated above; and to the best of my knowledge, from the causes stated. 22a. SIGNATURE (Degree or title) 22b. ADDRESS 22c. DATE SIGNED MILWAUKEE CO. GENERAL HOSPITAL ms MILWAUKEE 13, WISCONSIN 12-10-66 23a. BURIAL, CREMATION, 23b. DATE 23c. NAME OF CEMETERY OR CREMATORY 23d. LOCATION (City, town or county) (State) REMOVAL (Specify) Burial December 13, 1966 St. Adalberts Cemetery Milwaukee, Wisconsin 24. NAME OF FUNERAL HOME AND ADDRESS Voth & Anderson Inc. Funeral Home 2427 W. National Ave. Milwaukee, Wisconsin 53204 DATE REC'D BY LOCAL REG. REGISTRA SIGNATURE 25. FUNERAL DIRECTOR'S SIGNATURE DEC 1 9 1966 Michard M. Mosay ms PTHC"
}