{
  "anumber": "A18961437",
  "id": "A18961437_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: SOLICITUD DE VISA DE INMIGRATE Y REGISTRO DE EXTRANGERO\\nForm number: FS-513 ( (Spanish)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Form FS-519 (Spanish) SERVICIO EXTERIOR DE LOS ESTADOS UNIDOS DE AMERICA SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este formulario se debe llenar en duplicado en máquina de escribir O a mano en letras de molde legibles. De ser necesario, todas las preguntas se han de contestar. Las preguntas que no sean pertinentes se han de señalar. Si no hay espacio suficiente en el formulario, úsense hojas aparte en duplicado con los mismos números que aparecen en el formulario. Fijense a éste las hojas aparte. Este formulario no se debe firmar hasta que lo indique el funcionario consular. Los derechos por la solicitud de visa de inmigrante son 5.00 dólares. Los derechos deben pagarse al contado en dólares de los Estados Unidos o su equivalente en moneda local, O en giro bancario, cuando usted comparezca ante el funcionario consular. ADVERTENCIA: Toda declaración falsa, O el ocultar algún hecho esencial puede ser causa de exclusión total de los Estados Unidos de América. Aun cuando se le permita a usted la entrada al país, toda entrada a base fraudulenta puede ser causa de enjuicia- miento O de deportacion. Por la presente solicito visa de inmigrante y matrícula de extranjero LA EMBAJADA en de los Estados Unidos en MEXICO, D. y al efecto declaro lo siguiente: (I hereby apply for an immigrant visa and alien registration at the United States at and state the following facts:) 1. Apellido (My family name is) Nombre (My first name is) Apellido materno (My middle name is) GONZALEZ EDUWIGIS Arias de 2. Nombre completo en el alfabeto nacional si no se usan caracteres romanos (My full name in native alphabet (If other than Roman letters are used) is) EDUVIGIS ARIAS DE GONZALEZ 3. Otro nombre usado O por el cual se le conozca. (La mujer casada debe dar su nombre de soltera) (Other names I have used or by which I have been known are) (If married woman, give maiden name) EDUVIGIS ARIAS OSORNO 4. Fecha de nacimiento (The date of my birth 5. Lugar de nacimiento (My place of birth is) is) día 6 X año 1914 DISTRITO FEDERAL MEXICO MEXICO mes ciudad o pueblo provincia y país (day) (month) (year) (city or town) (province) (country) 6. Edad (My age is) 7. Profesión u ocupacion actual (My present calling or occupation is) AÑos HOGAR housewife 8. Direccion actual (My present address is) AVE. VASCO DE QUIROGA No. 1706, SANTA FÉ, MEXICO, D. F, 9. Sexo (My sex is) 10. Estado civil (My marital status is) Soltero Casado Viudo Divorciado Separado Masculino Femenino (Single (never married)) (Married) (Widowed) (Divorced) (Separated) (Male) (Female) 1 Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married times. 11. Nacionalidad (My nationality is) MEXICANA 12. Filiación (My personal description is) 13. Tengo las siguientes marcas visibles de identificacion (I have the following visible marks of identification) (a) Color del pelo (Color of hair) (c) Estatura (Height) none NEGRO blk 5 pies (ft.) 1 pulgs. (in.) NINGUNA (b) Color de los ojos (Color of eyes) (d) Tez (Complexion) CAFES brn MORENO fair 14. Mi objeto al ir a los Estados Unidos es: (My purpose in going to the United States is) RADICAR 15. Pienso radicarme en los Estados Unidos permanentemente O (indíquese el 16. Pienso entrar a los Estados Unidos por el puerto de (I intend to enter the período de permanencia) (I intend to remain in the United States perma- United States at the port of) nently or (Give length of time)) PERMANENTEMENTE LAREDO, TEXAS. 17. Tengo (o no tengo) boleto hasta mi destino final (I (Do) (Do Not) have a ticket to my final destination) TODAVIA NO 18. (a) Voy a los Estados Unidos a reunirme con la siguiente persona (indíquese 18. (b) Mi fiador es (indíquese el nombre y la dirección de la persona u organiza- el nombre, la dirección y el parentesco si es que lo tiene) (I am going to cion si es distinta de la que aparece en el parrafo (a) (I am sponsored by the United States to join the following person) (Give name and address the following person and/or organization) (Give address if different and relationship, if any) PERFECTO GONZALEZ from (a) ESPOSO) 2250 NORTH 16 ST., MILWAUKEE, WISCONSIN 19. Mi direccion permanente en los Estados Unidos será (My final address in the United States is) 2250 NORTH 16 ST. MILWAUKEE, WISCONSIN 53205 20. Mis recursos personales son: (My personal financial resources are) S1 (a) Efectivo (Cash) PARA GASTOS DE VISA ¥ V (g) Bienes raices (Real estate (value)) (b) Depósitos en bancos (Bank deposits) SI (d) Otros (Other) S1 ESTE FORMULARIO SE PUEDE OBTENER GRATIS EN TODAS LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA"
}