{
  "anumber": "A18961437",
  "id": "A18961437_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Spanish), Screeneded by NAA, 6/1/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Form FS-510 (Spanish) Página 4 32. (CONTINUED) (10) ¿Es usted un exvisitante del programa de canje de personas que no ha residido en el exterior durante dos años después de su salida de los Yes No Estados Unidos? (Are you a former exchange visitor who has not resided abroad for two years following your departure from the United Sí No States?) (11) ¿Es O ha sido usted (Are you now or have you ever been) (a) ¿Anarquista? (an anarchist?) Sí No (b) ¿Partidario de oposición a todo gobierno constituído? (an advocate of opposition to all organized government?) Sí No (c) ¿Partidario del Comunismo? (an advocate of Communism?) Si No (d) ¿Miembro o afiliado del Partido Comunista o de sus organismos afiliados o de una organización dominada por los Comunistas o de una organización que aboga por el derrocamiento por la fuerza de todos los gobiernos constituidos, o de cualesquiera otras organizaciones semejantes? (a member of, or affiliated with, the Communist Party or affiliated organization, an organization advocating Communism Si No or a Communist-dominated or controlled organization or an organization advocating the overthrow by force of all organized govern- ment or any other similar organization?) (Si la respuesta a cualquiera de las preguntas que anteceden es \"Si,\" sirvase dar explicaciones, indicando las fechas y la naturaleza de las actividades de los miembros) (If the answer to any of the above questions is Yes, explain, giving dates and nature of activities or membership.) (12) ¿Trata usted de entrar a los Estados Unidos desde el Canadá, Mexico O desde una isla adyacente a los Estados Unidos dentro de dos años después de su llegada a dicho país o isla? (Si la respuesta es sirvase indicar el nombre de la compañía de transportes en que llegó o Sí No trata de entrar en ese país o isla.) (Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in such country or island?) (If answer is Yes, give the name of transportation company by which you entered or intend to enter such country or island) 33. ¿Le ayudaron a usted a llenar esta solicitud? (De ser así, sirvase anotar el nombre y la dirección de la persona o personas que le ayudaron, indicando si son parientes, amigos, o abogados, agentes de viajes, etc.) (Were you assisted in completing this application?) (If so, give name and address of person or persons assisting you indicating whether relative, friend, attorney, travel agent, or other) Nombre (Name) Dirección (Address) MA. TERESA RAMIREZ DANUBIO 142-3 ESCRITORIO PUBLICO 5, NO SE DEBEN LLENAR LAS SIGUIENTES PARTES (14) El funcionario consular le ayudará a contestar las ec. 212 34. Declaro estar exento de exclusión para recibir una visa de conformidad con el artículo de la casilla 32, por las siguientes razones: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 32 for the following reason:) (14) Not Required: U.S. Citizen: IR-1 Spouse of 35. Declaro ser inmigrante de cuota preferencial (I claim to be a) conforme a la cuota ( preference quota immigrant under the IR BORN IN MEXICO inmigrante no incluido en cuota (Nonquota immigrant) Mi declaración se basa en los hechos siguientes: (My claim is based on the following facts:) 10 V.P. FILED July 69 approved July 31 69 by INS. MEXICO CITY Reconozco que estoy obligado a entregar mi visa al empleado de Inmigración de los Estados Unidos en el lugar donde solicité entrada al país y que, además, la posesión de la visa no me da derecho a entrar a los Estados Unidos si se encuentra que en el mo- mento no soy admisible, de conformidad con las leyes de inmigración. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) Reconozco que toda declaración hecha por mí intencionalmente, falseada O enganosa, o, el ocultar expresamente algún hecho esencial me puede sujetar a exclusión permanente de los Estados Unidos y, si se me admite a los Estados Unidos, me puedo ver sujeto a enjuiciamiento criminal o a deportación, o a ambos. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) El infrascrito, solicitante de una visa de inmigración a los Estados Unidos, juro (o afirmo) solemnemente que todas las declara- ciones consignadas en esta declaración han sido hechas por mí, inclusive los círculos de las casillas en el artículo 32, y que son ver- daderas y completas, a mi mejor y más leal saber y entender. Asimismo, juro (o afirmo) que en caso de ser admitido a los Estados Unidos no me dedicaré a actividades que sean perjudiciales al interés público O que pongan en peligro el bienestar, la seguridad y la tranquilidad de los Estados Unidos; a actividades prohibidas por las leyes de los Estados Unidos relacionadas con espionaje, sabotaje, desorden público, o a otras actividades subversivas a la seguridad nacional; a toda actividad que tenga por objeto oponerse, dominar O derrocar el Gobierno de los Estados Unidos por medio de la fuerza, la violencia u otros medios anticonstitucionales; que no me afiliaré O participaré en las actividades de toda organización que esté inscrita O se requiera su inscripción conforme al Artículo 7 de la Ley de Control de Actividades Subversivas de 1950. Reconozco, además, todas las declaraciones que anteceden, pues he pedido y recibido explicación de todo punto que no entendía con claridad. (I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this appli- cation have been made by me, including the encircling of items in part 32, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with, or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me.) Eduviges Firma Oriando del Solicitante Tonzales (Signature of applicant) Firmado y jurado ante mí el día 17 de sept de 19 69rman Subscribed and sworn to before me this day of 19 Service No Tariff Ites. No. Fee paid U.S. $5.00 Local CY Equiv. Oficial Consular (Consular Officer) U.S. GOVERNMENT PRINTING OFFICE 1961-O-615972"
}