{
  "anumber": "A18961437",
  "id": "A18961437_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Alien Relative; Form I-130A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1942,
        1903,
        1969,
        1914,
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened 3/1/2023 50-524 0-265 Block II.-Information About Alien Beneficiary A-Z7 EDUWIGIS 7. Name of alien ARIAS DE GONZALEZ (First name) (Middle initial) (Last name) If this petition is for a married woman, give her maiden name EDUWIGIS ARIAS OSORNO 8. Alien was born OCTOBER 6, 1914: DISTRITO FEDERAL MEXICO MEXICO (Date) (City or town) (State or Province) (Country) 9. a. Relationship of alien to petitioner WIFE NO b. Is the alien related to you by adoption? 10. Alien's marital status (Check appropriate block) Married Widowed Divorced Single a. Name of alien's spouse, if married, and date and country of birth PERFECTO GONZALEZ, - APRIL 9, 1903 U.S.A. b. Names, birthdates and countries of birth of alien's children, if any JOSE ROGELTO HUMBERTO LOPEL ARIAS FEB. 20, 1942 MEXICO, D. F., LIDTA FLORES ARTAS MAY 8, 1946, MEXICO, Dr MEXICO. C. Full address of alien's spouse and children, if any VASCO E QUIROGA # 1706, MEXICO, D. DOMICILIO CONOCIDO COLONIA NAVIDAD, CUAJIMALPA, D. F, 11. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage APRIL 16, 1969; TAYLOR, TEXAS, U. S. A. b. Number of your prior marriages NONE C. Number of prior marriages of spouse Two ONE d. Last address at which you and your spouse resided together 518 EDEMAN ST., TAYLOR, TEXAS, (Apt. No.) TAYLOR, TEXAS, 1969 (Number and street) S, A. APRIL From APRIL 1969. To (Town or city) (State or Province) (Country) (Month) (Year) (Month) (Year) 12. If this petition is for a child, a. Is the child married? NO b. Is the child your adopted child? NO If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 13. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 14. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner NONE 15. Have you ever filed a petition for this alien before? NO If so, give place and date of filing and result: 16. Has this alien ever been in the United States? YES Has this alien ever been deported from the United States? NO If so, give Alien Registration Number, and date and place where deportation hearing was held: 17. Address in the United States where alien will reside 2250 NORTH 16 ST. MILWAUKLE WISCONSIN 18. a. Address at which alien is presently residing VASCO DE QUIROGA # 1706, SANTA FE. D. E. MEXICO 1963 (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code, if in U.S.) Since (Month) (Year) b. If alien is in the United States, give the following: Name and address of present employer Date alien began this employment (Month) (Day) (Year) 19. Check the appropriate box below and furnish the information required for the box checked a. Alien will apply for a visa abroad at the American Consulate in MEXICO CITY MEXICO (City in foreign country) (Foreign country) b. Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at , (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Block III.-Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Subscribed and sworn to (affirmed) before me this Signature of petitioner (See Instruction 10 No. 5) Merluta Gonsaler day of July A.D. 1969 at mefito DE mix [SEAL] My commission expires Brown 0/0 (Signature of officer administering oath) (Title) Block IV.-Signature of Person Preparing Form, if Other Than Petitioner I MA. TERLS the RAMIREZ N. de Me that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledg DANUBI it 142-3, D. F JULY 9, 1969 (Signature) (Address) (Date) 2"
}