{
	"anumber": "A18961437",
	"id": "A18961437_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization and Citizenship Application,, N-4-102."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 (3) (31) If serving or ever served in the Armed Forces of the United States, give branch ; from 19 to 19 and from 19 to 19 inducted or enlisted at ; Service No. ; type of discharge ; ; rank at discharge ; (Honorable, Dishonorable, etc.) reason for discharge (alienage, conscientious objector. other) Reserve or National Guard from 19. to # (32) My occupation is unemployed Social Security 227 mo 1.3 List the names, addresses, and occupations (or types of business) of your employers during the last 5 years. (If none, write \"None.\") List present The FROM employment FIRST. present To EMPLOYER'S NAME (14) ADDRESS Unemployes OCCUPATION OR TYPE 9185 OF BUSINESS (a) 9 1983 PRESENT TIME Asociacion NACIONAL 122 MAMAR Sil.Cook HERPETL (b) 4 1981 9 1983 , PAUL JABARA 8029 HEMET P1. HOUSEKCEPER (c) 19 (d) , 19 19 19. 1/10 other 5 (33) Complete this block if you are or have been married. I am DIVORCED - 3/16/77 The first name of my husband 16 or wife is (was) PERFECTO (Separated, married, divorced, widowed) We were married on 4/15/69 at GEORGETOWN TX He or she was born at PASO tEYAS on 4/15/01 He or she entered the United States at (place) n/A on (date) N/A for permanent residence and now resides with me apart from me at UNKNOWN (Show full address if not living with you.) He or she was naturalized on N/A at N/A ; Certificate No. NA or became a citizen by Boen His or her Alien Registration No. is - (34) How many times have you been married? How many times has your husband or wife been married? If either of you has been married more than once, fill in the following information for each previous marriage. (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE CITIZEN ALIEN ENDED (a) UNKNOWN (b) (c) (d) (35) I have children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- (Number) wise give city and State of child's residence.) (b) Sex (c) Place Born (d) Date (e) Date (a) Given Names (g) Alien (Country) Born of Entry (f) Port of Entry Registration No. (h) Now Living at JOSE ROGELTO ARIAS MEXICO 2/20/42 12/20/80 SAN FISIDIOFOIA (b)(6) WINMINTON CA L.A,CA LIDIA Flores ARIAS I MEXICO 5/8/46 N/A U/A N/A mexico others 17 (36) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) I want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $35 for each child for whom you want certificates, otherwise, send no money with this application.) Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages."
}
