{
  "anumber": "A19320867",
  "id": "A19320867_0159",
  "page_index": 159,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0159/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REF_entr Permit Application: Supplement, REF_entr Permit Application: Supplement"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "REFNTR PERMIT APPLICATION: SUPPLEMENT 1 Do you own a home or an apartment in Taiwan? Yes No If not, who owns the home you are staying in now? 2. Do you own property in the United States? Yes No If not, who owns the home you stayed in the last time you were in the United States? My daughter Enti U.S DPTD U.S a/s 2/74 3. If you are married, is your spouse: 9/14/75 R/P 2/7/76 A permanent resident. 6/29/77 R/P 7/27/77 An American citizen. 6/8/78 ARC 10/19/78 Neither. If neither, has your spouse been petitioned? Yes No 11/28/80 ARC 1/3/81 4. Have you or your spouse been employed in Taiwan within the last 12 months? Yes No If so, by: A local company An American company Self-employed CHINESE GOVERNMENT SERVANT. 5. What close relatives do you have in the U.S.? Spouse Parents Children 6. Did you enter the United States with an immigrant visa or was your status adjusted while you were in the U.S. as a nonimmigrant? IV Adjusted status 7. When and where were you admitted for permanent residence? Date: 2-20-74 Port of entry: ALB IR-5 (or INS office) 8. After you became a permanent resident by either entering the U.S. with an immigrant visa or by having your status adjusted, how long did you remain in the United States? SINCE FROM 74 To PRESENT. Why did you leave the United States? TOWRIST 9. Is this your first reentry permit? Yes No. If not, is it your second? Yes No Your third?. Yes No 10. How many passports have you had? Z are they all attached? Myes No 11. Attach a copy of your U.S. income tax return for last year. If you did not file an income tax return, explain below: HOUSEWI FE. No INCOME I certify that I have completed this form by myself or that someone else has filled it out for me only after asking me all of the questions above. I have reviewed all of the answers and they are true and correct. Date: Your Name: chi-su- Liang Wu"
}