{
	"anumber": "A19320867",
	"id": "A19320867_0146",
	"page_index": 146,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0146/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, Form N-14 ( (Rev 9/16/97)"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Immigration and Naturalization Service File No.: A19 320 867 Date: 4/21/98 CHI S WU Officer: LAckie 7024 HEDGEWOOD DR RANCHO PALOS VERDES CA 90275 Reviewing Officer: Examination of your application (N400) shows that additional information, documents or forms are needed before your application can be acted upon. Please RETURN THIS LETTER WITH REQUESTED INFORMATION and/or DOCUMENTS by mail only within 87 days from the date of this letter 10 the following address: 7/21/98 Immigration & Naturalization Service P.O. Box 7390 Laguna Niguel, CA 92607 Failure to do so may result in the denial of your application. NOTE: ALL DOCUMENTS MUST BE ORIGINAL OR CERTIFIED COPIES. Any documents in a foreign language must be accompanied by a translation in English. The translator must certify that he/she is competent to translate and that the translation is accurate. Complete arrest report(s), court disposition(s), and probation report(s) (if applicable) for: (All court dispositions MUST be certified by the court issuing the record. If a record is DO longer available, you must submit documentation from the appropriate agency as to its unavailability If a record has been sealed or expunged, court records showing such must be submitted.) Police clearance(s) from the local law enforcement agency(ies), from all jurisdictions where you have resided for the last 5 years. Birth certificate of Marriage certificate of Divorce decree (interlocutory and final decree) of Death certificate of Your written statement and a letter from your church explaining how your religious beliefs prevent you from taking the full oath (over) Form N-14 (Rev 9/16/97)"
}
