{
  "anumber": "A19320867",
  "id": "A19320867_0094",
  "page_index": 94,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0094/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes. An alien who has actually established residence in the United States after after having been admitted as an immigrant or after after having adjusted status to that of an immigrant, and who is considering the filing of a nonresident alien tax return or the non-filing of a tax return on the ground that he is a nonresident alien, should consider carefully the consequences under the immigration and naturalization laws if he does so., Form I-143, Application for Extension of Permit to Reenter the United States, and must be accompanied by permit and by the fee specified in the instructions on Form 1-143."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "a member by treaty or statute anoth which the immigrant or after having adjusted status to that alien was not employed until after being lawfully admitted for permanent residence in order to of an immigrant, and who is considering the filing of a nonresident alien tax return or the non-filing qualify for such approval the applicant must have been physically United of a tax return on the ground that he is a nonresident States after permanent alien, should consider carefully the consequences residence of at least under the immigration and naturalization laws if he one year et does not does so. exempt the applicant from the that If an alien takes such action, he may be regarded e be physically present in the United States for as having abandoned his residence in the United least one-half of the period of residence re States and as having lost his immigrant status un awned for naturalization except 19 the CASP of the immigration and naturalization laws. As a those persons who are employed by or under consequence he may be ineligible for a visa or contract with the Government of the United States; other document for which lawful permanent resi- those persons who are authorized to perform the dent aliens are eligible; he may be inadmissible to ministerial or priestly functions of 8 religious de- the United States if he seeks admission as a return- nomination having a bona hide organization within ing resident; and he may become ineligible for the United States and those persons who are en- naturalization on the basis of his original entry or gaged solely by religicius denomination or by an adjustment as an immigrant. interdenominahomal mission organization having a EXTENSIONS: The validity of a permit may, on bone hide organization within the United States as good cause shown, be extended for a period or s missionary brother nun, or sister Such approval periods not exceeding one year from the original should be applied for on Form N-470, Application to Preserve Residence for Naturalization Purposes expiration date. (under section 316 (b) or 317, Immigration and Application for extension must be made prior Nationality Act) available at any office of the to the expiration date shown on this permit. The Immigration and Naturalization Service application should be submitted 30 to 90 days prior Aliens who are absent in connection with or for to the expiration date. the purpose of performing the ministerial or priestly The application must be made on Form I-143, functions of a religious denomination having a bona Application for Extension of Permit to Reenter the te organization in the United States, or who are United States, and must be accompanied by ungaged by such a denomination or an interdenomi- permit and by the fee specified in the instructions national mission organization having a bona fide on Form I-143. organization within the United States, as a mission- The application may be obtained from the issu- ary, brother nun, or sister are also eligible to make ing office shown on Page 2 or from the office of such application Such aliens may acquire the re- the Immigration and Naturalization Service having quired one year of uninterrupted physical presence jurisdiction over the place in which the applicant is after the absence. temporarily sojourning abroad. It may also be ob- EFFECT OF CLAIM TO NONRESIDENT ALIEN STA. tained at some United States consular offices. TUS FOR FEDERAL INCOME TAX PURPOSES An alien who has actually established residence in the If validity of the permit or extension thereof United States after having been admitted as an has expired, the alien must obtain an immigrant visa from an American Consul before embarking 16 4 for the United State BUREAU OF ENGRAVING AND PRINTING"
}