{
  "anumber": "A19320867",
  "id": "A19320867_0057",
  "page_index": 57,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0057/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes: An Alien who has actually established residence in the United States after having been admitted as an alien under section 316(b) or 317, Immigration and Nationality Act., F-4-02589"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "is a member by treaty or and by which the ving adjusted status to that alien was not employed until after being lawfully grant, and who is considering the filing admitted for permanent residence. In order to alien fax return or the non-filing qualify for such approval the applicant must have on the ground that nonresident been physically present and residing in the United consider carefully the consequences States, after being lawfully admitted for permanent and naturalization he residence, for an uninterrupted period of at least one year. The granting of such approval does not such action he may exempt the applicant from the requirement that abandoned his residence in the United e be physically present in the United States for aving lost his immigrant status i least one-half of the period of residence re- and naturalization laws quired for naturalization except in the case of he may be ineligible for a visa those persons who are employed by, or under for which lawful permanent contract with, the Government of the United States; are eligible he may be inadmissible in those persons who are authorized to perform the he-seeks admission as a return ministerial or priestly functions of a religious de- he may become ineligible nomination having a bona fide organization within on the basis of his original entry the United States, and those persons who are en- as an immigrant gaged solely by a religious denomination or by an The validity of interdenominational mission organization having a be bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-470, \"Application to Preserve Residence for Naturalization Purposes (under section 316 (b) or 317, Immigration and Nationality Act)\" available at any office of the stays prior to the Immigration and Naturalization Service. be submitted so Aliens who are absent in connection with or for authorized to act the purpose of performing the ministerial or priestly the permit's validity functions of a religious denomination having a bona The application ide organization in the United States, or who are Application for engaged by such a denomination or an interdenomi- national mission organization having a bona fide organization within the United States, as a mission- ary, brother, nun, or sister, are also eligible to make such application. Such aliens may acquire the re- quired one year of uninterrupted physical presence after the absence. consdiction EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- emporarily sojourning TUS FOR FEDERAL INCOME TAX PURPOSES: An lashed al some United States alien who has actually established residence in the H validity of the permit United States after having been admitted as an expired the alien from an American Consul 16 for the United States"
}