{
  "anumber": "A19360870",
  "id": "A19360870_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19360870_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR EXTENSION OF TIME OF TEMPORARY STAY"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1917,
        1971,
        1972,
        1973,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/1 1/2023 UNITED STATES DEPARTMENT OF RECEIVED READ INSTRUCTIONS CAREFULLY. FEE STAMP RECEIVED Form approved IMMIGRATION AND NATURALIZATION SERVICE FEE WILL NOT BE REFUNDED. Bureau No. 43 - R0068 APPLICATION AM 10: 06 TIME OF TEMPORARY STAY '7) APR26 AM 10: 14 I&HS. BUFFALO.N.Y. I HEREBY APPLY TO EXTEND MY TEMPORARY STAY IN 24128 mfer number NEWARK I&NS, NEWARK. N.J. THE UNITED STATES 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER 7. DATE TO WHICH EXTENSION IS REQUESTED MEHTA SAVITRI DEVI D5-136 APRIL 1972 2. OTHER NAMES (Include all past and present names; married woman must give her maiden name 8. REASON FOR COMING TO THE UNITED STATES none 3. MAILING ADDRESS IN U.S. SAVITRY Street) (City) (State) Devy Zip To visit my son and his (Number and Code) 65 SALEM ROAD ROCHESTER N.Y 14622 family, who are permanent resident of the U.S 4. DATE OF BIRTH (Mo. Day - Yr.) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 9. REASON FOR REQUESTING EXTENSION 3-10-1910 INDIA INDIA 5. NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES Possibility of going B 2 a under treatment. APRIL ****** 9,71 6. DATE AND PORT or LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS OF 10. DATE OF INTENDED DEPARTURE FROM U.S. New York 10/9/70 LAST ARRIVAL IN U.S. Air France April 1972 FOR GOVERNMENT USE ONLY 11. PASSPORT NUMBER PASSPORT ISSUED BY (Country) U.S. NYS I-903848 DATE INDIA EXTENSION GRANTED TO (Date) OF ACTION MAY 26 1971 PASSPORT EXPIRES ON (Date) October 9,1971 28 th july 1973 DD OR 12.1 AM AM NOT IN POSSESSION OF A EXTENSION DENIED V.D. TO (Date) OIC BUFFALO, N.Y. OFFICE 9e5 TRANSPORTATION TICKET FOR MY DEPARTURE 13. Number, Street, City, Province (State) and Country of Permanent Residence 14. MY USUAL OCCUPATION IS: 15. SOCIAL SECURITY No. c-138 Greater Kailash-I New Delhi (If none, state \"none\") House wife none 16. I AM AM NOT married. If you wish to apply for extension for you spouse and children, give the following: (See Instruction #1) NAMES OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) AND EXPIRES ON (Date) Ret'd. Completed Froord ved IT In NOTE: If spouse and children for whom you are extension do not reside with you, give their complete address on a separate attachment to this application. 5/14/91 17. (Insert \"Have\" or \"Have Not\") Have not BEEN EMPLOYED OR ENGAGED IN BUSINESSIN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADRRESS OF EMPLOYER OR BUSINESS XX KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED X X g 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), COMPLETE THIS BLOCK. I HAVE 1000 DOLLARS IN THE UNITED STATES. I RECEIVE DOLLARS EACH FROM: MR. & Mrs C. Mehta g (Day, Week, Month) Name and Address) 19. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES NAME RELATIONSHIP ADDRESS Mr. C. Mehta son 65 Salem Road, Rochester N. 14622 20. I ATTACH WRITTEN STATEMENT FROM Mr. C. Mehta DATED 4/21/71 IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE AND I MAKE IT PART OF THIS APPLICATION. (See Instruction 6.) I CERTIFY THAT THE ABOVE IS TRUE AND CORRECT SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN APPLICANT SIGNATURE OF APPLICANT Hild 7147 DATE I DECLARE THAT THIS DOCUMENT WAS PREPARED BY ME AT THE REQUEST OF THE APPLICANT AND IS BASED ON ALL INFORMATION OF WHICH I HAVE ADDRESS LABEL FOR NOTICE OF ACTION ON APPLICATION ANY KNOWLEDGE. TYPE OR PRINT (VERY FIRMLY AND CLEARLY) YOUR NAME, MAILING ADDRESS, AND IF APPROPRIATE \"In Care Of\" IN THE SPACES BELOW. SIGNATURE Whehter YOUR NAME Mrs. Savitri Devi Mehta c/o DATE STREET Mr. C. Mehta 4-21-71 ADDRESS 65 SALEM ROAD ZIP CITY AND STATE 14622 ADDRESS 65 Salem Rd ROCHESTER N.Y ATTACH YOUR FORM I-94 OR SW 434 States ⑉ Ro chester NY14622 FORM I-539 (REV. 11-1-70) Received Tr. In Rei'd Tr. Out Completed 4 4 30 5-19 5/45/1917 5/26/7 PM"
}