{
	"anumber": "A19360870",
	"id": "A19360870_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19360870_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY, I-539 ( (REV. 11-1-70)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1910, 1972, 1973, 2023, 1902]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 UNITED STATES DEPARTMENT OF JUSTICE READ INSTRUCTIONS CAREFULLY. IMMIGRATION AND NATURALIZATION SERVICE RECFEE WILL NOT BE REFUNDED. Form approved Budget Bureau No. 43 - R0068 APPLICATION TO EXTEN FEE STAMP TIME OF TEMPORARY STAY NOV-9 PM I: :05 $10.00 FEE PAID No. 90-7 Immigration and Naturalization Service I&NS, BUFFALO, N.Y I HEREBY APPLY TO EXTEND MY TEMPORARY STAY IN Buffalo, N. Y. RAIS THE UNITED STATES Date 11/9/71 Verified by are 1. FAMILY NAME (Capital (SAVITRI) FIRST NAME MIDDLE NAME FILE NUMBER MEHTA Letters) DEVI 7. DATE TO WHICH EXTENSION IS REQUESTED MARCH 72 2. OTHER NAMES (Include all pass and present names:marfied woman must give her maiden name) 8. REASON FOR COMING TO THE UNITED STATES 3. MAILING ADDRESS IN SAVITRY U.S. (Number and Street) Devy (City) State) TO VISIT my SON (Zip Code) 65SALEM ROAD ROCHESTER N.Y 14622 AND His FAMILY 4. DATE OF BIRTH (Mo. Day Yr.) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 9. REASON FOR REQUESTING EXTENSION 3-10-1910 INDIA INDIA BEING WIDOWED 8 5. NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES S-136 6. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS OF 9,oct,71 ILL HEALTH. 10. DATE OF INTENDED DEPARTURE FROM U.S. NEWYORK 19/9/10 LAST ARRIVAL IN U.S. CANIT SAY FOR GOVERNMENT USE ONLY 11. PASSPORT NUMBER PASSPORT ISSUED BY (Cour U.S. APPROVED INS DATE - 903848 INDIA EXTENSION GRANTED TO (Date) OF ACTION NOV 10 1971 PASSPORT EXPIRES ON (Date) March 30,1972 wm cutty 28th JULY, 1973 DD EXTENSION DENIED V.D. TO (Date) OR get 12.1 AM ANYNOT IN POSSESSION OF A OIC TRANSPORTATION TICKET FOR MY DEPARTURE OFFICE BUFFALO, N.Y. 13. Number, Street, City, Province (State) and Country of Permanent Residence NEW 14. MY USUAL OCCUPATION IS 15. SOCIAL SECURITY No. C-138 GREATER KAILASH-I DELHI WIFE (If none, state \"none\") HOUSE 16. I AM AM NOT married. If you wish to apply for extension for your spouse and children, give the following: (See Instruction #1) NAMES OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) or (Date NOTE: If spouse and children for whom you are seeking extension do not reside with you, give their complete address on a separate attachment to thistapplication 17. (Insert \"Have\" or \"Have Not\") I HAVE NOT BEEN EMPLOYED OR ENGAGED BUSINESS IN THE UNITEDSTATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THIBBLACK.A NAME AND ADRRESS OF EMPLOYER OR BUSINESS x KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED x 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), COMPLETE THIS BLOCK. I HAVE DOLLARS IN THE UNITED STATES. I RECEIVE DOLLARS EACH FROM: (Day, Week, Month) (Name and Address) 19. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES NAME RELATIONSHIP ADDRESS MR & MRS C. MEHTA SON 65 SALEM ROAD ROCHESTER 20. I ATTACH WRITTEN STATEMENT FROM MR. C. MEMTA DATED Nov, 71 IN S OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE AND I MAKE IT PART OF THIS APPLICATION. (See Instruction 6.) I CERTIFY THAT THE ABOVE IS TRUE AND CORRECT SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN APPLICANT SIGNATURE OF APPLICANT DATE (11-7-71) I DECLARE THAT THIS DOCUMENT WAS PREPARED BY ME AT THE REQUEST OF THE APPLICANT AND IS BASED ON ALL INFORMATION OF WHICH ADDRESS LABEL FOR NOTICE OF ACTION ON APPLICATION ANY KNOWLEDGE. TYPE OR PRINT (VERY FIRMLY AND CLEARLY) YOUR NAME, MAILING ADDRESS, AND IF APPROPRIATE \"In Care Of\" IN THE SPACES BELOW. SIGNATURE MRS S. Mehta chet Mehta YOUR NAME DATE ADDRESS STREET 65 SALEM ROAD Nov, 7/71 CITY AND ROCHESTER NY ZIP 14622 ADDRESS 65 Salem Rd. STATE JUST NOT MAILE BETOB ATTACH YOUR FORM I-94 OR SW 434 Naturall Rochester N.Y. Received Tr. In Ret'd.-Tr. Out Completed FORM I-539 (REV. 11-1-70) 1129 11/1902"
}
