{
	"anumber": "A19360870",
	"id": "A19360870_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19360870_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY IN THE UNITED STATES, I-539 ( (REV. ( 11-1-70)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/11/2023 UNITED STATES DEPARTMENT OF JUSTICE READ INSTRUCTIONS CAREFULLY. Form approved IMMIGRATION AND ZATION SERVICE FEE WILL NQT Budget Bureau No. 43 - R0068 APPLICATION TO EXTEND TIME9? PREMEORARY STAYL Buffalo, and and New FEE STAMP IMMIGRATION S. Immigration FEE PAID No. 187-15 and Naturalization Service/ NS BUEFALO, I HEREBY,APPLY TO EXTEND MY TEMPORARY STAY IN Buffalo, N. Y. RAIS THE UNITED STATES Date 3/29/72 Verified by 00 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER 7. DATE TO WHICH EXTENSION IS REQUESTED MEHTA SAVITRI DEVI Sept. 72 2. OTHER NAMES (Include all past and present names; married woman must give her maiden name) 8. REASON FOR COMING TO THE UNITED STATES To see my son a-nd 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 65 SALEM ROAD his family. ROCHESTER N. 14622 4. DATE OF BIRTH (Mo. - Day - Yr.) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 9. REASON FOR REQUESTING EXTENSION March10, 1910 INDIA INDIA To stay with my son 5. NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES B 2 March 30,72 6. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS OF 10. DATE OF INTENDED DEPARTURE FROM U.S. LAST ARRIVAL IN U.S. New York Oct.,9,70 Air France Not certain FOR GOVERNMENT US APPROVED INS 11. PASSPORT NUMBER PASSPORT ISSUED BY (Country) DATE I 903848 INDIA EXTENSION GRANTED TO (Date) OF PASSPORT EXPIRES ON (Date) ACTION APR7 372 July 28, 73 DD OR you 12. I AM X AM NOT IN POSSESSION OF A EXTENSION DENIED V.D. TO (Date) OIC TRANSPORTATION TICKET FOR MY DEPARTURE April 17, 1972 OFFICE BURRANO, 13. Number, Street, City, Province (State) and Country of Permanent Residence 14. MY USUAL OCCUPATION IS: 15. SOCIAL SECURITY No. HOUSE WIFE (If none, state \"none\") C138 GREATER KAILASH NEW DELHI INDIA X 16. I AM AM NOT married. If you wish to apply for extension for your spouse and children, give the following: (See Instruction #1) NAMES OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) AND EXPIRES ON (Date) NOTE: If spouse and children for whom you are seeking extension do not reside with you, give their complete address on a separate attachment to this application. 17. (Insert \"Have\" or \"Have Not\") have not BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADDRESS OF EMPLOYER OR BUSINESS KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN EDENDED 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), COMPLETE THIS BLOCK. I HAVE X I RECEIVE DOLLARS EACH FROM: the NDEX DOLLARS IN THE UNITED>STATES. (Day, Week, Month) (Name and Address) bi 19. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES NAME RELATIONSHIP ADDRESS Mr & Mrs C. Mehta son 65 SALEM ROAD, ROCHESTER N. Y 20. I ATTACH WRITTEN STATEMENT FROM C. MEHTA DATED March 25.72 IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE AND I MAKE IT PART OF THIS APPLICATION: (See Instruction 6.) I CERTIFY THAT THE ABOVE IS TRUE AND CORRECT SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN APPLICANT SIGNATURE OF APPLICANT DATE Hadlad 3/25/72 I DECLARE THAT THIS DOCUMENT WAS PREPARED BY ME AT THE REQUEST OF THE APPLICANT AND IS BASED ON ALL INFORMATION ADDRESS LABEL FOR NOTICE OF ACTION ON APPLICATION OF WHICH I HAVE ANY KNOWLEDGE. TYPE OR PRINT (VERY FIRMLY AND CLEARLY) YOUR NAME. MAILING ADDRESS AND IF APPROPRIATE \"In Care Of\" IN THE SIGNATURE SPACES BELOW chet Mehta YOUR NAME MRS SAVITRI DEVI MEHTA DATE STREET 3/25/72 ADDRESS 65SALEM ROAD ZIP ADDRESS CITY AND STATE ROCHESTER N.Y 14622 and Natur Fallzation servicead DO MOL MALLE ATTACH YOUR FORM 1.94 OR SW 434 Received Tr. In Ret'd.-Tr. Out Completed FORM I-539 (REV. 11-1-70) 4/9 4-7-12 pc"
}
