{
	"anumber": "A19320867",
	"id": "A19320867_0069",
	"page_index": 69,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0069/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes: An Alien who has actually established residence in the United States after having been admitted as an alien."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "is a member by treaty or atute and by which the or after status to that alien was not employed until after being lawfully immigrant and who scoudering the filing admitted for permanent residence. In order to conresident alien tax return or the non-filing qualify for such approval the applicant must have return on the ground the he been physically present and residing in the United should consider carefully States, after being lawfully admitted for permanent immigration and naturalizar he residence, for an uninterrupted period of at least one year. The granting of such approval does not such action he may be exempt the applicant from the requirement that abandoned his residence in the noted he be physically present in the United States for as having lost his at least one-half of the period of residence re- gration and naturalization laws quired for naturalization except in the case of frequence he may be ineligible for a VIS hose persons who are employed by, or under document for which lawful permanent ( contract with, the Government of the United States; antos are eligible he may be inadmissible those persons who are authorized to perform the stailed States if he seeks admission as ministerial or priestly functions of a religious de- resident and he may become ineligible nomination having a bona fide organization within valization on the basis of his original entry OF the United States, and those persons who are en- experiment as an immigrant gaged solely by a religious denomination or by an EXPENSIONS The validity of a permit may on interdenominational mission organization having a esed cause shown be extended for a period or bona fide organization within the United States as classions not exceeding one year from the original a missionary, brother, nun, or sister. Such approval repiration date should be applied for on Form N-470, \"Application Application for extension must be made prior to Preserve Residence for Naturalization Purposes the expiration date shown on this permit The (under section 316 (b) or 317, Immigration and application should be submitted not more than 90 Nationality Act)\" available at any office of the prior to the expiration date \" must ho wever Immigration and Naturalization Service. submitted so as to be received by the officer Aliens who are absent in connection with or for authorized to act thereen print to the expiration of the purpose of performing the ministerial or priestly the permit's validity functions of a religious denomination having a bona The application must be made on Form 1-131 fide organization in the United States, or who are Application for Extension of Permit to Reenter the engaged by such a denomination or an interdenomi- limited States, and must be accompanied by the national mission organization having a bona fide armit and by the fee specified to the instruction organization within the United States, as a mission- on Form 1-131 ary, brother, nun, or sister, are also eligible to make The application may be obtained from the such application. Such aliens may acquire the re- office shown on Page 2 or from the office of quired one year of uninterrupted physical presence Immigration and Naturalization Service after the absence. disdiction over the place in which the EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- temporarily sojourning abroad It may 00 bained at some United States consular others TUS FOR FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the If validity of the permit or extension theraol United States after having been admitted as an expired the alien must management from an American Consul ambarking or the United States 16"
}
