{
	"anumber": "A19320867",
	"id": "A19320867_0093",
	"page_index": 93,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0093/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes: An Alien who has actually established residence in the United States after having been admitted as an alien is not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for at least one-half of the period of residence required for naturalization except in the case of those persons who are employed by, or under contract with, the Government of the United States; those persons who are authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, and those persons who are engaged solely by a religious denomination or by an interdenominational mission organization having a a bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-4 70, ,  available at any office of the Immigration and Naturalization Service. Aliens who are absent in connection with or for the purpose of performing the ministerial or priestly functions of a religious denomination having a bona fide organization in the United States, or who are engaged by such denomination or an interdenominational mission organization having a bona fide organization within the United States, as a missionary, brother, nun, or sister, are also eligible to make such application. These aliens may acquire the required one year of uninterrupted physical presence after the absence. EFFECT OF CLAIM TO NONRESIDENT ALIN STAS FOR FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the United States after having been admitted as an alien having adjusted status to that of a nonresident alien was not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for at least one-half of the period of residence required for naturalization except in the case of those persons who are employed by, or under contract with, the Government of the United States; those persons who are authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, and those persons who are engaged solely by a religious denomination or by an interdenominational mission organization having a a bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-4 70, ,  available at any office of the Immigration and Naturalization Service. Aliens who are absent in connection with or for the purpose of performing the ministerial or priestly functions of a religious denomination having a bona fide organization in the United States, or who are engaged by such denomination or an interdenominational mission organization having a bona fide organization within the United States, as a missionary, brother, nun, or sister, are also eligible to make such application. These aliens may acquire the required one year of uninterrupted physical presence after the absence. EFFECT OF CLAIM TO NONRESIDENT ALIIN STAS for FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the United States after having been admitted as an alien having adjusted status to that of nonresident alien was not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for at least one-half of the period of residence required for naturalization except in the case of those persons who are employed by, or under contract with, the Government of the United States; those persons who are authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, and those persons who are engaged solely by a religious denomination or by an interdenominational mission organization having a a bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-nd 70, , ) available at any office of the Immigration and Naturalizationation Service. Aliens who are absent in connection with or for the purpose of performing the ministerial or priestly functions of a religious denomination having a bona fide organization in the United States, or who are engaged by such denomination or an interdenominational mission organization having a a bona fide organization within the United States, as a missionary, brother, nun, or sister, are also eligible to make such application. These aliens may acquire the required one year of uninterrupted physical presence after the absence. EFFECT OF CLAIM TO NONRESIDENT ALIEN STAS for FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the United States after having been admitted as an alien having adjusted status to that of nonresident alien was not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for at least one-half of the period of residence required for naturalization except in the case of those persons who are employed by, or under contract with, the Government of the United States; those persons who are authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, and those persons who are engaged solely by a religious denomination or by an interdenominational mission organization having a bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-nd 70, , ) available at any office of the Immigration and Naturalization Service. Aliens who are absent in connection with or for the purpose of performing the ministeriall or priestly functions of a religious denomination having a bona fide organization in the United States, or who are engaged by such denomination or an interdenominational mission organization having a a bona fide organization within the United States, as a missionary, brother, nun, or sister, are also eligible to make such application. These aliens may acquire the required one year of uninterrupted physical presence after the absence. EFFECT OF CLAIM TO NONRESIDENT ALIIN STAS for FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the United States after having been admitted as an alien having adjusted status to that of nonresident alien was not employed until after being lawfully admitted for permanent residence. In order to qualify for such approval the applicant must have been physically present and residing in the United States, after being lawfully admitted for permanent residence, for an uninterrupted period of at least one one year. The granting of such approval does not exempt the applicant from the requirement that he be physically present in the United States for at least one one-half of the period of residence required for naturalization except in the case of those persons who are employed by, or under contract with, the Government of the United States; those persons who are authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, and those persons who are engaged solely by a religious denomination or by an interdenominational mission organization having a a bona fide organization within the United States as a missionary, brother, nun, or sister. Such approval should be applied for on Form N-nd 70, "
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "is a member by treaty or statute and which the adjusted alien was not employed until after being lawfully and who is admitted for permanent residence. In order to Tax return qualify for such approval the applicant must have the ground that he is been physically present and residing in the United States, after being lawfully admitted for permanent consider carefully the residence, for an uninterrupted period of at least and naturalization one year. The granting of such approval does not exempt the applicant from the requirement that such action he may be physically present in the United States for abandoned his residence least one-half of the period of residence re- having lost his immigrant status quired for naturalization except in the case of immigration and naturalization laws those persons who are employed by, or under requience he may be ineligible for 8 visa or contract with, the Government of the United States; document for which lawful permanent resi those persons who are authorized to perform the shens are eligible he may be inadmissible to ministerial or priestly functions of a religious de- listed States if be seeks admission as a return- nomination having a bona fide organization within resident and he may become ineligible for the United States, and those persons who are en- on the basis of his original entry or gaged solely by a religious denomination or by an mediment as an immigrant interdenominational mission organization having a TENSIONS: The validity of a permit may on bona fide organization within the United States as cause shown, be extended for a period or a missionary, brother, nun, or sister. Such approval should be applied for on Form N-470, \"Application dentals exceeding one year from the original expiration date. to Preserve Residence for Naturalization Purposes (under section 316 (b) or 317, Immigration and Application for extension must be made prior Nationality Act)\" available at any office of the the expiration date shown on this permit The Immigration and Naturalization Service. application should be submitted 30 to 90 days prior Aliens who are absent in connection with or for the expiration date. the purpose of performing the ministerial or priestly The application must be made on Form functions of a religious denomination having a bona Application for Extension of Permit to Reenter the le organization in the United States, or who are United States, and musi be accompanied engaged by such a denomination or an interdenomi- and by the fee specified in the national mission organization having a bona fide Form 1-143 organization within the United States, as a mission- The application may be obtained from ary, brother, nun, or sister, are also eligible to make office shown on Page 2 or from such application. Such aliens may acquire the re- Demigration and Naturalization Service Maxing quired one year of uninterrupted physical presence alichon over the place in which the after the absence. temporarily sojourning abroad H may EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- at some United States consular allier TUS FOR FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the validity of the permit or United States after having been admitted as an has expired, the alien must from an Amarican Consul 16 the United"
}
