{
	"anumber": "A19320867",
	"id": "A19320867_0124",
	"page_index": 124,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0124/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa,, I-130."
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1935, 1974, 1948, 1914, 1906, 1933, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "SLB HECKEL JBS Form approved Budget Bureau No. 43-R0401 PETITION TO Date filed 10th Fee-stamp CLASSIFY STATUS OF FEE PAID RECEIVED No. 74-1-3 ALIEN RELATIVE FOR Immigration and Service ISSUANCE OF IMMI- 1973 JUL -2 AM 8:34 Date 7/2/77 Albany, N. Y GRANT VISA Verified'hy 1 & NS ALBANY TO THE SECRETARY OF STATE: The petition was filed on JULY 21973 Remarks The petition is approved for status under SLB 939 CHECKED section: Albany, No X4 U.S. APPROVED INS SPOUSE, 201 (b) CHILD 203(a)(2) DATE JAN 02 1974 OF ACTION 201 (b) PARENT 203 (a) (4) DD 203 (a) (5) DISTRICT William ALBANY, backley N. Ye 203 (a) (1) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. a0ezeto Block I. - Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) (Middle) 3.DoNotWrite in This Space 4. Relationship of beneficiary to petitioner Mother WU, Chi-Su Liang 6. Is beneficiary related to you by adoption? 5. Other names used; Married woman give maiden name No Chi-Su Liang 9. Beneficiary's marital status: 7. Place of birth (Country) 8. Date of birth (Month, day, year) Married Widowed Divorced Single China February 8 1914 12. Has this beneficiary ever been in- the U.S.? 10. Petitioner's name (Last in CAPS) (First) 11 Petitioner's phone Yes No WU, Julian Juh-Ren (518)436-4981 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) WU, Ta Yu April 5, 1906 China 14. Names, birthdates and countries of birth of beneficiary's children, if any Mrs. Jane Pu-chu Hu, Oct. 19, 1933; Julian J. Wu, June 15,1935; Mrs. Joyce Chin-yi Yeh, Aug 16 1939. A11 three above born in China and all-are now U.S. citizens. And Chu-Tao Wu, July 19 1948, born in China, now U.S. permanent resident. 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) (Please see the attached sheet.) 16. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) NOUS 17. If this petition is for a child, (a). Is the child married? (b) Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 18. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner 20. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: Form 1-130 UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service (Rev. 11-1-70) Y"
}
