{
  "anumber": "A19320867",
  "id": "A19320867_0154",
  "page_index": 154,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0154/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1981,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. IMMIGRATION AND NATURALIZATION SERVICE FLEET POST OFFICE ADDRESS: AMERICAN CONSULATE GENERAL TELEPHONE 5-279257 c/o AMERICAN CONSULATE GENERAL. BOX 30 FPO SAN FRANCISCO 96659 HONG KONG PLEASE REFER TO THIS FILE NUMBER HKC 223-C October 28, 1981 A19-320-867 (SND) Mrs. WU LIANG Chi Su 104 Tien Mu 3rd Road Taipei, Taiwan FOC 131 Dear Mrs. Wu: 12/30/81 Section 223 of the Immigration and Nationality Act as amended provides for the issuance and/or extension of a Reentry Permit to an alien Lawful Permanent Resident of the United States who has maintained that status and wishes to visit abroad temporarily. You were admitted to the United States for permanent status on February 20, 1974. You have been issued three permits to reenter the United States. Your husband is a citizen and native of Taiwan and you have not filed a Petition To Classify Status For Alein Relative, Form I-130 for him. It is concluded that you neither have a residence in the United States which you have no intention of abandoning nor can your absence be construed to be a temporary visit. Your application is therefore denied. There is no provision for an appeal from this denial. Your Reentry Permit #1205586 which is valid for application for admission to the United States until January 6, 1982 is herewith returned. Sincerely, Donald A.- Young Officer-in-Charge INS:JG:pw"
}