{
	"anumber": "A19320867",
	"id": "A19320867_0082",
	"page_index": 82,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0082/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Alien Registration Receipt Card ( I-94, I-90"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1927]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "13. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States. (If you have engaged therein, briefly describe and show periods of such employment or business activity.) ARRILING HORBAND 14. Since the time I became a permanent resident of the United States, I have filed a federal income tax return as a nonresident. Yes No. (If Yes\", state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of the Internal Revenue Service office where filed.) KIWEV 15. Since the time I became a permanent resident of the United States, I have failed to file a federal income tax return with respect to income I earned outside the U.S. because ! regarded myself as a nonresident alien and therefore exempt from tax on such earnings. Yes No. (If \"Yes\", state the years for which you failed to file tax returns for that reason.) 16. I do do not intend to return to the United States after my temporary visit abroad. 17. I do do hot intend to retain my status as a lawful permanent resident. 18. CHECK My Alien Registration Receipt Card is attached. Application Form 1-90 for issuance of Alien Registration Receipt Card is attached. ONE: My Permit to Reenter, which 1 wish to have extended, is attached. 19. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if I submitted or applied for that card, should be forwarded to: My address as shown in block #1, on reverse. U.S. Embassy or Consulate at TAIPE, TAIWAN REPUBLIC oF CHINA U.S. Immigration and Naturalization Office at Jot Other (Specify) 20. If application is for issuance of a Permit to Reenter execute Block A of Item 20 only. If application is for extension of a Permit to Reenter execute Block B of Item 20 only. If application was completed by other than the applicant, that person must execute Item 21. BLOCK A 9-99-59 BLOCK B I do swear (affirm) that I know the contents of this application signed I certify that I know the contents of this application signed by me and that the statements herein are true and correct. by me and that the statements herein are true and correct. 641-27 river 2vn CV J-1H-52 WU, chi-Su (Signature of applicant) Liang 20 (Signature of applicant) Subscribed and sworn to (affirmed) before me this day of January A.D. 19 76 Date: IDENCE Pioneer Savings Bank (Month) (Day) (Year) at (SEAL) My commission expires march 30 1927 \"X\" 0105 Theresa m. blenn Teller (Signature of officer administering oath) (Title) THERESA M. GLENN 21. Notary Public in the State of New SIGNATURE OF PERSON Residing PREPARING FORM, IF OTHER THAN APPLICANT in declare that this daoum ent was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. My Commission Expires March 30, 19 77 China Griug BLOMU Black Julian (Signature) 4 Sage Hill (Address) Lane Meuende, 12204 n.y (Date) 1-19-76 APPLICANT DO NOT WRITE BELOW THIS LINE A ction with regard to Alien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter Seen tped 1-30-76 I-151 submitted by alien returned Na DENIED (See denial notice for reasons 1. AR-103 or AR-3 submitted by alien returned GRANTED Permit valid to FEB 91977 New 1-151 issued on basis of I-90 Single entry Multiple entries : Restriction on travel in following countries waived: NONE DATE U.S. APPROVED INS NM DELIVERY OF PERMIT 0598291 INITIALS OF EMPLOYEE OF EFFECTING DELIVERY ACTION BY MAIL FEB 91976 TO APPLICANT PERSONALLY els Room OFFICE DATE Post Office Bldg. OFFICE ALBANY EXIENDIO Albany, New York 12201 2/12/76"
}
