{
  "anumber": "A19320867",
  "id": "A19320867_0114",
  "page_index": 114,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0114/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325A ( (REV. 8-72-72)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1931,
        1899,
        1889
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['none']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "N.A"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A (REV. 8-27-72)N Albany, N.Y. Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 I- 95,sec 245 nigration and Naturalization Service BIOGRAPHIC 1- 3-74 TC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. WU 9 Chi-Su Liang FEMALE 02-08-1914 Republic Of (If any) (60 MFA CITY AND COUNTRY OF BIRTH China (Taiwa SOCIAL SECURITY 329248 NO. ALL OTHER NAMES USED (Including names by previous marriages) Chi-Ann, Kiangsi, China (If any388 70 9424 Chi-Su Liang 388-70-9426 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER Liang, Se-Tze 1889 Chi-An, Kiansi, China same>deceased ) MOTHER (Maiden name) Lo, Bow-Yuan 1899 Chi -An. Kiansi, China (deceased HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) 1931 Chi-An, WIFE Huang- Hupei, (date Kiansi, WU, Ta-Yu 04-05-1906 China 9 est'd) China FORMER HUSBANDS OR WIVES (if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE None. APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 4 Sage Hill Lane Menands N.Y. U.S.A. June 1 973 PRESENT TIME Alley =5 =Lane = 12 Jen -Ai-=Ped Sect-$4 Tainei Taiwan Republic China 4722 Fond du Lac Trail Madison Wisconsin U.S.A. April 73 June 73 1-3 Alley 5, Lane 12, Jen-Ai Rd. 9 Sect. 4 Taipei Taiwan Rep. China June 65 April 73 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO MONTH YEAR MONTH YEAR STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY 1-3 Alley 5, Lane 12 Jen - Ai Rd. Sec. 4 Taipei Taiwan Rep. China June 65 April 73 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME None. Show below last occupation abroad if not shown above. (Include all information requested above.) THIS. FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): X IF chi su Liang Wu YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes # PENALTIES : SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}