{
  "anumber": "A19360870",
  "id": "A19360870_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19360870_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application Form N-4, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        2023,
        1948
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/11/2023 17. (Complete this block only if you checked Box E or F of Block 1) A. I first arrived in the United States at (Port) on (Date) by means of (Name of vessel or other means of travel) I was was not inspected by an immigration officer. B. I entered the United States under the name (Name at time of entry) and I was destined to (City and State) Mehta Savitri Devi Rochester N.Y I was coming to join (Name and relationship) my son his family C. Since my first entry I have have not been absent from the United States. (If you have been absent, attach a separate statement listing the port, date and means of each departure from and return to the United States.) 18. Completed Form G-325A (Biographic Information) is Completed Form G-325A (Biographic Information) is not attached attached as part of this application. as applicant is under 14 years of age. 19. IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, Signature of Applicant: WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: HINDI ALPHABET Date of Signature: 20. (Signature of person preparing form, if other than applicant.) I declare that Address of person preparing form, if other than applicant this document was prepared by me at the request of the applicant and is based on all information on which I have any knowledge. 65 Salem Road Rochester N.Y 14622 Chet Mehta Date: Occupation: Industrial Engr. not be until appears before an officer of the Immigration and Naturalization Service for examination) I, do swear (affirm) that I know the contents of this application subscribed by me includ- ing the attached documents, that the same are true to the best of my knowledge, and that corrections numbered to were made by me or at my request, and that this application was signed by me with my full. true name: Chef Mehta (son) acted Buffalony (Complete and true signature of applicant) as and interpreter sworn to before me by the 572 Subscribed above-named applicant at on (Month) (Day) (Year) (Signature and title officer INSTRUCTIONS Read instructions carefully. Fee will not be refunded. 1. APPLICATION.- separate application must be executed by each applicant. b. Submit the following documents only if you checked box \"A\" or \"D\" in An application in behalf of a child under 14 years of age shall be executed by the block I of the application. parent or guardian. Form G-325A (Biographic Information) must be completed and (1) Record of your birth. submitted with each application if the applicant is 14 years of age or older. Failure to (2) A letter from your present employer showing employment of a do so delays action and may result in return of the application. permanent nature, if you are employed, or an affidavit of support Form I-134 from a responsible person in the United States, or other evidence to establish 2. FEE.-A fee of twenty-five dollars ($25) must be paid for filing this that you are not likely to become a public charge. application. It cannot be refunded regardless of the action taken on the application. DO NOT MAIL CASH. Payment by check or money order must be drawn on a bank (3) If you are the spouse or unmarried minor child of a person who has or other institution located in the United States and be payable in United States been granted preference classification by the Immigration and Naturalization currency. If you reside in the Virgin Islands, check or money order must be payable Service or has applied for preference classification, and you are claiming the to the \"Commissioner of Finance of the Virgin Islands.\" If you reside in Guam, same preference classification, or if you are claiming special immigrant check or money order must be payable to the \"Treasurer, Guam.\" All other classification as the spouse or unmarried child of a minister of religion who has applicants must make the check or money order payable to the \"Immigration and been accorded or is seeking classification as a special immigrant, submit the Naturalization Service.\" When check is drawn on an account of a person other than following: For the spouse: Marriage certificate and proof of termination of all the applicant, the name of the applicant must be entered on the face of the check. If prior marriages of each spouse. For the child: Marriage certificate of parents, payment is made by the type of international money order that cannot be mailed, together with proof of termination of their prior marriages, if such documents the money order must be drawn on the postmaster of the city in the United States to have not been submitted by a parent. which the application will be mailed, and that city, the money order number, and the (4) If you are a nonimmigrant foreign government official, a member of date must be shown clearly on the top margin of the application form. the family or servant of such person, or a treaty trader, the spouse or child of such person or a foreign government representative to an international 3. PHOTOGRAPHS You must submit with this application two photographs of organization, a member of family or servant of such person, you must submit yourself taken within 30 days of the date of this application. These photographs Form I-508, waiving all rights, privileges, exemptions, and immunities which must be 1 1/2 by 1 1/2 inches in size, and the distance from the top of head to point of would otherwise accrue to you by virtue of such status. chin should be approximately 11/4 inches. They must not be pasted on cards or (5) If you checked box \"A\" in block 1 of the application, you must mounted in any way, must be on thin paper, have a light background, and clearly execute and attach a single copy of Form 1-590A. show a front view of your face without hat. Snapshots, group, full-length portraits or c. If you checked box \"B\" in block I of the application, submit your vending machine photographs will not be accepted. Using crayon or soft pencil to marriage certificate if you are the spouse; If you are the child, submit your birth avoid possible mutilation of the photographs, write your name lightly on the reverse certificate and the marriage certificate for your parent's present marriage. of the photographs. d. If you checked box \"E\" in block I of the application, submit documentary 4. FINGERPRINTS.- completed fingerprint card (Form 1-413) must be evidence to prove you have resided in the United States continuously since prior submitted by each applicant who is 14 years of age or older. Fingerprint cards with to July 1. 1924. If you have checked box \"F\", submit documentary evidence to instructions for their completion are available at any office of the Immigration and prove you have resided in the United States continuously since prior to June 30, 1948. Naturalization Service. You may have your fingerprints recorded on Form 1-413 at an office of this Service or you may prefer to present Form 1-413 to a police station or (1) Examples of documents which may be submitted to prove residence sheriff's office and request an officer there to record your fingerprints on the card. are: bankbooks, leases, deeds, licenses, birth records or baptismal records of The card must be signed by you in the presence of the officer taking your children born in the United States, census records, affidavits, police records: fingerprints, who must then sign his name and enter the date in the spaces provided. contracts, postmarked mail addressed to you, rent or tax receipts, premium It is important to furnish all the information called for on the card. installment receipt books or any other type of receipt: school records on the school's stationery showing dates when you entered and left the school and if 5. DOCUMENTS available, showing the name of parent or guardian and where you resided; a. General All documents must be submitted in the original. If you desire to employment records on letterhead paper or notarized, showing the signer's have the original of any of the other documents returned, and if copies are by law title and indicating exact dates of employment and stating if the employment permitted to be made, you may submit photographic or typewritten copies. If was continuous; insurance records or letters on insurance company stationery you stibmit copies, the original documents must be presented at the time of your showing the name and address of the insured and the date showing the lifetime examination. Each foreign document must be accompanied by a translation of the policy; church, union or lodge records on official stationery and bearing certified by the translator as to the accuracy of the translation and as to his the organizational seal, if any, and giving specific dates in their records showing competency to translate. If you are unable to secure documentary evidence from your membership in the organization; letter from business firms on letterhead abroad, you must submit proof of the efforts you have made to secure luch paper showing specific dates of business dealings with you and indicating your documents. address during the period in question; letters from landlords indicating the (Page 3)"
}