{
  "anumber": "A19360870",
  "id": "A19360870_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19360870_0012/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, 43-R423"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service Budget Bureau No. 43-R423 AFFIDAVIT OF SUPPORT (Fill in with typewriter or print in block letters in ink) I, CHETAN MEHTA (Name) Residing at 65 SALEM ROAD ROCHESTER (Street and number) N.Y 14622 (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. I was born on March 4th,39 at SHEIKHUPHRA INDIA Also, answer either a, b or c, as appropriate (Date) (City) (Country) if you are not a native born United States citizen (a) If a United States citizen through naturalization, give number of certificate of naturalization (b) If a United States citizen through parent (s) or marriage, give number of own certificate of citizenship . If none obtained, attach statement explaining how citizenship derived (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number. FOIA (b)(6) 2. That I am 33 years of age and have resided in the United States since Nov 1967 3. That this affidavit in at at is executed behalf of the following person(s) present residing 65 Salem Rd Rochester N.Y 14622 NAME MARRIED OR AGE RELATIONSHIP TO SEX COUNTRY OF BIRTH SINGLE DEPONENT MRS Saviti Devi India Widowed Mother Mehta 4. (a) That I am employed as, or engaged in the business of Industrial Engr with Taylor Instrume. (Name of concern) -nts at 95Ames st, Rochesterny 14601 and derive a net annual income of $ 11500 (b) That I have on deposit in savings (Address) banks in this country $ 3000+ (c) That I have other personal property, the reasonable value of which is $ HOURE (d) That I have stocks and bonds in the amount of $ , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at 65 Salem Road valued at $ 20,000 , with mortgages or other encumbrances there- on amounting to $ (f) That I have life insurance in the sum of $ , cash surrender value of $ (g) That if self-employed, I attach a copy of my last income tax return or report of com- mercial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) Form I-134 (Rev. 12-9-66)"
}