{
  "anumber": "A19320867",
  "id": "A19320867_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM 1-131 ( (Rev. 10-25-79)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1981,
        1974,
        1980,
        1914
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. OMB No 43-R0052. Immigration and Naturalization Service APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the SN0045265 Immigration and Nationality Act Use typewriter or print in block letters with ball point pen. 10/16/8 2 VESBOAED 112 issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME 'Capital Leners) FIRST MIDDLE 1. YOUR NAME WU Chi-su IMPORTANT: You must submit your Alien Registration Receipt Liang Card with this application if you checked \"Issuance\" above. C/O IN CARE OF Jane P. Wu If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt. No.) MAILING ADDRESS 8422 Prestwick Drive ALIEN REGISTRATION NUMBER IN U.S. (City) La Jolla (State) CA 92037 (ZIP Code) A- FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month) Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR Feb 8, 1914 China Taiwan, China Brown Black HEIGHT 5 FEET / INCHES VISIBLE MARKS AND SCARS NONE 3. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMA NENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS Wu, Chi-S Liang GRANTED ADJUSTMENT Albery, NY WAS GRANTED Feb20, 1974 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) Chiha Airline FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME Liang, S. C. LO 4. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Wu, Chi-Su Liang Los Angles, CA Dec 1981 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: China Airline 5. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Los Angler CA Jan , 1982 18 month NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL China Airline 6. FILL IN ITEM 6 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO RENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT 1980 (City and State) Dec San Diego, CA IS ATTACHED NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED, STATE EXPIRATION DATE Taken by immigration officer at port of entry ALL APPLICANTS MUST FILL IN ITEMS 7 THROUGH 16, INCLUSIVE 7. PRESENT OCCUPATION: Housewife NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER None 388-70-9424 8. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) 04TIEN- MU 3rd Road Taipei ZAIWAN, CHINA 9. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): To accompany ailing husband makin us RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM 1-131 (Rev. 10-25-79)N OVER"
}