{
	"anumber": "A19320867",
	"id": "A19320867_0074",
	"page_index": 74,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0074/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM I-131 ( (Rev. 4-1-76NM)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "Canada", "Mexico", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 1977, 1978, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE is 3600 ALB 10/13/78 Form approved. Immigration and Naturalization Service OMB No. 43-R0052 FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES 5.00 FEE PAID No 79-8-3 as provided in section 223 of the Immigration & Naturalization Servic Immigration and Nationality Act Milwaukee, Wisconsin INFO Date 10/12/78 Verified by D.H. Use typewriter or print in block letters with pall-point pen. issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE IMPORTANT: You must submit your Alien Registration Receipt 1. YOUR NAME WU Chi-su Liang Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No, and Street) (Apt. No.) MAILING 1225 Baldwin Court ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City)] Mequon, Wisconsin 53092 A- 19 320 867 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR Feb. 8, 1914 China Republic of China Brown Black HEIGHT 5 FEET 1/2 INCHES VISIBLE MARKS AND SCARS None 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS Wu, Chi-su Liang GRANTED ADJUSTMENT WAS GRANTED Albany, New York Feb. 20,/1974 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Wu, Chi-su Liang Los Angeles, California June 8, 1978 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: China Airlines 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Chicago, Illinois Oct. 30, 1978 12 months NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL Northwest Airlines N.A. FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. N.A. N.A. 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED June 20, 1977 Albany, New York IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED, STATE EXPIRATION DATE N.A. June 17, 1978 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: None NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER N.A. 388-70-9424 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) 20-2 Lane 44, Kin-men Street, Taipei Taiwan Rep. of China 11. COUNTRIES TO BE VISITED (List each country) Republic of China 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): To take care some personal business and to visit the health- deteriorating husband. RECEIVED TRANS IN RET'D-TRANS. OUT COMPLETED FORM I-131 (Rev. 4-1-76)N OVER OCT 1 3 1978"
}
