{
  "anumber": "A19320867",
  "id": "A19320867_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19320867_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT ( (FINGERPRINTS)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF J FICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT (FINGERPRINTS) APPLICANT NAME: CHI su Will FILE NO 19 320 867 DATE 11/18/98 EXECUTED AT LACAINA NIQUEL Before the following officer of the U.S. Immigration and Naturalization Service: in the CHINA (NAME AND TITLE) language. Interpreter WERE used. I, CHI Su Wu , acknowledge that the above named officer has identified. himself/herself to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He/she has informed me the he/she desires to take my sworn statement regarding: N400 He/she has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: Q. What is your true, full and complete name? A. CHI su wu Q. What is your place and date of birth? A. CHINA DOB = 02-08-1914 Have you ever been arrested or detained by a law enforcement officer? A. NO Q. Have you had your fingerprints taken for any reason by a law enforcement officer? A. NO Q. Have you ever been issued a ticket or been taken into custody by a law enforcement officer? A. NO Q. Have you ever been ordered by a court to: pay a fine; go to jail; serve a probationary sentence; perform community service: make restitution; or have your wages garnished (e.g., for failure to make child support payments)? A. NO Q. Have you ever received an expungement, parole, pardon, or successfully completed a diversion or rehabilitation program? A. NO Q. If you have answered \"yes\" to any of the above questions. please explain below: A. I certify. under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore. I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking. gnature of Applicant chi Su the Wu 18TH day of Nov 19 98 Sworn and subscribed heir Alu Signature INS Officer before Signature me: of Witness"
}