{
	"anumber": "A19581639",
	"id": "A19581639_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECEIVED, 3022 Heirlloom Way Sacramento, Ca. 95826"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1979, 1970, 1972, 1980, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 RECEIVED 3023 Heirloom Way FEB 4 1980 Sacramento, Ca. 95826 Mr. David Ilchert, 3rd ROBERT DISTRICT T. CALIFORNIA MATSUI, M.C. District Director, Deportation Branch, 630 Sansome Street San Francisco, Ca. 9411 Dear Sir, This is an appeal against the denial of the application for extended stay in U.S.A. by my grand-mother Mrs. Dhankunvar Mohanlal Gatha. I and my husband sponsored my grand-mother's trip from India to U.S.A. under visitors visa. She came to U.S.A. on December 2nd, 1978 and intended to return to India by March 1979. As she had not visited other parts of U.S.A. and also wanted to visit my brothers and their families in Canada. She applied for six month's extension in March 1979 which was extended upto October 1979. By then her health began to fail and we felt that she should be staying with us and not return to India because she needed constant care and attention. There is nobody in India to look after her. Hence we applied for further extension. In fact we requested for a permanent stay for her on October 2nd,1979. The immigration authorities denied this request and gave a final extension upto February 2nd, 1980. We considered sending her to Canada where my brothers are living but they made it clear that they are willing to send money for her support but they would not be able to look after her. So this door was closed to her. During this period her health subsequently deteriorated and now she can hardly walk from her bedroom to the bathroom. Under these circumstances we again applied to the immigration for extension of her stay and a verbal request was made for her permanent stay on January 22nd, 1980 for reasons of her ill health. Her doctor's certificate testifies for her illness and the need for her to be living with the family. This request was also denied and they have given a defferred departure upto April 23nd, 1980. Under these circumstances, considering her ill-health and the fact there is nobody in India to take care of her, I request you to grant her a permanent stay in U.S.A. on compassionate grounds. She is eighty-three years old and how long is she going to survive under this kind of physical condition? I and my husband will take all the responsibility of her living and medical expenses. My two brothers are also remitting money for her support. I may add that when my grand mother visited U.S.A. in 1970, she was given a permanent residency in April at Balitmore, Maryland and her alien registration card number is A 19-581-639. She went back to India in the October of 1972 but was unable to return within the stipulated time due to her illness then, and her green card has since then expired. Hoping for a favorable reply and thanking you. is Yours sincerely, This The my letter are Mrsskmithaiwala has rent t. the deputation Brand. (=) per your request (sohinee K. Mithaiwala )"
}
