{
  "anumber": "A19581639",
  "id": "A19581639_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 7/13/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 DO NOT WRITE BELOW THIS LINE - FOR GOVERNMENT USE ONLY. REMARKS: #KRD xomi RECEIAED ANYHO - one PM you POONER 3053 OVAK you 2012 M92 business ps we of the Lednezs of the 900 12 pareq ou all ou mpies 1 pano OUR Ot LOUN It OTHER on COUNTR we tue spons 12 tins SUG COLLECT n/y 4/H hilb leves two YOOKSEE Oil os INCOME - MECK OF BROWN RUDEO 14 non HYAE OUR ENGPOLES on chovoto ⑉ ⑉ ANE ORIGED REVIEW CONSFELS MEDA os AHE Brace ⑉ (SHREHA on NY. DEEH REGROAED on EMOVOER IM is AND names RAYAUR HOLE PAP CHICAMON KOW KHOK ion VAR TEENING 00 HOL agains MEAN Agai BIAE AMERICAN VODUES the . RELEAVER will HYWE OK PHONES YWO CHICOHEN OYIS 06 BIKIN CONHINA On BIRTH STREET TERNED BA (conseen) YOU EXPIRES on (DVLS) INVOICE - . an MIEM to EXAMMAION ov KORW cannot of CHICONER OTAR THE (OKE insurance - HHLP WONLING Dates his his its HOME concerns or in MA neave KO are greeds 11-31-1883 INDIA (CONTAINA) 13 MOTON DEMIS A'D (OVLE) LICHER LOM NA MARK ORO - THE Ok Vis 18 IRLEND 40 DELYNS sean AHE or 26YHARD to (DWAE) on Duty A. MARMS WD of vastas LOU nat OHEA in the HYAE AON EAEN VERVISO - ALAY ON AME BEEMIA MONDEY on NONE 1001 130231 ze WD. April OMO MY 7604 Dsc him Jolk MEDIATOR OVLE ou real nexeus on OAHCH KEYME OH JEW bried A121 JNS 4880 any you taw 12 avis on 1841 InDia INDIY Alamy glong OWEK D4 MINAM ORA'AN THAN convention MESSOM RAMIE wise YORKER reviewe annuan 303. ? you SING HOWRED H CYVE iss 2 kw the some - Clif the WORK profess to than KYOICA HYWE TEXAS - sport HEARDH Brock KYWITA HYWE 12 DIEBESERS is BON Longa LHYA MYME in THE CIO RECORD LOMM been in sone YOURERS 114 THE nia 12 MILH ZONEONE MHOZE SNO H80 ARIMA OH LANE AROS HYWE va 1.4 VILEVER ON LONG OVIN AP WHICH searching 10 THE DULLED 10 EXIEND WA Date pA LINE OF sig MOSTLES TRICTOUS 26LATCO 10 EXIEND LEE LVID 10°250 revalor TERNICE ME MITE NOJ BE LEENADED OXIB No numero PAYIEZ DELV MEMBUS or SOUTH KEVD CYKERNITA Lotte shiroage"
}