{
  "anumber": "A19581639",
  "id": "A19581639_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY, Form approved OMB No. 4-3R0068"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1897,
        1979,
        1980,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 READ INSTRUCTIONS CAREFULLY Form approved UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE E WILL NOT BE REFUNDED. OMB No 43-R0068 FE. MP APPLICATION TO EXTEND TIME OF TEMPORARY STAY $ 5- FEE PAID SAC-80-2-8 Immigration and Naturalize Service I HEREBY APPLY TO EXTEND MY Saoramento, Calif TEMPORARY STAY IN THE UNITED STATES Date OCT 2-1979 Verified by s PRESS IRMLY-LEGIBLE COPY REQUIRED. PRINT OR TYPE YOUR NAME EX- 7. DATE TO WHICH EXTENSION IS REQUESTED ACTLY AS IT APPEARS ON YOUR ARRIVAL-DEPARTURE RECORD FORM 1-94. IF YOUR MAILING ADDRESS IN THE U.S. IS WITH SOMEONE WHOSE FAMILY FEB - 2 - 1980 NAME IS DIFFERENT FROM YOURS, INSERT THAT PERSON'S NAME IN THE C/O BLOCK. FAMILY NAME (CAPITAL LETTERS) FIRST MIDDLE 8. REASON FOR REQUESTING EXTENSION 1. YOUR NAME GATHA DHANKUNVAR MOHANLAL To enable me to attain IN CARE OF c/o MITHAIWALA SOHINEE KISHORE NUMBER AND STREET (APT NO.) FILE NUMBER India Canedian Immigrant 2. MAILING 3023, HEIRLOOM WAY ADDRESS IN U.S. CITY SACRAMENTO STATE CALIFORNIA ZIP CODE status. 95826 3. DATE OF BIRTH (MO DAY YR.) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 9. REASON FOR COMING TO THE U.S.: 1897 INDIA INDIA To meet grandy daughter 4. PRESENT NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES B2 OCT 2-1979 and great-grand children. 5. DATE AND PORT OF LAST ARRIVAL IN U.S NAME OF VESSEL AIRLINE OR OTHER MEANS OF NEW-YORK - Dec. 21918 LAST ARRIVAL IN U.S. PAN AM ozl 10. HAS AN IMMIGRANT VISA PETITION EVER BEEN FILED IN YOUR BEHALF? 1705356 ES NO IF 'YES\". WHERE WAS FILED? 6. THE PERMIT NUMBER ON MY FORM 94 IS: at Battimore 11. HAVE YOU EVER APPLIED FOR AN IMMIGRANT VISA OR FOR GOVERNMENT USE ONLY PERMANENT RESIDENCE IN THE U.S.? EXTENSION GRANTED TO (DATE) DATE YES ONQ IE 'YES\" WHERE DID YOU APPLY? OF at Baltimore. ACTION Feb. 02, 1980 Feb 2-1980 OCT X:2 1979 12. I INTEND TO DEPART FROM THE U.S. ON AM IN POSSESSION OF A TRANSPORTATION EXTENSION DENIED V.D. TO (DATE) TICKET FOR MY DEPARTURE LYES DD 13 PASSPORT NO.* EXPIRES ON (DATE) ISSUED BY OR OIC J556094 April 27-1983 (COUNTRY) OFFICE INDIA 14. NUMBER STREET, CITY. PROVINCE (STATE) AND COUNTRY OF PERM ANENT RES. 15. MY USUAL OCCUPATION IS: 16. SOCIAL SECURITY NO. 74/6 Marine Drive, Bombey INDIA NIL. (IF NONE. STATE \"NONE\") NIL 17. AM AM NOT MARRIED IF YOU WISH TO APPLY FOR EXTENSION FOR YOUR SPOUSE & CHILDREN, GIVE THE FOLLOWING: (SEE INSTRUCTION 1) NAME OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (COUNTRY) AND EXPIRES ON (DATE) N A IF SPOUSE AND CHILDREN FOR WHOM YOU ARE SEEKING EXTENSION DO NOT RESIDE WITH YOU. GIVE THEIR COMPLETE ADDRESS ON A SEPARATE NOTE: ATTACHMENT TO THIS APPLICATION. 18. I (INSERT OR \"HAVE NOT\") BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE/BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADDRESS OF EMPLOYER OR BUSINESS INCOME PER WEEK DATES EMPLOYMENT OR BUSINESS BEGAN & ENDED N / A I certify that the above is true and correct. SIGNATURE OF APPLICANT his 1914211911 DATE 10-1-1979 SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information on which I have any knowledge. SIGNATURE Skgatha ADDRESS 3023, HEIRLOOM WAY. DATE 10-1-1979 Sacto. AL-95826 ATTACH YOUR FORM 1-94 OR SW-434 *DO NOT SEND YOUR PASSPORT RECEIVED TRANS. IN RET'D.-TRANS. OUT COMPLETED 10/02/79 Form I-539 (Rev. 9-12-77) Y"
}