{
	"anumber": "A19509771",
	"id": "A19509771_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19509771_0043/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, 443-R0400"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1924, 2023, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Form Approved Budget Bureau No. 43-R0400 APPLICATION FOR STATUS AS PERMANENT RESIDENT FEE STAMP File No. RECEIVED APPLICATION FOR THE BENEFITS OF SECTION: INFORMATION 203(a)(7) and Sec. 245, I&N Act 245 249 I&N Act Sec. 214(d), I&N Act Sec. 13, Act of 9/11/57 (DO NOT (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO ANSWER SYOTEON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPON QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. \"I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check box A, B, C, D, E or F) An immigrant visa is immediately available to me: A. As a refugee (Section 203(a)(7) and Section 245, I&N Act). B. As a former fiancee or fiance of a U.S. citizen whom I married within 90 days after my arrival in the United States, or as a child of such fiancee or fiance (Section 214(d), I&N Act). C. As a former government official, of as a member of the immediate family of such official (Section 13, Act of September 11, 1957). D. As a person to whom an immigrant visa is immediately available, other than one described above, (Section 245, I&N Act). E. As a person who has resided in the United States continuously since prior to July 1, 1924 (Section 249, I&N Act). F. As a person who has resided in the United States continuously since a date on or after July 1, 1924, but before June 30, 1948 (Section 249, I&N Act). 2. My name is (Last in capital letters) (First Name) (Middle Name) My alien registration number is Sex TRIVEDI Mohanlal A19509771 Male Female 3. I reside in the United States at: (Apt. No.) (No. and Street) Flushing (City) (State) (ZIP Code) 132-65 Pople Avenue Queens, New York 11355 2 4. Date of Birth Place of Birth (City or Town) (County, Province, or State) (Country) I am now a citizen of (Country) 11/17/06 Kolithad, India India 5. I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) New York, N.Y. 12/20/70 by (Name of vessel or other means of travel) as a (visitor, student, exchange visitor, temporary worker, fiancee, fiance, crewman, parolee, etc.) Pan Am Visitor (B2) Xwas My nonimmigrant visa was issued by the United States Consul at (City) (State) on (Month) (Day) (Year) I inspected. was not Khartoum 9/23/70 6. I am single married divorced widowed a. I have been married 1 times, including my present marriage, if now married. (If you are now married give the following:) b. Number of times my spouse has been married c. Name of spouse d. My spouse resides with me apart from me at Address (Apt. No.) (No. & Street) (Town or City) (Province or State) (Country) 5 7. a. I have 5 children, as follows: (complete all columns as to each child. If child lives with you, state \"with me\" in last column; otherwise give city and state or country of child's residence. Name Sex Place of Birth Date of Birth Now Living at Ranjan Bhatt F India 9/17/40 132-65 Pople Ave Queens, NY Pravin Trivedi M India 4/27/43 24 Dwight St St Aguan Mass FOIA (b)(6) MB. The following members of my family are also applying for permanent resident status: None 8. I have have not heretofore filed an application for the status of a permanent resident. (If you have ever filed such application, give the date and place of filing and final disposition.) Form I-485 (Rev. 7-1-70)N UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Page 1) Received Tr. Ret'd. - Tr. Out Comp 8"
}
