{
	"anumber": "A19509771",
	"id": "A19509771_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19509771_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, Form approved Budget Bureau No. 4-R423"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service Budget Bureau No. 43-R423 AFFIDAVIT OF SUPPORT (Fill in with typewriter or print in block letters in ink) Subodh Bhatt I I, Residing at 132-65 Pople Avenue (Name) 132 (Street and number) venue Flushing New York USA (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. I was born on 12/12/34 at Ahmedabad, India Also, answer either a, b or c, as appropriate (Date) (City) (Country) if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization (b) If a United States citizen through parent (s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number FOIA (b)(6) 2. That I am years of age and have resided in the United States since Sept. 30, 1966 37 3. That this affidavit is executed in behalf of the following person(s) at present residing at 132-65 Pople Aye. Flushing, New York NAME MARRIED OR RELATIONSHIP TO SEX AGE COUNTRY OF BIRTH SINGLE DEPONENT Mohanlal Trivedi M 65 India Widowed Father 4. (a) That I am employed as, or engaged in the business of with Sr. Engineer (Nechtel) corp. at 485 Lexington Ave NY and derive a net annual income of $15,600. (b) That I have on deposit in savings (Address) banks in this country $ 6,000 . (c) That I have other personal property, the reasonable value of which is $ 8,000 (d) That I have stocks and bonds in the amount of $ 13,000. market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at valued at $ , with mortgages or other encumbrances there- on amounting to $ 1,000 . (f) That I have life insurance in the sum of $ 10,000 , cash surrender value of $ (g) That if self-employed, I attach a copy of my last income tax return or report of com- mercial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) Form I-134 (Rev. 12-9-66)"
}
