{
	"anumber": "A19581639",
	"id": "A19581639_0058",
	"page_index": 58,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0058/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, A19 581 639"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1978, 2023, 1972, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 630 SANSOME STREET SAN FRANCISCO. CALIFORNIA 94111 NOV 18 1982 PLEASE REFER TO THIS FILE NO. A19 581 639 Dhankunyar Mohanlal Gatha c/o S.K. Mithaiwala 3023 Heirloom Way Sacramento, CA 95826 A review of your file at this office indicates that the status of your case has not been updated for some time. It is necessary to determine whether this office should continue to defer institution of deportation proceedings in your case. It is also possible that you may have developed equities which would make it possible for you to obtain permanent residence. In order to make this determination, please answer the following questions checked /x/ below. Mail your answers with this letter in the enclosed pre-paid envelope. If you have any questions you may contact Investigator Onn at (415) 556-0530 You may use the back of this letter to add any additional information you feel is important. What is your present address and phone number? 3023 HEIRLOOM way Sacramento CA 95826 Phone: 362-3357 Who lives with you? I live with my grand daughter and her How are you supported? my My grand daughter and her husband husland and daughter in law supports me Where are you employed? How much do you earn? Do you receive welfare assistance, and if so, how much? I receive only medicial assistance. Have you been arrested since , and if so, for what? heal ith you has been deteriorating. I.was hospitalized for fine days Are in good health? NO I am not in good health. My during the beginning of August for dehydiation Please see at the bak What is your marital status? Have any close family members (parents, spouse, children over 21) become United States citizens? When did you last leave the United States and when did you return? then I have not left the country. I left united state in 1972 and returned in 1978 Since 401842 511911 Sincerely, from I-51 Signature Robert M Moschorak Assistant District Director for Investigations"
}
