{
  "anumber": "A19581639",
  "id": "A19581639_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0056/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Consulate General of India, 540 Arguello Blvd., San Francisco, California 94118."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 7/13/2023 TELEPHONE: 668-0662 540 Arguello Blvd., , SAN FRANCISCO, CALIFORNIA CABLE ADDRESS: CONGENDIA 94118. CONSULATE GENERAL OF INDIA Sanf/Cons/83. January 25, 1983. RECEIVED Mr. David Ilchert, District Director, OFFICE 6/3/18 DIRECTOR U. S. Dept. of Justice, immigration & Naturalization Calif. Service Immigration and Naturalisation Service San Francisco, 630 Sansome Street, San Francisco, CA. 94111. Dear Mr. Ilchert, I would like to refer to your letter No. A19 581 639 (I-51) dated January 14, 1983, addressed to Mr. Ishrat Aziz, who has since left San Francisco on completion of his tour of duty. I am confident that you will appreciate, that this particular lady who is 85 years old and suffering from SO many ailments, , has her family members here. She would therefore not have many family members to stay on with in India. As things are, we do not have the system of Social Security or Medicare, under which she could get free or subsidize medicare in India. I will, therefore, request you to get this ailing 85 years old lady stay on here on humanitarian, if not on any other grounds, so that she is spared the trauma of having to leave all her family members in U.S. and fend for herself in India. She is in no position to do SO because of her old age and sickness. This would also enable this old lady to spend the remaining few days of her life with her family members here. Thanking you, RECEIVED Yours sincerely, OFFICE DISTRICT DIRECTOR Immigration & Naturalization Service San Francisco, Calif. Rihe R.1 P Dua Acting Consul General"
}