{
  "anumber": "A19581639",
  "id": "A19581639_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Congress of the United States, A24 216 295"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 ROBERT T. MATSUI WASHINGTON OFFICE: 3RD DISTRICT, CALIFORNIA 502 CANNON HOUSE OFFICE BUILDING WASHINGTON, D.C. 20515 COMMITTEE ON INTERSTATE AND FOREIGN COMMERCE (202) 225-7163 SUBCOMMITTEES: Congress of the United States DISTRICT OFFICE: COMMUNICATIONS TRANSPORTATION AND COMMERCE 8058 FEDERAL BUILDING house of Representatives 650 CAPITOL MALL COMMITTEE ON GOVERNMENT OPERATIONS 634 SACRAMENTO, CALIFORNIA 95814 Washington, D.C. 20515 (916) 440-3543 SUBCOMMITTEES: COMMERCE, CONSUMER AND MONETARY AFFAIRS GOVERNMENT ACTIVITIES AND TRANSPORTATION SELECT COMMITTEE ON l'ARCOTICS ABUSE AND CONTROL February 6, 1980 Mr. David Ilcert District Director Immigration and Naturalization Service 630 Sansome Street this Mr. San Francisco, California 94111 Dear Mr. Ilchert: I am writing on behalf of my constituent, Sohinee Mithaiwala, concerning her interest in having her grandmother remain with her in the United States. Mrs. Dhankunvar Mohanlal Gatha, a one-time permanent resident, returned to the United States on a visitor's visa. Upon her application for an extension, she was advised to request a permanent stay. Mrs. Gatha is eighty-four years old and suffer- ing from ill-health. As she has no family living in India to care for her, her family is most concerned over how she will continue to live if forced to return to India. I would be most appreciative of your favorable consideration of Mrs. Gatha's request for a permanent stay. I am looking forward to your earliest possible response. Very truly yours, Robert 2. matsui Robert T. Matsui Member of Congress RTM:a Enclosure RECEIVED A24 216 285 2-11-80 OF DISTRICT DIRECTOR Immigration OFFICE & Naturalization Service San Francisco, Calif. PLEASE RESPOND TO: WASHINGTON OFFICE DISTRICT OFFICE"
}