{
	"anumber": "A19509771",
	"id": "A19509771_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19509771_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Extension of Reentry Permit denied because, NARA-890.544"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 FOR USE OF IMMIGRATION OFFICERS ONLY Extension of Reentry Permit denied because Reentry Permit extended to: (Date) Oct 27,1974 Remarks Date of action Action taken at Date DD Sept or oic 10,1973 District Director or Officer in Charge Office AMERICAN CONSULATE GENERAL INSTRUCTIONS BOMBAY 26, INDIA READ INSTRUCTIONS CAREFULLY - FEE WILL NOT BE REFUNDED 1. Who May Apply - Any alien who is the holder of an unexpired permit to reenter the United States, which has not already been extended for a period or periods aggregating one year from the original expiration date, may apply under section 223 of the Immigration and Nationality Act for an extension of that permit. A separate application must be submitted by each alien regardless of age. A parent, guardian or other person having a legitimate interest in a person under the age of 14, and a guardian of a mentally incompetent person may apply on behalf of such person. 2. Submission of Application - The application may not be submitted more than 90 days prior to the expiration of the reentry permit's validity. It must, however, be submitted so as to be received by the office authorized to act thereon prior to the expiration of the reentry permit's validity. It may be submitted to the immigration office having jurisdiction over the applicant's place of residence in the United States,or to the United States immigration officer stationed abroad having jurisdiction over the place where the applicant is temporarily sojourning. It may also be submitted to certain American consular offices. Inquiry may be made at any immigration office for the location of United States immigra- tion officers abroad and consular offices authorized to extend reentry permits. 3. Reentry Permit - You must attach to this application your permit to reenter the United States, so that the appropriate endorsement of the extension, if granted, may be made therein. 4. Fee - A fee of ten dollars ($10) must be paid for filing this application. It cannot be refunded regardless of the action taken on the application. DO NOT MAIL CASH. Payment by check or money order must be drawn on a bank or other institution located in the United States and be pay- able in United States currency. If applicant resides in the Virgin Islands, check or money order must be payable to the \"Commissioner of Finance of the Virgin Islands.\" If applicant resides in Guam, check or money order must be payable to the \"Treasurer, Guam.\" All other applicants must make the check or money order payable to the \"Immigration and Naturalization Service.\" When check is drawn on an account of a person other than the applicant, the name of the applicant must be entered on the face of the check. If payment is made by the type of international money order that cannot be mailed, the money order must be drawn on the postmaster of the city in the United States to which the application will be mailed, and that city, the money order number, and the date must be shown clearly on the top margin of the application form. 5. Delivery of Permit - If you are in the United States, the permit will be mailed to your United States address. If you are abroad, It will be mailed to the United States immigration office abroad or the consular office nearest to you, and you will be notified to appear at that office to accept delivery. 6. Limitation on Extensions The validity of a reentry permit may be extended for a period or periods aggregating not more than one year from the original expiration date of its validity. 7. Naturalization Residence Warning - The extension of your reentry permit will not protect your naturalization residence. If you are continuously absent from the United States for as much as one year, you will thereby break your residence for naturalization even though your reentry permit is extended. This means that you will not be able to become a citizen until a new period of residence is completed following your return to the United States. Exceptions to this rule in certain cases are explained at pages 15 and 16 of your reentry permit. GPC 890.548"
}
