{
  "anumber": "A19581639",
  "id": "A19581639_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, Form Number: A19 581 639 (I-51)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 630 SANSOME STREET SAN FRANCISCO. CALIFORNIA 94111 PLEASE REFER TO THIS FILK NO. A19 581 639 (I-51) Dhankunvar Mohanlal GATHA c/o Mrs. S. K. Mithaiwala 3023 Heirloom Way Sacramento, CA 95826 A review of your file at this office indicates that the status of your case has not been updated for some time. It is necessary to determine whether this office should continue to defer institution of deportation proceedings in your case. It is also possible that you may have developed equities which would make it possible for you to obtain permanent residence. In order to make this determination, please answer the following questions checked /x/ below. Mail your answers with this letter in the enclosed pre-paid envelope. If you have any questions you may contact Investigator Onn at (415) 556-2438. You may use the back of this letter to add any additional information you feel is important. What is your present address and phone number? % Mrs. S. K Mithaivala 3023 Heirloom way, Sacramento CA 95826 Phone96362-3357. Who lives with you? I live with my grand- daughter's family How are you supported? By my grand-daughter Where are you employed? How much do you earn? Do you receive welfare assistance, and if so, how much? No. 3 elfave asistance Medical only Have you been arrested since , and if so, for what? Are you in good health? I am not in good health. I am suffering from osteopporogis which has made me almost bedridden rant I require constant help. your indication very about encouraging my getting Requ of perme for a favourable rep decision is What is your marital status? Have any close family members (parents, spouse, children over 21) become United States citizens? When did you last leave the United States and when did you return? Left U.S.A in 1972 and returned in 1978 Jesse Sincerely, I Bellfor Xa-3342 Signature Jesse J. Bell The above signature is in her Assistant District Director mother tongue for Investigations"
}