{
  "anumber": "A19581639",
  "id": "A19581639_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0074/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, FORM I-181 ( (REV. 11-1-70) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Baltimore, Maryland File No A19 581 639 Status as a lawful permanent resident of the United States is accorded: JO VOLICE SEX DATE OF BIRTH Name Dhankunvar Mohanlal Gatha F 1897 2 Street Address 1053 Reverdy Road we abbijcaup PLACE OF BIRTH Lebte- Baltimore, Maryland 21212 Ajab, India City, State, Zip NATIONALITY unwpel LLOW COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India 503 exblaru 203(a)(8) Plock PRIORITY DATE India 10/12/71 Al2a unwpet 12 505 (p) OL REMARKS Exempt from labor certification. IU6 NONPREFERENCE: Section 212(a)(14) certification not required because: live you-blejeteuce buy gate Individual section 212(a)(14) certification issued; Blanket section 212(a)(14) certification issued; under the following provision of law: you-blejeleuce A120 Sec 203(h) of the I & N Act Sec 249 of the I & N Act GA Sec 13 of the Act of 9/11/57 Sec 214(d) I & N Act Sec 244 (cc) (10) of the I & N Act Sec 1 of the Act of 11/2/66 Private Law no. of the OL pas yo peeu anabeug Congress session Sec 245 of the & N Act Maz Sec. 2 of the Act of 11/2/66 01 (Other law Specify) pas yo peeu enabeuqeq (3) gate As of at Baltimore, Maryland (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE 62100 1001 UOL abbid to plw OL paper Class of admission (Insert symbol) Z-2 (NP-1) LOU-DLSISLSUCS gaje abbit (Applicable in all cases) lue accolged abbycaup pl we countral OFICE as RECOMMENDED BY: (Immigration Officer) (Date) APPROVED: (District Director) (Date) be nugel 2echou 542' the the FOR USE BY VISA CONTROL OFFICE we ! COULLO Office spall pe blebaleq IU qubjicate auq the bjaceq Date auq bjaceq Ca262 Lednile the foll 10 pe Foreign State excebt MUBLE Service 12 the au Useq pe blebaleq pe cases Mpele belwaugui alauteq Million Letella to the COULLO Preference Category paz Leacueq ade It UOI Lednileq LOL IP!? bnibose spall to we State DILECIOL of of SAGLA alleu polu ou OL 2eb- Number 110199 10 we gals &Lauteq auq formalqeq bya auq bjaceq IU6 IU ancp ca262 the Hubicate cobi MPICP Ma2 Month of Issuance the Al2a unwpet spall pe abblo- auq cobl MP alau of pecower ou nuger of 5' Japp Signed (Visa Office, Dept. of State) OL case nugel 5V2 Form I-357 delivered Form I-151 delivered Form I-151 mailed CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service FORM I-181 (REV. 11-1-70) N"
}