{
  "anumber": "A19581639",
  "id": "A19581639_0064",
  "page_index": 64,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19581639_0064/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NONPRIORITY CASE SUMMARY, Form G-312"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1897,
        1970,
        1972,
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 NAME ADDRESS DIST. FILE NO. GATHA, Dhankunvar Mohanlal c/o Mrs. S.K. Mithaiwala 13 A19 581 639 3023 Heirloom Way, Sacto. Calif. BIRTHDATE BIRTHPLACE NATIONALITY 1897 India India DATE AND MANNER OF LAST ENTRY EVER LAWFULLY ADMITTED FOR PERMANENT RESIDENCE 12/2/78 B-2 Yes (sec 245 adj at BAL 1/18/72) PRESENT IMMIGRATION STATUS AND AVAILABILITY OF ANY ADMINISTRATIVE RELIEF. Illegal (B-2 overstay) V/R granted via I-541 to 4/23/80 No administrative relief available GROUNDS OF DEPORTABILITY SEMIB: Nonimmigrant visitor remained longer than permitted ALL PERIODS OF RESIDENCE IN U.S. FROM TO (Sec. 245 ad justmentat BAL 1/18/72) March 1970 October 1972 abandoned residence & returned to India 3023 Heirloom Way, Sacto. Calif December 2, 1978 present PHYSICAL & MENTAL CONDITION REQUIRING TREATMENT OR CARE IN U.S. under care of V.R. Desai M.D. of 2322 Butano Drive Suite 100; Letters from the Dr. dated 1/21/80 and 1/30/80 indicate subject has severe Spondylitis, Osteoporosis, Glaucoma and aphakia and will need care for an indefinate period. FAMILY SITUATION: 1. LOCATION OF SPOUSE, SONS, DAUGHTERS, PARENTS NAME AGE RELATIONSHIP LOCATION IMMIGRATION STATUS Nohan Lal Husband Deceased Never in U.S. Kanti Lal Son Deceased India Jamnadas Son Deceased India Vanmalidas Kotak Father Deceased India Gomati Mother Deceased India 2. EFFECT OF EXPULSION Subject has no imediate family left in India to care for her. She is now being cared for by her grand daughter, Mrs. S.K. Mithaiwala her closest living blood relative. She is 83 years old and in poor health and unable to care for herself. (Cont'd on reverse) NONPRIORITY STATUS: RECOMMENDED APPROVED District Director (Signature and Date) Regional Commissioner (Signature and Date) NONPRIORITY CASE SUMMARY Form G 312 (Rev. 7-1-75)N UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service"
}