{
	"anumber": "A19509771",
	"id": "A19509771_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19509771_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, I-485 ( (245)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE 45 IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Leon Wildes Application or Petition Form No. I-485 (245) File No. A19509771 22 CHECK ONE -- SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203 (a) ( ) NONPREFERENCE 203 (a) (8) NPI 2-9-72 DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If Checked) (If Checked) Date Mailed 5.17.72 DATE Delay Notice XXXXXXXXXXXXXXX B/C MEDICAL 830A I-181 to State M/C INTERVIEW 1015A G-325A Sheet #1 3-21-72 Photos RESCHEDULED 2 11 Support MEDICAL 3 : / I-508 INTERVIEW 4 Khartaum I-88 Other Consulate ar (Location CATEGORY A--- Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY Prepare I-486, omitting date and insert in file. Type I-151, omitting.entry date, place and lamination. Insert in file with 245 packet (I-357; G-153) Officer's Instructions: India PPI-746818 Dorsinp p 11-17-06 DISTRIBUTE (If Checked) I-181 to State Dept. I-181 to Consulate AT I-181 to Sol. Serv. This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent date which may facilitate processing. Keep this sheet on top of all material in file until initial decision is made GPO 946-883 Form I-468 (Rev. 11-1-70) As"
}
