{
	"anumber": "A19675266",
	"id": "A19675266_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19675266_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, FILE NO.: A 19 675 266"
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE FILE NO.: A 19 675 266 Philadelphia, Pa. DATE: May 17, 1971 MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW Mrs. Vimala Vinayak Phatak 6602 N. 13th Street Philadelphia, PA 19126 INSTRUCTIONS FOR MEDICAL EXAMINATION A MEDICAL EXAMINATION IS NECESSARY AS PART OF YOUR APPLICATION FOR ADJUSTMENT OF STATUS TO THAT OF A PER. MANENT RESIDENT WHEN YOU APPEAR FOR THE MEDICAL EXAMINATION BRING WITH YOU THIS LETTER, THE TWO ATTACHED COPIES, AND THE FOLLOWING: 1. X-RAY FILM (14\" x 17\") OF YOUR CHEST, UNLESS YOU ARE UNDER 11 YEARS OF AGE, AND A REPORT BY A LICENSED PHYSICIAN INTERPRETING IT. FILM MUST NOT BE MORE THAN 30 DAYS OLD. 2. SEROLOGY REPORT, UNLESS YOU ARE UNDER 15 YEARS OF AGE. SEROLOGIC TEST FOR SYPHILIS MUST NOT BE MORE THAN 30 DAYS OLD. THIS X-RAY AND TEST MUST BE ACCOMPLISHED BY A LICENSED PHYSICIAN OR A STATE OR LOCAL HEALTH DEPARTMENT APPROVED LABORATORY. IF YOU DO NOT HAVE A PERSONAL PHYSICIAN, YOU MAY WISH TO TELEPHONE YOUR STATE OR LOCAL HEALTH DEPARTMENT FOR THE NAME OF AN APPROVED LABORATORY THAT MAY BE ABLE TO PERFORM THE X-RAY AND TEST REQUIRED. PLEASE NOTE THE BOX CHECKED BELOW WITH REGARD YOU YOUR MEDICAL EXAMINATION AN APPOINTMENT HAS BEEN MADE FOR YOU TO BE EXAMINED BY A PHYSICIAN OF THE U.S. PUBLIC HEALTH SERVICE AT: ADDRESS: 225 Chestnut Street DATE: JUNE 3,1971 Philadelphia, Pa. TIME: 9:30AM PLEASE ARRANGE FOR YOUR MEDICAL EXAMINATION WITH THE BELOW LISTED PHYSICIAN AT THE ADDRESS SHOWN. THE EXAMINATION SHOULD BE COMPLETED BEFORE PHYSICIAN'S NAME AND ADDRESS: PLEASE SHOW THE COPIES OF THIS LETTER TO YOUR PHYSICIAN (OR LABORATORY) PERFORMING THE EXAMINATION AND FURNISH HIM WITH YOUR SIGNATURE, WRITTEN IN HIS PRESENCE FOR INCLUSION WITH HIS REPORT. INSTRUCTIONS FOR IMMIGRATION INTERVIEW AN APPOINTMENT HAS ALSO BEEN MADE FOR AN INTERVIEW BEFORE AN IMMIGRATION OFFICER AT: ADDRESS: 128 North Broad Street DATE: June 3, 1971 Philadelphia, Pa. TIME: Immediately after the medical examination. BRING WITH YOU AT THE TIME OF INTERVIEW THE ITEMS CHECKED BELOW: THE SEALED ENVELOPE FURNISHED TO YOU BY THE PHYSICIAN WHO PERFORMED THE MEDICAL EXAMINATION. YOUR PASSPORT AND FORM 1-94 of IF YOU DO NOT SPEAK ENGLISH, A PERSON OF YOUR OWN SEX SHOULD ACCOMPANY YOU WHO CAN NOTE: ACT AS INTERPRETER AT MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW. I FAILURE TO KEEP THESE APPOINTMENT AND TO BRING THE REPORTS AND DOCUMENTS REQUIRED WILL DELAY YOUR CASE. FORM 1-486 (REV. 10-1-70)N FILE COPY DISTRICT DIRECTOR"
}
