{
	"anumber": "A19675264",
	"id": "A19675264_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19675264_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa - Grant Visa, NARA. 4-3-R401.4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 7108, 2011, 2023, 1902, 1909, 1015]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 SLB CHECKED 3/12/71 HSW Form approved. (date (initial Budget Bureau No. 43 R401.4. Date filed PETITION TO LECTED Fee stamp U. CLASSIFY STATUS OF $10 FEE PAID ALIEN RELATIVE FOR SERVICE Immigration and Naturalization Service No HOLD-10 ISSUANCE OF IMMI- FEB 19 / 24 PM'71 or Philadelphia Pa. GRANT VISA exbires Dat 21991 Verified by 0.12 INF DISTRICT OFFOTHE SECRETARY PHILADELPHIA, OF STATE: The petition was filed on FEB. 19-7 Remarks The petition is approved for status under section: SPOUSE, Aom ULG U.S. APPROVED INS 201 (b) CHILD 203(a) (2) DATE MAR 12 1971 OF ACTION 201 (b) PARENT 203 (a) (4) DD Bureau Bernard DISTRICT PHILA., PA. Hea 203 (a) (1) 203 (a) (5) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. (a) unspec 909 que suq bjace Bindy SUCC 2-26-2011 Block I. Information About Alien Beneficiary A 19 675 264 - 2. Name (Last, in CAPS) (First) (Middle) 3.Do Not Write in This Space 4. Relationship of beneficiary to petitioner PHATAK VINAYAK GOVIND WATHER 6. Is beneficiary related to you by adoption? 5. Other names used; Married woman give maiden name 9. Beneficiary's marital status: 7. Place of birth (Country) 8. Date of birth (Month, day, year) Married INDIA Widowed Divorced DECEMBER 13, 1902 Single 10. Petitioner's name (Last in CAPS) (First) (Middle) 11. Has this beneficiary ever been in the U.S.? 31 V991688 PHATAK VISHVANATH V. Yes No 12. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) PHATAK VIMALA V. Champer MARCH 19 1909 INDIA. 13. Names, birthdates and countries of birth of beneficiary's 164 schildren, if anyics (Forms G-22.2a, G-23.30 (year) NOT A APPLICABLE IT Received Tr. In Held-IT: Out 2/8/7/95 3/12/7108 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 6602 N 13th St PHILA PA 19126 Corianjure 15. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages Number of prior marriages of spouse d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) : (Month) (Year) (Month) (Year) 16. If this petition is for a child, (a). Is the child married? (b) Is the child your adopted child? subjoAuse If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state OCTOBER 11/21/1015 17. If this petition is for a brother or sister, are both your parents the same as the alien's parents If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 18. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner PHATAK ViMALA MOTHER 19. Have you ever filed a petition for this alien before? NO If so, give place and date of filing and result: Form I-130 UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service (Rev. 10-15-69)"
}
