{
	"anumber": "A19675266",
	"id": "A19675266_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19675266_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, Form G-325 A ( (REV. 5-1-68)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1970, 1992, 2023, 1909, 1926, 1965]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "INDIAN"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 FORM G-325 A (REV. 5-1-68) Form Approved UNITED STATES DEPARTMENT OF JUSTICE Officedee Thile, 43-R436 BIOGRAPHIC INFORMATION Type: 245 Immigration and Naturalization Service Date: 4-12-71 (Family name) (First name) (Middle name) BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. MALE PHATAK VIMALA VINAYAK FEMALE 3-19-1909 INDIAN (If any) A 19 675 266 ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) BARODA, INDIA FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER (DECESED) GOKHALE RAMCHANDRA MOTHER (Maiden name) (PEC). JOGLEKAR SITABAI SPOUSE (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (For wife, give maiden name) PHATAK VINAYAK 12-13-1992 POONA, INDIA 3-4-1926 BARODA. FORMER SPOUSES (If none, so state) NONE FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 6602 13th ST. PHILADELPHIA PA. U.S. A. Get. 1970 PRESENT TIME C-30,HA.ESTATE, PIMPRI. POO NA MAHARASHTRA INDIA APRIL 1965 GeT. 1970 LAST FOREIGN RESIDENCE OF MORE THAN ONE YEAR IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR NONE PRESENT TIME LAST OCCUPATION ABROAD IF NOT SHOWN ABOVE. (INCLUDE ALL INFORMATION REQUESTED ABOVE.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Vinala V- Phatak OTHER (SPECIFY): PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
