{
	"anumber": "A19675266",
	"id": "A19675266_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19675266_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit, 3 Rs. 50 np"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1905, 2023, 1926]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Gujarat 3 Rs. 50 np India Stamp: Three Rupees Fifty Naye Paise Sta V1.R. 4313 / 3-50 Trimbak Govind Phatak B.A.(Hons) LL.B. Advocate C/O Dr .Arun T. Phatak M.D. D.Ped, I/22. Doctors' Quarters Indira -Avenue, Baroda Dt. 18-1-1971. Sd V.G. Gaikwar District Court, Stamp Vendor, Baroda. In the Court of the First Class Magistrate at Baroda. Gujrat State, India. AFFIDAVIT. I, TRIMBAK GOVIND PHAT AK B.A. (Hons) LL.B. Advocate of the High Court of Gujarat, India residing at Baroda City declare on oath and make this affidavit as follows: (1) I solemnly state on oath : (a) that my full name is \"TRIMBAK GOVIND PHATAK,\" my father's full name being \"GOVIND NARAYAN PHATAK\" (b) that I am an Advocate of the High Court of Gujarat of the Gujarat State, India, practising as a lawyer in the law Courtsat Baroda in the Gujarat state, India, having my office at Baroda. (c) that my full address and place of residence is as follows: T.G. Phatak, Advocate, C/O. Dr. Arun T. Phatak M.D. D.Ped., Block No. I/22, \"Yavateshwar Compound\" Jail Road, at BARODA CITY (Gujarat State, India). (d) That I was born in the City of POONA, in the Maharashtra State, India on the 7th of December , 1905 A.D. and at present I am aged 65 (sixty five) and that I am by caste a Hindu Brahmin. (2) I also solemnly state and declare on oath : (a) that Dr, VINAYAK GOVIND PHAT AK is my full elder brother and (b) that I was personally present, along with our parents and other family members, at the marriage of my said elder brother Vinayak Govind Phatak with VIMALA RAMCHANDRA GOKHALE ( the daughter of Ramchandra Hari Gokhale, the Ex Chief Justice of the then Baroda High Court) on the 4th of March, 1926 A.D. and that I had personally witnessed the said marriage ceremony, which took place on the said date at Baroda (Gujarat State, India) and -2-"
}
