{
  "anumber": "A19675264",
  "id": "A19675264_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19675264_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, NARA-132256"
    },
    "years": {
      "ms_years_nlp_v1": [
        1925,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "by NARA, 7/13/2023 LOKW F181 (BEA' 21016 DILECIOL 26LAICE A120 CC A120 Office D'C 30250 for affocaffou LOLU INSTRUCTIONS Lou To request allocation of a visa number for a preference or nonpreference case under Section 245 218ueq or for a Western Hemisphere number under Section 1 of the Act of November 2, 1966, mail original and one copy to Visa Control Office. When grant of permanent residence becomes final, the copy returned by the Visa Control Office which allocates the visa number shall be appro- priately endorsed, and placed in the file. In such cases the triplicate copy, which was retained noun the file, shall be noted to show the date permanent residence status is granted and forwarded to the State Director of Selective Service in the case of every male alien born on or after Sep- tember 15, 1925, and who has reached 18 years of age. If not required for this purpose, it shall be destroyed. In cases where permanent residence is granted without referral to the Visa Control Office, except where Selective Service is to be notified, only an original I-181 need be prepared and placed in the file. In other cases where outstanding instructions require the form I-181 to be Dal forwarded to the Visa Control Office, it shall be prepared in duplicate and the original placed in the file, except when an additional copy is required to notify Selective Service. LOB NSE OLLICE PREFERENCE: Under Section 245, the priority date will be the filing date of one of the first six preference petitions. NON-PREFERENCE: Under Section 245, the priority date shall be fixed by the following factors, whichever is the earliest; (1) the priority date accorded the applicant by the consular officer as a non-preference immigrant; (2) the date on which application Form I-485 is filed, if the appli- cant establishes that the provisions of section 212(a)(14) of the Act do not apply to him or that he is within the Department of Labor's Schedule A or C Precertification List (29 CFR Part 60) when that list has not suspended; (3) the date on which an approved valid third or sixth preference visa petition in his behalf was filed if the applicant was within the Department of Labor's Schedule A or C-Precertification List when that list has not been suspended; or (4) the date an application for certification was accepted for processing by any office within the employment service system of the Department of Labor, provided the certification applied for was issued. A non-preference priority date, once established, is retained by the alien even though at the time a visa number becomes available and the is allotted a non-preference visa number he meets the provisions of section 212(a)(14) of the Act by some means other than that by which he originally established entitlement to the non-preference priority date. Check and complete the block regarding certifications on the form as appropriate in a non- preference case. REMARKS: If the visa number requested is based on Section 202 (b) (1), (2), (3) or (4) or Section 203 (a) (9) of the Act explain as appropriate in \"Remarks\" block. DATE MAICH NOTICE TO APPLICANT AND ATTORNEY: When the Service must obtain a visa number from the Department of State before granting permanent residence, the letter portion of this form no- tifying of the delay is mailed to the applicant with a copy to the attorney of record. In repre- sented cases the attorney, is notified of the approval of an application by furnishing him with copy of the notice which is part of this form. SEX DATE OE as of the 12 accolqeq: blace WEWORANDOW Oh OE KECOKO TAMENT RESIDENCE PELAICO ONILED OE INVICE"
}