{
  "anumber": "A19790690",
  "id": "A19790690_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19790690_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Executive Affidavit for Support,, GPO 928-979"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 2/10/2023 6. (To be filled in, if appropriate.) That I have previously submitted affidavit(s) of support for the following per- son(s): FOIA b)(6) FOIA b)(6) ritted 7. (To be filled in, if appropriate.) That I have submitted visa petition(s) to the Immigration and Naturalization Service, on behalf of the following person(s): Name Relationship Date submitted 8. That I am willing and able to receive, maintain, and support the person(s) listed in item 3 above. That I am ready and willing to deposit a bond, if necessary, with the Immigration and Naturalization Service to guarantee that such person(s) will not become public charges during their stay in the United States, or that they will maintain their nonimmigrant status if admitted temporarily and will depart prior to the expiration of their authorized stay in the United States. 9. That this affidavit is made by me for the purpose of assuring the Immigration and Naturalization Service that the person(s) named in item 3 will not become public charges in the United States. 10. (Complete this block only if the person(s) named in item 3 will be in the U.S. temporarily.) That I do intend do not intend to make specific contributions to the support of the person(s) listed in item 3 above. (If you checked \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly and for how long.) 11. That my reasons for signing this affidavit are: To support my mother - in - law in her application for permanent residence. Execution of affidavit. You must sign the affidavit in your full, Signature of person preparing form, if other than deponent true, and correct name and affirm or make it under oath. In the United States the affidavit may be sworn to or affirmed before an immigration officer without the payment of fee, or be- I declare that this document was prepared by me at the fore a notary public or other officer authorized to administer request of the deponent and is based on all information oaths for general purposes, in which case the official seal or of which I have any knowledge. certificate of authority to administer oaths must be affixed. SIGNATURE Outside the United States the affidavit must be sworn to or Address: affirmed before a United States consular or immigration officer. Date: SUBSCRIBED AND SWORN TO BEFORE ME THIS (Signature of deponent) day of A.D. 19 at (Signature of officer) (Title of officer) Nature of Evidence of Net Worth To Be Submitted.-The deponent must submit in duplicate evidence of net worth as follows: 1. Statement from an officer of the bank, postal or other financial Institution in which you have deposits giving the following details re- garding your bank account: (1) Date account opened, (2) Total amount deposited for past year, (3) Present balance. 2. Statement of employer, preferably on his business stationery, showing: (1) Date and nature of employment, (2) Salary paid, (3) Whether position temporary or permanent. 3. If self-employed: (1) Copy of last inco ax return filed or (2) report of commercial rating con 4. List containing serial number and denomination of bonds and name of purchaser. GPO 928.979"
}