{
  "anumber": "A19790690",
  "id": "A19790690_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19790690_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application to Extend Stay in the United States, Form approved OMB No. 4-80068"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1969,
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE REA AScreened by NARA, 2/AB/2023LLY Form approved IMMIGRATION AND NATURALIZATION SERVICE FEE WILL NOT BE REFUNDED. OMB No. 43-R0068 APPLICATION TO EXTEND EIVED $1000 FEE No. POO- 73 PAID STAMP TIME OF TEMPORARY STAY SERVICE 131-6 ODEG Immigration and Naturalization Service Portland, Oregon M & F I HEREBY APPLY TO EXTEND MY TEMPORARY STAY IN THE UNITED STATES Date 1/12/7 Verified by Pig 6. DATE TO WHICH EXTENSION IS REQUESTED PRINT OR TYPE YOUR NAME EXACTLY AS IT APPEARS ON YOUR ARRIVAL - DEPARTURE RECORD FORM 1-94 July 1973 1. YOUR FAMILY NAME (Capital Letters) FIRST MIDDLE 7. REASON FOR REQUESTING EXTENSION: NAME NGUYEN Nhat Thi 2. MAILING NUMBER AND STREET FILE NUMBER 2173 W. 16th Ave. Visit children ADDRESS IN U.S. CITY STATE ZIP CODE Eugene Oregon 97402 3. DATE OF BIRTH (Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 8. REASON FOR COMING TO THE U.S.: 1906 Vietnam Vietnam 4. PRESENT NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES B/2 Jan. 17, 1973 Visit children 5. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL AIRLINE, OR OTHER MEANS OF LAST ARRIVAL IN U.S. Dec. 17, 1969, Honolulu PA 842 9. HAS AN IMMIGRANT VISA PETITION EVER BEEN FILED IN YOUR BEHALF? YES NO IF \"YES\", WHERE WAS IT FILED? FOR GOVERNMENT USE ONLY 10. HAVE YOU EVER APPLIED FOR AN IMMIGRANT VISA OR PERMANENT RESIDENCE IN THE U.S.? YES XINO IF \"YES\", WHERE DID YOU APPLY? DATE EXTENSION GRANTED TO (Date) OF ACTION January 30, 1973 July, 1973 July 17, 1973 11. I INTEND TO DEPART FROM THE U.S. ON I AM IN POSSESSION OF A TRANSPORTATION TICKET FOR MY DEPARTURE YES NO EXTENSION DENIED V.D. TO (Date) DD 12. PASSPORT NO. EXPIRES ON (DATE) ISSUED BY (COUNTRY) OR OIC OFFICE Portland, Oregon 020124/69 Dec. 1973 Vietnam 13. Number, Street, City, Province (State) and Country of Permanent Residence 14. MY USUAL OCCUPATION IS: 15. SOCIAL SECURITY No. (If none. state \"none\") 177/2 Le Van Duyet, Saigon, Vietnam Housewife None 16. AM AM NOT married. If you wish to apply for extension for your spouse and children, give the following: (See Instruction #1) NAME OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) AND EXPIRES ON (Date) NOTE: If spouse and children for whom you are seeking extension do not reside with you, give their complete address on a separate attachment to this application. 17. I (Inserts HAVE \"AHave\" or NO1 \"Have-Not\") BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADDRESS OF EMPLOYER OR BUSINESS INCOME PER WEEK DATES EMPLOYMENT OR BUSINESS BEGAN AND ENDED N/A 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), SEE INSTRUCTION 6 AND COMPLETE THIS BLOCK BY FILLING IN SPACES AND PLACING AN \"X\" IN THE APPROPRIATE BOXES. I HAVE 1.000 DOLLARS IN THE UNITED STATES. I RECEIVE DOLLARS EACH FROM . (Week, Month) (Name) (Relationship) (Address) MY ROOM AND BOARD IN THE U.S. ARE SUPPLIED BY MYSELF BY Mr.&Mrs. J. McGeever Daughter & Son-in-law 2173 W. 16th Ave. Eugene, Oregon 97402 (Name) (Relationship) I HAVE 00 NOT HAVE A FAMILY ABROAD DEPENDENT UPON ME (Address) FOR SUPPORT IF YOU CHECKED \"HAVE\" STATE HOW YOUR FAMILY IS BEING SUPPORTED: I certify that the above is true and correct. SIGNATURE OF APPLICANT DATE Jan. 10, 1973 SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. SIGNATURE ADDRESS DATE Douxuan Mcguver 2173 W. 16th Ave. Eugene Jan. 10, 1973 ATTACH YOUR FORM 1-94 OR SW-434-*DO NOT SEND YOUR PASSPORT RECEIVED TRANS. IN RET'D.-TRANS. OUT COMPLETED FORM 1-539 (REV. 8-1-72)N JAN 1 1 7913 JAN 1 8 1973"
}