{
  "anumber": "A19790690",
  "id": "A19790690_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19790690_0032/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO EXTEND MY TEMPORARY STAY IN THE UNITED STATES, F-1539 ( (REV. 11-1-70)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        1977,
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE READ Streeted byTNARA, (2AB/2023) LY. Form approved IMMIGRATION AND NATURALIZATION SERVICE FEE WILL NOT BE REFUNDED. Budget Bureau No. 43 - R0068 THE JAN FEE STAMP APPLICATION TO EXTEND TIME OF TEMPORARY STAY RECEIVED 1972 1000 FEE PAID No. POO- 72 IMM. 127-15 Portland, SERVICATZ Ore, Immigration and Naturalization Service I HEREBY APPLY TO EXTEND MY TEMPORARY STAY IN Portland, Oregon INF THE UNITED STATES N-250 1/7/72Verified by LNB. 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER 7. DATE TO WHICH EXTENSION IS REQUESTED NGUYEN NHAT THI 020124/69 July 1972 2. OTHER NAMES (Include all past and present names; married woman must give her maiden name) 8. REASON FOR COMING TO THE UNITED STATES TRAN DINH DAN 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) Visit Children 2173 16th Ave. West Eugene Ore. 97402 4. DATE OF BIRTH (Mo. Day Yr.) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 9. REASON FOR REQUESTING EXTENSION 1906 Vietnam Vietnam Visit daughter and 5. NONIMMIGRANT CLASSIFICATION DATE ON WHICH AUTHORIZED STAY EXPIRES son-in-law. B/2 Jan. 17, 1972 6. DATE AND PORT OF LAST ARRIVAL IN UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS OF 10. DATE OF INTENDED DEPARTURE FROM U.S. LAST ARRIVAL IN U.S. Honolulu, Hawaii PA 842 July 1972 FOR GOVERNMENT USE ONLY 11. PASSPORT NUMBER PASSPORT ISSUED BY (Country) DATE B. APPROVED INS. 020124/69 Vietnam OF PASSPORT EXPIRES ON (Date) EXTENSION GRANTED TO (Date) ACTION JAN 7 - 1972 Dec. 1972 DD 12. AM AM NOT IN POSSESSION OF A OR EXTENSION DENIED V.D. TO (Date) OIC OFFICE Wm. L. Pattillo TRANSPORTATION TICKET FOR MY DEPARTURE 1-17-72 PORTLAND 13. Number Street, City, Province (State) and Country of Permanent Residence OREGON 14. MY USUAL OCCUPATION IS: 15. SOCIAL SECURITY No. 177/2 Le Van Duyet (If none, state \"none\") Saigon, Vietnam Housewife None 16. I AM AM NOT married. If you wish to apply for extension for your spouse and children, give the following: (See Instruction #1) NAMES OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) AND EXPIRES ON (Date) NOTE: If spouse and children for whom you are seeking extension do not reside with you, give their complete address on a separate attachment to this application. 17. (Insert \"Have\" or \"Have Not\") I have not BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADDRESS OF EMPLOYER OR BUSINESS NA KIND OF EMPLOYMENT OR BUSINESS INCOME PER WEEK DATES SUCH EMPLOYMENT OR BUSINESS BEGAN AND ENDED NA brought $1,000 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), COMPLETE THIS BLOCK. I HAVE DOLLARS IN THE UNITED STATES. I RECEIVE DOLLARS EACH FROM: (Day, Week, Month) (Name and Address) 19. I AM VISITING THE FOLLOWING PERSONS IN THE UNITED STATES Mc GEEVER, Xurn Tran NAME RELATIONSHIP ELP 1-20-70 ADDRESS 414-960-1461 Mr. & Mrs. James McGeever Daughter 2173 16th Ave. West & Son-in-law Eugene, Oregon 97402 20. I ATTACH WRITTEN STATEMENT FROM James McGeever DATED Jan. 6, 1972 IN SUPPORT OF THIS APPLICATION. I BELIEVE SUCH STATEMENT TO BE TRUE AND I MAKE IT PART OF THIS APPLICATION: (See Instruction 6.) I CERTIFY THAT THE ABOVE IS TRUE AND CORRECT SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN APPLICANT SIGNATURE OF APPLICANT DATE ng illungial Jan. 6, 1972 I DECLARE THAT THIS DOCUMENT WAS PREPARED BY ME AT THE REQUEST OF THE APPLICANT AND IS BASED ON ALL INFORMATION ADDRESS LABEL FOR NOTICE OF ACTION ON APPLICATION OF WHICH I HAVE ANY KNOWLEDGE. TYPE OR PRINT (VERY FIRMLY AND CLEARLY) YOUR NAME, MAILING ADDRESS, AND IF APPROPRIATE \"In Care Of\" IN THE SIGNATURE SPACES BELOW. Hegeever YOUR NAME Nguyen Thi Nhat DATE STREET 2173 16th Ave. West Jan. 6, 1972 ADDRESS ZIP ADDRESS CITY AND For Statictics on Adjudentials 2173 16th Ave. West STATE Eugene, Oregon 97402 Eugene, Oregon 97402 ATTACH YOUR FORM 1.94 OR SW 434, Tr. Out FORM I-539 (REV. 11-1-70) 1977 19th"
}