{
  "anumber": "A19918776",
  "id": "A19918776_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19918776_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1926,
        1972,
        2025
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PLICANT.-Do not fill in or sign anything on page AFFIDAVIT I, the applicant do swear Subscribed and sworn to before me upon examination of the (Applicant, parent, guardian) that I know and understand the contents of this application, applicant (parent, guardian) at inca this signed by me, and of attached supplementary pages num 23 day of June 1972 hered to ( inclusive, that the same are true to the and continued solely for: best of my knowledge and belief; and that corrections num- bered to (8) were made by me or at my request. Hannah and Harmet person machine officent agreement that Harriet Altman NR 6-23-72 (uth Become (Signature of applicant, parent, guardian) signature REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents, records, and persons examined, and the identification upon personal appearance of the underage beneficiary, I find that all the facts and conclusions set forth under oath in this application are - true and correct; that the applicant did .derive OF acquire United States citizenship on June 17, 1926 through on which date date she was a lawfue (Month) permanent (Day) (Year) reserent of the n s and under 21 years her father having been materialized on and that (s) he time. I recommend that this be has not expatriated since that application greated and that A- - Certificate of Citizenship be - issued in the name of Harret caral altman (A) (AA) In addition to the documents listed in Item 14, the following documents and records have been examined: full of sister manon sengel to A19886628 Harnet showing Cup on attest he applicants leave entry impermanter substance of active re u conert and used names apperients Relationship mind strong showing applients fathers mill and Ex Z mc apprecent Date Testimony Person Examined Address to Applicant Heard marin Sengel 2025 Bedford H sister 6-23-70 ha Co Supplementary Report (s) No. (s) not Attached. 16th Browne (Officer's signature and title) 6-23 , 197 Gen ath (unt) I do concur in the recommendation. Date 19 (Signature of District Director or Officer in Charge & (4) KB"
}