{
	"anumber": "A19927965",
	"id": "A19927965_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551, Form I-90"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 U. S. DEPARTMENT OF JUSTICE Form Approved Immigration and Naturalization Service OMB No. 43-R0040 (SEE INSTRUCTIONS ON<REVERSE) Fee Stamp APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551 MAY 15 1981 (TYPE OR PRINT IN BLOCK LETTERS WITH BALLPOINT PEN) LOS 415273 1. Family Name (Capital Letters) First Middle 2. Alien Registration Number HUSSAIN MAHMUDA A- 19-927 965 3. Mailing address in c/o (Number & Street) (City) (State) (ZIP Code) 1125 N. ONANDAGA AVE.,APT.3 ANAHEIM, CAL. 92801 4. Name used when I became a permanent resident: (If same as present, write \"Same\") 5. Country of citizenship SAME PAKISTAN 6. Date of Birth (Mo./Day/Y) .) 7. Place of birth (City or town) (Province or State) (Country) 8. My phone number is (Include Area Code) 10.10.10 LAHORE, PUNJAB, PAKISTAN 714 - 956 - 3839 3538 9. Originally admitted to U.S. at (City and State) 10. Date of admission as Permanent Resident or adjusted to status as Permanent Resident CHICAGO, ILLINOIS AS VISITOR (Mo/ /Day/Yr) 2.7.75 NFC 1. Destination in U.S. at time of original admission 12. My file is at the INS office in (City and State) LOSANGELES, CALIFORNIA LOSANGELES, CALIFORNIA 13. List the dates of all absences from the U. S. of 1 year or longer, since admission for permanent residence NONE 14. City of residence when I applied for an immigrant visa or adjustment to permanent residence status LOSANGELES 15. Consulate where my visa was issued (or INS office where I was adjusted to permanent residence status) LOSANGELES, CALIFORNIA 16. Mother's First Name Living Deceased 17. Father's First Name Living Deceased MUHAMMADI IBBAL MIR AHMAD 18. I NEED A CARD BECAUSE (A) My alien registration receipt card was lost, destroyed, or mutilated. (Attach remainder of card) (FEE REQUIRED, SEE INSTRUCTION 3.) Explain how card was lost, destroyed, or mutilated. (B) My name has been changed. (Attach the decree of the court or the marriage certificate and old card.) (FEE REQUIRED, SEE INSTRUCTION 3) (C) I am required to be registered and fingerprinted after my 14th birthday. (Attach old Card.) (You MUST use the fingerprint card Form FD-258 which you can get from any United States Consular or Immigration and Naturalization Service office.) (D) I am an alien commuter taking up actual permanent residence in the U. S. (Attach old card.) (E) I received an incorrect card. (Attach old card.) (F) I never received my card. ARMED STOLEN DURING AROBBERY AT 5605 BURNING TREE DR. LACANADA ON (G) OTHER (Explain) 5.11.81 POLICE REPORT LACRESCENTA POLICE FILE NUMBER 481-015-821261601 19. Signature and date of person preparing the form if other than applicant 20. Signature of applicant and date Durdana glani Khan M.D mahmuda Hussain 5/15/81 DO NOT WRITE BELOW THIS LINE. ACTION BLOCK (For use by Immigration or Consular officer) This applicant was interviewed by me under oath on at (City) (Date) REMARKS: U. S. APPROVED INS. (Signature and Title) GRANTED DENIED Fingerprint card forwarded to the FBI to comply with DATE OF ACTION 1982 Section 262 b (Initials and Date) DD DISTRICT 8 okey I-89 to Immigration Card Facility 5/7/82/155r (Date) (Signature of Immigration Officer) REMOTE ADJ. CENTER a RECEIVED TRANS. IN RET'D. TRANS. OUT SYS/ COMPLETED FORM I-90 (Rev. 4-4-80)"
}
