{
	"anumber": "A19927965",
	"id": "A19927965_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "HAGA UNA CRUZ EN EL CASILLERO APLICABLE Y SUMINISTRE LA INFORMACIÓN DESEADA, HAGA UNA CRUZ EN EL CASILLERO APLICABLE Y SUMINISTRE LA INFORMACIÓN DESEADA"
		},
		"years": {
			"ms_years_nlp_v1": [1973]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "by NAFAA, HAGA UNA CRUZ EN EL CASILLERO APLICABLE Y SUMINISTRE LA INFORMACION DESEADA La persona sobre la que se solicita información: Partió de los Estados Unidos desde Jan 20th 1973 from Kannady Airport el (Puerto de salida) New York por (Fecha) by P. 1. A . (Nombre de la embarcación u otro medio de transporte) Nota: Si se dispone del Formulario I-94 \"Arrival-Departure Record\", sirvase agregarlo a este formulario antes de devolverlo. Solicitó o se le confirió extensión del permiso de permanencia temporal en la oficina del Servicio de Inmigración y Naturalización en N.A . (Lugar) Solicitó cambio de su clasificación de Inmigración en la oficina del Servicio de Inmigración y Naturalización en nips common N.A . (Lugar) Puede ser hallada en la siguiente dirección: bats.an 25 B. (Calle) Campus garage (Ciudad) of karachi Sind ou of paristan (Estado o Provincia) (País) Tiene los siguientes amigos o parientes en los Estados Unidos, quienes puedan tener información sobre su paradero: Lokeiro plan Hourt N.A Nombre Domicilio Ciudad Estado bourse Nombre Domicilio Ciudad Estado dec Nombre Domicilio Ciudad Estado No dispongo de información. Ninguno de los datos indicados más arriba es aplicable. (En caso de marcar este bloque, sirvase suministrar en OBSERVACIONES, más abajo, toda infor- mación que podría facilitar la determinación del paradero de la(s) persona(s) en cuestión). OBSERVACIONES: 1-94 handed over to p.1. A at counter SR at cannady Air port, New york Exhequence de mance Mrs Imtiaz Hussain Signature (Firma) Karachi paristan (Domicilio) matches against Info-shat Feb.27,1973"
}
