{
	"anumber": "A19918776",
	"id": "A19918776_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19918776_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Petition and Affidavits of Petitioner and Witnesses,, N-4-1257"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Poland", "Italy"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1970, 1906]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Third / was born on the day of anko tromane Fourth Aynigrated to the United States from Trieste, Italy on or about the day of 920 anno Domini and arrived in the United States, at the port of the day of ,920 diff America ando Domini on the reases (1'the allen arrived otherwise by of conveyance of sivened be gives) 420 Fifth I declared my intention to Secome citizen of the United States on the day of anna Demini 1 Superfor illinois Cock County Illinois at its Rice Court of 77 Sixth am My name is she day may 883 aniso Derains / at Three Pland and now resides at 1140 Troy (live number live and street) Chicago, m. children, and the name, date, and place of birth, and place of resi 14cl of each of at could children Poland was 29 may waite Harrick minime 29 3 Dr. apr 1970- 1912- - at thics go illinois Seconth / am not a disbeliever in or opposed to organized government or a member of or \"filitated with any organization or body of teaching Libeliefin or opposed to organized government. / am not a polygamiat nor a believer in the practice of polygamy / am attached to the principles of the Constitu tion of the traded States. and \" is my intention to become a citizen of the United States and to renounce absolutely and forever all allegiance and Adelity to any foreign prince. potentate. state. or and particularly to the Republic of Polent of whom as this time fam is object, and \" is any intention to reside permanently in the United States Rights fam able to speak the English language. Ninth I have resided continuously in Ang United States of America for the term 928 WaA years at least immediately proveding the date of this petition, to alnea the sep sept anno Domini and in the State of Illinois, continuously M at proceding the date of this petition, since the 18. of day of cano Domini 720 being of year preceding the date / a residence within this State ⑉ least one - of this petition. Tenth / have not heretofore made petition for citizenship to any court. (I made petition for oftimenship to the of on the day said petition was denied by the said the following and causes. to with and the cause of It Attached hereto and made a par of this petition are my declaration of intention to become a citiven of the United States and the from the Deportment of Labor, together with myamda it and the affidarits of the two verifying witnesses thereto, required by law. Wherefure your potitioner prays that he 7. by be admitted to el bloom of the United States of America Herrs Borus Haftons Hermon heat- 8 (Completeless 125782 Declaration of day of Feb petitioner) Intention and Certificate of Arrival from Department of Labor filed this 6 No NOTE TO CLERK OF Coust petitioner arrived in the United State OR on REPORT JUNE 2. 1906, ptrike oui the words reading Fand Certificate of Arrival from Depart sent of Labor AFFIDAVITS OF PETITIONER AND WITNESSES STATE OF ILLINOIS, *** County of Cook The aforesaid petitioner being duty awarn, deposes and says that he is the petitioner in the above-entitted proceedings that he has read the foregoing patition and the contents thereof that the said petition is signed with his full. Irsaname, that the same. frue of his own knowledge. except aa to matters therein tated to be allaged upon information and belief and that as to those matters he believes it to be true tears Bogues Happy of Hernan Hept and Harry barber occupation geneter residing (Complete at! of 4655.40 SCS/-N trousignation CHicago, 118. occupation residing Chicago, the being severally justy and respectively and says that he in di citizen w the taxed States of America: that has has personally nown Thing Brock his Holling since the the potitioner above mentioned, to have resid ed in the United States continuously / immediately receding the date of filing petition day of Jan anno Domini ,921 and in the State in which the above entitled petition is made continuously since the / day of Jan anno Domini , 921 and that he has personal knowledge that the sold petitioner is a person of good moral character attached to the principles of the Constitution of the United States, and that the petir loner is in every way ysolip ed. in Md opinion, to be admitted a citizen of the United States. Harry glow Gange a (Signature of Schoolzy withers) Subcoribed and to before me by the about Feb and witnesses in the office the Clerk of said Complaint Chicago, III., this (SEAL) g day of anno Domini mamuedE By Destrooting Clerk Depirty Clark"
}
