{
  "anumber": "A19927965",
  "id": "A19927965_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. INS. INFORMATION SHEET FOR REQUEST FOR EXTENSION OF VOLUNTARY DEPARTURE TIME., INS-8024"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U.S. INS. INFORMATION SHEET FOR REQUEST FOR EXTENSION OF VOLUNTARY DEPARTURE TIME. The following information must be furnished before the request can be considered: 1. ALIEN'S NAME: IMTIAZ HUSSAIN FILE #: A19 927 965 2. ALIEN'S PLACE OF BIRTH LAHORE, Pakistan DATE OF BIRTH: 10/10/10 3. ALIEN'S PRESENT ADDRESS: 17331/2 S. WESTMORELAND AVE. L.A. 90006 (street) (city) (zip code) 4. ALIEN'S TELEPHONE #: 747-2931 SOCIAL SECURITY #: 5. ALIEN'S SPOUSE'S NAME: - 6. ALIEN'S SPOUSE'S COUNTRY OF CITIZENSHIP: PAKISTAN 7. ALIEN'S SPOUSE'S IMMIGRATION STATUS. A# illegal ( ) ; temporary visitor ( ) ; permanent resident ( ) 8. NUMBER OF ALIEN'S CHILDREN: (U.S.Citizen: - ); (Illegal: - ); (Other: ) 9. IS ALIEN ATTEMPTING TO IMMIGRATE INTO THE U.S.? (YES: ) ; (NO: ). . Name of Person or Organization assisting: 10. HAS PETITION FORM I-130 OR FORM I.550 BESN FILED? (YES: ) (DATE) ) (NO: ) 11. TO WHICH AMERICAN CONSULATE WAS FORM DIRECTED? 12. HAS A PRIORITY DATE BEEN RECEIVED? (YES: ) (DATE: ) (NO: ) 13. DONC ALIEN'S SPOUSE, OR children, RECEIVE COUNTY OR STATE AID, OR WELFARE? No (If YES, how much each two weeks? 14. HOW LONG HAS ALIEN BEEN EMPLOYED IN U.S.? - MONTHLY INCOME: 15. NAME AND ADDRESS OF ALIEN'S EMPLOYER : - 16. FOR WHICH YEARS HAVE STATE & FEDERAL INCOME TAX FORMS BEEN FILED? - (Attach copies of Forms for the years filed) 17. IS ALIEN IN POSSESSION OF A VALID PASSPORT? (YES: ) EXPIRATION DATE: Jan.24,1974 (NO: ) 18. DOES ALIEN INTEND TO DEPART FROM U.S.? (YES: ; (NO: ) 19. IF ABOVE ANSWER IS YES FURNISH THE DATE OF INTENDED DEPARTURE: March 17,1973 20. WHAT IS ALIEN'S REASON FOR REQUESTING EXTENSION OF VOLUNTARY DEPARTURE? Medical treatment 21. SIGNATURE OF ALIEN: mrs Imtiaz Hussain HAND DELIVER THIS FORM WITH REQUIRED ATTACHMENTS TO RECEPTIONIST, ROOM 8024 (Do Not Write in Block Below) U.S. INS. OFFICE REMARKS: DEP - 8/15/72"
}