{
	"anumber": "A19927965",
	"id": "A19927965_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO EXTEND TIME OF TEMPORARY STAY, Form No. 1-539 ( (REV.8-1-72N)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 1970, 1972, 1974, 1973, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE READ INSTRUCTIONS CAREFULLY Form approved IMMIGRATION AND NATURALIZATION SERVICE FEE WILL NOT BE REFUNDED. OMB No. 43-R0068 FEE STAMP APPLICATION TO TEND TIME OF TEMPORARY STAY I HEREBY APPLY TO EXTEND MY TEMPORARY STAY IN THE UNITED STATES PRINT OR TYPE YOUR NAME EXACTLY 6. DATE TO WHICH EXTENSION IS REQUESTED AS IT APPEARS ON YOUR ARRIVAL - DEPARTURE RECORD FORM I-94 MAY 26,1973 1. YOUR FAMILY NAME (Capital Letters) FIRST MIDDLE 7. REASON FOR REQUESTING EXTENSION: NAME HUSSAIN, MRS. IMTIAZ 2. MAILING NUMBER AND STREET FILE NUMBER HEALTH AND ADDRESS 17331/2 S.WESTMORELAND IN U.S. A19927965 CITY STATE ZIP CODE Los ANGELES, CALIF 90006 FAMILY 3 DATE OF BIRTH (Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 8. REASON FOR COMING TO THE U.S.: Oct. 10, 1910 PAKISTAN PAKISTAN 4. PRESENT NONIMMIGRANT CLASSIFICATION TOURIST B-x DATE ON WHICH AUTHORIZED STAY EXPIRES x YS Nov. 26, 1972 FAMILY 5. DATE AND PORT 0 ARRIVAL IV UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS OF LAST ARRIVAL IN U.S. Oct.10, 1970, CHICAGO SWISS AIR 9. HAS AN IMMIGRANT VISA PETITION EVER BEEN FILED IN YOUR BEHALF? YES NO IF \"YES\". WHERE WAS IT FILED? FOR GOVERNMENT USE ONLY U.S. APPROVED 10. HAVE YOU EVER APPLIED FOR AN IMMIGRANT VISA OR PERMANENT RESIDENCE IN THE U.S.? YES XNO IF \"YES\", WHERE DID YOU APPLY? DATE EXTENSION GRANTED TO (Date) OF ACTION NOV 21 11. I INTEND TO DEPART FROM THE U.S. ON I AM IN POSSESSION OF A TRANSPORTATION MAY26, 1973 EXTENSION DENIED V.D. TO (Date) TICKET FOR MY DEPARTURE YES NO DD 12. PASSPORT NO. * OR EXPIRES ON (DATE) ISSUED BY (COUNTRY) 60 DAYS 1-21-73 OIC OFFICE AC 439799 Jan 24,1974 PAKISTAN 13. Number, Street, City, Province (State) and Country of Permanent Residence 14. MY USUAL OCCUPATION IS: 15. SOCIAL SECURITY No. (If none, state \"none\") 25B Campus Minio of Karachi, Pakistan HOUSEWIFE 16. AM AM NOT married. If you wish to apply for extension for your spouse and children, give the following: (See Instruction #1) NAME OF SPOUSE AND CHILDREN DATE OF BIRTH COUNTRY OF BIRTH PASSPORT ISSUED BY (Country) AND EXPIRES ON (Date) NOTE: If spouse and children for whom you are seeking extension do not reside with you, give their complete address on a separate attachment to this application. 17. (Insert \"Have\" or \"Have Not\") HAVE NOT BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES. IF YOU HAVE BEEN EMPLOYED OR ENGAGED IN BUSINESS IN THE UNITED STATES, COMPLETE THE REST OF THE BLOCK. NAME AND ADDRESS OF EMPLOYER OR BUSINESS INCOME PER WEEK DATES EMPLOYMENT OR BUSINESS BEGAN AND ENDED 18. IF YOU ARE A TEMPORARY VISITOR FOR PLEASURE (B-2), SEE INSTRUCTION 6 AND COMPLETE THIS BLOCK BY FILLING IN SPACES AND PLACING AN \"X\" IN THE APPROPRIATE BOXES. I HAVE TOO OOLLARS IN THE UNITED STATES. I RECEIVE 100 DOLLARS EACH month FROM Sous (S. HUSSAIN, (Name) 2545 MARIPOSA,LA (Week, Month) (Relation (Address) MY ROOM AND BOARD IN THE ARE SUPPLIED BY MYSELF BY (Name) (Relationship) HAVE DO NOT HAVE A FAMILY ABROAD DEPENDENT UPON ME (Address) FOR SUPPORT. IF YOU CHECKED \"HAVE\" STATE HOW YOUR FAMILY IS BEING SUPPORTED: I certify that the above is true and correct. SIGNATURE OF APPLICANT Mrs Intinz Hussain DATE Nov. 8, 1972 SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. SIGNATURE ADDRESS DATE afzaal 1733 1/2 Westmoreland are L.A. Nov. 8, 1972 ATTACH YOUR FORM 1-94 OR SW-434- DO NOT SEND YOUR PASSPORT RECEIVED TRANS. IN RET'D.-TRANS OUT COMPLETED FORM 1-539 (REV. 8-1-72)N"
}
