{
  "anumber": "A19918776",
  "id": "A19918776_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19918776_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization, 7151"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        1970,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "751 U. S. DEPARTMENT OF LABOR 121 NATURALIZATION SERVICE DUPLICATE No. 71151 the be teresaded to the three 48 Naturalisatisa) UNITED PETITION STATES FOR NATURALIZATION OF AMERICA I To the Honorable the Superior Court of Cook Minoist First The petition My place of of Anny residence in Kertich Quanty, Haltary Ave Herman Haft hereby Med, respectfully showers Chicago ni. (Dive number and street) Second My occupation is Third / was born on the 12 day of Dec anno Domins 4881 of Warsaw, Priand Fourth Amigrated to the United States from Irleste, Italy 420 on or about the day of Sept anno Domini and arrived in the Unifed States, of are of on the 8 ,920 on the vessel America port day of clift anno Domini (Ifthe allen arrived otherwise than by of conveyance Fifth declared my intention to Secome a citizen of the United States an the my should be given) day of anno Domini I 420 at Chicago Winnia Superfor \"Rice Court of Sixth I am Smarted. jeife's name is 77 Cod County Illinois plant (she teas form and Fry gray 883 day Domini / at Three and now resides as 114c (Other number and itree D Chicago,III. Dasili children, and the name, date. and place of birth, and place of rest lease of eash of said whilders w Been 19 Harric Minnie / 79 3 - ,Ded up -1970- 1912- may resed at this go Seventh I am not a disbeliever in or opposed to organized government or a member of or affiliated with any organisation or body of ersons teaching disbelled 20 or appoint to organized government I am not a polygamist 71.07 a believer in the practice of polydamy / am attached to the principlas of the United tion of the United States, and it is my intention to become a citizen of the United States and to renounce absolutely and forever all allegiance and Adelity to any foreign prince, potentate, state, or subresignty and particularly to The Republic of Polence iv whom at this time I am a subject, and \" is any intention to reside permanently in the United States Eighth / am able to speak the English language. Ninth / have resided continuously in the United States of America for the term Was years of loast immediately proceeding the date of this petition, to with since the since the 18 of day of sept 928 sept annu Domini and in the State of Minola, continuously proceding the date of this petition, anno Domini / Tio being a residence within this State of de least one year near preceding the date of this petition Tenth I have not heretofore made petition for citizenship Co any court. (I made petition for efficership to the Court of of on the day if and the said petition was denied by the sold Court the following and causes. to with and the cause of anch 22 Attached hereto and made \" pm e of this petition are my declaration of intention to become a officers of the United States and the car Waste from the Deportment of Labor, together with nyandari and the a/I/davits of the two verifying witnesses thereto, required by law. Wherefure your notitioner proys that he R by be admitted a of the United States of America Heres Borus Haftons, terman huft Declaration of Intention No 125782 and Certificate of Arrival this 8 (Complete and potitioner) from Department of Labor filed day of Feb 10g 6 Note TO CLEAR OF COURT- petitioner arrived is the United State ON OR REPORT JUNE 29. 1996,strike out the words reading \"and Certificate of Arrival from Depart time of Labee AFFIDAVITS OF PETITIONER AND WITNESSES STATE OF ILLINOIS, as: County of Cook, The aforesaid petitioner being duly incorn. deposes and says that he is the petitioner in the above-entitled proceedings: that he has read the foregoing position and knows the contents thereof that the said petition is signed with his full, trkenama; that the same true of his DION knowledge. except as to matters therein tated to be alleged upon information Sand belief and that as to those matters he believes it to be true tears Boruc laftway J Herman High barber (Complete and Harry Diglority occupation residing at 4655.40 Chicago, m. occupation geveler resident at 505/-V Chicago, it. severally and respectively any that he is a nitizen the States of America that he has personally"
}