{
  "anumber": "A19927965",
  "id": "A19927965_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CHECK APPLICABLE ITEM AND INSERT REQUIRED INFORMATION, NARA Form 2305-10"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 CHECK APPLICABLE ITEM AND INSERT REQUIRED INFORMATION The person inquired about: Departed from the United States at new York City on (Port of departure) Jane 20, 1973 via PAKISTAN INTERNATIONAL AIRLINES . (date) (Name of vessel or other means of transportation) (Note: If Form I-94 Arrival - Departure Record is available, please attach it to this form before returning.) Applied for or has been granted extension of temporary stay at the DIPITICL DISECIOK office of the Immigration and Natura- (Location) lization Service. Applied for adjustment of status at the (Location) office of the Immigration and Naturalization Service. Couany Can be contacted at the following address: % Dr. M.I. Siddigi, 25B Campus, University of Karachi, (City) Karachi32 (Street) Pakistan (State or Province) (Country) Has the following friends or relatives in the United States who may have information concerning his whereabouts: geb Q.,Apaal Hussain, 17331/2 Address S.Westmoreland City are Laticalif State 90006 Name LP Mr. Anjad Hussain, 1341 welester Ave City Anaherm, Calif State Name Address Mr. Shankat Hussain, 252 s. mariposa, apt. 19, L.A. Calif Name Address City State I have no information. None of the above items are applicable. (If this block is checked please furnish any information under REMARKS below, which may help to ascertain the subject's whereabouts). REMARKS: Dute: Lep IS' JO.13 ass des BOX V YMD REMAICE OHILED OE Invice Afzaal Hussaun (Signature) 17331/2S. / estimoneland Ave. L.A. Calif (Address) 90006"
}