{
  "anumber": "A19927965",
  "id": "A19927965_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0007/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A19 927 965"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE FILE Place Los Angeles, Ca. File No. Status as a lawful permanent resident of the United States is accorded: Mahmuda A19 927 965 SEX DATE OF BIRTH Name MOHMODA HUSSAIN F 10/10/10 Street 17332 Westmore land Ave. PLACE OF BIRTH Address Los Angeles, Ca 90006 Pakistan we volice City, State, Zip que NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Pakistan the DETAX VOLICE MPGU the opia unwpet PRIORITY DATE Pakistan Nonpreference 6/3/74 REMARKS live unwpet Sec. 203 (a) (8) (5)' (3) OL OL 20CHOU NONPREFERENCE: Section 212(a)( (14) certification not required because: CEBITE supported by son the Plock ou we Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the & N Act Sec 249 of the & N Act Sec 214(d) & N Act OUCE Private Law no of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session op Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 Mas OL (v) the 7 2 FEB 1975 IUG VOL abbid (3) (Other law Specify) LOS ANGELES, CALIFORNIA As of (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE OL CLB Class of admission (Insert symbol) Z-2 NP6 3 (Applicable in all cases) ce DATE blobelli 11/6/74 sb OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION FEB 1915 p we 02 Rayll we 7 FEB 1975 DD pe Sureck byout DISTRICT FOR USE BY VISA CONTROL OFFICE LOS excebt LedniLeq Date !U case? Foreign State au CLOSING ACTION REQUIRED bjaceq CO202 MPOLE Preference Category: Number OI 380 nonpreference 1-151 2/7/25 excebt G-188 11-75 G-361 241575 we pe G-153 Month of Issuance pecow Feb I-530 OUG Signed (Visa Office, Dept. of State) we ACI of Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed UOL Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - 181 (Rev. 5-1- - - 74) N (Page 1)"
}