{
  "anumber": "A19927965",
  "id": "A19927965_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19927965_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Under Docket Control at Los Angeles,, A19 927 965"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 UI ED STATES DEPARTMENT OF JUSTICE Dept IMMIGRATION AND NATURALIZATION SERVICE 300 NORTH LOS ANGELES STREET 8024 LOS ANGELES. CALIFORNIA 90012 Z File No.: A19 927 965 Date: November 21, 1972 Imtiaz Hussain c/o Afzaal Hussain South Westmoreland Avenue Los Angeles, California 90006 UNDER DOCKET CONTROL AT LOS PLEASE NOTE THE ITEM OR ITEMS CHECKED BELOW WITH REGARD TO YOUR APPLICATION. 1. X Upon consideration, it is ordered that your application for extension of temporary stay be denied for the following reason: a. You have failed to establish that you intend to depart from the United States within & definite time. of b. You have failed to establish that you have a residence abroad to which you intendato return. c. You have failed to establish that you can financially maintain yourself as >bona fide nonimmi- grant. d. You have failed to establish that the purpose for which you were admitted has not been accom- plished and that your requested extension is not merely an attempt to prolong your stay indefinitely. e. You have violated your nonimmigrant status unauthorized employment in the United States. 50/00 by accepting f. 2. X It will be necessary for you to depart from the United States not later than January 21, 1973 You must notify this office before that date of the arrangements you have made to effect your departure, including the date, place and manner of departure. USE THE ENCLOSED SELF-ADDRESSED CARD TO NOTIFY THIS OFFICE REGARDING DEPARTURE ARRANGEMENTS POSTAGE IS NOT REQUIRED? RECORD, Deard At the time of your departure, do not fail to surrender Form I-94, ARRIVAL DEP RTURE in accordance with instructions on that Depthes form Dran D.D.Speace 3. Upon consideration, it is ordered that your application as a nonimmigrant student for permission to engage in employment be denied for the following reason: UNDER DOCKET CONTROL AT LOS Enclosures: Form I-94 Your Passport Form I-438 Very truly yours, DISTRICT DIRECTOR Form I-541 (Rev. 8-1-70)"
}