{
  "anumber": "A20181518",
  "id": "A20181518_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPLICANT.-De not fill in or sign anything on this page AFFIDAVIT I, the (Applicant, parent, guardian) Applicant , do swear Subscribed the that I know and understand the contents of this application, applicant (parent, and sworn guardian) to before at me upon examination the of signed by me, and of attached supplementary pages num- , this 13 day of 1984 bered ( HOT inclusive; that the same are true to the best of my knowledge and belief; and that corrections num- Mncle and continued solely for: teglimang Intas bered ( ) to 10 were made by me or at my request. NAthan Dwoskin tourhouse 162 wat 4610 Beetined St not # 77035 X (Signature of/applicant, parent, guardian) (Officer's signature and titlet (N) REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents, records, and persons examined, and the identification upon personal appearance of the underage beneficiary, I find that all the facts and conclusions set forth under oath in this application are true and correct; that the applicant did - derive or acquire United States citizenship on 3-1-21 , throughx on whi ch (Month) (Day) (Year) he was a lawful permanent resident of the UnitedStates under twenty-one years of age, his father having been ns tural zed on 3-1-21 and that (s) he has not been expatriated since that time. I recommend that this application be Granted and that A Certificate of Citizenship be issued in the name of Joseph Young (A) (AA) In addition to the documents listed in Item 14, the following documents and records have been examined: Relationship Date Testimony Person Examined Address to Applicant Heard see N -341 testimony -Ex 9 thousting 24a 5/15/74 No. (s) none substitute untness used Parents Attached. deceased Supplementary Report (s) Dallaw may 24 54 (Officer's signature and title) - I do concur in the recommendation. Date Image of 144 Robert (Signature of District J Director Officer Pallage in Charge) or (4) by"
}