{
	"anumber": "A20181518",
	"id": "A20181518_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Declaration of Intention,, 8275"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form I U. S. DEPARTMENT OF LABOR DUPLICATE (To) be 70 the NATURALIZATION SERVICE laries el Number No. 8275 UNITED STATES OF DECLARATION OF INTENTION Invalid for all purposes seven years after the date hereof THE UNITED STATES C. In the UNITED STATES DISTRICT Court SOUTHERN DISTRICT OF LING ss. of we Isadoro Yosevits . aged 45 years, occupation Leather Goods Worker do declare on oath that my personal description is: Color White , complexion Dark , height 5 feet IO inches, weight I70 pounds, color of hair Black , color of eyes Brown other visible distinctive marks None. I was born in Balta Russia. on the 18th day of July anno Domini I 873 : 1 now reside at 520 Armory Ave, Cincinnati, Chio, (Give number, street, city or town, and State) I emigrated to the United States of America from Hamburg, Germany on the vessel Protoria : my last (If the allen arrived otherwise than by the character of conveyance or name of transportation company should be given) foreign residence was Balta, Russia. : 1 am married: the name of my wife is Ester : she was born at Rassia and now resides at Cincinnati, Ohio. It is my bona fide intention to renounce forever all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty, and particularly to The Present Government of Runsis of whom I am now a subject: I arrived at the port of New York , in the State of New York , on or about the 15th day of April , anno Domini I 904 : I am not an anarchist I am not a polygamist nor a believer in the practice of polygamy: and it is my intention in good faith to become a citizen of the United States of America and to permanently reside therein: So HELP ME GOD. osador yosicitz (Original signature of deciarant) Subscribed and sworn to before me in the office of the Clerk of said Court this 9t1 day of November , anno Domini 191 [SEAL] B E.Dilley Clerk of the UNITED STATES DISTAICT. Court. By W Riley Deputy Clerk."
}
