{
  "anumber": "A20181518",
  "id": "A20181518_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Naturalization Certificate, 1520180"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Mo. 1520180 UND insurance WADO Burnu Take for wereled john to the CANNED OF CHEAN ZANAU Polition Volume 29 Number 4272 Description of, holder. ( Age. 48 years: height. 5 feel 7 inches: color. White complexion Dark color of eyes, Brown color of hair Binok visible destenquisking marks. None. Name: age and place re / residence of wife Eather age Oyrup resides at Cincinnati, Ohio. Names ages and/places of residence of minor children Harry age 17yrs, Joseph age 19yrs. Charles age 14yrs, Lillian age 12yrn, Bellenge 9yrs. Gertrude age lyre, all reside st Cincinati, Ohio DUPLICATE United States of America Southern District of Ohio S.S. esador young Signature el hetder the il remembered that Isador Young then residing al number 520 Armery Ave, there Town City of dineimat 1, Territory of State Ohio. whirprevious to salion was n subject citizen of RUBSTK. having up plied toly admilieda alisen of the United States of Umerica andain Regular kron ofthe United States District Court of Southern District of Ohio helded Cincinnati, Ohio ON the 1st day of March in the year of our ford nineteen hundred und twenty -one the rouri having found that the politioner had resulted can linuously within the United. hates for al least five years and in this Farritory State for at least one perimmediately providing the dair of the filing of me polition, and that said politioner intends to District mide permanently in the United Vales had in all respects complied with the law in relation therelo and that he was entitled w to w admitted il nus themufone ordened by the said court that he 14 admitted asa citizen of the United linter, of Umerica I'll inherent the seal of said court 11 herrunio officed in the 1st day of March m the your of our ford nineteen hundi rd and twenty-one Sunday eur Unitependence the on hundred and forty-fifth, CLERK U 3. DISTRICT COURT, S. D. 0. character of question DEP REMENT ⑉ LABOR"
}