{
  "anumber": "A20181518",
  "id": "A20181518_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization, 8275"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1917,
        1220,
        1904,
        1909,
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U. S. DEPARTMENT OF LABOR NATURALIZATION 272 DUPLICATE No it. Se forwarded to the Boread UNITED STATES OF of Naturallizational PETITION FOR NATURALIZATION SOUTHERN DISTRICT OF OH10 To the Honorable the Court of HELD'AT CINCINNATI ONIO at The petition of Lider Yosevitz hereby filed. respectfully showers First, My place of residence is 520 Armory Avo, Cincinnati, Ohio. decond. My occupation is Goods Worker (Give number, street city or town, and State.) Third. / was born on the 18th day of July anno Domini 1 873 at Balta, Russia, Fourth. I emigrated to the United States from Hamburg, Germany on or about the Ist day of April anno Domini 904, and arrised in the United States, at the port of New York, N.Y. on the 15th day of April anno Domini 1904 on the vessel Pretoria (If the allen arrived otherwise thap by Vener, the character of name comproportation company should be given.) Fi/th I decli red my intention to become @ officer of the United States on the day of NOVEMBER anno Demins 2 918 Cinelmati, Chio at District in the United states Court of Birth fam Easter married My wife's name is at Russia Cinednust ,Ohio she was born on the 15 day of September anno Domini 880 and now resides at six children, and the name. date and place of birth, and place of residence of each of cold children is as follows: (Give number, street city or town, and State) I have Veaph Does 4th day of July I90I at Eusain resides Cincipneti, Ohio. herry home 6th Sept 903 Do. Charles been January 1907 Otheinnati Do. lily 27. april 1909 D0. Bella born 5th December 1917 at Do Gertrude horn 29th November I9I9 at Cincinnati, death am not a diabellever in or opposed to organized government or is member of or affiliated with any organization or body of persons teaching diabelief in or opposed to organized made want I am not a polygamist nor a believer in the practice of polygamy. I 0776 attached to the principles of the Constitution of the United States, and \" is my intention to officer 1 the United States and to renounce absolutely and foreper all allegiance and Adalty to any foreign prince, potentate, state, or supereignty, and lassia or any independent state within the bounds of the perticularly former of whom at this time I am a subject. and \" is my Intention to reside permanently in the United States. Righth I am able to speak the English language. Itth Note: / sure resided continuously in the United States of America for the term of five years at least immediately proceding the date of this petition, to wit. since like deposit April anno Domini 1 904 and in the State of Ohio continuously next precedin, the date of this position. 695 tax 25th day of April anno Domini 1 904 being a residence within this State of at least one year 750xé proceeding the date of this petition. Tenth I have not heretofore made petition for citizenship to any court. (I made petition for citizenship to the Cours of at on the day of anno Domins 1 Had the and dansed by the said Court for the following reasons and causes, to wit and the cause of such dental has since been cured or removed.) Attoches her to and made a part of this petition are my declaration of intention to become a citizen of the United States and the certificate from the Department of Labor, with my afidaus and the ufidavits of the two verifying witnesses thereto, required by low. Wherefore your petitioner prays that he may be adjusted a citizen of the United States of America , esador (Complete signature potitioners yosevitez and true of Declaration of Intention No. 8275 and Certificate of Arrival No. from Department of Labor Med this 16th November day of 1220 NOTE TO a COURT- petitioner andred in the United States ON on BERPORE JUNE 29, 1906, strike out the ordereading \"and Certificate of Arrival No. from Department or Labor.\" AFFIDAVITS OF PETITIONER AND WITNESSES it UNITED STATES OF AMERICA 63: SOUTHERN DISTRICT OF CHIP Me The aforesaid petitioner being duly sworn, deposes and bego that he is the petitioner in the +entitled proceedings: that he has read the foregoing petition and knows the thereof that the paid petition is signed with his full. trus name: that the same is true of his own knowledge, except as to matters therein stated to be alleged upon information and that @@ to those matters he belleves it to be trice lesador yoseacing"
}