{
  "anumber": "A20181518",
  "id": "A20181518_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATE OF OHIO DEPARTMENT OF HEALTH CERTIFICATE OF DEATH, Form G166-B (GPO 943-662"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "STATE OF oldo docal give DEPARTMENT OF HEALTH No. 29946 CSR2 , PLACE ON BEATH CERTIFICATE OF DEATH County Registration Destrict No 484 File My Team Printery Registreción District No 927 Registered No 5224 or Vitaria No Jowish loss ft 27 désis current is + hospital or An in Hair nation of - apil adidas or longits n P love - bath some to ind @ M. a # w Note unit. DUE Discover Serve in 3 FULL - Teacos Total MAN or Army (a) No. 3990 Carber Place Si West - AND Premium PARTICULARS MEDICA 11 CORPORATE or DEATH E six LOVOLI HARRIS Where de 21 DATS OF DEATH ( day, 5. se 12 Director Re: 22 So. - Divorced July it in n 13. 5t present FENTIFY the I / from 12.25 $ that Tounge last NEW in direct the - 19 4 DATE (month do - - - have average en the above is 3:30.PA see the Dign than 1 dr The PRINCIPAL CAONS OF DEATS and obsed of importative shirt office of deart - ⑉ - e ignor the Chartery Vocker Conview of this greetake with And bone & Long 9. in - Learne potestages in served 11 Total mm years (sily (seventh - le alide CON remove - respect complition - - (day or tental NOTE to 16 (do of Have of - Date of What leaf continued the design - I is Charge 13 = dealth - des to enternal - - - - following 16 (dby or - do dant. names is benefits Date of future 1% company I Where mi Goorg would 17 SUCK News Toute Hay - - copy shrite I in - in I ⑉ 560 10 OR Manga of leping Date Hair el - 10. PUNCHAN your ⑉ Wa or - way - or - 1 - M (injury) EXHIBIT 7 ROD Eshibit identification Form G146-B GPO 943.662"
}