{
  "anumber": "A20181518",
  "id": "A20181518_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0029/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Death, G146-B (C-254"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1860,
        2200,
        2006,
        1938
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OHIO DEPARTMENT OF HEALTH 3101 134-38-2860 Reg. Dist. No DIVISION OF VITAL STATISTICS State File No Primary Reg. Dist. No CERTIFICATE OF DEATH Registerer's No 1. PLACE OF DEATH 2. USUAL RESIDENCE (Where deceased lived. If institution: Resi- a. COUNTY dence before admission) Hamilton e. STATE Ohio b. COUNTY Hamilton b. CITY, VILLAGE, OR LOCATION c. LENGTH OF STAY IN 16 e. CITY, VILLAGE, OR LOCATION Cincinnati Cincinnati d. NAME OF (1) not in hospital or institution, give street address) d. STREET ADDRESS HOSPITAL OR INSTITUTION 561 Hale Ave. 561 Hale Ave. e. IS PLACE OF DEATH INSIDE CITY LIMITS? o. is RESIDENCE INSIDE CITY LIMITSP 6. IS RESIDENCE ON A FARM? YES x NO YES NO YES NO 3. NAME OF First Middle Last 4. DATE Month Day Year DECEASED Esther Young OF (TYPE OR PRINT) DEATH May 20 1938 5. SEX 6. COLOR OR RACE 9. MARRIED NEVER MARRIED 8. DATE OF BIRTH 9. AGE (In godes If Under 1 Year If Undie 24 line. last birthday) Female White WIDOWED DIVORCED 9-19-1860 51 Hours No. 10a. USUAL day of well done 10b. KIND OF BUGINESS OR INDUSTRY 11. (State or 82. during mast of warking filio, - # voltred) country) Housewife - Russia 13. FATHER'S NAME 14. MOTHER'S MAIDEN NAME Isnac Bwaskin P. Schumaeker 15. WAS DECEASED EVER IN U. S. ARMED FORCES? 16. SOCIAL SECURITY NO. 17. INFORMANT'S SIGNATURE Address (Yes, no, or unknown) (If yes, give war or dates of sevoice) - Harry Young 10. CAUSE OF DEATH (Betav only one cease per line for (a), (b), and (c). INTERVAL BETWEEN PART DEATH WAS CAUSED BY: Acute Cardiac Dilatation ONSET AND DEATH 1. IMMEDIATE CAUSE fel. Conditions. if any DUE TO Ibl which gave rise to above cause (a), stating the under- lying cause last. DUE TO fat PART 11. OTHER SIGNIFICANT CORDITIONS GOOTHIBUTING TO DEATH BUT nov RELATED TO THE TERMINAL DISCASS Cononion GIVEN ⑉ Pain del 19. WAS AUTOPSY PERFORMED? Hypertensive heart disease YES NO 20a. ACCIDENT UNCIDE HOMICIDE 20b. DESCRIZE NOW INJURY OCCURED. balare of injury is Pard H of item 18.) 20e. TIME OF Hour Month, Day, Year INJURY a m. a m. 20d. INJURY OCCURRED 20e. PLACE OF INJURY (e. 8.2 in or about home, 201. CITY, VILLAGE, OR LOCATION COUNTY, STATE WHILE AT NOT WHILE farm. factory, street, office bldg., etc.) WORK AT WORK 5-17-38 3=20-38 to and last HWW him alive on g-an-go 21. I attended the deceased from Death occurred at 10:15 - on the date stated in di and to the best of my knowledge, from the causes stated. the DATE SIGNED 2200 SIGNATURE (Degree w (iii) Joseph Slavin M. D. 630 Vine St., 5-23-38 23e. BURIAL CREMA 23b. DATE 23c. NAME OF CEMETERY OR CREMATORY 23d. LOCATION (City. town, or county) (State) TION. (Specify) Burial 5-22-38 Covedale Cemetery Cincinnati Ohio 24. NAME OF EMBALMER 25. FUNERAL DIRECTOR'S SIGNATURE (Md. NO.) (LIC. NO.) Wm. Weil 4454 A GordonWeil 2006 20s FUNERAL FIRM AND ADDRESS (STREET NO.) (am (STATE) Weil Funeral Home Cincinnati, Ohio 27. DATE nco BY 20. REGISTRAR'S SIGNATURE 29. SUB-REGISTRAR'S SIGNATURE LOCALITO. 5-23-38 . Walter Evans I hereby det EXHIBIT 8 of the cort MDC Enhibit Identification Form G146-B GPO 943-662"
}