{
	"anumber": "A20181518",
	"id": "A20181518_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Petition and Affidavits of Petitioner and Witnesses,, 6278"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Russia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [9144, 1912, 1906, 7903]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "on or about the day of capril anno Demini 1 9144 and arrived in the United States, at the port of New York, M.Y. on the 15th day of April anno Domini , 904 on the vessel Pretoris (If the after arrived otherwise than by vessel, the character of conveywood.co name gortation company should be given.) Fifth I decla ad my intention to become a officer of the United States on the day of NOVEMBER District anno / Domins 918 Cincimati, Ohio at in the United states Court of Sixth. am married My wife's name is Sester at Hospital and now resides at Cinednnat she was Dorn Ohio on the 15 day v September anno Domini 880 (Oise number street, city or town, and State.) have six children, and the name. date and place of birth and place of residence of each of sald children is as follows: Joseph born 4th day of July I90I at Russi in posides Cincippeti, Ohio. DESTY born 6th Sept 7903 no. Charles born January 7 Ciheinnati Do. lily april I909 DO. Belle born 5th December 1912 at Do Gartrude born 29th November I9I9 at Cincinnati, Seventh / am not a disbellever in or opposed to organized government or a member of or affiliated with any organization or body of persons teaching diabelief is or opposed information government. I am not a polygamist nor a believer in the practice of polygamy. I am attached to the principles of the Constitution of the United States, and \" is my intention to become a citizen of the United States and to renounce absolutely and foreper off allegiance and Adelity to any foreign prince, potentate, state, or - Rissis or any independ ent state vitoin the bounds of the particularly to former Russie impire of whom at this time am a subject, and \" is my intention forestole permanently in the United States Rights. am able to speak the English language. Ninth , have resided continuously in the United States of America for the term of Ave years at least immediately precading the date of this petition. to with since the foin day of April anno Domini / 904 and in the State of Ohio continuously next preceding the date of this petition, since the 25th day of April anno Domini 1 being a residence within this State of of loost one year nort proceding the data 904 of this position. Tenth I have not heretofore made petition for citizenship to any court. (1 made petition for oftizenship to the Court of at on the day of anno Domini / and the said position was dented by the said Court for the following reasons and causes, to wit and the cause of such dental has since been cured OF removed.) Attached hereto and made a part of this petition are my declaration of intention to become a ettisen of the United States and the certificate from the Department of Labor together with my and the affidavits of the two verifying witnesses thereto, required by low. Wherefore your petitioner prays that he may be adjusted a officer of the United States of America ,esador (Complete and true signature of petitioners yosevite Declaration of Intention No. 8275 and Certificate of Arrival No. from Department of Labor Midd this 16th day of November Note to CLERK or COURT- petitioner and/or in the United States ON OR BSUPORE JUNE 29, 1906, strike out the words reading \"and Certificate of Arrival No. from Department OR Labor.\" AFFIDAVITS OF PETITIONER AND WITNESSES art UNITED STATES or AMERICA 88 : SOUTHERN DISTRICT OF 01410 Me The aforeanta petitioner being duly sworn. deposes and says that he is the petitioner in the above-enclitied proceedings: that he has road the foregoing petition and knows the contents thereofi that the sold petition is signed with his full, true name; that the same is true of his our knowledge, except as to matters therein stated to be alleged upon information and bellet, and that as to those matters he believes it to be true. resador yoseacing (Complete did true signature of positioner.) lax Cotesman occupation Supt Drucker Co. residing at 2333 Park Ave, Cinti.0 and Mathew Drueker occupation anuisaturer residing at 3895 Reading Rd. Cintiro each being severally, duty, and respectively sworn, deposes and says that he is a offixen of the United States of America; that he has personally known Insdare Yosevitz the petitionar above mentioned, to have resided in the United States continuously im mediately preceding the dare of filing his petition. since the 16th day of November anno Domini 915 and in the State in which the above insitied petition is made continuously since the 16th day of November anno Domini 1 916 and that he has personal knowledge that the said petitioner is a person of good moral charactor, attached to the principles of the Constitution of the United States, and that the petitioner is in every way qualified, in his opinion, to be admitted a citizen of the United States. mad Gotterman (Signature of with Nayhan Boneter (Signature of By horthed and sworn 10 before me by the above-named petitioner and witnesses in the office of the Clerk of Court this 16th day (BRASS) Novazber anno Domini 19 BEDies Clerk H (OVER.) By Deputy Clerk"
}
