{
	"anumber": "A20211280",
	"id": "A20211280_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20211280_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, 724/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1919, 1975, 1945, 2014, 2023, 1913, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES ARTMENT JUSTICE Screened by NARA, 7/24/2023 Immigration and Nat alization Service & Form approved PETITION TO Date filed IMMIC Artion OMB No. 43-RO401 Fee stamp CLASSIFY STATUS OF ALIEN RELATIVE FOR ISSUANCE OF wit 9 38 AH'75 CARD IMMIGRANT VISA APR SECTOFFICE APR STRIOT TO THE SECRETARY OF STATE: The petition was filed on Remarks The petition is approved for status under section: U. S. APPROVED INS approvel conditioned SPOUSE, 201 (b) CHILD 203 (a) (2) AUG 19 1975 DATE on Computative of OF ACTION 201 (b) PARENT 203 (a) (4) Edward Devency An Blood Samping DD MIAMI, FLORIDA 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. Block 1. - Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) N/C (Middle) NIC 3. Do Not Write in This Space 4. Relationship of beneficiary to petitioner CHENG, Ching-Hsing 720-211-280 brother 5. Other names used; (including maiden name if married woman) 6. Are beneficiary and petitioner related by adoption? \"Jona than\" no 7. Place of birth (Country) 8. Date of birth (Month, day, year) 9. Beneficiary's marital status: China March 12, 1913 Married Widowed Divorced Single 10. Petitioner's name (Last, in CAPS) (First) (Middle) 11. Petitioner's phone 12. Has this beneficiary ever been in the U.S.? Chen, Lilian En-Tsi (813) 956-1374 Yes No 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) CHENG, Tsui-Ling (nee') Hsai) Dec. 20, 1919 China 14. Names, birthdates and countries of birth of beneficiary's children, if any YUN*CHUNG, 2/231941; YU-CHUNG, 6/20/1939; and WEN-CHUNG11/4/1945(Mrs John Mathey or Ruth Cheng) All born in China 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) YU-CHUNG &YUN-CHUNG, 9855 Fox .Riverside, Ca. 92503; WEN-CHUNG; 14160 El Passo, Riverside, Ca. 92508; & Tsui-Ling, 129-5 Wenchow Street, Taipei, Taiwan, Republic of China. 16. If this petition is for your spouse or child, give the following: not applicable a. Date and place of your present marriage b. Number of your prior marriages c. Number of prior marriages of spouse 9/3/38; Peiping China none none d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) Taipei, Taiwan, Republic of China, 129-5, Wenchow St. 2/7/53 8/74 17. If this petition is for a child, (a). Is the child married? (b) Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 8/2/2014 Not applicable 18. If this petition is for a brother or sister, are both your parents the same as the alien's parents? Yes If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner none 20. Have you ever filed a petition for this alien before? no If so, give place and date of filing and result: Cattloxuze FORM 1-130 RECEIVED TRANS. IN RET'D-TRANS. COMPLETED (REV 1-1-73)N"
}
