{
	"anumber": "A20258691",
	"id": "A20258691_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20258691_0038/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Service Processing Sheet"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. 9/21/2023 SEX m HUMIC JON AND NATURALIZATION SERVICE M Processing Shoot MARITAL STATUS: HEIGHT: LC. 5 in. 3 Section of COUNTRY OF FORMER Law NATIONALITY 316A FITC No. 20 258 691 CHINA INITIAL INTERVIEW En FINAL ACTION - Date and Initials 1 Speaks 1/55 Reads 1/5 Writes 155 8 C 3 Ocafuls Date & Initials English: 1 C 3 withdravals Date c Initials Government: INS Test ok STAND. TEST 8 s C 3 Oath Taken: Certificate issued. REECAN: ( Date and Initials & - ACTION OR DOCUMENTS STILL REQUIRED Documents presented: ARC: 20 258 691 see accashed N-14 ( ) Reexamination C , ( ) other ( , visa Fil< DOB: 4-4-10 ' Post Audie POE/COE KAN DOE 9-28-73 CIO/COL: RECORRENDATION= En GA APPROVED INS DISTRICT DIRECTOR P/P MFA 486530 Date and Initials COMMENTS: FEB 1 8 1993 15/55 Recommended by: an LOS 4540 Approval (stamp) OATH OF ALLEGIANCE 1 3 Modified Oath. Delete part(s) Oath with INS ( , Procise to Bear ASMS. C J Noncombat Duty Oath with Court NAME CHARGE NO Court No. I HEREBY DECLARE. oa each. chac 1 absolucely and encirely renounce and abjure all allegiance and fidelicy CO aad foreign prince. pocencace. scace. or sovereigacy of whom or which I have heretofore been a subject or cicizen: chac I will support and delead the Conscitution and che laws of che United States of America against all encnics. foreign and domescic: thac I will bear crue faith and allegiance CO the same: chac I will bear arms OR behalf of che United Scaces when required by che lau: chac I will perform nonconbacanc service in che Armed Forces of the Uniced Scaces when required by the law: chac I will perform work of nacional importance under civilian direction when required by che lav: and Chac I cake this obligacion freely without any mencal reservacion or purpose of evasion: so HELP HE COO. In acknowledgemene whereof I have hereunco affixed my signature. My You Signature Zari Leang may for DIY be overnisted or stamped to show instructions, items requested, items received, or orber XI frent data which my - processing. Xarp the above ad 100 of all accessal in al. would Lutical decision is seds A"
}
