{
	"anumber": "A20216306",
	"id": "A20216306_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20216306_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Servic OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS; FILL IN WITH TYPEWRITER OR PRINT IN BLOCK L ETTERS IN INK.) I, AFZAL HUSSAIN SHAH residing at 1655 W 44 PL. # 336 (Name) (Street and number) HIALEAH FLA. 33012 U.S.A (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. I was born on 03-21-47 at KARACHI PAKISTAN Also, answer either a, b or c, as appro- (Date) (City) (Country) priate, if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number FOIA (b)(6) 2. That I am 28 years of age and have resided in the United States since JUNE 1971 3. That this affidavit is executed in behalf of the at 1655 W 44 PL. following person(s) present residing at Apt. # 336 HIALEAH FLA. 33012 NAME SEX AGE MARRIED OR COUNTRY OF BIRTH RELATIONSHIP TO SINGLE DEPONENT HAJI ISLAM SHAH M 70 PAKISTAN WIDOWER FIATHER 4. (Amounts shown in answer to this question must be in United States dollars.) (a) That I am or engaged in the business of MANAGER with BURGER KING employed as, (Name of concern) at 2275 SW 87 Are and derive a net annual income of $ 9000.00 (b) That I have on deposit in savings (Address) banks in this country $ 2000.00 (c) That I have other personal property, the reasonable value of which is $ 2000.00 (d) That I have stocks and bonds in the amount of $ , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at valued at $ , with mortgages or other encumbrances there- on amounting to $ (f) That I have life insurance in the sum of $ , cash surrender value of $ (g) That if self-employed, I attach a copy of my last income tax return or report of commer- cial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) 5. That the following persons are dependent upon me for support: (Place a check in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) WHOLLY PARTIALLY NAME OF PERSON AGE RELATIONSHIP TO ME DEPENDENT DEPENDENT NONE Form 1-134 (Rev. 5-31-72)"
}
