{
	"anumber": "A20258691",
	"id": "A20258691_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20258691_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR A SEARCH OF THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE, NARA, 4-21/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 4744]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 (R-4) Form approved. Budget Bureau No. 43-R0104 APPLICATION FOR A SEARCH OF THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE Fee Stamp (See instructions on reverse) 3,00 FEE PAID No 187-8 Take or mail to- Immigration and Na \"gralization Service Kansas City, Missouri M &F IMMIGRATION AND NATURALIZATION SERVICE Date 3-28-75 Verified by am It is requested that: Place \"X\" in applicable box(es) (Fill in with typewriter or print in block letters in ink) Information be furnished regarding the person described below. There be furnished / copies of the record described below. (Number) The record described below be made available for inspection. 1. SPECIFIC INFORMATION OR RECORD DESIRED: 2. PURPOSE Date FOR of WHICH Birth DESIRED: or proof of age SOCIAL SECURITY BENEFITS OTHER (Explain fully) 3. THE INFORMATION SHOULD BE IN THE FORM OF (letter, exact copy, or certified copy) Letter DATA FOR IDENTIFICATION OF THE RECORD 4. FAMILY NAME GIVEN NAME MIDDLE NAME 5. ALIEN REGISTRATION NUMBER 6. Leang OTHER NAMES USED IF Yue TSI A20 258 691 ANY 7. NAME USED AT TIME OF ENTRY None 8. PLACE OF BIRTH Yue Tsi Leang 9. DATE OF BIRTH China 4744/10 10. 630 PORT OF ENTRY San FRancisco Calif 11. PORT ABROAD FROM WHICH LEFT FOR UNITED 12 DATE OF ENTRY Tai PEi STATES Taiwan 13. NAME OF VESSEL OR OTHER MEANS OF ENTRY AiRCRaft GIVE THE FOLLOWING INFORMATION IF THE PERSON WAS NATURALIZED 14. NAME ON NATURALIZATION CERTIFICATE 15. CERTIFICATE NUMBER 16. NATURALIZATION DATE 17. ADDRESS AT TIME OF NATURALIZATION 18. NAME AND LOCATION OF NATURALIZATION COURT 19. SEND INFORMATION TO ADDRESS: NUMBER, STREET, CITY, STATE, AND ZIP CODE Social SecuRity Office 435 S Water Wichita Ks 67202 I consent to the furnishing of the above information (see Instruction 2 on reverse) NAME NAME OF PERSON REQUESTING You INFORMATION on Leang. ADDRESS: NUMBER, STREET, CITY, STATE, AND ZIP CODE ADDRESS: NUMBER, STREET, CITY, STATE, AND ZIP CODE DATE: DATE: 3042 Valley Forge , Wichila Ks 67210 MD 3/26/75 Form N-585 (Rev. 10-13-67) UNITED STATES DEPARTMENT OF JUSTICE-Immigration and Naturalization Service"
}
