{
	"anumber": "A20211280",
	"id": "A20211280_0077",
	"page_index": 77,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20211280_0077/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service, A 2 2011 280"
		},
		"years": {
			"ms_years_nlp_v1": [1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "United States Department of Justice IMMIGRATION AND NATURALIZATION SERVICE 51 SW 1st Ave. A 20 211 280 FILE NO. Miami, Fla. 33130 DATE: April 17, 1975 BLOOD GROUP. BLOOD TYPE AND RH FACTOR TEST TC ks Name of person to be tested Lilian En-tsi CHEN INSTRUCTIONS FOR PERSONS TO BE TESTED It is necessary that you have a blood group, blood type and RH factor test made to help establish relationship between the petitioner and beneficiary of this visa petition. A FEE OF $10.00 MUST BE PAID TO SAYET LAB Before appearing for the blood test you must: IMMEDIATELY PRIOR TO TESTING. 1. Obtain two 2\" X 2\" square photographs full face with light background; 2. Glue one photo in the space provided on each copy of the form. 3. Take both copies of this form with you at the time of your appointment and give them to the physician. After the test, the physician will I er or his attorney or representative with the blood test results attache 4. Do not sign your name until you a the physician. At that time in the presence of the physician sign your name or of this form so that your name will appear partially on the photograph and P Lilian Signature of person tested Please note the box checked below with regard to your blood test. An appointment has been made for a physician of the U.S. Public Health Service to perform your blood test and you are requested to appear for that purpose at Address: Sayet Lab, 3935 Biscayne Blvd. Miami, Fla. N.H Patterson Coleman Laboratories Tampa Fla. Date: Mayl, 1975 Time: Please arrange for your blood test with the below listed physician at the address shown. 9:00 A M. Physician's name and address: TO PHYSICIAN PERFORMING THE TEST 1. Please identify the person tested, with the person whose photograph appears on this form, have him sign in accordance with instruction 4 above, and perform a blood group, blood type and RH factor test from his blood sample. 2. The cost of this test will be paid by the person tested. 3. When the blood test has been completed note the results on the reverse of both copies of this form by checking the appropriate boxes, or prepare the results in duplicate. Mail both copies of this form with results to the fol- lowing address: Name of Petitioner or Attorney Address I certify to the best of my ability that the person whose photograph is affixed to this form is the same person from whom I obtained a blood sample this date. Physician's signature Date Mav 6. 1975 Form G-620 (Rev. 9-1-73)N"
}
