{
  "anumber": "A20258691",
  "id": "A20258691_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20258691_0019/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, Form No. 4-3-R0400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        1938,
        1948,
        1973,
        2023,
        1978,
        1924,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Form Approved O.M.B. No. 43-R0400 APPLICATION FOR STATUS AS PERMANENT RESIDENT FEE STAMP File No. $ 25.00 FEE PAID No. 24-6 APPLICATION FOR THE BENEFITS OF SECTION: Immigration and Naturalization Service 203(a)(7) and Sec. 245, I&N Act 245 Kansas City, Missouri M & F arm Sec. 214(d), I&N Act 249 I&N Act Date 8.3.73 Verified by Sec. 13, Act of 9/11/57 (DO NOT WRITE ABOVE THIS LINE.) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM. USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check box A, B, C. D, E, or F) A. As a refugee to whom an immigrant visa is immediately available (Section 203(a)(7) and Section 245, I&N Act). B. As a former fiancee or fiance of a U.S. citizen whom I married within 90 days after my arrival in the United States, or as a child of such fiancee or fiance (Section 214(d), I&N Act). C. As a former government official, or as a member of the immediate family of such official (Section 13, Act of September 11. 1957). D. As a person to whom an immigrant visa is immediately available, other than one described above (Section 245, I&N Act). E. As a person who has resided in the United States continuously since prior to July 1. 1924 (Section 249, I&N Act). F. As a person who has resided in the United States continuously since a date on or after July 1, 1924, but before June 30, 1948 (Section 249, I&N Act). 2. My name is (Last in capital letters) (First Name) (Middle Name) Myalien registration number is Sex Male LEANG YUE TSI 420-258-691 Female 3 I reside in the United States at: (Apt. No.) (No. and Street) (City) (State) (ZIP Code) 2210, GREENFIELD, WICHITA, KANSAS , 67217 4. Date of Birth Place of Birth (City or Town) (County, Province, or State) (Country) I am now a citizen of (Country) APRIL , 4, 1910 KWANG TUNG CHINA CHINA 5. I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) HONOLULV HAWAII MAR 30 1973 by (Name of vessel or other means of travel) as a (visitor, student, exchange visitor, temporary worker, fiancee, fiance, crewman, JAPAN AIRLINES parolee, etc.) VISITOR was My last nonimmigrant visa issued outside the United States was issued by the American on (Month) (Day) (Year) I inspected. was not Consul at (City) (Country) TAIPEI TAIWAN JAN 31.1973 6. I am single married divorced widowed a. I have been married ONE times, including my present marriage, if now married. (If you are now married give the following:) b. Number of times my husband or wife has been married c. Name of husband or wife (Wife give maiden name) ONE EI-KING MOK d. My husband or wife resides with me apart from me at Address (Apt. No.) (No. & Street) (Town or City) (Province or State) (County) AIN SHENG EAST READ TAIPET, 105 TAWAN, REP OF CHINA 7. a. I have 4 sons or daughters as follows: (complete all columns as to each son or daughter; if living with you state \"with me\" in last column; otherwise give city and state or country of son's or daughter's residence). Name Sex Place of Birth Date of Birth Now living at Sou BIG LEANG F KWANG TUNG JAN, 14, 1938 798/2, MIN SHENG EAST RD TAIPEL TCHI KIEN LEANG M KWANG TUNG AUG 29, 1939 2210, GREENHELD, WICHITA, KANSAS Sou HOA LEANG F KWANG TUNG AUG 25. 1948 798/2 MIN SHENG F. RD TAIPEI FOIA (b) )(6) / b. The following members of my family are also applying for permanent resident status: 690 PEI KING Mok (LEANG BIG LEANG FOIA (b)(6) Kansar at 8 I have have not heretofore filed an application for the status of a permanent resident. (If you have ever filed such application, give the date and place of filing and final disposition.) UNITED STATES DEPARTMENT OF JUSTICE RECEIVED TRANS IN RET'D.-TRANS OUT COMPLETED Immigration and Naturalization Service Form I-485 (Rev. 12-1-72) N 1978 (Page 1)"
}