{
  "anumber": "A20258691",
  "id": "A20258691_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20258691_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Alien Registration Receipt Card ( I-90, I-151"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 13. have have not engaged in business or employment outside the United States since I became a permanent resident of the United States (If you have engaged therein, briefly describe and show periods of such employment or business activity.) BETHLINE? MDA 14. Since the time I became a permanent resident of the United States. I have filed a federal income tax return as a nonresident Yes No. (if \"Yes\". state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of the Internal Revenue Service office where filed NOT YET 15. Since the time I became a permanent resident of the United States. I have failed to file a federal income tax return with respect to income I earned outside the U.S. because I regarded myself a nonresident alien and therefore exempt from tax on such earnings Yes No. (If \"Yes\", state the years for which you failed to file tax returns for that reason.) RETIRED 16. I do do not intend to return to the United States after my temporary visit abroad. 17. I do do not intend to retain my status as a lawful permanent resident. 18. CHECK My Alien Registration Receipt Card is attached. Application Form 1.90 for issuance of Alien Registration Receipt Card is attached ONE: My Permit to Reenter, which I wish to have extended, is attached. 19. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if I submitted or applied for that card, should be forwarded to: My address as shown in block #1. on reverse. U.S. Embassy or Consulate at U.S. Immigration and Naturalization Office at Other (Specify) 20. If application is for issuance of a Permit to Reenter execute Block A of Item 20 only. If application is for extension of a Permit to Reenter execute Block 8 of Item 20 only. If application was completed by other than the applicant, that person must execute Item 21. CHINA BLOCK A BLOCK B I do swear (affirm) that I know the contents of this application signed I certify that I know the contents of this application signed by me and that the statements herein are true and correct. by me and that the statements herein are true and correct. You (Signature of Tsi Leany applicant) 11th (Signature of applicant) Subscribed and sworn to (affirmed) before me this day of October . A.D. 19 73 Date: Wishita , Kenser Sedgwick County (Month) (Day) (Year) at (SEAL) My commission expires My Commission Expires May 14, 1977 Novella W. White Notary Public (Signature of officer administering oath) (Title) 21. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Lawrence (Signature) Leang 2210 Greenfield (Address) 10/10/73 (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Alien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter 1-151 submitted by alien returned DENIED (See denial notice for sont si - AR-103 or AR-3 submitted by alien returned GRANTED Permit valid to 11-4-74 New 1-151 issued on basis of 1-90 Single entry Multiple entries U.S. APPROVED INS. Restriction on travel in following countries waived: NOV5 1973 none DATE DELIVERY OF PERMIT INITIALS OF EMPLOYEE OF H.Smajor EFFECTINGADELIVERY ACTION BY MAIL TO APPLICANT PERSONALLY group KANSAS CITY, MO. OFFICE KAN DATE 11-9-73 OFFICE"
}