{
	"anumber": "A20211280",
	"id": "A20211280_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20211280_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECEIPT FOR INITIAL PREMIUM – HEALTH INSURANCE, CER-3179 RECEIPT FOR LIFE INSURANCE"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 DETACH LOWER PORTION AND LEAVE WITH EACH APPLICANT TO BE DELIVERED TO THE PROPOSED INSURED IN CONNECTION WITH APPLICATION FOR LIFE OR HEALTH INSURANCE Notification to CHENG CHING HSING Proposed Insured (Parent if proposed Insured is a Child) As part of our underwriting procedure, an investigative consumer report may be prepared whereby information is obtained through personal inter- views with your neighbors, friends, or others with whom you are acquainted. This inquiry includes information as to your character, general repu- tation, personal characteristics and mode of living. You have the right to make a written request within a reasonable period of time to receive additional, detailed information about the nature and scope of the investigation. Information regarding your insurability will be treated as confidential. Certified Life Insurance Company of California may, however, make a brief report thereon to the Medical Information Bureau, a non-profit membership organization of life insurance companies, which operates an information exchange on behalf of its members. If you apply to another Bureau member company for life or health insurance coverage, or a claim for benefits is submitted to such a company, the Bureau, upon request, will supply such company with the information in its file. Upon receipt of a request from you, the Bureau will arrange disclosure of any information it may have in your file. (Medical information will be disclosed only to your attending physician.) If you question the accuracy of information in the Bureau's file, you may contact the Bureau and seek a correction in accordance with the procedures set forth in the Federal Fair Credit Reporting Act. The address of the Bureau's information office is Post Office Box 105, Essex Station, Boston, Massachusetts 02112, telephone number (617) 426-3660. Certified Life Insurance Company of California may also release information in its file to other life insurance companies to whom you may apply for life or health insurance, or to whom a claim for benefits may be submitted. CER-4019 USE CER-3179 RECEIPT FOR LIFE INSURANCE CERTIFIED LIFE INSURANCE COMPANY OF CALIFORNIA Home Office: 14724 Ventura Boulevard, Sherman Oaks, California 91403 RECEIPT FOR INITIAL PREMIUM - HEALTH INSURANCE Received from CHENG CHING HSING (applicant) an application for a Policy of insurance, and $ 94.07 (the initial premium exceeds subsequent premiums by $ 6.60 ) to pay premiums on the policy for 3 months from its date of issue. In the event the application is declined the above amount will be refunded. No other obligation is incurred by the Company unless said application is approved by the Company at its Home Office and a policy is issued and executed by its President and Secretary. Date 4/6/27 Representative 3224 Number CER-3735 (3-75) USE CER-3179 RECEIPT FOR LIFE INSURANCE"
}
