{
  "anumber": "A20211280",
  "id": "A20211280_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20211280_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE OFFER OF EMPLOYMENT TO ALIEN, Form DS-1743, 10-75"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 Return completed form to: OMB Approved 47-S 75002 Form DS-1743 10-75 DEPARTMENT OF STATE OFFER OF EMPLOYMENT TO ALIEN INSTRUCTIONS: Please fill out this form by typewriter or in legible block letters in ink. Please answer all questions. If there is insufficient room OD the form, answer on a seperate sheet of paper. using the same numbers as on the form. Sign the form before a notary public and return it directly 10 the consular office named above, 1. NAME OF ALIEN Family name (in capital letters) First name Middle name Maiden name Cheng Ching-Hsing 2. PRESENT ADDRESS OF ALIEN Number and street City or town State or Province ZIP Code Country 1405 Rosehill Riverside CA 92507 U.S.A. 3. NAME OF EMPLOYER (Full name of organization) 4. TELEPHONE (Area code and number) Alphabet Printers 714-925-2414 5. ADDRESS Number and street City County State ZIP Code 503 E. Florida Ave. , Hemet Riverside CA 92343 6. BRIEF DESCRIPTION OF EMPLOYER'S BUSINESS OR ACTIVITY 7. NUMBER OF EMPLOYEES (If under ten) Print Shop 4 8. DESCRIPTION OF JOB OFFERED TO THE ALIEN General Shop Work, Delivery, Etc. 9. TOTAL HOURS PER WEEK ALIEN TO BE EMPLOYED 10. TOTAL WEEKS PER YEAR 11. RATE OF PAY $ per Month 37 1/2 Hours 50 525 12. The alien named in No. 1 above has been fully informed of the details of employment by letter or contract. YES X NO I swear (affirm) that I know the contents of this offer of employment signed by me, and the statements herein are true and correct. flexity Signature of Employer/Agent subscribed and sworn to (affirmed) before me this 8th day of April 19 77 OFFICIAL SEAL SANDRA A. LANE Sandow a. Lane (SEAL) INCIPAL OFFICE IN NOTARY PUBLIC . CALIFORNIA My commission expires Sandra A. Lane RIVERSIDE COUNTY My Commission Expires September 9, 1978 NOTE: The above information is requested in connection with Section 212(a)(15) of the Immigration and Nationality ACL The information will be used by U.S. Consular Officers in determining whether an offer of employment to an intended immigrant is sufficient to guarantee that the alien will not become a public charge. If acceptable, the information will be enclosed with the alien's immigrant visa, and may be subject to further inspection by the Immigration and Naturalization Service when the alien is admitted for lawful permanent residence, There is 40 penalty for failure to file this form, but failure to file may prevent the alien from receiving an immigrant visa to the United States. WARNING: To knowlingly furnish any false information in the preparation of this form is a felony punishable by $10,000 fine or five years im- prisonment, or both (18 USC 1001)."
}