{
  "anumber": "A20211280",
  "id": "A20211280_0062",
  "page_index": 62,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20211280_0062/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, I-140 VP EXPIRES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1978,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 APF in ONS CLERK so DATE EXAMINED DEC 15 1976 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE I-140 VP EXPIRES Processing Sheet Application or Petition Form No. I-485 File No. A20 211 280 PS 6 # 3 Pal 4-3.75 CLERK'S DATE INITIALS ACTION REQUIRED - DOCUMENTS NEEDED REQUESTED RECEIVED INTERVIEW & USPH MEDICAL APPOINTMENT MEDICAL and/or INTERVIEW RESCHEDULED G-325A(1)-FBI Identification Division G-325A(2)-FBI Records Branch DEC 15 56 \" \" Sheets (1) & (2) . - SECOND REQUEST G-325A(3)-CIA G-325A(4)-Am/Com Thipee Am/Con I-156 to: I-88 I-508 Applicant's: BC ;MC ;DD ;CC ; Affidavit of Support #1 Employment Letter #2 need Photos ; Form I-9 need BRING: PP Sb I-181 I-181 Nonpreference I-181 To STATE DEPT for VISA NUMBER ATTORNEY: Wellington Kwan DEC Is 1978 INTERVIEWED: FFR 28 1977 NO SHOW: (DATE) OK TO GRANT EXCEPT FOR: appear with atty Second notice to: W. KWAN 1. Evidence financial responsibility 2. I Subject has 10000 in bank. 3. 2 medical consumer otherwise supported by daughter who earns $1 9,000 a year + who is expecting 4. h child. Subject spruse will join Judged insufficient everend of finencau responsibility him i he will also file for turson a C This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this shoet on top of all material in file until initial decision is made Form I-468 (Rev. 11-1-70)"
}