{
  "anumber": "A20337856",
  "id": "A20337856_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20337856_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/18/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place SFR File No. A20 337 856 T-11 Status as a lawful permanent resident of the United States is accorded: Name Rukmani Devi Advani SEX DATE OF BIRTH Street 1218 St. Matthew Way F 1/15/07 Address Los Altos, CA 94022 PLACE OF BIRTH of the CFU City, State, Zip India cob of the volice MPICY abbucaup cob & affolue NATIONALITY cases 100 COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India of the qual 12 NOTICE Mpeu the opioju unwper PRIORITY DATE REMARKS the unwpel 12 paseq OIJ SOS(P)(1)' (3) OL OL 20CHOU NONPREFERENCE: Section 212(a)(14) certification not required because: Check auq we Plock Ledalqui ou lipe forw as Individual section 12(a)(14) certification issued Blanket section 212(a)(14) certification issued gaje* under the following provision of law: of Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act [OI. V ouce Private Law no of the we Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session ou Sec 245 of the & N Act Sec 13 of the Act of 9/11/57 Maz OL we live (Other law Specify) of 1977 As 12 123 at SFR (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE OL Scuegnie Also CL-K Class of admission (Insert symbol) Z 2 (Applicable in all cases) DATE APPROVED 12 OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION qeq we countral OFFICE as 1977 Plutip LWalus qate tacfold DD DISTRICT the FOR USE BY VISA CONTROL OFFICE are exceb au cobi 10 Date COUILO spall pe blebaleq auq we bjaceq !U OTHEL cases MUSLE the LOLLU 10 pe Foreign State ouid au STATISTICS blebaleq IU C0202 MPOLE belivateur Letella 10 excebt Preference Category 101 IP!Superscript(e) bnibose pe of SAGLA alleu PelMeeu we OL permeeu 32 IUS case Number case 1116' spall pe Month of Issuance cases the cob X' L6- pecower Ottice MPICU ajjocates spall OUG Signed MPeu aLoup of e (Visa Office, Dept. of State) nugel of live Vcl of Form 1-357 delivered 26 Form 1-151 delivered Form 1-151 mailed LIOI Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with 59) Form I - 181 (Rev. 5 - - I - 74) N (Page 1)"
}