{
  "anumber": "A20337856",
  "id": "A20337856_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20337856_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/18/2023 yigge TED STATES DEPARTMENT OF JUS' E Immigration and Naturalization Service 630 Sansome Street SFR 103.7-C San Francisco, Calif. 94111 File No. mind adqamgotodq Date October 30, 1972 ted twodfiw Inoil aniwons bnoompload adail bae 10 10/00 lawsian ai ad adgetrologic Gulu T. Advani 870 Elmira Dr. Sunnyvale, CA 94087 no re: Rukmani D. Advani (Ben.) In connection with the (enclosed) application I-130, $10.00 and encls. returned. it is necessary that you comply with the items in this letter checked in red. THEN RETURN THIS LETTER with the requested information, documents, and forms: Unless you furnish the requested information or document(s) checked , it will be necessary to recommend to the court that your petition for naturalization be denied for lack of prosecution. Submit original documents Complete enclosed form N-565 per instructions and return. Complete or comply with those items on the application where checked in red. The application form you have submitted is obsolete. Complete and return the enclosed new application. Send money order or check for $ made payable to the \"Immigration and Naturalization Service, Department of Justice\". Do not send cash or postage stamps. Submit birth or baptismal certificate of nol sojaeimbe Submit marriage certificate of Submit adoption decree for Submit divorce decree of Submit proof of termination of marriage of Submit death certificate of Submit marriage certificate, divorce decree or other court order showing change of name. You must reside in your State for 6 months before you can apply for naturalization. Resubmit your application after boneq berlups bailinan VIDE FREN of aid of an bns E. H. Pullin to lo gailsm dididosq Jon Form N-14 - (Rev. 8/2/65) Deputy District Director (Over)"
}