{
  "anumber": "A20337856",
  "id": "A20337856_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20337856_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 7/18/2023 NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE In re: DATE 7-3-92 Form N-400 FILE No. A20 337 856 I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): NAME Petitioner Applicant Rukmani Devi ADVANI Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) NAME Petitioner Applicant Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) Check Applicable Item(s) below: I am an attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia CALIFORNIA/LOUISIANA and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2 I am on accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so recognized by the Board: 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS JACKSON & HERTOGS 170 Columbus Avenue 95 South Market St. Suite 400 Suite 480 San Francisco, CA 94133 San Jose, CA 95113 NAME (Type or Print) Eric G. Hoffman TELEPHONE NUMBER JACKSON & HERTOGS (415) 986-4559 (408) 971-0282 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: ALLEN R. JACKSON - JEFFREY J. RUMMEL - DANIEL H. BLUTME - LYNDA WON-CHUNG EDWIN J. WHITE - NORMAN C. PLOTKIN - (Name ILANA of Attomer J. DRUMMOND or Representative) - CLARK M. TREVOR-ERIC G. HOFFMAN THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE Rukmani Devi ADVANI 7-3-92 in ( NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented is a citizen of the United States or an alien lawfully admitted for permanent residence.) Form G-28 UNITED STATES DEPARTMENT OF JUSTICE (Rev. .10-25-79)N Immigration and Naturalization Service"
}