{
  "anumber": "A20543620",
  "id": "A20543620_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Issuance of Alien Registration Receipt Card, I-90"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 13. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States. (If you have engaged therein, briefly describe and show periods of such employment or business activity.) 14. Since the time I became a permanent resident of the United States, I have filed a federal income tax return as a nonresident. Yes No. (If \"Yes\", state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of the Internal Revenue Service office where filed.) 15. Since the time I became a permanent resident of the United States, I have failed to file federal income tax return with respect to income I earned outside the U.S. because I regarded myself as a nonresident alien and therefore exempt from tax on/such earnings. Yes No. (If \"Yes\" state the years for which you failed to file tax returns for that reason.) 16. do do not intend to return to the United States after my temporary visit abroad. 17. do do not intend to retain my status as a lawful permanent resident. 18. CHECK My Alien Registration Receipt Card is attached. Application Form I-90 for issuance of Alien Registration Receipt Card is attached. ONE: My Permit to Reenter, which I wish to have extended. is attached. 19. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if I submitted or applied for that card, should be forwarded to: MY address as shown in block #1, on reverse. U.S. Embassy or Consulate at U.S. Immigration and Naturalization Office at Other (Specify) 20. If application is for issuance of a Permit to Reenter execute Block A of Item 20 only. If application is for extension of a Permit to Reenter execute Block B of Item 20 only. If application was completed by other than the applicant, that person must execute Item 21. BLOCK A BLOCK B I do swear (affirm) that I know the contents of this application signed I certify that I know the contents of this application signed by mé and that the statements herein are true and correct. by mê and that the statements herein are true and correct. NGO KHANHHOG (Signature of applicant) 16th (Signature of applicant) Subscribed and sworn to (affirmed) before me this August day of A.D. 19 74 Date: (Month) (Day) (Year) at (a (SEAL) My commission expires M. Com nor OATHSTUP (Signature of officer administering oath) Cent.Rig (Title) 21. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Th Rito Conales 1810 North Broadway Santa Ana, California 92706 August 12,1976 (Signature) (Address) (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Alien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter 1-151 submitted by alien returned DENIED (See denial notice to reason(s) 1. AR-103 or AR-3 submitted by alien returned GRANTED Permit valid to AUG 15 1977 New 1-151 issued on basis of I-90 Single entry Multiple entries Restriction on travel in following countries waived: 0555155 none DATE RUG 16 1976 DELIVERY OF PERMIT INITIALS OF EMPLOYEE OF EFFECTING DELIVERY ACTION BY MAIL Goseph OFFICE Since OFFICE TO APPLICANT PERSONALLY Ey DATE Low ADG 16 1976 Los"
}