{
  "anumber": "A20550522",
  "id": "A20550522_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Bernard Cooper Attorney at Law, BC:1j"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/18/2023 BERNARD COOPER ATTORNEY AT LAW 311 SOUTH SPRING STREET - SUITE 1120 LOS ANGELES, CALIFORNIA 90013 (213) 688-7400 . 688-7401 September 15, 1976 Immigration and Naturalization Service 300 N. Los Angeles St. Los Angeles, California 90012 Attention: Mr. D'Orto Re : Hiranand Tolaram Gulrajani File No. A20 550 522 Gentlemen: On Monday, August 1976, an interview was held in connection with the application of Mr. Gulrajani and his family for per- manent residence. Mr. Gulrajani is citizen of India and filed his application as a business investor. Between the time that the original application was filed and the time of your interview of August 2nd, the business upon which Mr. Gulrajani had based his operation ceased to exist. However, at the interview we informed you that he was entering a new business with a substantial investment. You stated that the case would be held in abeyance for a few weeks in order to give us time to submit the required documents. The purpose of this letter then is to submit the required docu- ments showing Mr. Gulrajani's new business. This new business is a restaurant located at 114 S. Main St., Los Angeles, Calif., , and known as Taros Restaurant. The investment of Mr. Gulrajani in this restaurant totals $27,000.00 for the purchase of the place alone. I am enclosing my certified copies of the receipts and escrow papers. If you wish to see the originals of these receipts, would you please contact my office. Thank you for your cooperation. Very truly yours, mu BERNARD COOPER BC:1 encls."
}