{
	"anumber": "A20550522",
	"id": "A20550522_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A/20 550 522"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED Immigration and Naturalization Service 4 MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place LOS ANGELES, CALIFORNIA File No. A/20 550 522 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street Hiranand Tolaram GULRAJANI 7/13/13 Address 816 South Westlake Avenue PLACE OF BIRTH City, State, Zip Los Angeles, California 90057 India NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE( (If any) India PRIORITY DATE India Noh Preference 6/21/75 REMARKS Sec. 203(a)(8) NONPREFERENCE: Section 212(a)(14) certification not required because:investor Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244 ( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) As of at LOS ANCELES CALIFORNIA (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission, (Insert symbol) NP6 (3) (Applicable in all cases) 5/21/76 js. DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION DD DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Veann Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - 181 (Rev. 5 - 1 74) N (Page 3)"
}
