{
  "anumber": "A20535147",
  "id": "A20535147_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20535147_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RESULTS OF EXAMINATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1955,
        1978,
        1961,
        1950,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(7) (If petition filed under Section 319(a).) I have resided continuously in the United States in marital union with present spouse for at least three years immediately preceding the date of this petition, and after my lawful admission permanent residence, during all of which period my said spouse has been a United States citizen, and have been physic present in the United States at least one-half of such three-year period. I have resided continuously in the State in .ch this petition is made at least six months immediately preceding the date of this petition. United (If States, petition or of an American institution of research recognized as such by the Attorney General, or an American firm or corporation engaged in (8) is filed under Section 319 (b).) My present spouse is a citizen of the United States, in the employment of the Government of the public international organiza- whole or in part in the development of foreign trade and commerce of the United States, or subsidiary thereof. or of a statute, is authorized to perform the ministerial or priestly functions of a religious tion in which the United States participates by treaty or or denomination having a bona fide organization within the United States, or is engaged solely as a missionary by a religious denomination or by an such interdenominational employment. I mission intend in organization good faith having upon naturalization a to live abroad with my spouse and to resume my residence within the United States bona fide organization within the United States, and such spouse is regularly stationed abroad in immediately upon termination of such employment abroad. (9) (If petition is filed under Section 328.) I have served honorably in the Armed Forces of the United States for a period or periods aggregating three years. I have never been separated from the Armed Forces of the United States under other than honorable conditions. If not still in service, my service terminated within six months of the filing of my petition. (10) (If petition is filed under Section 829.) While an alien or noneitizen national of the United States, I served honorably in an active-duty status in the military, air, or naval forces of the United States during either World War I or during a period beginning September 1, 1939, and ending December 31, 1946. or during n period beginning June 25, 1950, and ending July 1, 1955. or during a period beginning February 28, 1961, and ending October 15. 1978. or during a period beginning 19 and ending 19 or I was discharged after five of service under the Act of June 30, 1950 (P.L. 597. 81st Congress). If separated from such service. I was separated under honorable conditions. At the years time of enlistment, reenlistment, or induction I was in the United States, the Canal Zone, American Samoa, or Swains Island. If not in any of these on places, account I was of lawfully allenage. I was not a conscientious objector who performed no military, air, or naval duty whatever or refused to wear the uniform. I have admitted to the United States for permanent residence subsequent to enlistment or induction. I was never separated from such service not previously been naturalized on the basis of the same period of service. (11) (12) I am not and have not been, within the meaning of the Immigration and Nationality Act, for a period of at least 10 years immediately preceding the date of this petition, a member of or affiliated with any organization proscribed by such Act, or any section, subsidiary, branch. affiliate or sub- division thereof. nor have I during such period believed in, advocated, engaged in. or performed any of the acts or activities prohibited by such Act. (13) I am, and have been during all the periods required by law. a person of good moral character, attached to the principles of the Constitution of the United States and well disposed to the good order and happiness of the United States. (14) It is my Intention In good faith to become a citizen of the United States and take without qualification the oath of renunciation and allegiance prescribed by the Immigration and Nationality Act, and to reside permanently in the United States. I am willing. when required by law. to bear arms on behalf of the United States, to perform noncombatant service in the Armed Forces of the United States, and to perform work of national im- portance under civilian direction (unless exempted therefrom). (15) I am able to read, write, and speak the English language (unless exempted therefrom), and I have a knowledge and understanding of the funda- mentals of the history, and of the principles and form of government of the United States. (16) Attached hereto and made part of this, my petition for naturalization, are the affidavits of at least two verifying witnesses required by law. and supplemental affidavit on Form N (17) Wherefore I request that I may be admitted a citizen of the United States of America. I swear (affirm) that I know the contents of this petition for naturalization subscribed by me, and that the same are true to the best of my knowledge and belief. and that this petition is signed by me with my full, true name. So Help Me God. two Ham Ying (Full Name, Without Abbreviation) 61 0861 dd (910) RHP 61 loss Add SI 097 18 apsur II pasocdds zapun e pue 086L A SI roodssog alyo MS 371 vsin ULSISH-I : 20 ed : on : oa or or : or : on or on : DN nd-uasqy or : at bcbl eoujs hibl aouts IN (2) (1) 53 IN Paulog of moxy us of way up or mony up or was up spunning OL :pazjnbar asset-D gard 28 a 201 \"II STE-D CHINE AR 7405 or No NOLLOV LANOO NOLLVNINVXH LINSTH"
}