{
	"anumber": "A20550522",
	"id": "A20550522_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "The United States of America, 11574244"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1983, 1913]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "N.A"
			},
			"marital_status": {
				"marital_status_llm_v1": "MARRIED"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1983.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "1619 S. Westmoreland Ave., Los Angeles, CA"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "Screened by NARA, 7/18/2023 a TO BE FORWARDED TO No. 11574244 IMMIGRATION AND NATURALIZATION SERVICE 1 Pelilion No. 479681 DUPLICATE AlienRegistration Re A20 550 522 Personal description FATH of holdera of date of DARK naturalizations Date of birth JULY 13, 1913 sex MALE complexione colorobeyes BROWN NONE color of hair GREY height 5 feet I inches; weight MARRIED visible distinctive marks Maritalstatus Country of formernationality PAKISTAN I certify that the description above givents true, and that the photograph, afficed hereto is a likeness of me. Huauand Tolavious Guhajam / Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States 18, 1983 Los Angeles ONHIRANAND TOL ARAM GULRAJANI the Court having, found that then residing at 1619 S. WESTMORELAND AVE. 9 LOS ANGELES, CA. inlends loreside permanently in the United. States when so required by the Naturalization Laws of the United. States), had in all other respects, complied with the applica ble provisions, of such naturalization laws, and was entilled to be Seal admitted locitisenships thereupon ordered that such person be and (s)he was admilled as a citizen of the United States of America. In whereoft the sealof the courtis hereunto, afficed this 18 TH day of MARCH EIGHTY-THREE in the year of our. Lord nineteen hundred and LEONARD A. BROSNAN Clerk of the U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Elemnor allow Deputy Clerk."
}
