{
  "anumber": "A20550522",
  "id": "A20550522_0136",
  "page_index": 136,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0136/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE DEPOSIT ADvIcE, BT-487-DR REV. 7 ( (2-72)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/18/2023 BT-487-DR REV. 7 (2-72) STATE BOARD OF EQUALIZATION HQ ONLY CERTIFICATE DEPOSIT DEPARTMENT OF BUSINESS TAXES 1. ACCOUNT NUMBER Record Number ADVICE Tax Office Number Type Item a R AA 43019 b A. CERTIFICATE DEPOSIT RECORD 2. DEPOSITOR 3. MULTIPLE SECURITY INFORMATION Account Number Codes Owner (s) Tax Office Number A M H Mike, Hirnnand, Pushpa, Sunder Gulrajani Name a & 1832 V. 7th Address b Los Angeles, CA 90057 4. TYPE 5. Total Amount Requested 350.00 SAVINGS BONUS/DEPOSIT CERTIFICATE Certificates Previously Deposited SNone 1 FULLY PAID INVESTMENT CERTIFICATE Amount of This Certificate 200.00 ACCUMULATIVE INVESTMENT CERTIFICATE TIME CERTIFICATE OF DEPOSIT (Automatically Renewable, Only) Total Certificates on Deposit 200.00 7. CERTIFICATE NUMBER 8. HQ ONLY 6. ISSUE DATE 9. NAME OF ISSUER T.P. also has $150100 cash deposi Name Code 9-25-73 5003 Walls Fargo Bank 770 Wilshire LA CA 90017 10. Receipt of the above described certificate as security for payment of tax is acknowledged. Office AA By Donaghbo Date 10-22- 73 SIGNATURE NOT A CLOSE OUT B. DISPOSITION OF CERTIFICATE 11. 01 FULL REFUND 03 CONVERSION 04 CHANGE IN RENEWABLE STATUS 12. CERTIFICATE RETURNED TO DEPOSITOR Same 200.00 $ Same 1 AMOUNT OF CERTIFICATE ENTER ADDRESS WHERE MAILED IF DIFFERENT THAN BLOCK 2 13. CERTIFICATE RETURNED TO ISSUER with request to remit only amount of liability and to release remainder to depositor. Remittance advice or return prepared (TOTAL AMOUNT MUST $ Return to depositor. $ Remitted to Board EQUAL TOTAL IN BLOCK 5) 14. CERTIFICATE CONVERTED TO CASH Deposit exceeds liability Liability equals or exceeds deposit $ Change to another type of security or amount. AMOUNT OF CERTIFICATE 15. CERTIFICATE RELEASED TO ANOTHER AGENCY Agency Amount of Agency Code (HQ ONLY) Certificate $ Name 16. CHANGE IN RENEWABLE STATUS 17. HEADQUARTERS TO RELEASE CERTIFICATE, District review incomplete on: $ AMOUNT OF CERTIFICATE AA M. Navarro 10/31/74 Verified cpd 18. Office By Date in D.O. By CNG SIGNATURE FOODE"
}