{
	"anumber": "A20550522",
	"id": "A20550522_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/18/2023, 6101 California Uniform Commercial Code"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 with all of the provisions of any and all laws applicable to the subject matter hereof. II The parties shall promptly comply with the terms of these instructions and shall execute and deliver to the escrowholder on demand all papers, doc- uments, instruments, releases and monies required of them to consummate this transaction. III You will be handed a Bulk Sale Notice which you will forward to a local newspaper service for recordation and publication pursuant to Sections 6101- 6107 California Uniform Commercial Code, and the responsibility for such recordation and publication shall be that of the local newspaper service and not that of the escrowholder. IV The escrowholder is not to be held liable for the sufficiency or correctness as to form, manner of execution, or validity of any instrument deposited in escrow, nor as to the identity, authority or rights of any person executing the same nor for failure to comply with any of the provisions of any agree- ment, contract or instrument filed or referred to in said escrow, nor for forgeries, false impersonations or fraud occurring or perpetrated by any person in connection with this escrow. The escrowholder's duties hereunder shall be limited to the safekeeping of such money, instruments or other docu- ments received by the escrowholder, and of the disposition of same in accordance with the written instructions accepted in this escrow. Escrow- holder is authorized to destroy, without further notice to the parties, all documents, papers, instructions, and any other material connected with this escrow five (5) years after date of the same. V The parties authorize the escrowholder to pay from funds deposited all charges for recordings, publications, filings, and reports of title status when incurred, and at close of escrow or on notice of recission or cancellation or following failure of the parties, or any of them, to comply with the terms of Paragraph II hereof, to pay all escrow fees, attorneys fees or other expenses incurred in the escrow. VI If these instructions require preparation and execution of any promissory note or other writing which evidences an indebtedness or chose in action or any document intended to create a security interest in real or personal property then the parties agree to furnish the escrowholder appropriate forms to accomplish said requirements. Should the parties elect to use any forms made available to them by the escrowholder it is agreed that the escrow- hokler has made available such forms as an accommodation only and shall not be liable to the parties, or any party, for the selection, correctness or sufficiency of said forms. VII Unless expressly set forth in these instructions the escrowholder shall have no duty to make any chattel or security interest search or to obtain or request any document showing status of title or encumbrances or claims against the parties hereto or the property or assets intended to be transferred herein, and buyer and/or any secured party are not protected hereby as to the same. VIII The seller guarantees and escrowholder may assume in pro-rating that all insurance premiums and all rents which fall due prior to close of escrow have been paid. Further the escrowholder is not to be concerned with the payment of or the existence of any liens in connection with any municipal, county, state or federal taxes unless otherwise specifically instructed in writing in this escrow. Unless otherwise specifically provided herein all pro- rations are based on a 30 day month. IX Each party agrees that the escrowholder's liabilities hereunder are that of a stakeholder only and as such has no other legal relationship to any of the parties hereto, and is an escrowholder only on the terms expressed herein. Further, the escrowholder has no responsibility to notify any party to this escrow, or otherwise, of any sale, resale, loan, exchange, or other transaction involving any property incident hereto or any profit realized by any person, firm or entity in connection therewith, even though any such transaction may be handled by the escrowholder in this escrow or in another escrow. It is understood that the parties hereto are acting independently and do not and will not rely upon any representations heretofore or hereafter made by the escrowholder or by any of its officers or employees. X Should any dispute arise between or among the parties, or should conflicting demands or notices be served upon the escrowholder by the parties, or any third parties, the escrowholder may, at its sole option and in its sole discretion, but without limiting its other rights, do any or all of the following: Stop all proceedings in the performance of this escrow and withhold the delivery of any documents or funds in its possession until said conflicts are resolved and proof thereof, satisfactory to the escrowholder, is deposited in escrow; file a suit in interpleader or for declaratory judgement or for other relief. If such suit be brought the escrowholder shall be released and discharged from any liability and obligation to further perform any duties in connection with this escrow, and the parties jointly and severally agree to pay the escrowholder all costs, expenses and reasonable attorney's fees ex- pended or incurred by the escrowholder. Escrowholder shall make payment to or for, or deliver documents to any party only if in its sole judgement such payment or delivery may be made without incurring any liability upon the escrowholder. XI Except if otherwise specifically instructed in writing, if either the sellers or the buyers herein consist of more than one person, then it is agreed that except for these instructions and any documents required herein which require the signature of all of the parties, the signature of either of the sellers and either of the buyers shall hereafter suffice for escrow instructions and purposes, and the parties shall indemnify and hold the escrowholder harmless from any liability for accepting, using, performing or acting upon and in reliance of such singularly signed instruments or instructions. XII The parties hereto, jointly and severally, promise to pay on demand, as well as to indemnify and hold the escrowholder harmless from any and all costs, damages, judgements, attorney's fees, expenses and liabilities of any kind or nature whatsoever, occasioned by any party, including costs incurred by the escrowholder in connection with instituting, prosecuting or defending litigation, which in good faith the escrowholder may thus incur and sus- tain. Further, the escrowholder is hereby given a lien upon all of the rights, titles and interests of each of the undersigned in all papers, property and funds deposited in escrow, to protect the escrowholders rights and to indemnify and reimburse it for any such expenses incurred and sustained. XIII Where the context of this agreement requires, the masculine gender shall include the feminine and neuter genders, the singular shall include the plural, the words person or party shall include all entities recognized under the laws of the State of California, including but not limited to individuals, partnerships, joint ventures and corporations, and this instruction may be executed in any number of counter-parts each of which shall be construed as and be effective as an original. Should any paragraph, clause, or provision of this agreement be construed or interpreted by court of competent jurisdiction to be void, invalid or unenforceable only that portion so judged shall be affected and the remaining text hereof shall remain valid, effec- tive and enforceable. XIV This agreement shall inure to the benefit of and be binding upon the heirs, executors, administrators, successors and assigns, of the parties hereto who agree that time is of the essence of these and all additional or changed instructions. Should the parties fail to close this escrow within 60 days from and after the date or time intended for closing hereof, then the escrowholder shall be entitled to receive an additional reasonable sum each month as hold open fees, and may deduct and pay the same from funds in escrow. XV The foregoing terms, conditions, provisions and instructions have been read and are understood and agreed to by each of the parties hereto, each of whom acknowledge receipt of a copy thereof. NIKKOKU AMERICA, INC. thiawand By: Taro Kamamori, Vice-Pres. seller/s buyer/s - 3 -"
}
