{
	"anumber": "A20550522",
	"id": "A20550522_0051",
	"page_index": 51,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0051/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR DETERMINATION THAT PROSspective IMMIGRANT IS AN INVESTOR, Form I-526 ( (12-20-72)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023, 1972, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 UNITED STATES DEPARTMENT OF JUS Form approved Immigration and Naturalization Service OMB No. 43-R0514 REQUEST FOR DETERMINATION THAT PROSPECTIVE IMMIGRANT IS AN INVESTOR in order to be relieved from labor certification requirement of Section 212 (a) (14) of the Immigration and Nationality Act FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS WITH BALL-POINT PEN. DO NOT LEAVE ANY QUESTION UNANSWERED. When appropriate insert \"None\" or \"Not Applicable\". If you need more space to answer fully any question on this form use a separate sheet of paper this size and identify each answer with the number of the corresponding question. I hereby declare that I am seeking to become a lawful permanent resident of the United States for the purpose of engag- ing in a commercial or agricultural enterprise, and that I have invested, or am actively in the process of investing, in such enterprise capital totaling at least $10,000. On the basis of such investment, I request that the labor certifi- cation requirement of Section (a) (14) of the Immigration and Nationality Act be considered not applicable to me. Iam submitting this request as part of my application to become a lawful permanent resident of the United States. 1. Applicant's Family Name (Capital Letters) (First name) (Middle name) (Maiden name, if married woman) GULRAJANI HIRANAND TOLAREM 2. Birthdate (Month,day,year) Birthplace (City or town) SINDH PAKISTAN (Country) 7-13-13 3. Present Address (Number and treet) (City or town) (Province or State, ZIP Code) (Country) 738 So BEACON ST., L. A. CAL. 90017 4. Nature of Enterprise (Describe briefly) RESTAURANT 5. Name and Location of Enterprise MAHARAJAH SNACK BAR, 1832 w 7th ST., L A. CAL. 6. Check one: have made the investment. am actively in the process of making the investment. 7. The capital investment 1 made or am actively in the process of making consists of: Cash $3000 00 Other $14503.71 (describe) MERCHANDISE DURING 1973 +1974 Other $ (describe) TOTAL $17,503.71 8. Describe briefly how you will engage in the enterprise, including the title of any job you will hold in it and the number of hours per week you will devote to the job. OWNER & MANAGER 30.40 hours per week 9. EXPERIENCE - List all jobs or training you have had which qualify you to engage In the enterprise: Name and address of employer or trainer Name of job SELF EMPLOYED Nov.1972 RESTAURANT Date started Date left month year month year Kind of business Describe in detail duties you performed, including use of tools, machines, or equipment, No.of hours per week OWNER MANAGER OB1 MAHA RAJAH SNACK BAR Name and address of employer or trainer COOKED Name of jub Date started Date left Kind ot business month year month year Describe 11. detail duties you periorited, including use of tools, machines, or equipment, No. of hours per week 10. Describe any additional qualifications you possess for engaging in the enterprise. 11. List licenses (professional, journeyman, etc.) you have received. Form I-526 (12-20-72)"
}
