{
  "anumber": "A20535147",
  "id": "A20535147_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20535147_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A2 535 147"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2000,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place LOS ANGELES, CALIFORNIA File No. A20 535 147 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Mr. Kuo-Han YING M 12/25/14 Street 315 West Grand Avenue PLACE OF BIRTH Address Alhambra, California 91801 China City, State, Zip NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) China China 2nd PRIORITY DATE 12/5/73 REMARKS Sec. 203(a)(2) NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 13 of the Act of 9/11/57 Sec 214(d) I & N Act Sec 244 ( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Private Law no. of the Congress session Sec 245 of the + & N Act Sec 2 of the Act of 11/2/66 (Other law Specify) 19 MAR 1974 As of at LOS ANGELES, CALIFORNIA (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) Z-2 (P2-1) P26 (2) (Applicable in all cases) 1/24/74 /hp DATE OF 19 MAR 1974 RECOMMENDED BY (Immigration Officer) (Date) ACTION Roughbu 19 MAR 1974 DD Joseph Starect DISTRICT FOR USE BY VISA CONTROL OFFICE LOS 1613 FEB -7 1974 Date Foreign State China CLOSING ACTION REQUIRED Preference Category second 1.151 MAR 19 1974 MBW G-188 Number 10,714 MARCH G-361 5/20/74 2000 Month of Issuance G-153 MAR 19 1974 1-530 Signed VO7 (Visa Office, Dept. of State) Form 1-357 delivered Form I-151 delivered Form 1-151 mailed Form G-153 delivered MAR I 9 1974 19 1974 MAR 1 9 1974 CC: Visa Control Office, Visa Office, Department of State, Washington, D. C. 20520 for allocation of Immigrant visa number. State Director, Selective Service FORM I-181 (REV. 10-1-71) N (Page 1)"
}