{
	"anumber": "A20550522",
	"id": "A20550522_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4 ( 4(Rev. 4-14-81)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "Singapore", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1976, 2023, 1981, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 UNITED STATES DEPARTMENT OF JUSTICE OMB NO. 1115-0009 IMMIGRATION AND NATURALIZATION SERVICE Approval Expires 1/31/84 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION TH Mail or take to: 68317 IMMIGRATION AND NATURALIZATION SERVICE mg ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name GULRAJANI HIRANAND TOLARAM TYPE.) No. A20-550-522 Section of Law 316(a) Date: (Leave Blank) (1) My full true and correct name is HIRA NAND TOLARAM GULRAJANI (Full true name without abbreviations) (2) I now live at 1619 WESTMORELAND AVE LOS ANGELES CA 90006 (Number and street, ) (City county, state, zip code) JULY 13 1913 HYDERA BAD PAKISTAN (3) I was born on in (Month) (Day) (Year) (City (4) I request that my name be changed to IALCHAND TOIARAM or town) GULRAJANI (County province none. (5) Other names I have used are: NONE (Include maiden name) 2 Male Female (6) Was your father or mother ever a United States citizen? NO Yes x No YES (If \"Yes\", explain fully) (7) Can you read and write English? x Yes No (8) Can you speak English? YES Yes No YES (9) Can you sign your name in English? 11 I 1976 Yes No (10) My lawful admission for permanent residence was on under the name of HIRANAND T GULRAJANI (Month) LOBay A NGEI (Year) CA 90057 at (City) (State) (11) (a) I have resided continuously in the United States since New 1976 California (Day) (Year) Nev 11/76 3 (b) I have resided continuously in the State of since 969 (c) During the last five years I have been physically in the United States for a total of 50 (Month) 4 (Day (Year) months. FROM To STREET ADDRESS CITY AND STATE (a) 08 1981 PRESENT TIME 1619 S. Westmoreland Ave. Los Angeles CA (b) 05 19..80 0.8 19.81 19550 Victory Blvd. 07 73 Reseda CA (c) 19 19 80 816 S. Westlake Avenue Los Angeles, CA (d) 19 19 (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED, TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES Singapore Aurbrosb RETURNED TO THE UNITED STATES 06-19-81 07-29-81 Los Angeles, CA 03-20-82 05-19-82 2 mas 6 Los Angeles, CA 12/5/82 12/15/82 AviCanada awks (b) Since your lawful admission, have you been out of the United States January CANADA or longer? No If \"No\" state \"None\" If Yes\", fill in following information for every absence more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY BU DATE DB PARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES 126077 07-16-18 Korean Westeri 6 mas Cos Angeles, CA ancherage Ala no offer(11 Form N-400 (Rev. 4-14-81)Y (OVER) (1)"
}
