{
	"anumber": "A20550522",
	"id": "A20550522_0143",
	"page_index": 143,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0143/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Concession Lease, S-920 ( (CD-2.60)"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 6. Lessee shall not make any additions, improvements or alterations to said premises without the written consent of Lessor thereto, and Lessee agrees to keep said premises and the immediate approaches thereto in good condition and repair at its own expense, and to commit no waste thereof during the life of this lease; and Lessee hereby waives any right Lessee may have to make repairs at the expense of Lessor. If Lessee shall fail to make any necessary repairs, then, in addition to all other remedies, Lessor may make such repairs to said premises, and Lessee shall on demand pay Lessor the reasonable cost of such repairs. 7. Lessee shall neither erect nor display on said premises any advertising signs not approved by Lessor, and Lessor reserves the right to remove at any time from said premises its advertising signs or displays theretofore installed thereon by Lessor. 8. Lessee shall neither sell nor assign this lease, or any part thereof, or any interest therein, or sublet said premises, in whole or in part, nor become associated with any other persons, directly or indirectly, as partners or otherwise, with regard to Lessee's interest in, to or under this lease, without the written consent of Lessor thereto; and any consent to any such assignment or sublease shall not be construed to be a consent to any other or further assignment or sub- letting, as the case may be. Lessee shall not suffer any lien or encumbrance to be placed upon Lessee's leasehold interest in said premises, or any part thereof. nor shall Lessee permit anyone to occupy said premises, or any part thereof, in place and stead of Lessee; nor shall Lessee occupy the same, or any part thereof, as trustee of an express or implied trust for any person whatsoever. The breach by Lessee of any of the foregoing provisions, or any assignment or sublease hereof, whether voluntary or by operation of law, or by any process or proceeding of any court, or by attachment, execution, proceedings in insolvency or bankruptcy, whether voluntary or involun- tary, or receivership proceedings, shall constitute a breach of the covenant against the assignment of Lessee's rights hereunder, and shall, at the option of Lessor, work a forfeiture of this lease. 9. Lessee shall operate its said business at all times so as not to interfere in any way with the business of Lessor. Lessee grants Lessor the right to inspect Lessee's said business, and any buildings or equipment used in conjunction therewith, at any reasonable time or times. 10. Lessee shall pay, when due, all taxes levied upon any improvements or equipment placed upon said premises by Lessee. 11. Lessee shall indemnify, defend and hold Lessor harmless from and against all expense, liabil- ity and claims for damage to property (including Lessee's property) or injury to or death of persons (including Lessee) directly or indirectly resulting from anything occurring from any cause on or about or in connection with the use or occupancy of said premises or the means of ingress thereto or egress therefrom. 12. The provisions of this lease shall inure to the benefit of Lessor and of its principal, Standard Oil Company of California. 13. Until further notice from Lessor, all payments to be made and notices to be given to Lessor hereunder shall be made or given to 605 West Olympic Boulevard 100 Angeles, California 90015 IN WITNESS WHEREOF the parties hereto have executed this lease. STANDARD OIL COMPANY OF CALIFORNIA, WESTERN OPERATIONS, INC. annieu By ATTORNEY IN FACT LESSOR Heizwand CHANDUR ELLIS AND COMPANY By July Elles LESSEE Tax I.D. 557-08-2124 S.920 (CD-2.60) Concession Lease"
}
