{
	"anumber": "A20543620",
	"id": "A20543620_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, 443-R0052"
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Taiwan",
				"Canada",
				"Mexico",
				"Thailand",
				"United States",
				"Vietnam",
				"Laos"
			]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Servi OMB No 43-R0052. FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act Use typewriter or print in block letters with ball -point pen. issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME NGO, Khanh Hoa IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt. No.) MAILING 8125 2nd Street ALIEN REGISTRATION NUMBER ADDRESS (City) Donney (State) (ZIP Code) IN U.S. California 90241 A- 20 543 620 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR Jan 10,1915 Vietnam Vietnam Brown Dark Black HEIGHT 5 FEET 2 INCHES VISIBLE MARKS AND SCARS Mole by lettear indentation upper forehead 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS NGO, Khanh Has GRANTED ADJUSTMENT WAS GRANTED Los June 3, 1975 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL POST MOTHER'S MAIDEN NAME is 75 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after presence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED CLEARED PORT OF ARRIVA DATE OF ARRIVAL NOTAPPLICABLE NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE J LENGTH OF INTENDED ABSENCE ABROAD LGS Angeles California June As soon Two (2) months NAME TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL Pan Am FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. Not Applicable 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND INATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED Not Applicable IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: Housewife NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER None None 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) State/Province/District)2 Country) No 12-14 Padungdao Road Bang kok Thailand ADUITED 11. COUNTRIES TO BE VISITED (List each country) Taiwan & Thailanda Fronce 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): To try to obtain exitvisas for has band and son Husband tham. Son is in Laos RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM 1-131 (REV. 6-1-73) N OVER 3 JUN 1975 A"
}
