{
  "anumber": "A20543620",
  "id": "A20543620_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE, 300 North Los Angeles Street, 90012"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 300 North Los Angeles Street Los Angeles, California 90012 AUTHORIZED CIVIL SURGEONS IMPORTANT: As soon as you receive this notice you are required to make arrangements immediately for your medical examination. You are instructed to arrange for an appointment with one of the following medical examiners who will perform the required laboratory and x-ray pro- cedures as well as the medical examination. The total cost of this examination will be more than $32.50 which amount is required to be paid by you. The results of the medical examination must be presented at your immigra- tion interview as scheduled. X-RAY REPORT IS NOT NECESSARY FOR CHILD 10 YEARS OF AGE OR UNDER. SEROLOGY TEST IS NOT NECESSARY FOR CHILD 14 YEARS OF AGE OR UNDER. LOS ANGELES COUNTY RIVERSIDE COUNTY Michael S. Burton, M. D. John T. Lanier, M. D. Hillhurst Medical-Dental Building 6926 Brockton Avenue 2101 Hillhurst Riverside, California 92506 Los Angeles, California 90027 Telephone: (714) 686-5492 Telephone: (213) 664-2931 Murray Feldsher, M. D. KERN COUNTY 5801 East Washington Boulevard Los Angeles, California 90022 Kenneth G. Wong, M. D. (City of Commerce) 2615 \"II\" Street Commerce Clinic Bakersfield, California 93301 Telephone: (213) 722-8481 Telephone: (805) 327-1431 Martin F. Bain, M. D. & Associate Robert Michals, M. D. SANTA BARBARA COUNTY Torrance Emergency Clinic 2406 Torrance Boulevard John R. Rutten, M. D. Torrance, California 90501 Santa Barbara Clinic Telephone: (213) 775-8646 Calle Real at San Marcos Pass Road Santa Barbara, California 93102 ORANGE COUNTY Telephone: (805) 964-6211 Louis J. Cella, M. D. Santa Ana Clinic 309 Civic Center West Santa Ana, California 92701 Telephone: (714) 542-1166 11/11/74"
}