{
	"anumber": "A20550522",
	"id": "A20550522_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0032/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "SERVICE ESCROW COMPANY, ESCROW NO. 2803DN,, ESCROW NO. 2803DN"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 SERVICE ESCROW COMPANY, ESCROW NO. 2803DN, PAGE 2, AUGUST 31, 1976 09. Seller will assist the buyer in negotiating for a new lease for the subject premises with terms and conditions mutually acceptable to lessee and landlord, and this escrow shall be contingent on the same being obtained. be deposited in escrow. Lease, or copy thereof reflecting the signatures or all parties thereto, to 10. The parties shall immediately, or in any event as early. as practical, cause to be deposited in escrow an itemized list of the furniture, fixtures, and equipment being conveyed, approved in writing by both parties. Seller shall deposit herein his good and valid Bill of Sale covering the same, warranting them free of any liens or encumbrances whatsoever except as spe- cifically provided for in this escrow, to wit: (a). None. 11. The parties hereby instruct the escrow holder, on their behalf and at their expense, to: 1 (a). Record and publish a Notice of Bulk Transfer. (b). Obtain of the Secy. of State a UCC search under the name of seller, the business firm name, the corporation, if any, named herein as holding title to the business assets if other than the named seller, all only to the extent such names are provided you in writing herein, to show liens and encumbrances of record, if any. Further, the parties authorize payment, from the funds in escrow, of the charges for any and all of these procedures, when required or billed. 12. The buyer agrees that he is accepting delivery and possession of the premises, and the furniture, fixtures and equipment contained therein and thereon, in \"as is\" condition and state of repair, and waives any demand or claim against the seller in connection therewith. Nothwithstanding the above stated seller warrants to buyer that CoCo Cola Fountain Machine in the premises will be working order at the time of buyer's possession of the subject premises. The seller warran 13. The seller warrants to the buyer that no governmental agency having jurisdiction over the subject premises with respect to the operation of the subject business has issued any citation, notice or advisement, in wri- ting, or otherwise, for any faulty condition now remaining uncured, and that the premises, including the equipment installations therein or thereon will, as of the date of buyers possession, comply with the requirements currently in effect and being enforced by any such agency, as of the date of buyers possession, and if not the seller will bear the expense of any corrective work required to be done to meet such requirements. 14. Seller shall deposit in escrow, however not as a condition of its closing, certificates of release issued by the State Board of Equalization and the Department of Benefit Payments, pending the deposit of which the escrow holder is instructed to retain from funds having accrued to the account of the seller the sum of $2,000.00 , or, upon filing final returns with said agencies and obtaining their statements of amounts due, the seller may instruct the escrow holder to use the amount required of such funds held to obtain such releases. 15. Buyer warrants that while any part of the purchase money note remains unpaid he will maintain fire insurance covering the collateral given as se- curity for its payment, for the full insurable value thereof, naming the seller, or his assign, as first loss payee therein or as his interest may appear, and shall keep the holder of said note at all times furnished with a certificate or like written evidence of such insurance being kept in force. 16. Seller shall cause to be deposited in escrow, prior to it's close, corporate resolutions, certified by the secretary to be a true and correct copy of those entered into the permanent records of the corporation, as having been duly adopted by the seller's Board of Directors, wherein the sale of the assets which are the subject of this escrow has been authorized, on the terms and conditions set forth herein, and further, the authorization for the undersigned officer to conduct the sale and to execute, in his offi- cial capacity, any and all instructions, documents and instruments required to effect the same. Other than to receive the same, retain a copy for the escrow record, and delivery of a copy thereof to the buyer at close of es- crow, the escrow holder shall have no further concern therewith."
}
