{
  "anumber": "A20540300",
  "id": "A20540300_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20540300_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, 213"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31.34 for Instructions) Family Name (Capital Letters) Given Nome Middle Name Sex Hair Eyes Complexion Sanchez-Nieblas Gregoria F Blk Brn Med Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation Mexico A20 540 300 61st 170 Domestic United States Address (Residence) (Number) (Street) (City) (State) Scars or Marks In transit Mole on Rto Cheek Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status 4/5/74 1 Mile West POE SYS 10:PM EWI Single Married Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension Madrid, Colima, Mexico AC Birthdate Date of Action Location Code (At/Near) Date & Hour 8/8/13 3/6/74 LOS Calife Diamond Bar 3/6/74 City, Province (State) and Country of Birth AR Form: (Type & No.) By Cualcoman Mich. Mex. Lifled Logan Inv. Not Lifled Visa Issued At Social Security Account Name Status at Entry Status When Found None EWI In Transit Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. None To: Within 72 Hours Immigration Record Criminal Record Claims None Claims None Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of Minor Children Isaias Mendoza Mex. Tijuana BC Mexico None Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality and Address, If Known Guadalupe Sanchez Mex. Deceased Feliberta Nieblas Mex. Deceased Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 (Yes No Not Listed Listed, Code ROTEN Name and Address of (Last) (Current) U.S. Employer From: To: Not Employed Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last entry. and elements which establish admin- istrative and/or criminal violation. Indicate means and route of travel to interior.) No Money - No baggage Subject is witness in 274 Case Principal FOIA (b)(6) FOIA (b)(6) (If space insufficient, show \"continued\" and continue on reverse, from bottom upio Tuzbecrea 03 STT alamy (Signature and Title) DISTRIBUTION Received (subject and documents) (report of inferview)Han Officer: A.A. Bracamonte Inv Stats 3/6 Trans 19 74 at 3:45 (P) M. Disposition (Receiving Officer) Form 1-213 (Rev. 5-1-71)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}