{
  "anumber": "A20543620",
  "id": "A20543620_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0025/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A20 543 620"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Screened by NARA 7/28/2023 LOS Im gration and Naturalization Se: ice MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE 12 MAY 1975 Place (DATE) Los Angeles, California File No. A20 543 620 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Street Khanh Hoa NGO F 1/10/15 Address 8125 Second Street PLACE OF BIRTH POLICE City, State, Zip Downey CA 90241 Cholon, So. Vietnam NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) 01 S. Vietnam VieTNAN Non PreFerence PRIORITY DATE 2-7-75 REMARKS BEWAS Sec.203(a)(8) A120 NONPREFERENCE: Section 212(a) (14) certification not required because: TABOK auq Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session x Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 JUN 3 1975 3 (Other law Specify) As of 12 at Los Angeles CA (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE 02 Class of admission (Insert symbol) Z-2 (NP-I, NP6 32 (Applicable in all cases) DATE OF I.I.S. APPLOY RECOMMENDED BY (Immigration Officer) (Date) ACTION Whiles 5/2/75 DD 7975 DISTRICT FOR USE BY VISA CONTROL OFFICE of LOS ANGELES, CA Date MAY 61975 bjaceo the Foreign State Vietnan 21202 CLOSING ACTION REQUIRES CO262 we 1-151 7972 864 Preference Category Nangry bout Number GAGLA 195 G-361MAY 1975 we Month of Issuance MAY G-153 I-530 aug OUG Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - 181 (Rev. 5-1 - 74) N (Page 1)"
}