{
  "anumber": "A20540300",
  "id": "A20540300_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20540300_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION, DEPARTMENT OF JUSTICE, FD-249 ( (REV.3.13-72)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA. 4/24/2023 FEDERAL BUREAU OF INVESTIGATION, UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON D. C. 20537 YES NO PALM PRINTS TAKEN? INSTRUCTIONS YES NO UNLESS OTHERWISE PROVIDED BY REGULATION IN YOUR STATE, FINGERPRINTS PHOTO AVAILABLE? ARE TO BE SUBMITTED DIRECTLY TO FBI IDENTIFICATION DIVISION. FORWARD IM- MEDIATELY FOR MOST EFFECTIVE SERVICE. IF AVAILABLE, PASTE PHOTO OVER INSTRUCTIONS IN DOTTED AREA. 2. FINGERPRINTS SHOULD BE SUBMITTED BY ARRESTING AGENCY ONLY (MULTIPLE (DO NOT USE STAPLES) PRINTS ON SAME CHARGE SHOULD NOT BE SUBMITTED BY OTHER AGENCIES SUCH AS SINCE PHOTOGRAPH MAY BECOME DETACHED INDICATE NAME, JAILS, RECEIVING AGENCIES, ETC.). REQUEST COPIES OF FBI IDENTIFICATION REC. DATE TAKEN, FBI NUMBER, CONTRIBUTOR AND ARREST NUMBER ORD FOR ALL OTHER INTERESTED AGENCIES IN BLOCK BELOW. GIVE COMPLETE ON REVERSE SIDE, WHETHER ATTACHED TO FINGERPRINT CARD OR MAILING ADDRESS, INCLUDING ZIP CODE. SUBMITTED LATER. 3. TYPE OR PRINT ALL INFORMATION. IF ARREST FINGERPRINTS SENT FBI PREVIOUSLY AND FBI NO. UNKNOWN, 4. NOTE AMPUTATIONS IN PROPER FINGER BLOCKS. FURNISH ARREST NO. DATE 5. LIST FINAL DISPOSITION IN BLOCK ON FRONT SIDE. IF NOT NOW AVAILABLE SUB. MIT LATER ON FBI FORM R-84 FOR COMPLETION OF RECORD. IF FINAL DISPOSI. STATUTE CITATION (SEE INSTRUCTION NO. 9) CIT TION NOT AVAILABLE SHOW PRE-TRIAL OR ARRESTING AGENCY DISPOSITION, c. g., RELEASED, NO FORMAL CHARGE, BAIL, TURNED OVER TO, IN THE ARREST DISPOSI. 1. TION BLOCK PROVIDED ON THIS SIDE. 2. 6. MAKE CERTAIN ALL IMPRESSIONS ARE LEGIBLE FULLY ROLLED AND CLASSIFIABLE. 3. 7. CAUTION . CHECK BOX ON FRONT IF CAUTION STATEMENT INDICATED. BASIS FOR CAUTION (ICO) MUST GIVE REASON FOR CAUTION, e. g., ARMED AND DANGEROUS, ARREST DISPOSITION (SEE INSTRUCTION NO. 5) ADN SUICIDAL, ETC. 8. MISCELLANEOUS NUMBER (MNU) - SHOULD INCLUDE SUCH NUMBERS AS MILITARY SERVICE, PASSPORT AND/OR VETERANS ADMINISTRATION (IDENTIFY TYPE OF NUM. BER). EMPLOYER: IF U. S. GOVERNMENT, INDICATE SPECIFIC AGENCY. 9. PROVIDE STATUTE CITATION, IDENTIFYING SPECIFIC STATUTE (example - PL for PENAL LAW) AND CRIMINAL CODE CITATION INCLUDING ANY SUB-SECTIONS. IF MILITARY, LIST BRANCH OF SERVICE AND SERIAL NO. Unempl loyed 10. ALL INFORMATION REQUESTED IS ESSENTIAL. OCCUPATION SEND COPY TO: haborer RESIDENCE OF PERSON FINGERPRINTED COLIMA, mexico SCARS, MARKS, TATTOOS, AND AMPUTATIONS SMT REPLY DESIRED? YES NO None (REPLY WILL BE SENT IN ALL CASES IF SUBJECT FOUND TO BE WANTED) IF COLLECT WIRE OR COLLECT TELEPHONE REPLY DESIRED, INDICATE HERE: (WIRE SENT ON ALL UNKNOWN DECEASED) BASIS FOR CAUTION ICO WIRE REPLY TELEPHONE REPLY TELEPHONE NO. AND AREA CODE DATE OF OFFENSE DOO SKIN TONE SKN LEAVE BLANK 3-6-74 OLIVe MISC. NO. MNU ADDITIONAL INFORMATION LEAVE BLANK FD-249 3-13-72) * GPO 1972 462 - 542"
}