{
  "anumber": "A20543620",
  "id": "A20543620_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Thailand",
        "Canada",
        "Mexico",
        "United States",
        "Vietnam",
        "France",
        "Laos"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        1975,
        1915,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITEDSETEEHE8 DENARAM/28/2023USTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES as provided in section 223 of the Immigration and Nationality Act Use typewriter or print in block letters with ball -point pen. Tel- 385-8804 issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Registration Receipt NGO Khanh Hoa Card with this application if you checked Issuance'' above. C/O IN CARE OF If you checked 'Extension'' you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt No.) MAILING 8125 2nd Street ALIEN REGISTRATION NUMBER ADDRESS (City) (State) IN U.S. Downey, California 90241 HIP Code) A- 20 543 620 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY Dair OF EYES COLOR OF HAIR Jan 10, 1915 Vietnam Vietnam Brown Black head HEIGHT 5 FEET 2 INCHES VISIBLE MARKS AND SCARS Mole by left ear / indentation upper fore- 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR AD JUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED NGO, Khanh Hoa Los June 3, 1975 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel. Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL NGO,Khan h Hoa Los Angeles, CA Nov, 12, 1975 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: China Airlines 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Los Angeles, California August 19, 1976 Two (2) months NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL Pan Am FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 6/10/2016 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. Thailand, Republic oFChina, HongKong June 8, 1975 Los Angeles, California 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT June 8,1975 (City and State) IS ATTACHED Los Angeles, California IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. ATE EXPIRATION DATE Applicant has since lost it. ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: NAME and ADDRESS OF EMPLOYER POST 17 Housewife SOCIAL SECURITY ACCOUNT NUMBER 548-37-3368 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) CLEARED None DATE State/Province/District (Country) No 12-14 Padungdao Road; Bangkok, Thailand 11. COUNTRIES TO BE VISITED (List each country) INITIALS Taiwan & Thailand and France 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): To try to obtain exitvisas for husband and son. Husband is in Vietnam. Son is in Laos. AUGRECEAVED 976 TRANS IN RET'D TRANS. OUT COMPLETED FORM I 131 (Rev. 3-1-74) OVER AUG 16 DOT"
}