{
  "anumber": "A20535147",
  "id": "A20535147_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20535147_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DUPLICATE UNITED STATES DEPARTMENT OF JUSTICE (To accompany Immigration and Naturalization Service monthly report on Form N-4) 434163 UNITED STATES OF AMERICA PETITION FOR NATURALIZATION No. U. S. District Court, Los Angeles, Calif. A.R. No. A20 535 147 To the Honorable The Court for the at This petition for naturalization, hereby made and filed under section Immigration and Nationality Act, respectfully shows: 31G(A) , (1) My full, true, and correct name is Kuo Han Ying (Full, true name, without abbreviation) (2) My present place of residence is 2221 S. Annadel Ave. Rowland Hts/ (Apt. No.) (Number and street) (City or town) L.A. Ca. 91748 (County) (State) (ZIP Code) (3) I was born on 12-25-14 , in China (4) I request that my name be changed to Leo Kuo-Han Ying (5) I was lawfully admitted to the United States for permanent residence and have not abandoned such residence. (6) (If petition filed under Section 316(a).) I have resided continuously in the United States for at least five years and continuously in the State in which this petition is made for at least six months, immediately preceding the date of this petition and after my lawful admission for permanent residence, and I have been physically present in the United States for at least one-half of such five year period. (continued over) AFFIDAVIT OF WITNESSES The following witnesses. each being severally, duly, and respectively sworn, depose and say: A1 Seares (1) My name is 1227 Goldenrod Corona Del Mar Ca. I reside at and (Number and street) (City or town) (State) Eleanor Seares (2) My name is same as above I reside at (Number and street) (City or town) (State) I am a citizen of the United States of America: I have personally known and have been acquainted in the United States with the petitioner named in the petition for naturalization of which this affidavit is a part, since at least 4-15-75 to my personal knowledge, based upon (Month) (Day) (Year) frequent observations and personal contacts with the petitioner within the State of residence of the petitioner since said date, the petitioner has resided. immediately preceding the date of filing this petition. in the United States continuously since the date last mentioned: that the petitioner has been physically present in the United States for at least 31 months of that period: and that petitioner has been a resident In the State in which the petition is filed during at least the last 6 months. I have personal knowledge that the petitioner is, and during all such periods has been a person of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happinezs of the United States, and in my opinion the petitioner is in every way qualified to be admitted a citizen of the United States. I do swear (affirm) that the statements of fact I have made in the afidavit to this petition for naturalization subscribed by me are true to the best of and Allen my knowledge (Signature Nachine belief. So of Help Witness) Me God. (Signature of Witness) WHEN OATH ADMINISTERED BY CLERK OR DEPUTY WHEN OATH ADMINISTERED BY DESIGNATED EXAMINER CLERK OF COURT Subscribed and swarn, to (affirmed) before me by above-named pell- Subscribed and sworn to (affirmed) before me by above-named peti- tioner and witnessed in the respective forms of cath shown In said petition tioner and witnesses in the respective forma of onth shown in said petition and affidavit, and filed bsCand In the office of the clerk of said and affidavit at I...A CA. this 1514 If court at OF THE day of April 19-80 U.S. DISTRICT COURT APR 1980 this day of 19 CENTRAL DISTRICT I HEREBY CERTIFY That the foregoing petition for naturalization was by petitioner named herein filed in the office of I the clerk of said court OF Clerk. BY BLIFORNIA By at I.A. CA. this 141 day of CALIFORNIA Deputy Clerk. DEPUTY [SEAL] STATISTICS April 19 so Deputy Clerk. Clerk. Form N-405 (Rev. 11-27-78)N 5/9/80 aho"
}