{
	"anumber": "A20550522",
	"id": "A20550522_0060",
	"page_index": 60,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0060/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Lease Agreement,, 3-7069"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 3-7969 THIS LEASE, dated the 11th day of November , 19 71 ; WITNESSETH: 1. STANDARD OIL COMPANY OF CALIFORNIA, WESTERN OPERATIONS, INC., hereinafter called \"Lessor,\" hereby leases to CHANDER-SANAS AND COMPANY , hereinafter called \"Lessee,\" for the term commencing Jenuary 1 , 19 72 , and ending October 30 19 75 that certain building or area designated as Restaurant and outlined in red on the attached sketch, which is hereby made a part hereof, said building or area, hereinafter called said premises, being located on the following described real property in the City of Loo Angeles , County of Los Anzeles State or Territory of California Lots 1, 2 and 3 in Block 3 of the Bonnie Erae Tract in the City of Los Angeles, County of Los Angeles, State of California, as per map recorded in book 9 page 85 of Miscellaneous Records in the office of the County Recorder of said County. EXCEPT therefice the North 10 feet of lot 1 in said Block 3 conveyed by Irc W. Phelps and wife, to the City of Los Angeles for Seventh Street, by deed recorded in boots 803 page 301 of Deeds. together with the right of ingress to and egress from said premises over and across the above described real property for the purposes ereinafter specified and no others. Notwithstanding any other provisions in this lease contained, Lessor shall have the right to terminate this lease at any time upon giving Lessee thirty (30) days' written notice of Lessor's intention to terminate the same. 2. Lessor's interest in the premises is or may be a leasehold estate derived from a third party whose interest in the premises may or may not be of record. This Lease is subordinated to all the terms and conditions of any lease now in effect or hereafter entered into with such third party evidencing such leasehold estate of Lessor and, at Lessor's option, shall terminate if said lease is terminated in any manner or by either party thereto. Lessee expressly agrees to be bound by all of the terms, covenants and conditions thereof, and to perform and fulfill the same SC far as they may be applicable to Lessee': tenancy of the portion of the real property above described let to Lessee. 3. Lessee shall pay Lessor as rental for said premises the sum of One Hundred Fifty & NO/100 dollars ($ 150.00 ) a month, said rental to be paid monthly in advance on the First day of each and every month of the term hereof, commencing January 1 19 72 , 4. If any rent shall be due and unpaid, or if default shall be made in the performance of any of the terms, covenants or conditions herein contained, Lessor may at its option terminate this lease and re-enter and take possession of said premises and remove and exclude Lessee and all other persons therefrom; and Lessee agrees to quit and deliver up said premises to Lessor peace- ably and quietly at the expiration, or any sooner termination of this lease, in as good order and condition as the same are now, or may hereafter be put into, reasonable wear and tear excepted. 5. Lessee shall have the right, during the term hereof, to occupy and use said premises for the sole purpose of conducting thereon D. restaurant business and Lessee agrees to operate its business continuously during the term of this lease. Lessee shal neither use, store, handle, sell nor distribute from said premises any petroleum products or any goods or merchandise of a type or kind marketed by Lessor."
}
