{
  "anumber": "A20543620",
  "id": "A20543620_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0061/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Processing Sheet, I-485"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 APPLICATIO CLERK DATE EXAMINED UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or I-485 File No. Petition Form No. Preference: Priority Date: DATE CLERK'S ACTION REQUIRED - DOCUMENTS NEEDED REQUESTED RECEIVED INITIALS INTERVIEW & USPH MEDICAL APPOINTMENT MEDICAL and/or INTERVIEW RESCHEDULED G-325A(1)-FBI Identification Division G-325A(2) -FBI Records Branch \" 11 Sheets (1) & (2) - SECOND REQUEST G-325A(3)-CIA G-325A(4)-Am/Con. Tuper Am/Con LAOS I-156 to: I-530 I-88 I-508 Applicant's: BC ;MC ;DD ;DC ; Affidavit of Support #1 #3 Employment Letter #2 #4 Photos ; Form I-94 #5 BRING: I-181 I-181 Nonpreference I-181 To STATE DEPT. for VISA NUMBER ATTORNEY: Phone 862-5121 - INTERVIEWED: 6/3/75 NO SHOW: (DATE) Second Notice to: OK applement TO GRANT EXCEPT accompanied FOR: by I-isisen, RIAC Kim Jum. distraught temmingred 1. at LOS on 8/14/733440 -512-754. Opportunt highly well 2. to stating U.S her husland 1/9 year old sm win V retrain; as as alair married children & appreciate total she intende their 3. departure from Vietnam. She state she Anain had 2, fast s 3. Wietness immediately immediately in order to attempt to arrange 4. senre estamante including a mixinin fast GOOD business Shealse states another_cm wen chines Chen snow applying Telephantis for I 15/stille atlosbosed on being sell employed This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this sheet on top of all material in file until initial decision is made Form I-468 (Rev. 11-1-70)"
}