{
  "anumber": "A20543620",
  "id": "A20543620_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20543620_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, FORM NO. 4-3068"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Laos"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1974,
        1941,
        1973,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED Screened byENARA, 7/28/2023 JUSTICE FORM APPROVED IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-R0368 APPLICATION FOR VERIFICATION OF FEE STAMP LAWFUL PERMANENT RESIDENCE OF AN ALIEN AMERICAN CONSULATE GENERALI Take or mail to - IMMIGRATION AND NATURALIZATION SERVICE, JAN 20 1975 In connection with immigrant visa application(s) of my relative(s) listed in item 15 below, I request that the American Consul at Vancouver, B.C. (City and Country abroad) be furnished a verificati run) any 101 admission ORNADA into the United States for permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME is (Last, in CAPS) First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: LIM, Kiac Kim FOIA (b)(6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 8125 Second Street Downey, California 90241 June 15, 1941 5. MY FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) LIM Ngo an (TRAN Van Ba) Pakse, Laos 7. MY MOTHER'S FULL MAIDEN NAME: 8. 1 AM NOW A CITIZEN OF: (Country) NGO Khan Hoa China INFORMATION IN THESE BLOCKS PERTAINS TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME USED WHEN DMITTED FOR PERMANENT RESIDENCE (Last) (First) (Middle) 10. MY U.S. PORT OF ARRIVAL WAS LIM, Kim Kiae Los Angeles, California 11. MY DATE OF ARRIVAL WAS: (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS: (Show Name of Vessel or Airline and Flight No., etc.) August 14, 1973 Adjustment of Status $245 of I&N Act 12. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: Not Applicable. 13. 1 first obtained an immigrant visa at a United States consular office abroad on (date) (location). At that time, I was was not married Not Applicable. 14. Including my present marriage I have been married One times. The name of my present spouse is: Boua Thong S Lim to whom I was married on 25 April 1974 at Vientiane, Laos If married more than one time. list (date) (location) names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: Not Applicable. 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH NGO Khanh Hoa Jan 10, 1915 Cholon, Republic of Vietnam RELATIONSHIP ADDRESS Mother 8125 Second Street, Downey, California 90241 FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT The Secretary of State is hereby informed that the subject named 16. FULL SIGNATURE APPLICANT A.M AS NOW USED OF above was was not lawfully admitted for permanent residence. His \"A\" file shows the following: Date of First Admission for Permanent Residence: 8-14-73 Symbol 2-2 Issuing Post and Date of Issuance of IV: LOS Marital status at time of first admission: Single: Married: Date: 1-13-75 Verifier this ADMISSION Unter VER CFFEE Divorced Widowed INS OFFICE os FORM 1-550 (REV. 5-1-7211 INITIATS"
}