{
  "anumber": "A20866872",
  "id": "A20866872_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20866872_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, GPO 897-362"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS The individual or voluntary agency should submit the signed assurance to the officer in charge of the overseas office of the Immigration and Naturalization Service with whom the applicant is registered or to any office of the Immigration and Naturalization Service within the United States. The form need not be submitted at the time of registration but must be filed before the entry of the applicant may be authorized. Individual sponsors must attach offer of employment, showing location and type of employment to be provided. Individual sponsors must also show the type of housing that will be made available, including number of room's and facilities, city or town, state, and, if feasible, a specific street address. The authority for collection of the information requested on this form is contained in 8 U.S.C. 1225. Submission of the information by a U. S. citizen on this form is voluntary. The collected infor- mation will be used principally by the Service to determine whether the applicant is eligible for conditional entry into the United States under the provisions of sections 203 (a) (7) and 235 of the Immigration and Nationality Act, 8 U.S.C. 1153 and 1225. The information solicited may also, as a matter of routine use, be disclosed to other federal, state, local, and foreign law enforcement and regulatory agencies, the Department of Defense including any component thereof (if the applicant has served, or is serving in the Armed Forces of the United States), the Department of State, Central Intelligence Agency, Interpol and individuals and organizations, during the course of investigation to elicit further information required by this Service to carry out its functions. Failure to provide any or all of the solicited information may result in the denial of the application for conditional entry into the United States. NOUS Oxe8eea 0882 preas TONCHIMEKA HIVE Kome re TP TORCHIMEKA 1200 GPO 897-362"
}