{
  "anumber": "A20865114",
  "id": "A20865114_0070",
  "page_index": 70,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20865114_0070/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Statistical Analysis of Immigration Data, I-591"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "France",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 15. I list below all organizations, societies clubs, and associations, past or present, in which I have held membership, and the periods and places of such membership. (If you have never been a member of any organization, state \"None\" None (nock 16. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date and place and nature of each charge and the final result) 17. I have have not been in the United States. (If you have ever been in the United States, show the dates of entry and departure and the purpose of your entry. Visitor, permanent resident, student, seaman, etc.) File or Alien Registration number 18. I have the following close relatives in the United States: FOIA (b)(6) sponsored by (Give name una or United States Sponsor) U.S.C.C. and above relatives Date Signature of registrant May 26,1977 oomh DO NOT WRITE BELOW THIS LINE I, , do swear (affirm) that I know the contents of this registration sub- scribed by me including the attached documents, that the same are true to the best of my knowledge, and that cor- rections, numbered ( ) to ( ), were made by me or at my request, and that this registration was signed by me with my full, true name: wanth Complete and true signature of registrant) EMBASSY Subscribed and sworn to before me by the above-named registrant at PARIS, FRANCE on NOV as 1977 James (month)(day)(year) ok (Signature and title of officer) INTERVIEW Regular APPROVED203 (a) (7) REFUGEE ENTRY You the NOV 8 1977 United 203(a)(7) DATE DATE 29 JUN 1978 AMERICAN EMBASS AT Plan PARIS RANCE Jumatter NYC 823-78-1115 Immigration Officer Officer in Charge (Por) INSTRUCTIONS STA TISTICS This form should be executed, signed and submitted to the Officer-in-Charge of the nearest overseas office of the United States Immigration and Naturalization Service. When your name has been reached as a registrant you will be furnished additional instructions. 1. REGISTRATION - A separate Registration Form must be executed by each registrant and submitted in one copy. A Registration Form in behalf of a child under 14 years of age shall be executed by the parent or guardian. 2. ASSURANCES - Assurance Form I-591 executed by a United States sponsor will be required before your condi- tional entry may be authorized but need not be submitted at this time. U. S. GOVERNMENT PRINTING OFFICE: 894-552"
}