{
  "anumber": "A20865114",
  "id": "A20865114_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20865114_0059/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA 8/17/2023 UNITED STATES DEPARTMENT OF JUSTICE 'Immigration and Naturalization Service', OMB No. 4-40595"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Screened NARA 18/17/2023 immigration and Naturalization Service Form Approved OMB No. 43-R0595 DEMOGRAPHIC DATA TO ACCOMPANY APPLICATION FOR CREATION OF A RECORD OF LAWFUL ADMISSION FOR AN INDOCHINA REFUGEE (PLEASE TYPE OR PRINT) 1. (Family Name, in CAPS) (First) (Middle) 2. Alien Registration Number HOANG OANH T A-20-865-114 1a. Name which you were admitted to the United States (if different from above) Telephone Number TRAN THAY T 354-9457 3. Date of Birth (Month) (Day) (Year) 4. City and Country of Birth 4a. Nationality 5 Male 6. Single Married 1915 KIEN AN, QUI NHON, VN VIETNAM Female Divorced Widowed 7. List all of your dependents in the United States: Name and Relationship Sex Place of Birth Date of Birth Type of School/Grade Completed NONE 8. Family Name First Name Date City and Country of Birth (If known) City and Country of Residence TRAN CHUAN UNKNOWN FATHER DECEASED PHAM HAY UNKNOWN MOTHER (Maiden name) DECEASED 9. Applicant's residence last five years. List present address first, (EXCLUDE RELOCATION CAMP) From To Street and Number City Province or State Country Month Year Month Year 4116 MADRONA RD. RIVERSIDE CALIFORNIA U.S.A. 09 78 Present 4038 ACACIA ST, RIVERSIDE CALIFORNIA U.S.A. 08 78 09 78 01 RUE DES VERRIERS DIJON FRANCE FRANCE 12 76 08 78 21 TRUNG TRAC VUNG TAU PHUOC TUY VIETNAM 12 73 10 76 10. I am currently residing in: Apartment Mobile Home Condominium House Other (Specify) 11. Are you living rent free? Yes No 12. Applicant's employment last three (3) years. List present employment first. 13. Fluency in English Full name and Address of Employer Job Title Wage / Hour (Check) Poor Fair Good NONE Reading Writing Speaking 14. Last job title, ABROAD 15. Name and Location of Schools Attended Type of School From/To Highest Grade Completed Title of Degree NONE 16. To be answered only by the head of household to the best of his / her ability: Have you received any public / private assistance? Yes No If yes answer the following: Public Assistance (Source) Type From/To Dollar Amount SECURITY SOCIAL 08-79/ NOW $399.00 WELFARE (AFDC) AFDC 09-78/07-79 $201.00 Private Assistance (Source) NONE (Page 5) FORM I-485 C (Rev. 8-9-78) N"
}