{
	"anumber": "A20865114",
	"id": "A20865114_0073",
	"page_index": 73,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20865114_0073/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France", "Malaysia", "Vietnam", "Indonesia"]
		},
		"years": {
			"ms_years_nlp_v1": [1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "not able to pay the old accrued taxes imposed by the new Communist authorities. The tax-rate was so high that we did not see any other solution than to offer them our store and be prepared to move to the new economic zones. The future was so gloomy and frightening that we had endeavoured to search a way to flee Vietnam by sea, ready to defy all the dangers we could encounter and even though my daughter was expecting a baby within a few months. Malaysia was our first stop, but there we were not allowed to get ashore. We were compelled to head for another direction and headed for Indonesia. Through the assistance of a German priest in Indonesia, we were all admitted in a refugee camp in Tanjung Pinang. My married daughter gave birth to a baby son a few weeks after our arrival in Indonesia. Before I received any news from my son living in France FOIA (b)(6) a representative of the High Commissionary for Refugees came to visit us. We took that opportunity to register for re-settlement in France to be reunited with my son. Unfortu- nately, when I was able to communicate with my son, I learned that he was ready to go to the US to join his future wife and had decided to re-settle definitely in the US. Upon his confirmation, my son-in-law wrote to the Office of the High Commissionary for Refugees in Kuala Lumpur/Malaysia, expressing our strong desire to go to the US, as my son would no longer be in France. While waiting for the reply of the High Commissionary for Refugees, we were informed that our visa appli- cations to France had been granted. We tried to explain to the local authorities our actual situation, and requested to be allowed to remain in Indonesia waiting for the final decision of the Office of High Commissionary for Refugees. The request was not approved. We had no other choice but to go to France. We arrived in France on December 21. 1976. FOIA (b)(6) FOIA (b)(6) FOIA (b)(6)"
}
