{
  "anumber": "A20865114",
  "id": "A20865114_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20865114_0072/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/17/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "France",
        "Vietnam"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1942,
        1971,
        1938,
        1948,
        2023,
        1976,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 HOANG Thi Oanh (widow of: NGUYEN Tuong) Born: in 1915 in Vietnam Nationality: Vietnamese Paragraph 12 Name of children Date of birth Place of birth Present address NGUYEN Thi Hong in 1938 Binh Dinh/ 118/1 Ton That Hiep Loan Center Vietnam Phu Tho, Cholon, Saigon, S. Vietnam NGUYEN Thi Thu in 1942 Binh Dinh/ \" 11 Huong Center Vietnam NGUYEN Thi Kim in 1946 Nhatrang, 30/1 Duong Cong Trung Thanh Center Vietnam saigon, S. Vietnam NGUYEN Thi Ngan Aug. 15, 1948 Kien An (Qui Refugee Center, \"Foyer Nhon) S. Vietnam Sonacotra\", 1 Rue des Verriers, 21-DIJON, France FOIA (b)(6) Paragraph 6: Reasons of Departure My husband passed away in 1971 in South Vietnam. We have 9 children; one is presently residing in the US, three in France with me and five still are stranded in Vietnam. I fled Vietnam on October 19, 1976 by boat together with one single daughter, one married daughter with her husband and one widowed daughter and her four children, aboard a fishing-boat. I spent more than one and a half harrowing years in Vietnam following the arrival of the Communists into power. We used to earn our living as small merchant dealers, but with the fall of Vietnam, our grocery store was forced to close down as we were"
}