{
  "anumber": "A20866872",
  "id": "A20866872_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20866872_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title of the image: I-455 SUPPLEMENT FOR ISSUANCE OF I-551, Form number: L-485"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "I-485 SUPPLEMENT FOR ISSUANCE OF I-551 A20 866 872 TomcHiNsky Leib ALIEN NUMBER LAST NAME FIRST NAME MIDDLE NAME green card IN CARE OF ADDRESS 3033 Brighton 14street AptA6 NUMBER/STREET Brooklyn N.Y. 11235 CITY STATE ZIP CODE HAYA Itzik USSR MOTHER'S FIRST NAME FATHER'S FIRST NAME CITY/TOWN/VILLAGE OF BIRTH New York New york NAYANA CITY OF RESIDENCE WHEN CITY OF DESTINATION AT LOCATION OF CONSULATE APPLYING FOR THIS STATUS TIME OF ORIGINAL ADMISSION OR IMMIGRATION OFFICE TO THE UNITED STATES WHERE ADJUSTED 3/22/1906 New-York New-York USSR DATE OF BIRTH PORT OF ENTRY DATE OF ENTRY COUNTRY OF OR ADJUSTMENT BIRTH COLOR PHOTOGRAPH SPECIFICATIONS SAMPLE PHOTOGRAPH HEAD SIZE(INCLUDING HAIR) MUST FIT INSIDE OVAL 224MA CHIN SUBMIT Two (2) COLOR PHOTOS MEETING THE FOLLOWING SPECIFICATIONS 22MM (7/8\") HEAD WIDTH PHOTOGRAPH MUST SHOW THE SUBJECT IN A He FRONTAL PHOTOGRAPH MUST NOT BE PASTED ON CARDS OR MOUNTED PORTRAIT AS SHOWN ABOVE IN ANY WAY RIGHT EAR MUST BE EXPOSED IN PHOTOGRAPH FOR ALL AP- Two (2) PHOTOGRAPHS OF EVERY APPLICANT, REGARD. PLICANTS, HATS MUST NOT BE WORN LESS OF AGE. MUST BE SUBMITTED PHOTOGRAPH OUTER DIMENSION MUST BE LARGER THAN 1 1/4 X11/4 BUT HEAD SIZE (INCLUDING HAIR) MUST FIT WITHIN PHOTOGRAPHS MUST BE TAKEN WITHIN THIRTY (30) DAYS OF APPLICATION DATE THE ILLUSTRATED OVAL (OUTER DIMENSION DOES NOT INCLUDE BORDER IF ONE IS USED) SNAPSHOTS, GROUP PICTURES, OR FULL LENGTH PORTRAITS PHOTOGRAPH MUST BE COLOR WITH A WHITE BACKGROUND WILL NOT BE ACCEPTED EQUAL IN REFLECTANCE TO BONO TYPING PAPER USING CRAYON OR FELT PEN, TO AVOID MUTILATION OF THE SURFACE OF THE PHOTOGRAPH MUST BE GLOSSY PHOTOGRAPHS, LIGHTLY PRINT YOUR NAME (AND ALIEN REGISTRATION RECEIPT NUMBER IF KNOWN) ON THE BACK OF PHOTOGRAPH MUST NOT BE STAINED, CRACKED, OR MUTI. ALL PHOTOGRAPHS LATED, AND MUST UE FLAT IMPORTANT NOTE-FAILURE TO SUSMIT PHOTOGRAPHS IN PHOTOGRAPHIC IMAGE MUST BE SHARP AND CORRECTLY EX- COMPLIANCE WITH THESE SPECIFICATIONS WILL DELAY THE POSED, PHOTOGRAPH MUST BE UN-RETOUCHED PROCESSING OF YOUR APPLICATION ER 531 11-78(15)"
}