{
	"anumber": "A20865114",
	"id": "A20865114_0088",
	"page_index": 88,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20865114_0088/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, 20537"
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 1. LOOP APPLICANT CENTER TO OBTAIN CLASSIFIABLE FINCERPRINTS: OF LOOP 1. USE BLACK PRINTER'S INK. 2 DISTRIBUTE litk EVENLY Oil INKING SLAB 3. WASH AND DRY FINGERS THOROUCHLY. 4. ROLL FINGERS FROM MAIL TO NAIL AND AVOID ALLOWING FINGERS TO SLIP. 5. DESURE IMPRESSIONS ARE RECORDED IN CORRECT ORDER 6. IF AN AMPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER MAKE A NOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER BLOCK DELTA 7. IF SOME PHYSICAL CONDITION MAKES IT IMPOSSIBLE TO OSTAIN PERFECT IMPRESSIONS, SUBMIT THE BEST THAT CAN BE OSTAINED WITH A MEMO STAPLED TO THE CARD EXPLAINING THE CIR= CUNSTANCES 8. EXAMINE THE COMPLETED PRINTS TO SEE IF THEY CAN BE CLASSIFIED BEARING IN MIND THAT THE LINES BETWEEN CENTER OF MOST FINGERPRINTS FALL INTO THE PATTERNS SHOWN ON THIS CARD (OTHER PATTERNS OCCUR LOOP AND DELTA MUST SHOW INFREQUENTLY AND ARE NOT SHOWN HERE). 2. WHORL THIS CARD FOR USE BY: LEAVE THIS SPACE BLANK 1. LAW ENFORCEMENT AGENCIES IH FINGERPRINTING APPLI. CANTS FOR LAW ENFORCEMENT POSITIONS.* DELTAS 2. OFFICIALS DP STATE AND LOCAL GOVERNMENTS FOR PUR. POSES OF EMPLOYMENT LICENSING AND PERMITS AS AUTHOR ITED BY STATE STATUTES AND APPROVED BY THE ATTORNEY GENERAL OF THE UNITED STATES LOCAL AND COUNTY NAMCES UNLESS SPECIFICALLY BASED STATUTES 00 NOT SATIFY ILLEGIBLE PRINT 3. U.S.COVERNMENT AGENCIES IN ANCES.** 2-5- 4. OFFICIALS OF FEDERALLY CHARTERE INC INSTITUTIONS TO PROMOTE OI: MAINT REASON OF THOSE INSTITUTIONS. NO ARREST RECORD BY NAME THESE LINES RUNNING BETWEEN INSTRUCTIONS: FBI IDENTIFICATION DIVISION DELTAS MUST BE CLEAR \"1. PRIATE STATE THOSE 3. ARCH FINCERPRANTS WHICHLING HAS EEEN FOUND LOCALLY DE SUGATTED For FBI SEARCH 19 2. PRIVACY ACT OF FED. ERAL STATE, OR is Invoice SUCH OF DETAILS IT. IN IS PRINT CARD TO KISHED ESPACE RECO REGO FORCES NO., RECORDED PASSPORT NO (PPY ALIEN FCRT SE- ARCHES HAVE NO DELTAS CURITY CARD NO. (PS). SELECTIVE SERVICE NO. (55), VETER ANS ADMINISTRATION CLAIM NO. (YA.) DEC 23 1977 255 (Hav. 1-17-21) n U.S. GOVERNMENT PRINTING OFFICE 1975 595-270 IDENT. DIV. 42 C"
}
