{
  "anumber": "A20979192",
  "id": "A20979192_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Standard Accident Insurance Company, Form No. 1023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 (Page 2) Automobile Bodily Injury Liability Policy Standard Accident Insurance Company DETROIT, MICHIGAN (A STOCK INSURANCE COMPANY, HEREIN CALLED THE COMPANY) Agrees with the insured, named in the declarations made a part hereof, in consideration of the payment of the premium and in reliance upon the statements in the declarations and subject to the limits of liability, exclusions, conditions and other terms of this policy: INSURING AGREEMENTS I Coverage A-Bodily Injury Liability To pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of bodily injury, sickness or disease, including death at any time resulting therefrom, sustained by any person, caused by accident and arising out of the ownership, maintenance or use of the auto- mobile. Coverage C-Medical Payments To pay all reasonable expenses incurred within one year from the date of accident for necessary medical, surgical, ambulance, hospital, professional nursing and funeral services, to or for each person who sustains bodily injury, sickness or disease, caused by accident, while in or upon, entering or alighting from the automobile if the automobile is being used by the named insured or with his permission. II. Defense, Settlement, Supplementary Payments As respects the insurance afforded by the other terms of this policy under coverage A the company shall: (a) defend any suit against the insured alleging such injury, sickness, disease or destruction and seeking damages on account thereof, even if such suit is groundless, false or fraudulent; but the company may make such investigation, negotiation and settlement of any claim or suit as it deems expedient; (b) pay all premiums on bonds to release attachments for an amount not in excess of the applicable limit of liability of this policy, all premiums on appeal bonds required in any such defended suit, the cost of bail bonds required of the insured in the event of accident or traffic law violation during the policy period, not to exceed the usual charges of surety companies nor $100 per bail bond, but without any obligation to apply for or furnish any such bonds; (c) pay all expenses incurred by the company, all costs taxed against the insured in any such suit and all interest accruing after entry of judgment until the company has paid, tendered or deposited in court such part of such judgment as does not exceed the limit of the company's liability thereon; (d) pay expenses incurred by the insured for such immediate medical and surgical relief to others as shall be imperative at the time of the accident; (e) reimburse the insured for all reasonable expenses, other than loss of earnings, incurred at the company's request. The amounts incurred under this insuring agreement, except settlements of claims and suits, are payable by the company in addition to the applicable limit of liability of this policy. III Definition of Insured With respect to the insurance for bodily injury liability the unqualified word \"insured\" includes the named insured and also includes any person while using the automobile and any person or organization legally responsible for the use thereof, provided the actual use of the automobile is by the named insured or with his permission. The insurance with respect to any person or organization other than the named insured does not apply: a) to any person or organization, or to any agent or employee thereof, operating an automobile repair shop, public garage, sales agency, service station or public parking place, with respect to any accident arising out of the operation thereof; (b) to any employee with respect to injury to or sickness, disease or death of another employee of the same employer injured in the course of such employment in an accident arising out of the maintenance or use of the automobile in the business of such employer. IV Automobile Defined, Trailers, Two or More Automobiles (a) Automobile. Except where stated to the contrary, the word \"automobile\" means: (1) Described Automobile-the motor vehicle or trailer described in this policy; (2) Utility Trailer-a trailer not so described, if designed for use with a private passenger automobile, if not being used with another type automobile and if not a home, office, store, display or passenger trailer; (3) Temporary Substitute Automobile-an automobile not owned by the named insured while temporarily used as the substitute for the described automobile while withdrawn from normal use because of its breakdown, repair, servicing, loss or destruction; (4) Newly Acquired Automobile-an automobile, ownership of which is acquired by the named insured who is the owner of the described automobile, if the named insured notifies the company within thirty days following the date of its delivery to him, and if either it replaces an automobile described in this policy or the company insures all automobiles owned by the named insured at such delivery date; but the insurance with respect to the newly acquired automobile does not apply to any loss against which the named insured has other valid and collectible insurance. The named insured shall pay any addi- tional premium required because of the application of the insurance to such newly acquired automobile. (b) Semitrailer. The word \"trailer\" includes semitrailer. (c) Two or More Automobiles. When two or more automobiles are insured hereunder, the terms of this policy shall apply separately to each, but a motor vehicle and a trailer or trailers attached thereto shall be held to be one automobile as respects limits of liability. V Use of Other Automobiles If the named insured is an individual who owns the automobile classified as \"pleasure and business\" or husband and wife either or both of whom own said automobile, such insurance as is afforded by this policy with respect to said automobile applies with respect to any other automobile, subject to the following provisions: (a) With respect to the insurance for bodily injury liability the unqualified word \"insured\" includes (1) such named insured, (2) the spouse of such individual if a resident of the same household and (3) any other person or organization legally responsible for the use by such named insured or spouse of an automobile not owned or hired by such other person or organization. Insuring Agree- ment III, Definition of Insured, does not apply to this insurance. (b) This insuring agreement does not apply: (1) to any automobile owned by, hired as part of a frequent use of hired automobiles by, or furnished for regular use to the named insured or a member of his household other than a private chauffeur or domestic servant of the named insured or spouse; (2) to any automobile while used in the business or occupation of the named insured or spouse except a private passenger auto- mobile operated or occupied by such named insured, spouse, chauffeur or servant; (3) to any accident arising out of the operation of an automobile repair shop, public garage, sales agency, service station or public parking place; (4) under coverage C, unless the injury results from the operation of such other automobile by such named insured or spouse or on behalf of either by such chauffeur or servant, or from the occupancy of said automobile by such named insured or spouse. VI Policy Period, Territory, Purposes of Use This policy applies only to accidents which occur during the policy period, while the automobile is within the United States of America, its territories or possessions, Canada or New- foundland, or is being transported between ports thereof, and is owned, maintained and used for the purposes stated as applicable thereto in the declarations. VII Purposes of Use Defined (a) The term \"pleasure and business\" is defined as personal, pleasure, family and business use. (b) The term \"commercial\" is defined as use principally in the business occupation of the named insured as stated in item I of the declarations, including occasional use for personal, pleasure, family and other business purposes. (c) Use of the automobile for the purposes stated includes the loading and unloading thereof,"
}