{
  "anumber": "A20979192",
  "id": "A20979192_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF HEALTH, EDUCATION, AND WELFARE, FORM CAR-7014a ( (11-75)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1971,
        1937,
        1972,
        1974,
        1973,
        2023,
        1951,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 FORM CAR-7014a (11-75) DEPARTMENT OF HEALTH, EDUCATION, AND WELFARE SOCIAL SECURITY ADMINISTRATION BALTIMORE, MARYLAND 21235 SOCIAL SECURITY NUMBER 556-30-4579 We are pleased to furnish you information about your social security earnings. Shown below are the earnings now recorded for you. PERIOD EARNINGS 1937 THRU 1950 $ 17,041.45 1951 THRU 1971 91,937.80 1972 5,486.66 1973 5,500.00 1974 6,338.00 1975 THRU DEC 7,002.50 TOTAL - 1937 THRU DEC 1975 $ 133,306.41 Our records may not show all the earnings a person had in the last calendar year because of the time required to receive and process reports. One of the requirements for a person to receive benefits at retirement age or later is that he must work long enough under social security to give him an insured status. Insured status is measured in quarters of cover- age and the number of quarters of coverage a person needs depends on the date of his birth. However, in no case will a person need more than 40 quarters of coverage at retirement age. OUR RECORDS SHOW YOU NOW HAVE AT LEAST 40 QUARTERS OF COVERAGE. The insured status information above applies only to retirement benefits. For information regarding eligibility for disability, survivors, or health insurance benefits, get in touch with the social security office most con- venient to you. If this statement does not agree with your own record, please get in touch with any social security office. Most questions can be handled by telephone or mail. Enclose the statement if you write or take it with you if you visit one of our offices. Unless you report an error within 3 years, 3 months, and 15 days after the year in which you were paid wages or after the taxable year in which you derived self-employment income, correction of our records may not be possible. The enclosed booklet contains a brief summary of the social security program, information about your social security earnings record, and a further explanation of the action you should take if you do not agree with this statement. Answers to any specific question you have asked will be found on the pages checked in the booklet index. The people in any social security office will be pleased to answer other questions you may have about the social security program. Director Bureau of Data Processing This document is returned. It is infussi Enclosure insufficient. You must proove continuous residence. The years in question are 1951 to 1971. Ask Social Security for a yearly record for those years. The fact that you made over 90,000 dollars over those twenty years does not preclude the possibility that you may have spent some of them outside of the U.S."
}