{
  "anumber": "A20968145",
  "id": "A20968145_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20968145_0051/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ICAL Examination of Applicants for United States Visas, 50157-102"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PLACE Y ICAL EXAMINATION OF APPLICANTS New Delhi FOR UNITED STATES VISAS DATE OF EXAMINATION 20th Oct. 1982 CITY At the request of the American Consul at New Delhi COUNTRY India NAME AGE SEX I certify that on the above date I examined MR. CHUNI LAL NARANG 74yrs M WHO BEARS PASSPORT NO. ISSUED BY ON J-914707 Bombay 7/6/74 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) X CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A, B, or C-diagnosis, and pertinent details*): Class B- Defective vision both eyes 20th Oct. 1982 Normal Chest X-ray report from Dr. S. Aggarwal V.D.R. L-Nonmreactive Blood serological report from Dr. N.P.S. Chawla Non Other special report(s) (when needed) from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT MBBS MRCP. FICA. FACC. FCCP21st Oct.1982 50157-102 *Continue on reverse side if necessary. GPO : 1981 o - 341-526 (7150) OPTIONAL FORM 157 (Rev. 5-78) (DR. N.P.S. CHAWLA) Dept. of State"
}