{
  "anumber": "A20979192",
  "id": "A20979192_0084",
  "page_index": 84,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0084/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        2023,
        1913,
        1976,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 AFFIDAVIT San Bernardino, California February 19,1975 TO WHOM IT MAY CONCERN: I, Maria Dolores E. Garcia, residing at 1395 Union Street in the City of San Bernardino, State of California, do hereby state, under oath, the following facts: First, the family of Bruno Palos, also known as Bruno Mares, and my family were very close friends. I have known Bruno Palos since he was 5 years old. Second, Bruno's mother brought him to California in 1915. Her name was Felicitas Ornelas. After coming to California she married Santos Tello. They moved to Salt Lake City, Utah, where Santos died. Third, after the death of Santos Tello Felicitas lived with Manuel mares in common-law marriage. And when Bruno started to school, he was registered as Bruno Mares. Fourth, Bruno's true father's name was Feliciano Palos. He died in Mexico before Bruno and his mother came to California. Fifth, Bruno was born in Rio Chico, Jalisco, Mexico on October 6, 1913. He was baptized in Trinidad, Jalisco, Mexico. Signed, maria to E-garcia Maria D.E. Garcia, affiant ACKNOWLEDGEMENT STATE OF CALIFORNIA ) ) SS COUNTY OF San Bernardino) On February 19, 1975 before me, Laura N Raibon, Notary Public in and for said County and State personally appeared MARIA DOLORES E. GARCIA known to me to be the person whose name is subscribed to the within instrument and acknowledged to me that she executed the same. IN WITNESS WHEREOF, I have hereunto set my hand and affixed my official seal the day and year first above written. Laura WRasban Lau-ra N Raibon, Notary Public LAURA N. RAIBON in and for said County and State NOTARY PUBLIC SAN BERNARDINO COUNT CALIFORNIA My Commission Expires May 31, 1976"
}