{
	"anumber": "A20982512",
	"id": "A20982512_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20982512_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Adjustment of Status,, I-451."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1951]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Block 1. - Information About Alien Beneficiary (Continued) 21. Address in the United States where beneficiary will reside (City) (State) 2837 Loma CLinda dr Baho held Co. 93305 22. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (Zip Code, if in U.S.) 462/55 Le van Deceft SAIGON 23. If beneficiary is in the United States, give the following information concerning beneficiary: SODTH UTE TNAM a. He last arrived in the U.S.on b. He last arrived in U.S. as C. Show date beneficiary's stay expired or will (Month) (Day) (Year) (Visitor, student, exchange alien, crewman, stowaway, etc.) expire as shown on his Form I-94 or I-95: none d. Name and address of present employer e. Date alien began this employment 24. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in SAI GON (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) LEN Block II - Information About Petitioner 25. My name is Lem TH/ (Last) Difference (First) (Middle) 26. Other names used; (including maiden name if married woman) none 27. I reside in the United States at (C/O, if appropriate) (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) 2837 Edoma Lemote Ca 93305 28. Address abroad (if any) (Number and street) (Town or city) (Province) (Country) 469/55 Le vein 29. I was born: (Month) (Day) (Year) in: Digit (Town or city) (State or Province) (Country) 27 1951 Hie SOUTHX OIF 30. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate, and date and place of naturalization: LEN This RITC 9829734 Nov 2.1 19.73 (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition ? host (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with Instruction 4a. (2). Bokerspieed b. Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. Certified 31. If you are a lawful permanent resident alien of the United States, give the following: returned. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence Gorrect 30-440 973 Contact 9824334 copya Have you ever lost status as a lawful permanent resident alien? a If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) 32. Have you attached all required documents (see instruction No. 4) Yes Clair Block III. Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 6) 1 Ritchee Subscribed and sworn to (affirmed) before this day of me A.D. (SEAL) My commission explies OATHS DISNATED UNDER (SIGNATURE OF OFFICER ADMINIST ERING OATHY I declare that this document was prepared by me at the request of the petitioner and is based on all information of they (TITLE) Block IV.-Signature of Person Preparing Form, If Other Than Petitioner which I have any knowledge. (SIGNATURE) (ADDRESS) (DATE)"
}
