{
  "anumber": "A20979192",
  "id": "A20979192_0139",
  "page_index": 139,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0139/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit for Persons 14 Years of Age and Older"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1940
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 10. I am, or have been within the past 5 years, or intend to be engaged in the following activities: OFFICE In addition to other information, list memberships or activities in clubs, organizations, or societies USE A.C.J.M. CLUB, CATHOLIC CHURCH 5165 6801 NONE 11. My military or naval service has been (COUNTRY) 9 From to (BRANCH OF SERVICE) (DATE) (DATE) 12. I HAVE NOT applied for first citizenship papers in the United States. Date of application (HAVE. HAVE NOT) First citizenship papers received , , 0 (DATE) (NUMBER) (CITY) (STATE) Filed petition for naturalization , , (DATE) (CITY) (STATE) 13. have the following specified relatives living in the United States: NONE YES NONE Parent(s) Husband or wife Children (NONE, OR ONE. OR BOTH) (YES OR NO) (NUMBER) 14. I HAVE been arrested or indicted for, or convicted of any offense (or offenses). These offenses are: (HAVE. HAVE NOT) Nature of offense Date of arrest Place of arrest Disposition of case SUSPION OF ROB- SEPT. 1933 SALT LAKE CITY DISMISSED BERY UTAH 15. Within the past 5 years I HAVE NOT been affiliated with or active in (a member of, official of, a (HAVE. HAVE NOT) worker for) organizations, devoted in whole or in part to influencing or furthering the political activities, public relations, or public policy of a foreign government. AFFIDAVIT FOR PERSONS 14 YEARS OF AGE AND OLDER Subscribed and sworn to (or I have read or have had read to me the above statements, and affirmed) before me at the place and do hereby swear (or affirm) that these statements are true and on the date here designated by the complete to the best of my knowledge and belief. official post-office stamp below. Bruno Ormlas Palos (SIGNATURE OF REGISTRANT) Harmon (REGISTERING OFFICIAL) H. Day AFFIDAVIT FOR PARENT OR GUARDIAN ONLY PRINT NAME. ADDRESS, AND BUSINESS OF PERSON SIGNING THIS AFFIDAVIT IN 9 (c), I am the ABOVE. (PARENT OF. OR GUARDIAN OF. OR PERSON RESPONSIBLE FOR) Subscribed and sworn to (or the above-named alien, who is (UNDER 14 YEARS OF AGE. OR INSANE) affirmed) before me at the place and and have made the above allegations for him (or her). I have on the date here designated by the DEPARTMENT NOV 7 STATE read or have had the same read to me, and do hereby swear official post-office stamp at the (or affirm) that they are true and complete to the best of my right. 1940 knowledge, information, and belief. REGISTERED (SIGNATURE OF PARENT OF. OR GUARDI OR PERSON RESPONSIBLE FOR THE ALIEN) (REGISTERING OFFICIAL) 16-16415 GPO"
}