{
  "anumber": "A20979192",
  "id": "A20979192_0138",
  "page_index": 138,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0138/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION FORM, 39612256"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1916
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 Form AR-2 OFFICE USE 3967256 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION FORM OFFICE USE 1. (a) My name is BRUNO ORNELAS PALOS 420 (FIRST NAME) (MIDDLE NAME) (LAST NAME) (b) I entered the United States under the name of SAME (c) I have also been known by the following names NONE (include maiden name if a married woman, professional names, nicknames, and aliases): 156 E. 7th ST., CLAREMONT, LOS ANGELES, CALIFORNIA 00 2. (a) I live at (STREET ADDRESS OR RURAL ROUTE) (CITY) (COUNTY) (STATE) 30 (b) My post-office address is SAME 04 (POST OFFICE) (STATE) 3. (a) I was born on OCTOBER 6 1914 14 (MONTH) (DAY) (YEAR) (b) I was born in (or near) TEOCALTICHE JALISCO MEXICO, (CITY) (PROVINCE) (COUNTRY) I am a citizen or subject of MEXICO (COUNTRY) 5. (a) I am a (check one): (b) My marital status is (check one): 2 2 Male Female 1 2 3 4 0 Single Married Widowed Divorced 1 (c) My race is (check one): White 2 3 Negro Japanese Chinese 4 Other / I am 5 feet, 8 inches in height, weigh 145 pounds, have BLACK BROWN 6. hair and eyes. 084 (COLOR) (COLOR) 7. (a) I last arrived in the United States at EL PASO TEXAS on AUG. 1916 08X-16 (PORT OR PLACE OF ENTRY) (MONTH. DAY. AND YEAR) (b) I came in by RAILROAD LAND (NAME OF VESSEL, STEAMSHIP COMPANY. OR OTHER MEANS OF TRANSPORTATION) 1 (c) I came as a (check one): Passenger 2 Crew member 3 Stowaway Other (d) I entered the United States as a (check one): Permanent resident 1 2 3 Visitor Student 4 5 6 Treaty merchant Seaman Official of a foreign government Employee of a 7 foreign government official Other / 0 (e) I first arrived in the United States on AUG. ? 1916 (MONTH) (DAY) (YEAR) 8. (a) I have lived in the United States a total of 24 years. 24 (b) I expect to remain in the United States PERMANENTLY 5 (PERMANENTLY. OR DURATION OF EXPECTED STAY) LABORER NONE 9. (a) My usual occupation is (b) My present occupation is (c) My employer (or registering parent or guardian) is (NAME) whose address is IX (STREET ADDRESS OR RURAL ROUTE) (CITY) (STATE) and whose business is All items must be answered by persons 14 years of age, or older. For children under 14 years of age, only the items marked with a star (*) must be answered by the parent or guardian. All answers must be accurate and complete. 16-16415 U. S. GOVERNMENT PRINTING OFFICE"
}