{
	"anumber": "A20979192",
	"id": "A20979192_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, Form G-325A ( (REV. 8-27-72N)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' retired', 'clerk']"
			},
			"nationality": {
				"nationality_llm_v1": "Mexican"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 8-27-72)N Screened by NARA. 4/27/2023 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 BIOGRAPHIC Immigration and Naturalization Service LOS/DITRA 249 INFORMATION 5-12-75 A20 979 192 o (Family name) (First name) (Middle name) : MALE BIRTHDATE(Mo.-Day-Yr. NATIONALITY ALIEN REGISTRATION NO. PALOS BRUNO ORNELAS FEMALE Oct. , 6, 1914 Mexican (If any) 3967256 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Teocaltiche, Mexico (If any) 356-30-4579 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER Palos Feliciano Mexico Mexico MOTHER(Maiden name) Ornelas Felicitas \" #2 HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE La Verne, Molina Mary 5/39/14 Parras, Mex. 6/9/35 Calif. FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 29o Princeton Avenue Claremont Calif. USA Aug. 55 PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Bill Bentley (Bentley's Market) Clerk 7 48 PRESENT TIME 235 Yale Avenue Claremont, Calif. 91711 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): Brund Pales IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. A20 979 192 COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) PALOS BRUNO ORNELAS 3967256 (OTHER AGENCY USE) INS USE (Office of Origin) FORM G-325A (4) Consul"
}
