{
  "anumber": "A20979192",
  "id": "A20979192_0113",
  "page_index": 113,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0113/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AGREEMENT FOR SALE OF LAND."
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1948
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 1 AGREEMENT FOR SALE OF LAND. 2 3 The following is a MEMORANDUM OF AGREEMENT for the sale 4 of land, between LEISA G. BRONSON, hereinafter referred to as 5 Grantor, and BRUNO PALOS and MARY PALOS, husband and wife, herein- 6 after referred to as Grantees; the real property, subject of 7 this transfer, is described as follows: 8 The easterly 54.75 feet of the Westerly 95.24 feet 9 (distances measured on the Southerly line) of the 10 Southerly 101 feet measured parallel with the Westerly 11 line of Lot 50 of Tract 1,008, in the City of Clare- 12 mont, County of Los Angeles, State of California, as 13 per map recorded in Book 17, pages 62 and 63 of Maps in 14 the Office of the County Recorder of said County. 15 WHEREAS Grantor desires to sell and Grantees desire to 16 buy said above-described real property in consideration that 17 Grantor grants to Grantees all of her interest in said property, 18 Grantees agree to pay Five Thousand Dollars $5,000) to Grantor, 19 payable in equal monthly installments to be payable on the 15th 20 of each and every month month commencing on August 15, 1948, 21 said installments to be for Thirty and 30/100 Dollars ($30.30) each, 22 and represent equally apportioned monthly payments on said Five Thou- 23 sand Dollars ($5,000) with interest at four per cent (4%), Grantees 24 to execute a note to Grantor to secure said indebtness and Grantees 25 also to execute a Deed of Trust to secure such note, on the above- 26 described property with Mary C. Bronson as Trustee and Leisa G. 27 Bronson, Grantor, as Beneficiary. 28 It is understood by and between the parties hereto 29 that the Grantor, in granting said above described real property 30 to the Grantees, assumes payment of all costs and charges 31 on account of construction of the dwelling thereon, recently 32 CARTER. YOUNG & ZETTERBERG ATTORNEYS AT LAW FIRST NAT'L BLDG POMONA. CALIF. -1-"
}