{
	"anumber": "A20968145",
	"id": "A20968145_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20968145_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2230 ( (English) (Rev. 7–79)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "Mexico", "India", "United States", "Pakistan"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1946, 1975, 1979, 1968, 1974, 1981, 1926, 1976, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OPTIONAL FORM 230 (English) (Rev. 7-79) Page 2 24. Personal financial resources (a) Cash Rs. 5, 1000/- (c) Real estate (value) NIL (b) Bank deposits Rs.77,000/- (d) Other (describe) NIL 25. Father's name, address, date and place of birth (If deceased, so state giving year of death) MEHRCHAND NARANG, TALAGANG, W. PUNJAB, INDIA (now Pakistan) Died in 1946 26. Mother's maiden name, address, date and place of birth (If deceased, so state giving year of death) WAZIRDEVI, TALAGANG, WEST PUNJAB, INDIA (now PAKISTAN) died in 1947 27. Name, address and relationship of next of kin in home country (If neither parent is living) KRISHANLAL NARANG, TAPOVAN, DEHRADUN (U.P.), INDIA - BROTHER 28. List all places of residence for 6 months or more since your sixteenth birthday City or town Province Country Dates (From-To) Calling or occupation SEE ANNEXURE II 29. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Type of membership and Name and address Dates (From: To) 1) ATTACK ELECTRIC SUPPLY CO. LTD 1926 to 1947 office held, if any Secretary - Service Gita Bhavan, Lahore, India 2) Life Ins.Corpn. of India Fort Bombay 1949 to 1968 (Before inationalisation,: it was Oriental Life Ins Co. Branch Manager ) 30. List all languages, including your own, that you can speak, read and write Language Speak Read Write HINDI /ENGLISH Yes Yes Yes URDU Yes Yes Yes 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) 17-7-1974 to 17-9-1976 IM IGRANT VISA 18-8-1979 to 17-7-1981 IMMIGRANT VISA 32. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder. drug addiction or Yes No alcoholism? (If answer is Yes, explain) 33. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse Yes No or other charitable institution? (If answer is Yes, explain) 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or Yes No similar action? (If answer is Yes, explain) 35. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether Yes No you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) NON IMMIGRANT in BOMBAY in 1974 and then IMMIGRANT VISA in LOS ANGELES in 1975. 36. Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) Yes No 37. Have you ever registered with a draft board under United States Selective Service Laws? Yes No (If answer is Yes, explain) 38. Have you ever applied for relief from training and service in the United States armed forces or departed from Yes No or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) 39. Do d to enter the United States from Canada, Mexico or an island adjacent to the United States Yes No wi ars after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the ns tion company by which you entered or intend to enter Canada, Mexico or such island)"
}
