{
	"anumber": "A20979192",
	"id": "A20979192_0070",
	"page_index": 70,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0070/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Standard Accident Insurance Company, 219060"
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1946, 1395, 1948, 2023, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 Automobile Bodily Injury Liability Policy Standard No. J 219060 Accident Insurance Company DETROIT, MICHIGAN A Stock Company DECLARATIONS ITEM I NAME AND ADDRESS OF INSURED Liability the PALOS BRUNO 0 company Name and address of additional Insured (if any) P 0 BOX 373 CLAREMONT CALIF and of 2 The contained is POLICY PERIOD FROM JUNE 29TH 1949 TO 12:01 A. M. STANDARD TIME AT THE ADD OF THE NAMED INSURED AS STATED HEREIN JUNE 29TH 1950 THE AUTOMOBILE WILL BE PRINCIPALLY GARAGED IN THE ABOVE TOWN, COUNTY AND STATE UNLESS OTHERWISE SPECIFIED HEREIN THE OCCUPATION OF THE NAMED INSURED IS INDIVIDUAL COPARTNERSHIP CORPORATION ESTATE GROCER NO EXCEPTIONS INSURER HAS CANCELLED ANY AUTOMOBILE INSURANCE ISSUED TO THE NAMED INSURED, DURING THE PAST YEAR, EXCEPT AS HEREIN STATED: III THE PURPOSES FOR WHICH THE AUTOMOBILE IS TO BE USED ARE PLEASURE AND BUSINESS COMMERCIAL A1 IV DESCRIPTION OF THE AUTOMOBILE: YEAR & MODEL TRADE NAME TYPE OF BODY MOTOR NUMBER SERIAL NUMBER 1940 014 DODGE 2DR SDN 014 85617 30270103 NEW OR USED DATE PURCHASED ACTUAL COSTS TO INSURED MONTH YEAR INCLUDING EQUIPMENT V EXCEPT WITH RESPECT TO BAILMENT LEASE. CONDITIONAL SALE, MORTGAGE OR OTHER ENCUMBRANCE THE NAMED INSURED IS THE SOLE OWNER OF THE AUTOMOBILE, EXCEPT AS HEREIN STATED USED JUNE 1946 1395 is not required by or and principal VI THE INSURANCE AFFORDED IS ONLY WITH RESPECT TO SUCH AND so MANY OF THE FOLLOWING COVERAGES AS ARE INDICATED BY SPECIFIC PREMIUM CHARGE OR CHARGES. THE LIMIT OF THE COMPANY'S LIABILITY AGAINST EACH SUCH COVER. AGE SHALL BE AS STATED HEREIN, SUBJECT TO ALL OF THE TERMS OF THE POLICY HAVING REFERENCE.THERETO. COVERAGES LIMITS OF LIABILITY t POLICY NO. PREMIUMS (A) BODILY INJURY LIABILITY $ 10 000 EACH PERSON 20 000 EACH ACCIDENT J 219060 $20 70 (C) MEDICAL PAYMENTS $ 1 000 EACH PERSON (NAMED INSURED INCLUDED) 6 00 PROPERTY DAMAGE 5000 15 00 ® Not Agent of the Company, Form Auto 82 Ed. Jan. 1948 (C & J) 100 M-4-49 (Page 1)"
}
