{
  "anumber": "A20979192",
  "id": "A20979192_0071",
  "page_index": 71,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0071/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Property Damage Liability Endorsement, J 219060"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "boricx BEHIGD EIROPE Screened by NARA, 4/27/2023 1020 Standard Insurance Company NYNE VDDBESS 08 IMBARRD 138 also USING Property Damage Liability Endorsement For Company use only Not valid unless countersigned by a duly authorized agent of the company 15.00 In consideration of an additional premium of $ , it is hereby understood and agreed that the policy to which this endorsement is attached and of which it forms a part, is amended as follows: 1. The following paragraph is added to and made a part of Insuring Agreement I of said policy, as fully and completely as though wholly written or printed therein: Coverage B-Property Damage Liability To pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of injury to or destruction of property, including the loss of use thereof, caused by accident and arising out of the ownership, main- tenance or use of the automobile. 2. The provisions and limitations contained in the Insuring Agreements II, III, IV, V, VI and VII, Exclusions (a), (b) and (c) and Conditions 3, 4, 5, 6, 7, 8, 10, 12, 14, 15, 16 (the portion stated as applicable to Coverage A), 17 and 18 shall apply to Coverage B. 3. The following additional exclusion is added to and made a part of the Exclusions of said policy, as fully and completely as though wholly written or printed therein: (g) under Coverage B, to injury to or destruction of property owned by, rented to, in charge of or trans- ported by the insured. 4. The limit of the Company's liability against the Property Damage Liability insurance provided hereunder shall be $ 5,000 each accident. This endorsement forms a part of Policy No. J 219060 issued to Bruno 0. Palos , and is effective from June 29 , 19 49 12:01 A.M., standard time at the named insured's address. Standard Accident Insurance Company Countersigned by Authorized Agent Kshrowing Form Auto 138 Ed. Oct. 1947 (C. & J.) Secretary 50M-1-49"
}