{
  "anumber": "A20979192",
  "id": "A20979192_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0056/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 PRIVILEGES AND PROTECTION SECURITY-The assets of this Association shall be loaned only on improved or to be improved real estate (or upon its installment certificate as provided by the By-laws) and all se- curities shall be held intact and at all times subject to examination by the Banking Department of the State of Utah or other states in which the Association may do business. PAYMENTS-All payments on this Certificate must be made in advance, and the same may be paid quarterly, semi-annually or annually. Payments shall be made at the office of the Association in Salt Lake City, Utah, or at other Branch Offices which may be designated by the Board of Directors. No notice of payment will be given, and all payments shall be due on the first day of each month after the issuance of this Certificate, and payments shall become delin- quent on the 17th day of each month following the date on which such payment becomes due, and subject to conditions set forth in pass book issued to each Certificate holder. The maximum guaranteed cost of each $100.00 matured value represented by this certi- ficate shall be $50.40, payable in advance in 180 monthly installments of the sum of 28c each, at the expiration of which time all payments so made may be withdrawn, together with all profits standing to the credit of this Certificate; or at the option of the holder of this Certificate, the face or matured value hereof will be paid at maturity. In the event of said Certificate reaching maturity upon the payment of a sum less than above specified, no additional payments shall be required. All certificates shall be subject to such charges as may be fixed and allowed for the sale of such securities and conducting the business of the Association. WITHDRAWALS-Any holder of Investors Guaranteed Savings Certificate may withdraw from the Association at any time after thirty-six months after purchase thereof, upon giving thirty days' notice in writing to the Association of intention to withdraw; providing, however, that the payments then due shall have been regularly paid thereon. Upon the expiration of said thirty days' notice, or as soon thereafter as the funds of the Association will admit, the Certificate holder shall receive back on his certificate the entire book value thereof as shown by the books of the Association. LOAN PRIVILEGES-The Association may at any time after this Certificate has been in force for full thirty-six months, all payments having been promptly made, loan to the holder not to exceed 90% of the surrender value hereof as provided by the Articles of Incorporation and the By-laws, upon depositing this Certificate as collateral security. Loans on Certificates shall be made in the order of application for same. PRIVILEGE AND PROTECTION-After six monthly installments have been made here- on, the Certificate Holder may place this Certificate in suspense without fines for a period of from one to six months by giving notice in writing to the Sécretary of the Association, who will issue and mail to the Certificate Holder, a Certificate of Suspension. The holder may rein- state this Certificate, in the event of default, at any time within the period of such suspension, by resuming payments hereon. Before this Certificate can be reinstated the holder hereof must forward it to the Secretary of the Association at Salt Lake City, who will reissue it as of a series as many months later than its present series, as the Certificate has been in default, and the maturity of this Certificate will thereby be extended for a period equal to the total time that default continued. OPTION IN EVENT OF DEATH-Should the holder of this Certificate die while the Cer- tificate is in good standing, his legal representative may make application for withdrawal of the entire book value, and it is specifically agreed by the holder hereof that in case of application by the legal representative of a deceased person, the Board of Directors may place such appli- cation in priority over applications for withdrawal for any other reason. LIABILITY-It is agreed that there is no obligation or liability on the part of the owner of this Certificate or on the part of the Association, to pay any sum excepting as expressly specified in said Certificate, and for the purpose of determining the sufficiency of the Associa- tion's assets, to carry out its obligations, the book value of this Certificate as shown by the books and the records of the Association, shall be taken as the true value to the owner, and the measure of the Association's liability on this Certificate."
}