{
  "anumber": "A20979192",
  "id": "A20979192_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0074/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Exclusions, Form 3"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 EXCLUSIONS This policy does not apply: (a) under any of the coverages, while the automobile is used as a public or livery conveyance, unless such use is specifically declared and described in this policy and premium charged therefor; (b) under any of the coverages, to liability assumed by the insured under any contract or agreement; (c) under coverage A. while the automobile is used for the towing of any trailer owned or hired by the insured and not covered by like insurance in the company; or while any trailer covered by this policy is used with any automobile owned or hired by the insured and not covered by like insurance in the company; (d) under coverages A and C, to bodily injury to or sickness, disease or death of any employee of the insured while engaged in the employment, other than domestic, of the insured or in domestic employment if benefits therefor are either payable or required to be provided under any workmen's compensation law; (e) under coverage A, to any obligation for which the insured or any company as his insurer may be held liable under any workmen's compensation law; (f) under coverage C, to bodily injury to or sickness, disease or death of any person if benefits therefor are payable under any work- men's compensation law. CONDITIONS Conditions 1, 2, 4, 5, 7, 8, 9, 10, 11, 12, 13 and 14 apply only to the coverage or coverages noted thereunder. 1 Limits of Liability-Coverage A The limit of bodily injury liability stated in the declarations as applicable to \"each person\" is the limit of the company's liability for all damages, including damages for care and loss of services, arising out of bodily injury, sickness or disease, including death at any time resulting therefrom, sustained by one person in any one accident; the limit of such liability stated in the declarations as applicable to \"each accident\" is, subject to the above provision respecting each person, the total limit of the company's-liability for all damages, including damages for care and loss of services, arising out of bodily injury, sickness or disease, including death at any time resulting therefrom, sustained by two or more persons in any one accident. 2 Limit of Liability-Coverage C The limit of liability for medical payments stated in the declarations as applicable to \"each person\" is the limit of the company's liability for all expenses incurred by or on behalf of each person who sustains bodily injury, sickness or disease, including death resulting therefrom, in any one accident. 3 Limits of Liability The inclusion herein of more than one insured shall not operate to increase the limits of the company's liability. 4 Financial Responsibility Laws-Coverage A Such insurance as is afforded by this policy for bodily injury liability shall comply with the provisions of the motor vehicle financial responsibility law of any state or province which shall be applicable with respect to any such liability arising out of the ownership, maintenance or use of the automobile during the policy period, to the extent of the coverage and limits of liability required by such law, but in no event in excess of the limits of liability stated in this policy. The insured agrees to reimburse the company for any payment made by the company which it would not have been obligated to make under the terms of this policy except for the agreement contained in this paragraph. 5 Assault and Battery-Coverage A Assault and battery shall be deemed an accident unless committed by or at the direction of the insured. 6 Notice of Accident When an accident occurs written notice shall be given by or on behalf of the insured to the company or any of its authorized agents as soon as practicable. Such notice shall contain particulars sufficient to identify the insured and also reasonably obtainable information respecting the time, place and circumstances of the accident, the names and addresses of the injured and of available witnesses. 7 Notice of Claim or Suit-Coverage A If claim is made or suit is brought against the insured, the insured shall immediately forward to the company every demand, notice, summons or other process received by him or his representative. 8 Assistance and Cooperation of the Insured-Coverage A The insured shall cooperate with the company and, upon the company's request, shall attend hearings and trials and shall assist in effecting settlements, securing and giving evidence, obtaining the attendance of witnesses and in the conduct of suits. The insured shall not, except at his own cost, voluntarily make any payment, assume any obligation or incur any expense other than for such immediate medical and surgical relief to others as shall be imperative at the time of accident. 9 Medical Reports; Proof and Payment of Claim-Coverage C As soon as practicable the injured person or someone on his behalf shall give to the company written proof of claim, under oath if required, and shall, after each request from the company, execute authorization to enable the company to obtain medical reports and copies of records. The injured person shall submit to physical examination by physicians selected by the company when and as often as the company may reasonably require. The company may pay the injured person or any person or organization rendering the services and such payment shall reduce the amount payable hereunder for such injury. Payment hereunder shall not constitute admission of liability of the insured or, except here- under, of the company. 10 Action Against Company-Coverage A No action shall lie against the company unless, as a condition precedent thereto, the insured shall have fully complied with all the terms of this policy, nor until the amount of the insured's obligation to pay shall have been finally determined either by judgment against the insured after actual trial or by written agreement of the insured, the claimant and the company. Any person or organization or the legal representative thereof who has secured such judgment or written agreement shall thereafter be entitled to recover under this policy to the extent of the insurance afforded by this policy. Nothing contained in this policy shall give any person or organization any right to join the company as a codefendant in any action against the insured to determine the insured's liability. Bankruptcy or insolvency of the insured or of the insured's estate shall not relieve the company of any of its obligations hereunder. 11 Action Against Company-Coverage C No action shall lie against the company unless, as a condition precedent thereto, there shall have been full compliance with all the terms of this policy, nor until thirty days after the required proofs of claim have been filed with the company. 12 Other Insurance-Coverage A If the insured has other insurance against a loss covered by this policy the company shall not be liable under this policy for a greater proportion of such loss than the applicable limit of liability stated in the declarations bears to the total applicable limit of liability of all valid and collectible insurance against such loss; provided, however, the insurance with respect to temporary substitute automobiles under Insuring Agreement IV or other automobiles under Insuring Agreement V shall be excess insurance over any other valid and collectible insurance available to the insured, either as an insured under a policy applicable with respect to said automobiles or otherwise. 13 Other Insurance-Coverage C The insurance afforded with respect to other auto- mobiles under Insuring Agreement V shall be excess insurance over any other valid and collectible medical payments insurance applicable thereto. 14 Subrogation-Coverage A In the event of any payment under this policy the company shall be subrogated to all the insured's rights of recovery therefor against any person or organization and the insured shall execute and deliver instruments and papers and do whatever else is necessary to secure such rights. The insured shall do nothing after loss to prejudice such rights. 15 Changes Notice to any agent or knowledge possessed by any agent or by any other person shall not effect a waiver or a change in any part of this policy or estop the company from asserting any right under the terms of this policy; nor shall the terms of this policy be waived or changed, except by endorsement issued to form a part of this policy, signed by an executive officer or an authorized agent of the company. (Page 3)"
}