{
	"anumber": "A20979192",
	"id": "A20979192_0075",
	"page_index": 75,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0075/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Mexican Coverage Endorsement, 4"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 16 Assignment Assignment of interest under this policy shall not bind the company until its consent is endorsed hereon; if, however, the named insured shall die or be adjudged bankrupt or insolvent within the this unless canceled, shall, if written notice be given to the company within sixty days after the date cover the named insured's as of such policy death period, or adjudication, policy, (1) legal representative the named insured, and (2) under coverage A, subject otherwise to the provisions of Insuring Agreement III, any person having proper temporary custody of the automobile, as an insured, and under coverage C while the automobile is used by such person, until the appointment and qualification of such legal representative but in no event for a period of more than sixty days after the date of such death or adjudication. 17 Cancelation This policy may be canceled by the named insured by mailing to the company written notice stating when thereafter such cancelation shall be effective. This policy may be canceled by the company by mailing to the named insured at the address shown in this policy written notice stating when not less than five days thereafter such cancelation shall be effective. The mailing of notice as aforesaid shall be sufficient proof of notice and the effective date and hour of cancelation stated in the notice shall become the end of the policy period. Delivery of such written notice either by the named insured or by the company shall be equivalent to mailing. If the named insured cancels, earned premiums shall be computed in accordance with the customary short rate table and procedure. If the company cancels, earned premiums shall be computed pro rata. Premium adjustment may be made at the time cancelation is effected and, if not then made, shall be made as soon as practicable after cancelation becomes effective. The company's check or the check of its representative mailed or delivered as aforesaid shall be a sufficient tender of any refund of premium due to the named insured. 18 Declarations By acceptance of this policy the named insured agrees that the statements in the declarations are his agreements and representations, that this policy is issued in reliance upon the truth of such representations and that this policy embodies all agreements existing between himself and the company or any of its agents relating to this insurance. In Witness Whereof the STANDARD ACCIDENT INSURANCE COMPANY has caused this policy to be executed and attested, but this policy shall not be valid unless countersigned on the declara- tions page by a duly authorized agent of the company. Kskrown Secretary President MEXICAN COVERAGE ENDORSEMENT In consideration of the premium for the policy of which this endorsement forms a part, it is agreed that such insurance as is afforded by the policy is extended to apply while the automobile is being used for trips into the Republic of Mexico, PROVIDED THAT, this endorsement does not apply unless the insured's place of residence is within the United States of America and the automobile insured by the policy is principally garaged, maintained and used within the United States of America. Standard Accident Insurance Company Kskrown Secretary (Page 4)"
}
