{
  "anumber": "A20979192",
  "id": "A20979192_0066",
  "page_index": 66,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0066/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TheLLOYDS, LONDON, 193089"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 The Policy evidenced by this certificate provides indemnity for loss of life, limb, limbs, sight or time by accidental means, to the extent herein provided. ISSUED BY AUTHORITY OF THE UNDERWRITERS AT No 193089 BY ACT HEREINAFTER CALLED UNDERWRITERS In Consideration of the registration fee of One Dollar ($1.00) paid by the insured and subject to the terms, conditions, and limitations herein contained, UNDERWRITERS AT LLOYDS DO HEREBY INSURE Effective Date Certificate No. Age Sep.28-45 193089 31 Bruno O. Palos Box 373 662 Claremont, Calif. Beneficiary and Relationship Mary M. Palos (Wife) against Death or Disability resulting directly, independently, and exclusively of all other causes from bodily injuries effected solely through EXTERNAL, VIOLENT, and ACCIDENTAL MEANS (subject to all limitations and conditions herein contained) for a term of twelve (12) months, beginning at Noon, Standard Time, at the place of residence of the insured, and on the day this certificate is dated. Indemnity for loss of life provided by this certificate shall be payable to the beneficiary specified above. PART I. If the insured shall, during the term for which this certificate is issued or any renewal thereof, and as herein provided, By the wrecking of any Railroad Passenger Car, Passenger Steamship or Steamboat Street Railway Car or Elevated or Subway Railroad Car in or on which such insured is traveling either as a fare-paying passenger, or on a pass regularly issued by the above named common carriers, in a place regularly provided for passengers only, Suffer within thirty days from the date of accident, any of the specific losses set forth below in this Part I Underwriters will pay the sum set opposite such loss: For Loss of- Life Ten Thousand Dollars ($10,000.00) Both Hands Ten Thousand Dollars ($10,000.00) Both Feet Ten Thousand Dollars ($10,000.00) Sight of Both Eyes Ten Thousand Dollars ($10,000.00) One Hand and One Foot Ten Thousand Dollars ($10,000.00) One Hand and Sight of One Eye Ten Thousand Dollars ($10,000.00) One Foot and Sight of One Eye Ten Thousand Dollars ($10,000.00) Either Hand Thirty Seven Hundred and Fifty Dollars ($3,750.00) Either Foot Thirty-Seven Hundred and Fifty Dollars ($3,750.00) Sight of Either Eye Thirty-Seven Hundred and Fifty Dollars ($3,750.00) PART IL If the insured shall, during the term for which this certificate is issued or any renewal thereof, as herein provided, by the means and under the conditions recited in Part I, emidiately and wholly disabled and prevented by injuries so received from performing any and every duty pertaining to his or her usual business or occupation Underwriters will pay, providing the insured is under the professional care and regular personal attendance of a legally qualified physician or surgeon, accident indemnity, commencing with the first day of such disability, for a period not exceeding ten (10) consecutive weeks, at the rate of Twenty Dollars ($20.00) per week. If the insured shall, during the term for which this certificate is issued or any renewal thereof, and as herein provided, (a) By the wrecking of any Public Omnibus, Taxicab, Jitney, or Automobile Stage, which is being driven or operated at the time the PART III. of such wrecking by a licensed driver plying for public hire, and in which such insured is traveling as a fare-paying passenger; or (b) By the wrecking of any passenger elevator in which the insured is riding as a passenger, said elevator being used for passenger service only, (elevators in mines and elevators used for transportation of freight or of freight and passengers excluded), Suffer within thirty days from the date of accident, any of the specific losses set forth below in this Part III, Underwriters will pay the sum set opposite such loss: For Loss of- Life Three Thousand Dollars ($3,000.00) Both Hands Three Thousand Dollars ($3,000.00) Both Feet Three Thousand Dollars ($3,000.00) Sight of Both Eyes Three Thousand Dollars ($3,000.00) One Hand and One Foot Three Thousand Dollars ($3,000.00) One Hand and Sight of One Eye Three Thousand Dollars ($3,000.00) One Foot and Sight of One Eye Three Thousand Dollars ($3,000.00) Either Hand One Thousand Dollars ($1,000.00) Either Foot One Thousand Dollars ($1,000.00) Sight of Either Eye One Thousand Dollars ($1,000.00)"
}