{
  "anumber": "A20979192",
  "id": "A20979192_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SELECTIVE SERVICE SYSTEM"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1940,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 App. not req. Local Be rd No. 192 91 Los Angeles County 037 SELECTIVE SERVICE SYSTEM SERVICE 192 Order to Report 300 South Thomas St., STEP Preinduction Physical Examination Pomona, California (LOCAL BOARD DATE STAMP WITH CODE) February 11, 1944 (Date of mailing) The President of the United States, To Bruno Ornelas Palos 27 (First name) (Middle name) (Last name) (Order No.) GREETING: You are hereby directed to report for preinduction physical examination at Pacific Electric Bus Depot, Pomona (Place of reporting) at 7:15 A. m., on the 23 of February , 194.4 (Hour of reporting) (Day) Katharine (Month) E failor (Member or clerk of Local Board) IMPORTANT NOTICE TO REGISTRANT Registrant who believes he has a disqualifying defect.-If you believe that you have some defect which will disqualify you for service you may, unor before the Feb 21 day of 194 appear in person at the office of the Local Board, or, if you are unable by reason of such defect to personally appear, you may submit an affidavit from a reputable physician or an official statement by an authorized representative of a Federal or State agency to the effect that such physician has personal professional knowledge or such authorized representative has official knowledge of your defect, the character thereof, and that you are unable to personally appear due to the character of the defect. The Local Board may send you to the Local Board examining physician, and, if it does so, it shall be your duty to appear at the time and place designated by the Local Board and to submit to such examination as the examining physician shall direct. If the Local Board determines that your defect does disqualify you for service you will receive a Notice of Classifi- cation (Form 57) advising you that you have been placed in Class IV-F. Unless prior to the date fixed for your preinduc- tion physical examination, you receive such a Notice of Classification (Form 57) advising you that you have been placed in Class IV-F, you must report for your preinduction physical examination as directed. Every registrant.-When you report for preinduction physical examination you will be forwarded to an induction sta- tion where you will be given a complete physical examination to determine whether you are physically fit for service. If you sign a Request for Immediate Induction (Form 219), and you are found qualified for service, you will be inducted imme- diately following the completion of your preinduction physical examination. Otherwise, upon completion of your preinduc- tion physical examination, you will be returned to this Local Board. You will be furnished transportation and meals and lodgings when necessary. Following your preinduction physical examination you will receive a certificate issued by the commanding officer of the induction station showing your physical fitness for service or lack thereof. If you fail to report for preinduction physical examination as directed, you will be delinquent and will be immediately ordered to report for induction into the armed forces. You will also be subject to fine and imprisonment under the provi- sions of section 11 of the Selective Training and Service Act of 1940, as amended. If you are so far from your own Local Board that reporting in compliance with this order will be a hardship and you desire to report to the Local Board in the area in which you are now located, take this order and go immediately to that Local Board and make written request for transfer for preinduction physical examination. DSS Form 215 16-37979-1 U. s. GOVERNMENT PRINTING OFFICE"
}