{
	"anumber": "A20979192",
	"id": "A20979192_0102",
	"page_index": 102,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0102/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 State of Utah, I SS. AFFIDAVIT. County of Juab. x Manuel Marez, being first duly sworn, deposes and on his oath says: that he is a resident of Dividend, Utah county, state of Utah and has been so a resident of the said place for more than eight years, that he is employed as a miner at the Tintic Standard Mining Company property in said town of Dividend and that he is making a wage of Five 50/100 ($5.50) dollars per day, and that his wife Felez Marez has a boarding house at the said town of Dividend and is engaged in taking boarders and that he and his wife are fully able to take care of their present family and the addition of Buena Ventura de Pallos, the step son of affiant and the son Felez Marez, wife of the fis Affiant further says that the said Buena Ventura de Pallos, age 22 years, step son of ffiant as aforesaid, is now in Juarez, Mexico and is desirous of coming to the affiant to make his home if permitted so to do. Affiant further says that he is willing to take care of the said Buena Ventura de Pallos and provide for him as long as necessary and to get work for the said step son of the affiant and that the said step son is fully able and willing to work. Affiant further says that he has heretofore sent a railway ticket and money for the purposes of paying the transportation and expenses of the said Buena Ventura de Pallos, and that he will see that the said hife Buena Ventura de Pallos does not become a public charge. Subscribed and sworn to before me this the 26th day of March, 1930. Notary Public, residing at Eureka, Utah."
}
