{
	"anumber": "A20979192",
	"id": "A20979192_0119",
	"page_index": 119,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0119/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Sociedad Progresista Mexicana, Credencial Nº 800"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1946, 1929]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 SERIE VIII CREDENCIAL No. 800 sociedad progresista PROGRE Hexicana EDUCACION PATRIOTISMO RESPETO Congreso Ejecutivo Supreme Esta Credenrial, otorgada por autoridad de la Sociedad Progresista Mexicana, debidamente incorporada bajo las leyes del Estado de California, Estados Unidos de América, el 16 de Octubre de 1929, CERTIFICA: que Ed.s. Bougo Tados edad 31 años, residente en blaremont Estado delation ha sido admitid a como Socie de esta Sociedad, en la Logia No. 44 Ignorially, la ciudad to de blore Maria MY,Palos Estado de de Junio de 1946 y que Sra residente California en Estado de California edad 32 años, ha sido acptad como su hereder oficial. Y en consideración de las declaraciones hechas en su solicitud, su examen médico y el de su Hereder a arriba mencionad a los cuales han sido presentados y aprobados por dicha Logia No attom expide esta Credencial, quedando dich O. Soci a sujero a las leyes vigentes de esta Sociedad segun constan en la Constitución actual de la misma, y reformas o enmiendas hechas o que en el futuro se hicieren a ella, teniendo derecho a los beneficios y privilegios, y asumiendo las obligaciones y deberes expresados en dicha Constitución vigente y refor- mas O enmiendas hechas o que en el futuro se hicieren a ella. El Beneficio Funerario especificado en el Capítulo IX, Artículo 1ro., Fracciones I. II y III de la Constitucion vigente se ministrara bajo las condiciones especificadas en dicha Constitucion y en la siguiente forma: 1.-Si la defunción de Soaio o Heredera Oficial ocurriere DESPUES DE HABERSE CUMPLIDO TRES MESES y ANTES DE HABERSE CUMPLIDO SEIS MESES consecutivos a partir de la fecha de iniciación de a Socio en esta Sociedad, al Soci a... O Hereder Oficial (segun el caso), recibirá la mitad del Beneficio Funerario especificado en el Capítulo IX, Articulo 1ro., Fracciones I, II y III de la Constitución. 2-Si la defunción deel Socio o Hereder Oficial ocurriere DESPUES DE HABERSE CUMPLIDO SEIS MESES consecutivos a partir de la fecha de iniciación de d Soci o en esta Sociedad, a Soci 0 o Hereder a Oficial (según el caso), recibirá el Beneficio Entero especificado en el Capítulo IX, Art. Iro, Fracciones I, II y III de la Cons- titución vigente. 3.-Si la defunción de a Soci 0... o Hereder Oficial ocurriere ANTES DE HABERSE CUMPLIDO TRES ME- SES consecutivos a partir de la fecha de iniciación de Soci O. en esta Sociedad, no se pagará ningún Beneficio Fune- rario por dicha defunción. Los Beneficios por Enfermedad dependerán directamente de las Logias, y los Beneficios Funerarios especificados en dicha Constitución dependerán directamente del Congreso Ejecutivo Supremo, y ni las Logias podrán ser hechas res- ponsables por Beneficios Funerarios, ni el Congreso Ejecutivo Supremo podrá ser hecho responsable por Beneficios de Enfermedad que por cualquiera causa no fueren impartidos. Si las declaraciones hechas por el Socio en su Solicitud de Ingreso a esta Sociedad fueren totalmente o en par- te falsas, esta Credencial se considerará nula y sin valor, el Congreso Ejecutivo Supremo tendrá obligación solamente en caso del fallecimiento de el Soci O., de devolver asa Heredera Oficial las cantidades que l Soeiohaya pagado a esta Sociedad, menos los beneficios que se le hubieren impartido durante su estancia en el seno de ella, y los gastos correspondientes a su matrícula, etc., etc. Y para los efectos consiguientes expedimos esta Credencial y la autorizamos con nuestrafirma y con el Sello Ofi- cial del Congreso Ejecutivo Supremo de la Sociedad Progresista Mexicana, en la ciudad de Estado de California, a los 14 días del mes de N.E.Guerrero PRESIDENTE SUPREMO Julie de 6 angeles SECRETARIO SUPREMO Hago constar que he leído la Constitucion vigente de la Sociedad Progresista Mexicana y las condiciones estipu- ladas en esta Credencial y estoy conforme con ellas, y en constancia la firmo hoy día 24 de Octubre de 194.6 Bruno Palos FIRMA DEL SOCIO Los suscritos, Presidente y Secretario de la Logia No. dela Sociedad Progresista Me- xicana, firmamos y sellamos esta Credencial en la Ciudad de Clarement Estado de calefor dandole pleno vigor desde hoy día 24de coatubre de 194 c. Vicente PRESIDENTE M.Razo Julu Carrasro SECRETARIO"
}
