{
	"anumber": "A20979192",
	"id": "A20979192_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ADMISSION FOR PERMANENT RESIDENCE CREATED, NARA-0123456789"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1970, 1960, 1929, 1969, 1948, 1926, 1964, 1967, 1932, 1961, 1930, 1947, 1939, 1965, 1966,
				1928, 1958, 1954, 1937, 1962, 1934, 1952, 1957, 1950, 1959, 1949, 1942, 1943, 1956, 1935,
				1945, 1955, 1941, 1938, 1953, 2023, 1931, 1940, 1951, 1944, 1963, 1925, 1968, 1933, 1924,
				1927
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 SUGGESTED DOCUMENTARY EVIDENCE TO BE PRESENTED BY APPLICANT APPLYING TO HAVE A RECORD OF ADMISSION FOR PERMANENT RESIDENCE CREATED You should try to obtain documentary evidence for each year from to date. One document, of course, might serve to cover several years, an employ- ment letter, for instance, might cover the entire period. It is suggested that you arrange this evidence by years and check the years listed below when you obtain evidence covering them: June: 1924 1929 1934 1939 1944 1949 1954 1959 1964 1969 1925 1930 1935 1940 1945 1950 1955 1960 1965 1970 1926 1931 1935 1941 19460 1951 1956 1961 1966 1927 1932 1937 1942 1947 1952 1957 1962 1967 1928 1933 1938 1943 1948 1953 1958 1963 1968 (1) EMPLOYMENT RECORDS: Letters from each company by whom you were employed executed by an officer of the company under his official title. The letter should be written on stationery bearing the letterhead of the firm, and show the place of your residence, exact periods of employment, period of layoffs, and reasons of each unemployment. Such letters must indicate whether or not information is taken from official company records. If you have been in business for yourself, letters from firms with whom you have done business are acceptable. (2) SCHOOL RECORDS: Letters from the schools you or your children have attended in the United States. Such letters must show name of schools, name and address of parents, and the period of attendance at school. (3) GAS, ELECTRIC, TELEPHONE, WATER: Bills, letters or receipts from the company dispensing the utility, showing the dates during which you received service from it. (4) CHURCH, UNION AND OTHER ORGANIZATIONAL RECORDS: Letters from these organiza- tions signed an official under his official title, showing inclusive dates of membership, and address where you resided during that membership period. The seal of the organization should be impressed on the letter. (5) POLICE RECORDS: Letters of clearance from the Police Department having juris- diction over the place or places where you have lived for the past five years. (6) MARRIAGE RECORD: Your marriage certificate, and if YOU or your spouse have been married more than once, then certificates of previous marriages, and documents showing how such marriages were terminated. (7) ALIEN REGISTRATION CARDS: Your Alien Registration Card. (8) MISCELLANEOUS: Monev orders receipts passports, birth certificates of children born in the United States; bank books or letters from the bank where rou have maintained an account; correspondence between yourself and the Service in connection with any application you have made; any immigration or inaturalization document issued to you in the United States; election registration cards; social security cards; selective service cards; automobile licenses; automobile certifi- cates; letters or post cards addressed to you here in the United States bearing your name, address and postmark; deeds, mortgages, or land contracts to which you have been a party, tax receipts; and insurance policies, receipts or letters from insurance companies."
}
