{
	"anumber": "A20979192",
	"id": "A20979192_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 4/27/2023, PART IV., PART V., PART VI., PART VII., PART VIII."
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 PART IV. If the insured shall, during the term for which this certificate is issued or any renewal thereof, and as herein provided, (a) By being struck, knocked down or run over while walking or standing on a public highway, by a vehicle propelled by Steam, Cable, Electricity, Naphtha, Gasoline, Compressed Air, Liquid or Horse Power (excluding injuries sustained while on a railroad right of way, except an established crossing) ; or (b) By the wrecking of any private pleasure type automobile or horse-drawn vehicle within which the insured is driving or riding as a passenger, (excluding motorcycles and farm machinery) or while so driving or riding, by being accidentally thrown from within such wrecked automobile or vehicle (provided the insured is not operating such automobile or vehicle while carrying passengers for hire or while trans- porting merchandise for sale or delivery) or (c) By the collapse of the outer walls of a building while the insured is therein (except a building in process of construction, repair or demolition) or (d) By the burning of any church, theatre, library, school or municipal administration building in which the insured shall be at the beginning of such fire, and is burned by such fire or suffocated by the smoke therefrom; or (e) By being struck by lightning, cyclone or hurricane or tornado or injured by an earthquake; or (f) By the wrecking of a bicycle (excluding motorcycles) on which the insured is riding; or (g) By the wrecking of either a licensed passenger airplane or a licensed passenger dirigible airship, owned and provided by an incorpo- rated passenger carrier and while operated by a licensed passenger pilot over a definitely established regular passenger route of such carrier, and between definitely established airports and in which the Assured is a fare-paying passenger. This extension shall not cover loss sustained in any airplane or dirigible airship while it is being used for flights over water (except inland water ways) in excess of 100 miles, or more than 50 miles from land (not to apply in respect of \"Pan American\" South American routes), sight- seeing or in any military or naval airplane or dirigible or in any form of aviation travel or hazard other than that specified in the paragraph above, Suffer within thirty days from the date of accident any of the specific losses set forth below in this Part IV, Underwriters will pay the sum set opposite such loss: For Loss of- Life One Thousand Dollars ($1,000.00) Both Hands One Thousand Dollars ($1,000.00) Both Feet One Thousand Dollars ($1,000.00) Sight of Both Eyes One Thousand Dollars ($1,000.00) One Hand and One Foot One Thousand Dollars ($1,000.00) One Hand and Sight of One Eye One Thousand Dollars ($1,000.00) One Foot and Sight of One Eye One Thousand Dollars ($1,000.00) Either Hand Five Hundred Dollars ($500.00) Either Foot Five Hundred Dollars ($500.00) Sight of Either Eye Five Hundred Dollars ($500.00) PART V. If the insured shall, during the term for which this certificate is issued or any renewal thereof, and as herein provided, By the wrecking of any private commercial automobile, motor driven car, truck, wagon or horse-drawn vehicle (excluding motorcycles and farm machinery) within which the insured is riding or driving, and used for transporting merchandise for a business purpose (provided the insured is not operating such automobile or vehicle while carrying passengers for hire), or while so riding or driving, by being accidentally thrown from within such wrecked automobile, car or vehicle, Suffer within thirty days from the date of accident any of the specific losses set forth below in this Part V, Underwriters will pay the sum set opposite such loss: For Loss of- Life Five Hundred Dollars ($500.00) Both Hands Five Hundred Dollars ($500.00) Both Feet Five Hundred Dollars ($500.00) Sight of Both Eyes Five Hundred Dollars ($500.00) One Hand and One Foot Five Hundred Dollars ($500.00) One Hand and Sight of One Eye Five Hundred Dollars ($500.00) One Foot and Sight of One Eye Five Hundred Dollars ($500.00) Either Hand Two Hundred and Fifty Dollars ($250.00) Either Foot Two Hundred and Fifty Dollars ($250.00) Sight of Either Eye. Two Hundred and Fifty Dollars ($250.00) PART VI. If the insured shall, during the term for which this certificate is issued or any renewal thereof, as herein provided, by the means and under the conditions recited in Parts III, IV and V, be immediately and wholly disabled and prevented by injuries so received, from per- forming any and every duty pertaining to his or her usual business or occupation, Underwriters will pay, providing the insured is under the professional care and regular personal attendance of a legally qualified physician or surgeon, accident indemnity, commencing with the first day of such disability, for a period not exceeding fifteen (15) consecutive weeks at the rate of Ten Dollars ($10.00) per week. PART VII. Each consecutive renewal of this policy without default in payment of premium, that is, with premium payment made on or before the expira- tion date, will increase the amount of benefits herein provided for death, dismemberment, or loss of sight of the insured, sustained under conditions as described in Parts I, III, IV, and V, at the rate of ten per cent of the original amounts until fifty per cent is thus added. Thereafter, so long as this policy shall remain in continuous force, the insurance will be for the said original amounts plus the accumulations. PART VIII. REGISTRATION, IDENTIFICATION AND EMERGENCY BENEFIT The insured is registered with Underwriters and if he shall by reason of injury, be physically unable to communicate with relatives or friends, Underwriters will, upon receipt of a message giving particulars sufficient to identify the insured, immediately notify such of them as may be known to Underwriters, giving information so received, and will thereafter defray all expenses to put the insured in communication with and in care of relatives or friends, provided such expenses shall not exceed the sum of One Hundred Dollars ($100.00). STANDARD PROVISIONS 1. This certificate includes the endorsements and attached papers, if any, and contains the entire contract of insurance. No reduction shall be made in any indemnity herein provided by reason of change in the occupation of the insured or by doing any act or thing pertaining to any other occupation. 2. No statement made by the applicant for insurance not included herein shall avoid the certificate or be used in any legal proceeding hereunder. No agent has authority to change this certificate or to waive any of its provisions. No change in this certificate shall be valid un- less approved by the Underwriters or their Representatives and such approval be endorsed hereon. 3. If default be made in the payment of the agreed premium for this certificate, the subsequent acceptance of a premium by the Under- writers or any authorized agent shall reinstate the certificate, but only to cover loss resulting from accidental injury thereafter sustained."
}
