{
  "anumber": "A20979192",
  "id": "A20979192_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0061/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF LIVE BIRTH, 18387"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1941,
        2023,
        1966
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 ( DISTRICT No Card 18387 REGISTRAR'S No ROPERT PRUNO PALOS 1. Molina FULL NAME OF CHILD MAIDEN SURNAME OF MOTHER 2. PLACE OF BIRTH: (A) COUNTY 3. USUAL RESIDENCE OF MOTHER: (A) LENGTH OF RESIDENCE Los Angeles IN CALIFORNIA (3) CITY OR TOWN Los Angeles California (3) STATE 22 IF OUTSIDE Cill OR TOWN LIMITS. WHITE RURAL (c) NAME OF HOSPITAL OR INSTITUTION Low Angeles TE MONTHS DAYS (c) COUNTY Los Angeles County General Hospital (D) CITY OR TOWN Clar emont '15 MONTHS DAYS IF NOT H HOSPITAL OR INSTITUTION GIVE STREET NUMBER OR LOCATION IF OUTSIDE CITY ON TOWN LIMITS. WRITE RURAL YEARS MONTHS DAYS (D) MOTHER'S STAY BEFORE DELIVERY: 3days IN HOSPITAL OR INSTITUTION IN THIS COMMUNITY 3d any 156 E. 7th st. (E) STREET AND NUMBER DAYS 4. SEX 5. TWIN OR IF SO-BORN S. NUMBER OF MONTHS 7. DATE OF male TRIPLET 1ST 20 30 OF PREGNANCY 9 BIRTH September 21, 1941 MONTH BY NAME YEAR FATHER OF CHILD MOTHER OF CHILD 8. FULL NAME Bruno Palos 15. FULL 9. COLOR RACE white (Mex) 10. 26 MAIDEN OR Ade AT TIME OF THIS BIRTH NAME Mary Molina YEARS 11. LENGTH OF RESIDENCE IN CALIFORNIA 24 15. COLOR OR RACE white (Max) 17. AGE AT TIME OF THIS BIRTH 27 YEARS MONTHS DAYS Mexico YEARS 12. BIRTHPLACE 18. BIRTHPLACE Mexico 13. USUAL OCCUPATION Laborer 19. USUAL OCCUPATION Housewife 14. INDUSTRY OR BUSINESS Various places 20. INDUSTRY OR BUSINESS Home 21. CHILDREN BORN TO THIS MOTHER: 22. MOTHER'S MAILING ADDRESS FOR REGISTRATION NOTICE: o (A) How MANY OTHER CHILDREN OF THIS MOTHER ARE NOW LIVING 156 E. 7th st., o (3) How MANY OTHER CHILDREN WERE BORN ALIVE BUT ARE NOW DEADT Claremont, Calif o (c) low MANY CHILDREN WERE BORN DEADT 23. I BY CERTIFY. THAT I ATTENDED THE BIRTH OF THIS CHILD WHO WAS BORN ALIVE AT THE HOUR OF 4:29 P. M THE DATE ABOVE STATED AND THAT THE INFORMATION GIVEN WAS FURNISHED BY Mary Palco RELATED TO THIS CHILD AS 24. DATE RECEIVED BY LOCAL REGISTRAR 1.541 lesse 21. MD Mainens Mother SEP ATTENDANT'S OWN SIGNATURE 25. REGISTRAR'S SIGNATURE M.D., MIDWIFE OR OTHER DATE SIGNED 9-21-41 26. GIVEN NAME ADDED BY REGISTRAR ADDRESS 1200 N. State St. Ios Angeles, Cal DATE REGISTRAR Thank 27. (A) PREGNANCY. COMPLICATIONS OF: None DEPUTY (E) DID THE BABY HAVE ANY CONGENITAL MALFORMATION no DESCRIBE: none (3) LABOR, COMPLICATIONS OF : no INDUCEDI BIRTH INJURY no DESCRIBE: (c) WAS THERE AN OPERATION yes STATE ALL FOR DELIVERY? OPERATIONS: YES OR NO Cee arean section (F) WAS A SEROLOGICAL TEST MADE FOR SYPHILIS IN THIS MOTHER' yes (D) WAS A PROPHYLACTIC DRUG USED IN THE BABY'S EYES yes IF so. AT WHAT PERIOD OF GESTATION? 9th Mos IF YES. STATE DRUG AgN03 IF NOT. WHY NOT? STATE OF CALIFORNIA CERTIFICATE OF LIVE BIRTH U. S. DEPT. OF COMMERCE DEPARTMENT OF PUBLIC HEALTH BUREAU OF THE CENSUS his is a true certified copy of the record imprinted in purple ink. if it bears the seal of the County Recorder LOS FEE $2.00 FEB 1 1966 SECURITY Ray E.Lee COUNTY RECORDER LOS ANGELES COUNTY, CALIFORNIA * SECURITY CALIFORNIA"
}