{
	"anumber": "A20979192",
	"id": "A20979192_0068",
	"page_index": 68,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0068/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 4/27/2023, Form Number: 15-689"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 4. Written notice of injury on which claim may be based must be given to the Underwriters or their Representatives within twenty days after the date of the accident causing such injury. In event of accidental death immediate notice thereof must be given to the Underwriters or their Representatives. 5. Such notice given by or in behalf of the insured or beneficiary, as the case may be, to the Underwriters or their Representatives, The Western Adjusting Bureau, 621 South Hope Street, Los Angeles, California, with particulars sufficient to identify the insured, shall be deemed to be notice to the Underwriters or their Representatives. Failure to give notice within the time provided in this certificate shall not invalidate any claim if it shall be shown not to have been reasonably possible to give such notice and that notice was given as soon as was reasonably possible. 6. The Underwriters or their Representatives upon receipt of such notice, will furnish to the claimant such forms as are usually furnished by it for filing proofs of loss. If such forms are not so furnished within fifteen days after the receipt of such notice, the claimant shall be deemed to have complied with the requirements of this certificate as to proof of loss upon submitting within the time fixed in the certificate for filing proofs of loss, written proof covering the occurrence, character and extent of the loss for which claim is made. 7. Affirmative proof of loss must be furnished to the Underwriters or their Representatives, The Western Adjusting Bureau, 621 South Hope Street, Los Angeles, California, in case of claim for loss of time from disability within ninety days after the termination of the period for which the Underwriters are liable, and in case of claim for any other loss, within ninety days after the date of such loss. 8. The Underwriters or their Representatives shall have the right and opportunity to examine the person of the insured when and so often as it may reasonably require during the pendency of claim hereunder, and also the right and opportunity to make an autopsy in case of death where it is not forbidden by law. 9. All indemnities provided in this certificate for loss other than that of time on account of disability will be paid immediately after receipt of due proof. 10. Upon request of the insured and subject to due proof of loss all accrued indemnity for loss of time on account of disability will be paid at the expiration of each four weeks during the continuance of the period for which the Underwriters are liable, and any balance remaining un- paid at the termination of such period will be paid immediately upon receipt of due proof. 11. Indemnity for loss of life of the insured is payable to the Beneficiary if surviving the insured, and otherwise to the estate of the in- sured. All other indemnities of this certificate are payable to the insured. 12. If the insured shall at any time change his occupation to one classified by the Underwriters or their Representatives as less hazardous than that stated in the certificate, the Underwriters or their Representatives, upon written request of the insured and surrender of the certifi- cate, will cancel the same and will return to the insured the unearned premium. 13. Consent of the Beneficiary shall not be requisite to surrender or assignment of this certificate, or to change of beneficiary, or to any other changes in the Certificate. 14. No action at law or in equity shall be brought to recover on this certificate prior to the expiration of sixty days after proof of loss has been filed in accordance with the requirements of this certificate, nor shall such action be brought at all unless brought within two years from expiration of the time within which proof of loss is required by the certificate. 15. If any time limitation of this certificate with respect to giving notice of claim or furnishing proof of loss is less than that permitted by the law of the state in which the insured resides at the time this certificate is issued, such limitation is hereby extended to agree with the minimum period permitted by such law. 16. The Underwriters or their Representatives may cancel this certificate at any time by written notice delivered to the insured or mailed to his last address, as shown by the records of the Underwriters or their Representatives, together with cash or the Underwriters' or their Representatives' check for the unearned portion of the premiums actually paid by the insured, and such cancellation shall be without prejudice to any claim originating prior thereto. 19. If a like certificate or certificates, previously issued by the Underwriters to the insured be in force con- currently herewith, making the aggregate indemnity for loss other than that of time on account of disability in excess of $15,000.00, or the aggregate indemnity for loss of time on account of disability in excess of $20.00 weekly, the excess insurance of either kind shall be void and all premiums paid for such excess shall be returned to the insured. 20. The insurance under this certificate shall not cover any person under the age of fifteen (15) years nor over the age of sixty (60) years. Any premium paid to the Underwriters for any period not covered by this certificate will be returned upon request. ADDITIONAL PROVISIONS 1. This certificate is renewable only at the option of Underwriters. 2. Strict compliance on the part of the insured with all the provisions of this certificate is a condition precedent to recovery hereunder, and any failure in this respect will forfeit to Underwriters all rights to any indemnity. EXCEPTIONS AND REDUCTIONS 1. The insurance under this certificate shall not cover any person who is blind, deaf or who has lost an eye, hand or foot or limb. In all such cases, the limit of Underwriters' liability shall be the amount of the premium paid, which will be returned upon demand. 2. This certificate shall not cover (1) injuries fatal or non-fatal suffered, directly or indirectly caused by war or invasion; or (2) while riding or driving in races or any driver or occupant of any automobile in any race or speed contest anywhere, or while testing any automobile on any race track, speedway or testing ground; or (3) while traveling in or operating submarines or any mechanical device for aerial navigation except as provided under Item (g) of Part IV; or (4) anyone entering a mine; or (5) anyone while engaged in fighting a fire; or (6) injuries fatal or non-fatal arising out of participation in an act of law enforcement: or (7) while engaged in military or naval service; or (8) injuries fatal or non-fatal of which a contributing cause is the insured's commission of or attempt to commit an assault or felony or which occurs while the insured is engaged in an illegal occupation; or (9) while under the influence of narcotics unless administered on the advice of a physician or intoxicated; or (10) suicide or any attempt thereat while sane or insane; or (11) hernia or strain however sustained; or (12) carbon monoxide poisoning; or (13) any loss caused directly or indirectly by bodily or mental infirmity; or (14) injuries fatal, or non-fatal, except drowning, of which there shall be no visible mark or contusion on exterior of the body at the place of injury, the body itself in case of death not to be deemed such; or (15) injuries intentionally inflicted upon the insured by himself or any other person. 3. Riding of motorcycles will not be covered under this certificate, anything herein to the contrary notwithstanding. 4. No indemnity will be paid for death, or loss of limb or eyesight caused by any other means or under any other condi- tions than those set forth in Parts I or III or IV or V, or which death or loss does not occur within thirty (30) days from date of accident. No indemnity will be paid for disability caused by any other means or under any other conditions than those set forth in Parts II or VI, or which disability does not occur immediately after the accident causing such disability. 5. In every case referred to in this certificate, the loss of any member or members shall mean loss by severance at or above the ankle or wrist joints, and the loss of sight of eye or eyes shall mean the total and irrecoverable loss of the entire sight thereof. 6. The insurance hereby provided is limited to one only of any of the indemnities herein provided under Parts I or II or III or IV or V or VI and in no event shall the insured receive more than the maximum sum provided under Parts I or II or III or IV or V or VI, as the disability or loss may determine. In event of specific loss for which provision is made in Parts I and III and IV and V, no indemnity shall be paid for loss of time. 7. Indemnity will be paid only for the time the insured is under the professional care and regular personal treatment, at least once each seven days, of a legally qualified physician or surgeon, other than himself."
}
