{
  "anumber": "A20979192",
  "id": "A20979192_0110",
  "page_index": 110,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20979192_0110/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "wife"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Declaration of Homestead, WIFE"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 BOOK38153 PAGE 175 Declaration of Homestead (WIFE) know all men by these Presents: That I, MARY PALOS do certify and declare that I am a married woman, and that my husband's name is BRUNO PALOS and that my husband has not made any declaration of homestead, and I therefore make this declaration for the joint benefit of myself and husband; that I do now, at the time of making this declar- ation, actually reside with my family consisting of My husband, Bruno Palos and myself and our three children, Robert Palos, now ten years of age, Rodrick Palos, now seven years of age, and Corinne Palos, now four years of age, on the land and premises described as follows, to-wit: Lying and being in the County of Los Angeles State of California , , and bounded and described as follows: The easterly 54.75 feet of the westerly 95.24 feet (distances measured on the southerly line) of the southerly 101 feet, measured parallel with the westerly line of lot 50 of Tract 1008, in the City of Claremont, as per map recorded in book 17, pages 62 and 63 of Maps, in the office of the county recorder of said county. Chat it is my intention to use and claim the said lot of land and premises above described, together with the dwelling house. thereon, and its appurtenances, as a Homestead and I do hereby select, declare and claim the same as a Homestead. Chat the actual cash value of said property I estimate to be $ 6,000.00 [1] Said property consists of lot with dwelling house thereon In Witness Whereof, I have hereunto set my hand and seal, this 23rd day of January nineteen hundred and 52 , mary Palos (1.) Such declaration of homestead may further contain a statement of the character of the property sought to be home- steaded with sufficient detail that it is a proper subject of homestead, and that no former declaration has been made, or, if made, that it has been abandoned. If this statement is made the verification must also be made before the Notary Public. HOMESTEAD DECLARATION OF WIFE WOLCOTTS FORM 746"
}