{
	"anumber": "A20968145",
	"id": "A20968145_0066",
	"page_index": 66,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20968145_0066/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Corporation Grant Deed, 812905"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1977, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "first American Title Company of Los Angeles Order No. Everow No. 121 8903-11 17- 812905 can No. RECORDED IN OFFICIAL RECORDS WHEN RECORDED MAIL TO: OF LOS ANGELES COUNTY, CA. CHANDER KUMAR NARANG and JUL 27 1977 AT s A.M. KAILASH NARANG 501 Fairview Avenue Recorder's Office Siarra Madre, California SPACE ABOVE THIS LINE FOR RECORDER'S use MAIL TAX STATEMENTS TO: 80 DOCUMENTARY TRANSFER TAX $ 746.85 Computed on the consideration or value of property conveyed; OR Same as above addresses Computed on the consideration s velbe liens or ancumbrances remaining at time of sels. that Dies dont FIRST AMERICAN TITLE CO. Signature of Declarant or Agent determining tax - Firm Name A. P. No. 80 CORPORATION GRANT DEED and 3 FOR A VALUABLE CONSIDERATION, receipt of which is hereby acknowledged, A CITIZENS SAVINGS & LOAN ASSOCIATION corporation organized under the laws of the State of does hereby GRANT to CHANDER KUMAR NARANG and KAILASH MARANG, Husband and Wife, as Joint Tenants the real property in the City of unincorporated area County of Los Angeles State of California, described as Lot 3 of Tract 28931, as per map recorded in Book 831 Pages 46 to 51 inclusive of Maps, in the office of the county recorder of said county. EXCEPT all oil, gas, minerals, water and other hydrocarbon substances lying below a depth of 500 feet, but without right of entry to the surface above a depth of 500 feet, as conveyed to Upland Industries Corporation, a Utah corporation on April 22, 1976 as Instrument No. 2648. This deed is made and accepted and said real property is hereby granted subject to all the provisions of that certain Declaration of Restrictions recorded August 24, 1973 GS Instrument No. 3943 and any amendments thereto, all of which are incorporated herein by this reference thereto with the same effect as though fully set forth herein. General American Consulate India pumbay. Original seen and OF Dated July 22, 1977 CITIZENS SAVINGS & LOAN ASSOCIATION STATE OF CALIFORNIA Officer COUNTY OF as Los Angeles By Lost Consular Don Surne Vice President Co July 22, 1977 telere use. the undersigned, a Notary Public in and for said Store, personality appeared Don Sarno By Jeanne Reed Asst. Sebretary known to ⑉ to be the Vice President 1 Jeanne Reed / to we w the (Pup Aest. OFFICIAL SEAL Sacretary of the the mething instrument and known CAROL GALLAGHER to 14% to 4 the wis the within instrument on NOTARY PUBLIC CALIFORNIA Castral will the - and acknowledged to me PRINCIPAL OFFICE its the two @ison Basculad the withish instrument pursuant to LOS ANGELES COUNTY its by-live $ a resolution of its board of Consulasione Expires Because 11, 1677 the TINESS any and (This area for official sotarial sport MAIL TAX STATEMENTS AS DIRECTED ABOVE LA101703-3 , 09703-3"
}
