{
	"anumber": "A21199209",
	"id": "A21199209_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21199209_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A- 2I I99 209"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED SScreenedbyPNARAAZ/6/2023 JUCTICE Immigration and Naturalization S ice MEMOR ANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles. CA File No. A- 2I I99 209 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Street LE Sao Thi F I/I5/I3 Address I0222 Lanett Ave PLACE OF BIRTH City, State, Zip Whittier. CA 90605 Quang-Nam o Vietnam NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam PRIORITY DATE REMARKS Indochinese refugee NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 Public Law 95-I45 (Other law Specify) As of May Z 1975 Los Angeles. CA (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission.(Insert symbol) IC6 DATE OF MAR 18 1978 RECOMMENDED BY: (Immigration Officer) (Date) ACTION Stant MAR 18 1978 DD Joseph Sureek DISTRICT FOR USE BY VISA CONTROL OFFICE LOS Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 2)"
}
