{
	"anumber": "A21198924",
	"id": "A21198924_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21198924_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Application for Naturalization, N-4 (Rev. 07/19/1)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/18/2023 U.S. Department of Justice FRC OMB #1115-0009 S Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name PHAM Name THAO Initial VAN U.S. Mailing Address - Care of Resubmitted 04/14/94 8:57 Street Number Apt. N400 90.00 and Name 1805 W. ADAMS # City County SANTA ANA ORANGE State ZIP CA Code 92704 Reloc Sent Date of Birth 2/10/15 Country (month/day/year) of Birth VIETNAM Social Security # 586-40-5985 A # 21198924 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least live (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed c. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview c. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 6/4/75 LOS ANGELES Citizenship x VIETNAMESE Name on alien registration card (if different than in Part 1) Other names used since you becamo a permanent resident (including maiden name) NONE ARGUARS Sex Male Height Marital Status: Single Divorced Female 5-4\" Married Widowed Can you speak, read and write English ? No Yes. Action ROVED us DISTRICT DIRECTOR Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes. DEC 5 1994 If you answered \"Yes\" , complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate Recommended Frellow paper. Did absence last LOS 4607 Date left U.S. Date returned 6 months or more? Destination Reason for trip Yes No To Be Completed by Yes No Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back. APR 15 1994"
}
