{
  "anumber": "A21199209",
  "id": "A21199209_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21199209_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/6/2023, NRC ROUTING SHEET"
    },
    "years": {
      "ms_years_nlp_v1": [
        2017,
        2012,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/6/2023 For Official Use Only NRC ROUTING SHEET Director's Office Information & Field Services Director (Terry G. Sloan) ACD (Kathryn Quackenbush) Deputy Director (Tom Knepper) Incoming CRB (Joseph Dunning) Chief of Staff (Ethan Cole) Incoming ILB/SAVE (Cesar Dela Pena) Program Mgmt Analyst (Sandy Guerrant) Other: Other: Explanation of Required Action: Explanation of Required Action: Operations FOIA/PA ACD (John Lager) ACD FOIA OPERATIONS (Jill Eggleston) Incoming Operations FOIA COTR (Tracy Bellisime) Other: Other: Explanation of Required Action: Explanation of Required Action: Information Technology Additional Information/Comments ACD (Keith Dickinson, Acting) Please send to Retirements Other: Explanation of Required Action: Fileroom: Interfile FCO: Fileroom: Place File(s) on Shelf FCO: Mailroom: File(s) Transfer Forward - No Request in CIS FCO: Internal: Route/Update File(s) New Location in NFTS To: NFTS Code: Other: Problem File Unit (Consolidate, Deconsolidate, Pull, etc.) SECTION BELOW MUST BE COMPLETED BY SENDER Name/Title: Date: Becky Jones February 23, 2017 Revised 8/7/2012 The attached materials contain DEPARTMENT OF HOMELAND SECURITY information that is \"FOR OFFICIAL USE ONLY or other types of sensitive but unclassified information requiring protection against unauthorized disclosure. The attached materials will be handled and safeguarded in accordance with DHS management directives governing protection and dissemination of such information At a minimum, the attached materials will be disseminated only on a \"need-to-know\" basis; and, when unattended, will be stored in a locked container or area offering sufficient protection against theft, compromise, inadvertent access and unauthorized disclosure."
}