{
	"anumber": "A21201155",
	"id": "A21201155_0057",
	"page_index": 57,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201155_0057/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, N-430A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 OMB #1115-0064 Expires 3/31/84 U.S. Department of Justice Immigration and Naturalization Service Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch 300 NORTH LOS ANGELES STREET File or A # 21 201 155 Date 4/21/1983 LOS ANGELES, CA 90012 You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, I AND PLACE, shown below. Date 5/13/1983 Time 10:10 AM CHI THI LE 2433 W. FLORA ST SANTA ANA, CA 92704 Place 300 NORTH LOS ANGELES STREET 71 LOS ANGELES, CA 90012 FEDERAL BUILDING - DOWNTOWN ROOM NUMBER: 8010 You MUST BRING the following with you: - This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED IN. MICHAEL H. LANDON, JR. - Alien Registration Receipt Card. - Any evidence of Selective Service Registration. DISTRICT DIRECTOR - Any documents you have which you used in connection with any entries into the United States. - Those items noted on the reverse side of this letter which are applicable to you. - Filing Fee. $25.00 CASH ONLY (NO COINS). 3 IDENTICAL PHOTOS-2\" x2\" LIGHT BACKGROUND, FRONT VIEW 1-1/2\" (TOP OF HEAD TO POINT OF CHIN) TAKEN 30 DAYS PRIOR TO 1ST INTERVIEW. Please KEEP this APPOINTMENT even if you do not have all the items noted above or those on the back. However, you MUST bring the Filling Fee. Form N-430A IMPORTANT - PLEASE SEE REVERSE"
}
