{
	"anumber": "A21235980",
	"id": "A21235980_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0011/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEMORANDUM OF CL.ATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, Form Number: 1-157"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1078, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES Screened by NARA, 9/21/2023 JUSTICE Immigration and Naturalization Service MEMORANDUM OF Ck. LATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles. CA File No. A- 2I 235 980 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Street TRAN, Mau Ngoc Thi F I/I/I5 Address I8449 COlline St # I9 PLACE OF BIRTH City, State, Zip Tarzana. CA 9I356 Nam-Dinh. Vietnam abbioaci NATIONALITY 12 01 of ou volice COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam PRIORITY DATE pejole betwayed REMARKS Indochinese refugee NONPREFERENCE: Section 212(a)(14) certification not required because: case Individual section 212(a)(14) certification issued Blanket section 212(6)(14) certification issued under the following provision of law: Sec 203(h) of the & N Act Sec 249 of the I & N Act Sec 214(d) I & Act oppel BASU sponap a pecowez Private Law no. of the Sec 244( (oi)( of the & N Act Sec 1 of the Act of 11/2/66 Congress session WILDIN we of the ) Sec 245 of the & N Act Sec 13 of the Act of 9/11/57 Public Law 95-I45 (Other law Specify) biorguse 111149 Sice (7) As at Los Angeles. CA OL (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE bioxiged a OL that 12 Class of admission. (Insert symbol) apilli IU we DATE use obbycau was OF APR 1078 APR 29 1978 RECOMMENDED BY: (Immigration Officer) (3) (Date) ACTION !2 bubbli mulcue we gaie as 140 291526 Sureck DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State C0262 MUSIC for/walqee to Preference Category PROCESSED FOR 1,551 suqoi26q TEMPORARY EVIDENCE OF Number LAWFUL ADMISSION FOR TOO PERMANENT RESIDENCE benuqueus Month of Issuance VALID UNTIL EMPLOYMENT AUTHORIZED Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}
