{
  "anumber": "A21204721",
  "id": "A21204721_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21204721_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 204 721T"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 IMPORTANT: PLEASE READ INSTRUCTIONS ON BACK OF PAGE ONE BEFORE FILLING OUT MEMORANDUM 5. GOVERNMENT PRINTING OFFICE: 1974-535 -200 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Portland, Oregon File No. A21 204 721T Status as a lawful permanent resident of-the United States is accorded: SEX DATE OF BIRTH Name Street DO, Than Thi F 1915 Address 1825 NE 66th Ave, #52 PLACE OF BIRTH City, State, Zip Portland, Oregon 97213 Phuc Yen, Vietnam NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam PRIORITY DATE 08/16/95 REMARKS NONPREFERENCE Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 Sec 101 (Other law Specify) 08 of 16 75 As at Portland, Oregon (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) IC6 (Applicable in all cases) DATE OF 7/27/71 8 RECOMMENDED BY: (Immigration Officer) (Date) ACTION DD Liff. Dahlin me DISTRICT FOR USE BY VISA CONTROL OFFICE Portland, Oregon Date Foreign State F/P 9/29/78100 PHOTO SPM Preference Category I 89A & WKSHT I-181 pg 2 Number Month of Issuance I-94 UN 1 1979 co Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - - 181 (Rev. 5-1 - 74) N (Page 1)"
}