{
	"anumber": "A21206025",
	"id": "A21206025_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Information about your residences and employment., Form N-4 ( (Rev 07/1971)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam"]
		},
		"years": {
			"ms_years_nlp_v1": [1980, 1954, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 Part 4. Information about your residences and employment. A. List your addresses during the last live (5) years or since you became a permanent resident, whichever IS less. Begin with your current address. If you need more space, continue on separate paper: Dates (month/day/year) Street Number and Name, City, State, Country, and Zip Code From To 202 Aristotle St. Since valley CA USA 93065 Jul 1 193 present 1682 Dunham Circle Thousand oaks CA USA 91360 Jul' 93 NO other 3 B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write \"None\". If you need more space, continue on separate paper. Employer's Name Employer's Address Dates Employed (month/day/year) Occupation/position Street Name and Number - City. State and ZIP Code From To N/A 7 SSI 1980 present retired 5 NO other Part 5. Information about your marital history. 6 DOM-1933 Dec 1954 A. Total number of times you have been married / . If you are now married, complete the following regarding your husband or wife. Family name Given name Middle initial 7 Bui The Tich Address Date of birth Country of birth Citizenship (month/day/year) Social A# (if applicable) Immigration status Security# (If not a U.S. citizen) Naturalization (If applicable) (month/day/year) Place (City, State) No others If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. B. Total Number of Children 6 Complete the following information for each of your children. If the child lives with you, state \"with me\" in the address column; otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" in the address column If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address ANH N. Bui LINK C is Deceased MY HANH T. BUI UNK ENTERNAME N/A 47 LeLoi. VUNGTAU VN. MY DUNG .T. Bui UNK D is De ceased RHIET N. Bur 12-23-40 viet Nam U.S. Tuoc N. BUI 4-16-43 U.S. FOIA (b)(6)2570 young Ave J. CA 91360 \" with me My TUAN T. Bui 5-16-47 \" U.S. 642 TARA St N.P. CA91 320 NO other 12 Form N-400 (Ruv 07/17/91)N Continued on next page"
}
