{
  "anumber": "A21203763",
  "id": "A21203763_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1948
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 7. INELIGIBILITY.-Yo are ineligible for status as a permanent Application for the certification of the Secretary of Labor (or his resident if you checked box \"A\" or \"D\" of block 1 and: designated representative) must be made on Labor Department (a) You entered the United States as a member of the crew of a Forms entitled the \"Statement of Qualifications of Alien\" and vessel or aircraft or were destined to join a vessel or aircraft in the \"Job Offer for Alien Employment\", in accordance with the instruc- United States as a member of the crew when you arrived in this tions for the completion of those forms. The forms, instructions, country. and information concerning the \"Schedules\" may be obtained at (b) You were not admitted or paroled into the United States fol- principal offices of the Immigration and Naturalization Service, lowing inspection by a United States immigration officer. U. Consular offices and at local offices of the State employment (c) You are or have been an exchange alien, subject to, but have service. not complied with the foreign residence requirement of section If your occupation is not listed in \"Schedule application for 212(e) of the Immigration & Nationality Act and have not been certification must be made directly to the Department of Labor granted a waiver of this requirement. (This ground of ineligibility through the local office of the State employment service. When and applies to persons who checked box \"A\", \"B\", \"C\" or \"D\" of if a certification is issued to your employer, it should be submitted block 1.) with your application, together with the \"Statement of Qualifica- (d) You have, on or after January 1, 1977, continued in or ac- tion of Alien\", \"Job Offer for Alien Employment\", and documen- cepted unauthorized employment, unless you are an immediate tary evidence of your qualifications. If your occupation is listed in relative of a United States citizen as defined in section 201(b) of the \"Schedule A\" you must submit the forms with this application Immigration and Nationality Act. directly to the Immigration and Naturalization Service. (e) You entered the United States as an alien transit without visa. The following documentary evidence of your qualifications must NOTE: If you are ineligible under any of the foregoing but have be submitted with application for a labor certification: resided in the United States continuously since prior to June 30, a. Labor Department Forms entitled the \"Statement of Qualifica- 1948, you may still apply on this form to have a record of lawful tions of Alien\" and \"Job Offer for Alien Employment\" executed in admission for permanent residence created under section 249, Im- accordance with the instructions for completion of that form. migration and Nationality Act. In such case check box \"E\" or \"F\" b. Documentary evidence of your qualifications as follows: of block 1. (1) School Records-If your eligibility is based in whole or in part on higher education or attendance at a technical or vocational 8. IMMEDIATE RELATIVE AND PREFERENCE ALIENS.-If school, attach certified copy of school record. The record must you are claiming eligibility through relationship to a United States show period of attendance, major field of study, and degrees or citizen or permanent resident alien, a visa petition must be filed on diplomas awarded. your behalf for immediate relative or first, second, fourth, or fifth License or Other Official Permission to Practice a Profession.- preference classification. If you are claiming eligibility based on your If you are a member of a profession, attach a copy of the license profession or occupation, a third or sixth preference visa petition or other official permission granted to you to practice the profes- may be filed on your behalf. You are ineligible for adjustment of sion in the country where you were found qualified to practice that status or for the issuance of an immigrant visa under any of the profession if a license or other permission is required in that foregoing classifications unless you are the beneficiary of a valid un- country. expired visa petition approved on your behalf. (3) Evidence of Exceptional Ability in the Sciences or the Arts- NOTE: If you checked box \"B\",\"\"\"\" or \"F\" of block 1 of this If your eligibility is based upon exceptional ability in the sciences or application, instruction 8 does not apply to you. the arts, documentary evidence supporting the claim should be sub- If a visa petition is required to establish immediate relative or pre- mitted. Such evidence may testify to the universal acclaim and ference status, it must have been approved prior to filing this appli- either national or international recognition accorded you; show that cation. you have received a nationally or internationally recognized prize 9. IMMEDIATE AVAILABILITY OF IMMIGRANT VISA.-In- or award or won a nationally or internationally recognized competi- formation as to immediate availability of an immigrant visa may be tion for excellence for a specific product or performance or for out- obtained at the nearest office of this Service. standing achievement; or testify that you are a member in a nation- al or international association of persons which maintains stan- 10. CERTIFICATION OF THE DEPARTMENT OF LABOR.- dards of membership requiring outstanding achievement as judged All certifications must be valid at the time of approval of this by recognized national or international experts in the specific dis- application. cipline or field of endeavor. The following instruction applies to you only if: you checked (4) Physicians or Surgeons.-If you perform services as a member box \"D\" of block 1 of the application, and you are performing or of the medical profession you must submit evidence of graduation seek to perform skilled or unskilled labor, and you are seeking ad- from a medical school, satisfactory completion of parts I and II of justment as a nonpreference alien. You are considered to be a non- the National Board of Medical Examiners Examination (or an e- preference alien if you are not the beneficiary of a currently valid quivalent examination as determined by the Secretary of the De- visa petition approved by the Immigration and Naturalization Ser- partment of Health, Education, and Welfare), and competence in vice to accord you a preference or immediate relative classification, oral and written English. and you are not a member of one of the classes of \"special immi- grants\" listed in section 101(a)(27) of the Immigration and Nation- ality Act, as amended. (The classes of \"special immigrants\" include certain former citizens of the United States; certain ministers of religious denominations, and certain employees or honorably re- tired former employees of the United States Government abroad.) If you are a nonpreference alien who has checked box \"D\" in block 1 of this application, and you are performing or seek to per- form skilled or unskilled labor, you are subject to the requirement contained in section 212(a)(14) of the Immigration and National- ity Act, as amended, of obtaining a certification from the Secre- tary of Labor that there are not sufficient workers in the United States who are able, willing, qualified, and available to perform such skilled or unskilled labor, and your employment will not ad- versely affect the wages and working conditions of workers in the United States similarly employed. The Department of Labor pub- lishes lists (Schedules) of occupations in Part 656, Title 20, Code of Federal Regulations. \"Schedule A\" is a list of occupations for which the Secretary of Labor has issued a blanket certification for qualified persons. \"Schedule B\" is a list of occupations for which the Secretary of Labor has found that sufficient workers are available in the United States or the admission of aliens for employment in such occupa- tions will adversely affect wages and working conditions of wor- kers in the United States similarly employed. WARNING: If you contemplate departing from the United States to any country, including Canada or Mexico, before a decision is made on your application, consult with the office of the Immigration and Naturalization Service processing your case before departure, since a de- parture from the United States may result in a termination of your application. If you have not attached the documents called for by the in- structions, this application will be returned to you. PENALTIES: Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false document in the sub- mission of this application."
}