{
  "anumber": "A21206025",
  "id": "A21206025_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0073/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325C ( (9-1-74) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915,
        1976
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['no record']"
      },
      "nationality": {
        "nationality_llm_v1": "Vietnam"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325C (9-1-74) Y Screened by NARA, 7/28/2023 Form Approved UNITED STATES DEPARTMENT OF JI OMB No. 43-R436 BIOGRAPHIC Immigration and Naturalization Se INFORMATION (Family name) (First name) (Middle name) BIRTHDATE (Mo.-Doy-Yr.) NATIONALITY MALE LE THIN THI EMALE 1915 VIET NAM ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH NONE HANOI VIET NAM FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (if known) CITY AND COUNTRY OF RESIDENCE FATHER LE MAU (Dead) MOTHER (Maiden name) NGUYEN LIEN SAIGON VIETNAM HUSBAND or WIFE FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (If none, so state) (For wife, give maiden name) BUI TUC Dead FORMER HUSBANDS or WIVES (Fill in the blocks below. If none, state \"none\".) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE None APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 825 CALLE HAYA # 8 THOUSAN CA VSA 3 76 PRESENT TIME OKS 2271 CALLE CAMELIA \" 11 / 76 3 76 8842 GPIMES CYN Rd Moozpark 11 is 9 75 / 76 Welmar Med center Weiman \" 4 6 75 9 75 CAMP PENDLE TON 11 \" 5 75 6 75 6/2/18 LE VAN DUYET SAIGON SALGON VIETNAM / 74 4 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (if none, so IMM. NATE FIRST. FROM TO 11. S. FULL NAME AND ADDRESS OF EMPLOYER FORT MEADE MD. 20/59 OCCUPATION MONTH YEAR MONTH YEAR NONE REF'D. TO WAS PRESENT TIME FOR FILE REVIEW JUN 2 '76 No Record IF YOUR NATIVE ALPHABET Nation HEROTHAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: APPLICANT FOR Report Attached. - Pages CONDITIONAL ENTRY Remarks on Reverse Win PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW 4/14/76 FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE SIGNATURE OF APPLICANT OR PETITIONER) COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) LE THIN THI A21 206 025 (OTHER AGENCY USE) (INS USE) CONDITIONAL ENTRY APPLICANT Return to: Immigration and Naturalization Service NO RECORD 23 ON OFFICE CODE: JUN 1976 SFR TYPE OF CASE DCHIDIS VIETNAMESE REFUGEE DATE: JUNE 18, 1976 FORM -325C (4) Bal. (DCII)"
}