{
  "anumber": "A21206025",
  "id": "A21206025_0067",
  "page_index": 67,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0067/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information Form G-325A, FORM G-325A ( (REV. 10-1-74) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['n.a']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "VIETNAM"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A(REV.10-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 BIOGRAPHIC Immigration and Naturalization Service INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. LE THIN THI FEMALE 6-21-15 VIETNAM (If any) 206-025 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. N / A HANOI VIET NAME (If any) 34-4175 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE. FATHER LE MAU known Deceased MOTHER (Maiden name) NGUYEN LIEN Unknown SAIGON VIET NAM HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE OR PLACE OF MARRIAGE WIFE (For wife, give maiden name) BUI TUC Deceased FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 825 Calle Haya # 8 1000 oaks CA USA 2 76 PRESENT TIME 2217 Catte Camel a 1000 Oaks CA USA 10 75 2 76 8842 grimes Cyn Rd Moonpark CA USA 8 75 10 Weimer Medical leater Weilmar CA USA 75 6 75 8 75 Camp Pendle ton Occauside CA USA 5 IS 6 75 623/184 LE van Duyet SAIGON V N 5 13 4 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 623 /18A LE VAN DUYET SAIGON V.N 3 75 4 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER N/A OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) NONE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): My 3/28/78 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) LE THIN THI 21-206-025 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: FORM G-325A (4) Consul"
}