{
	"anumber": "A21202116",
	"id": "A21202116_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202116_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325A ( (REV. 10-1-74) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1915, 1914, 2023, 1978]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' retired', 'typist']"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Y Screened by NARA, 7/28/2023 AUG 15 1978 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. TRAN CHINH vam FEMALE July/14,1915 Th Vietnam (If any) 4 21202 116 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Victnam (If any) 586-40-7824 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE. TRAN FATHER TRIEV They MOTHER (Maiden name) HUSBAND (If none, so state) FAMILY NAME by FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give maiden name) LaM DOM 1914 Vietnam Mam Ding Vict-nam FORMER HUSBANDS OR WIVES(if none,so state) None FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 632 Westchester- LaF, IN. U.S 12 77 PRESENT TIME 1106 Ferry St. laf. IN, U. S 7 75 12 77 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 15 yen the Salyon Vietnam / 75 it 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Tippecance senior center lypist 12 76 PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Whinit 5/1H/78 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET is IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
