{
  "anumber": "A21207655",
  "id": "A21207655_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21207655_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF REFUGEE TRAVEL DOCUMENT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "4890 UNITED STAFES DEYMAR JUSTICE GPO: 1977-224-877 Immigration and Naturalization Service UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form approved. OMB No. 43-R 0517 APPLICATION FOR FEE STAMP ISSUANCE OR EXTENSION OF REFUGEE TRAVEL DOCUMENT UPDATED 00 31 (Article 28, United Nations Convention of July 28, 1951 and Protocol of 1967 ENTERED-RAI relating to Status of Refugees. 8 CFR 223a) 006591 I hereby apply for (check UPDATED Issuance Extension of refugee travel document. FAMIL Y NAME (Capital Letters) FIRST MIDDI E 1. YOUR NAME NGUYEN, BACH CHI THI IMPORTANT: If you are an applicant for issuance of a Refu- IN CARE OF CO None gee Travel Document submit your Alien Registration Card and any reentry permits previously issued to you with this appli- MAILING (No and Street) (Apt No.) ADDRESS 54 SOUTHERN OAKS COURT cation. (City) IN US LAKE JACKSON (State) TEXAS 77566 IZIP Code) If you are an applicant for extension of the document submit with this application only the document and complete blocks 2. ALIEN REGISTRATION NUMBER 1, 2, 19, 20 and 21; if you are a lawful permanent resident al- A2I207655 so complete block 18. 3. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY, IF ANY COLOR OF EYES COLOR OF HAIR 3/2/10 VIETNAM VIETNAM Brown Gray HEIGHT VISIBLE MARKS AND SCARS Country from which I am a refugee 5 FEET 02 INCHES None VIETNAM 4. My present immigration status in the U.S. is (Parolee, lawful permanent resident, conditional entrant, visitor, etc.) Lawful permanent resident 5. At time of my last arrival in the U.S. I was accorded the immigration status of parolee I last arrived in the U. S. at: on: by: (name of vessel, airline (city and State) (date) or other means of travel) I was inspected. GUAM 042975 Military aircraft was not I was last issued a visa by a U. S. Consul in: on: (date) Type of Visa (city and country) Not applicable 6. Check One: I believe I am a refugee because I came to the U. S. under a U. refugee law or program, or because I was granted a status or benefit by the U. S. Immigration and Naturalization Service on the basis of a claim to persecution. I believe I am a refugee for the following reasons: (Furnish specific details and attach supporting evidence). 7. a. Since becoming a refugee: have have not voluntarily re-availed myself of the protection of the country of my nationality. have have not voluntarily re-acquired the nationality which I lost. have have not acquired a new nationality. have have not voluntarily re-established myself in the country which I left, or outside which I remained, owing to fear of persecution. The circumstances in the country of my nationality (or country of former habitual residence if stateless) which resulted in my becoming a refugee have have not ceased to exist. b. I am am not in possession of a passport or similar document. If you have such document, give name of country of issuance and date of expiration. 8. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership, and the periods and places of such membership. (If you have never been a member of any organization, state \"none\".) None FORM 1-570 (REV. 4-1-76) N (over)"
}