{
  "anumber": "A21201153",
  "id": "A21201153_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Form, A-20"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1981,
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 NOTE.-Questions 8 through 12 refer only to the places for which petitioner has asked the witness to furnish testimony. As exact dates are important, each block should be filled in as completely as possible. 8. Q. To your personal knowledge, where and between what dates has he or she resided in the United States? From To- A. City or Town State Month Day Year Month Day Year 412 Phyllis Dr., Apt. 4 Killeen, Texas Texas 5 I 75 9 30 77 6562 Farinella Dr. Huntington Beach California 10 l 77 6 30 '79 1027 Mission Dr Costa Mesa California 7 I '79 3 31 '80 7172 Main st. Westminster California 4 I 180 PRESENT 9. Q. Where did you live during the time he or she resided in the places mentioned in Question 8? A. 8918 La Dona et , Fountain Valley, CA 92708 (Street and number) (City) (State) Country) 10. Q. How often did you see him or her while he or she resided in the places mentioned in Question 8? A. (Show specifically, such (as \"daily, \"weekly,\" \"monthly,\" or \"yearly.\") Monthly 11. Q. Since you first met him or her in the United States has he or she ever been absent from the United States? (Yes or No) (If yes state when, how long and purpose of each absence) A. NO 12. Q. Has he or she been arrested or charged with, or convicted of, a crime or a violation of law? (Yes or No) (If \"yes\", include date, place, and description of offense.) A. NO 13. Q. Has he or she to your knowledge, been a person of good moral character during all the time you have known him or her? A. YES (Yes or No) 14. 2. Has he or she ever been an anarchist, a believer in anarchy, or a member of the Communist Party or affiliated with any other subversive organization, or with any group of persons teaching disbelief in or opposi- tion to organized government? A. NO (Yes or No) (If \"yes\" include explanation) 15. Q. During all the time you have known him or her, has he or she believed in the principles of the Con- stitution of the United States and when naturalized will he or she be loyal to the United States? A. YES (Yes or No) 16. Q. Do you know of any reason why he or she should not become a citizen of the United States? (Yes or No) (If \"yes\" include full details in regard to each reason.) A. NO 17. Q. Do yo recommend or her for citizenship? A. YES TRAN HUNG VOONG (Yes or No) NOTARY PUBLIC - CALIFORNIA PRINCIPAL OFFICE IN huynhoale ORANGE COUNTY (Signature of witness) Subscribed and sworn_f before Mv Commission Expires Mar 30. 1984 this 21 day of July , 1981 , Certificate of naturalization or citizenship exhibited by witness. was Tran Harry Uning (Was or Was not) (Signature of attestor) .LOM-8-78-60.500 1593 NOTARY (Title of attestor) (Page 2)"
}