{
  "anumber": "A21201153",
  "id": "A21201153_0065",
  "page_index": 65,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0065/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, FD-258 ( (Rev. 4-25-72)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 FEDERAL BUREAU OP INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 1. LOOP APPLICANT CENTER OF LOOP TO OBTAIN CLASSIFIABLE FINGERPRINTS 1. USE PRINTER'S INK 2. DISTRIBUTE INK EVENLY ON INKING SLAB 3. WASH AND DRY FINGERS THOROUGHLY 4. ROLL FINGERS FROM NAIL TO HAIL, AND AVOID ALLOWING FINGERS TO SLIP 5. BESURE IMPRESSIONS ARE RECORDED IN CORRECT ORDER 6. IF AN AMPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER MAKE A NOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER BLOCK DELTA 7. IF SOME PHYSICAL CONDITION MAKES IT IMPOSSIBLE TO OBTAIN PERFECT IMPRESSIONS SUBMIT THE BEST THAT CAN BE OBTAINED WITH A MEMO STAPLED TO THE CARD EXPLAINING THE CIR CUMSTANCES 8. EXAMINE THE COMPLETED PRINTS TO SEE IF THEY CAN BE CLASSIFIED BEARING IN MIND THAT THE LINES BETWEEN CENTER OF MOST FINGERPRINT FALL INTO THE PATTERNS SHOWN ON THIS CARD (OTHER PATTERNS OCCUR LOOP AND DELTA MUST SHOW INFREQUENTLY AND ARE NOT SHOWN HERE). 2. WHORL LEAVE THIS SPACE BLANK THIS CARD FOR USE BY: DELTAS 1. LAW ENFORCEMENT AGENCIES IN FINGERPRINTING APPLICANTS FOR LAW ENFORCEMENT POSITIONS AND APPLICANTS FOR EMPLOYMENT LICENSES OR PERMITS IN THOSE STATES WITH STATUTES PROVIDING FOR INGER MENT, LICENSE OR PERMIT TO BE ISSUED LOC PRINTING AS REQUISITE FOR THE TYPE OF ILLEGIBLE PRINT COUNTY ORDINANCES UNLESS SPECIFICALLY BASED ON APPLICABLE STATE STATUTES, DO NOT SATIS REASON REQUIREMENT A SET OF APPLICANT PRINTS MUS BE CHECKED THROUGH THE APPROPRIATE.STA IDEN. TIFICATION BUREAU OR, IF NO SUCH BUREAU EXISTS THROUGH A CENTRAL AGENCY DESIGNATED FO su FBI IDENTIFICATION DIVISION THESE LINES RUNNING BETWEEN PURPOSE WITHIN THE STATE ONLY THOSE FINGE PRINTS FOR WHICH DISQUALIFYING RECORD HAS BEEK DELTAS MUST BE CLEAR LOCALLY SHOULD BE SUBMITTED FOR FBI SEARCH. IF A MORE CURRENT COPY OF AN EXISTING FBI IDENTIFICA. 3. ARCH TION RECORD is REQUIRED SIMPLY SUPPLY NAME FBI 433 NUMBER OR LOCAL ARREST NUMBER AND, IF READILY AVAILABLE THE PRIMARY AND SECONDARY PARTS OF THE FINGERPRINT CLASSIFICATION 2. U.S. GOVERNMENT AGENCIES IN CONNECTION WITH CLEARANCES IDENTITY OF PRIVATE CONTRACTOR SHOULD BE SHOWN IN SPACE \"EMPLOYER AND ADDRESS. THE CONTRIBUTOR IS THE NAME OF AGENCY SUBMITTING THE FINGERPRINT CARD TO THE FBI. FBI NUMBER IF KNOWN, SHOULD ALWAYS BE FURNISHED IN APPROPRIATE SPACE. MISCELLANEOUS NO. - RECORD: OTHER ARMED FORCERECORDED NO. PASSPORT NO. (PP), ALIEN REGISTRATION NO. (AR), PORT SECURITY CARD NO. (PS), SELECTIVE SERVICE NO. MAY 13 1975 ARCHES HAVE NO DELTAS (SS), VETERANS' ADMINISTRATION CLAIM NO. (VA). IDENT. DIV. 97 FD-258 (Rev. 4-25-72) U. S. GOVERNMENT PRINTING OFFICE: 1974 - 553-317"
}