{
	"anumber": "A21203763",
	"id": "A21203763_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF REFUGEE TRAVEL DOCUMENT, G100"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1915, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. UNITED STATES DEPARTMENT JUSTICE Immigration and Naturalization Service UNITED STATES DEPARTMENT OF JUSTICE Form-approved. Immigration and Naturalization Service OMB No. 43-R 0517 G100 APPLICATION FOR FEE STAMP ISSUANCE OR EXTENSION OF 6-1-76 REFUGEE TRAVEL DOCUMENT some (Article 28, United Nations Convention of July 28, 1951 and Protocol of 1967 Tel. 488-9658 relating to Status of Refugees. 8 CFR 223a) office 483-0644 I hereby apply for (check one): Issuance Extension of refugee travel document. FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME THIEL BANH IMPORTANT: If you are an applicant for issuance of a Refu- IN CARE OF C/O gee Travel Document submit your Alien Registration Card with this application. (No. MAILING ADDRESS and 636 Street) (Apt. No. ALPINE ST #5 If you are an applicant for extension of the document, submit (ZIP Code) with this application only the document and complete blocks IN U.S. 2. ALIEN REGISTRATION NUMBER (City) LOSANGELES (State) CA 90012 1, 2, 19, 20 and 21; if you are a lawful permanent resident also complete block 18. 21 203 763 3. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF NATIONALITY IF ANY COLOR OF EYES COLOR OF HAIR 01-1-1915 CANTON, CHINA VIETNAM Black GRAY HEIGHT VISIBLE MARKS AND SCARS Country from which I am a refugee FEET INCHES No VIETNAN 4. My present immigration status in the U. S. is (Parolee, lawful permanent resident, conditional entrant, visitor, etc.) ViETNAM REFUGEE 5. At time of my last arrival in the U. S. I was accorded the immigration status of REFLIGEE I last arrived in the U. S. at: on: by: (name of vessel, airline NOS ANGELES CALIF (city and State) san-Diego (date) or other means of travel) was inspected. 7-3-75 MILITARY was not I was last issued a visa by a U. S. Consul in: on: (date) Type of Visa (city and country) SND 7-3-75 REFUGEE 6. Check One: I believe I am a refugee because I came to the U. S. under a U.S. refugee law or program, or because I was granted a status or benefit by the U. S. Immigration and Naturalization Service on the basis of a claim to persecution. I believe I am a refugee for the following reasons: (Furnish specific details and attach supporting evidence). C C 7. Since becoming a refugee: I have have not voluntarily re-availed myself of the protection of the country of my nationality. have have not voluntarily re-acquired the nationality which I lost. have have not acquired a new nationality. have have not voluntarily re-established myself in the country which I left, or outside which I remained, owing to fear of persecution. The discumstances in the country of my nationality (or country of former habitual residence if stateless) which resulted in my becom- ing a refugee have have not ceased to exist. b. I am am not in possession of a passport or similar document. If you have such document, give name of country of is- suance and date of expiration. 8. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership, and the periods and places of such membership. (If you have never been a member of any organization, state \"none\".) NONE For Statistics Received Ir. In Read-Tr. Out MAY 28 1976 JUN 11 1976 FORM 1-570 (REV. 12-1-73) (over) LB"
}
