{
	"anumber": "A21203763",
	"id": "A21203763_0058",
	"page_index": 58,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0058/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325A ( (REV. 10-1-74)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1975, 1891, 1970, 1969, 1894, 2023, 1926, 1976, 1977, 1915]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['student', ' manager']"
			},
			"reason": {
				"reason_llm_v1": "Yes"
			},
			"nationality": {
				"nationality_llm_v1": "VIETNAM"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Y Screened by NARA, 9/21/2023 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. THIEU, BANH FEMALE JAN. 1, 1915 VIETNAM (If any) A21-203-763 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. -CAINA (CANTON) (If any) 1586-32-8966 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(I known) CITY AND COUNTRY OF RESIDENCE THIEU KY 1891 CHINA FATHER MOTHER (Maiden name) LUU; THI, 1894, CHINA HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE NGUYEN THI HAI 1926 CANTHO, ViETNAM 1949 VIETNAM FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR PRESENT TIME ALPINE ST. #5, 636 Los ANGELES CA90012 USA 12 1975 APRIL 1977 Westmoreland ST, 1242 Los ANGELES CA 90029 \" 8 1975 Dec. 1975 115thst. No 3937 W Hawthorne CA 90250 by 7 1975 TRAN HUNG DAO BLUD. Aug. 1975 No 762 (lotfl.) SAIGON VIETNAM 11 1970 April 1975 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR South Bay college 1800 Los BeverlyBlud Student PRESENT TIME Angeles 8 1976 April 1977 TAPHACO 762 lot Floor TRAN - MANAGER 5 1969 April 1975 HUNG DAO BLVD SAIGON, VIETNAM Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): FOR EXTENSION Theukon 04-26-1977 IS YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAR LETTERN WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
