{
	"anumber": "A21202301",
	"id": "A21202301_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202301_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, N-430A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/22/2023 OMB #1115-0064 Expires 3/31/84 U.S. Department of Justice Immigration and Naturalization Service barial Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch qidanosing to 10 drid 90 LIAHIA 300 NORTH LOS ANGELES STREET not 21.202.301 (noblid 11/09/1983 LOS ANGELES CA 90012 to File or A # (negblido) blids Date disid DOY deplair deight riginnol ni deign3 16 to letos not ads anivil TO to millings 20 shoilings drid estine 525 bns You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, 25163 bariaU here 2£ MOITASLASUTA AND PLACE/shownbelow mo) Date nothergommi doirtw of boa boilqgs eved modw not visitulov to 1:10 PM not TOAI DINH 00 Time 3820 W.CLARK AVE. us 320 SIMMOT BURBANK, CA 91505 300 NORTH LOS ANGELES STREET Place LOS ANGELES, CA 90012 ₫31,894.M animal 31AM FEDERAL BUILDING DOWNTOWN ROOM NUMBER: 8010 role3 noixalgmo HW198 bns a-d (earbell You MUST BRING the following with you: MICHAEL M. LANDON, JR. - This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED IN. - Alien Registration Receipt Card DISTRICT DIRECTOR wheM avipaitai() - Any evidence of Selective Service Registration. - Any documents you have which you used in connection with any entries into the United States. - Those items noted on the reverse side of this letter which bleto you IDENT CAL PHOT S-2 \"X2\", LIGHT BACKGROUND FROM VIEW - Filing Fee. 1-1/2 (TOP OF TO POIN 7 OF (HIN) TAK N DAYS PRIOR TO 1ST INTERVIEW. ord Please KEEP this APPOINTMENT even if you do not have all the items noted above or those on the back. However, you MUST bring the Filling Fee. Form N-430A IMPORTANT - PLEASE SEE REVERSE"
}
