{
	"anumber": "A21201153",
	"id": "A21201153_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INTERROGATORIES IN DEPOSITIONS OF WITNESSES"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 12/201153 UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVICE OMB No. 43-R0097 JUL 23 1981 CLERK OF COURT: Please file with petition Michael H Landen 8/41/ H ( District Director or Officer in Charge) (Date) do Filed , 19 (Clerk or Deputy Clerk) (Date) INTERROGATORIES IN DEPOSITIONS OF WITNESSES (To be answered by witness, not by petitioner) IN THE MATTER OF Ke Duc Pham 19207 Petitioner for naturalization Petition No. Court of California at Sentu Ins, In HUYNH HOA LE being first duly sworn by me, deposed, testified and said as (Name of witness) follows: 1. Q. State your full name, age, and address. A. Name HUYNH HOA LE age 41 address (Street and number) 8918 La Dona (City) Ct., Fountain (State) Valley, CA 92708 Country) (ZIP Code, if in U.S.) 2. Q. Where were you born? A. Tra Vinh, Vietnam (City) (State) (Country) 3. Q. Are you a citizen of the United States? A. Yes (Yes or No) 4. Q. If you are a naturalized citizen, state WHEN, WHERE, and in WHAT COURT you were naturalized and the number of your certificate. (ORIGINAL CERTIFICATE MUST BE SHOWN TO PERSON BEFORE WHOM THE FORM IS SWORN TO.) A. 10/30/79 Santa Ana; Calif. Superior Court; Cert. # 10940314 5. Q. If you claim citizenship through another person, such as a parent, state that person's name, rela- tionship, when and how he or she became a citizen, and the number of YOUR certificate of citizenship if one has been issued to you. A. (Leave blank if you are a citizen by birth in U.S.) 6. Q. State when and where you first met PHAM KE DUC in the United States (Name of petitioner) and how you came to meet him or her. A. October (Date) 1977 Huntington Beach, (Place) Calif. old friend from Vietnam (Circumstances under which you met) 7. Q. Have you personally known him or her to be a resident of the United States? A. Yes (Yes or No) FORM N-462A (Rev. 6-6-78) N (Page 1)"
}
