{
  "anumber": "A21202116",
  "id": "A21202116_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202116_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PLEASE NOTE"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 PLEASE NOTE Because of the vastness of our fingerprint records, it is imperative that the complete classification formula be employed for searching and filing in each instance. Accurate classifying depends primarily upon the best possible rolled impressions that can be taken. Fully rolled, clear impressions allow for accurate pattern differentiation, ridge counting, whorl tracing, and interpretation of whorl types. It is suggested that each newly completed fingerprint chart be examined to ascertain if it can be fully classified, bearing in mind the following: (1) loop-type patterns cannot be classified unless the center of the loop, the delta, and the ridges between them are clear; (2) whorl-type patterns cannot be classified unless the deltas and the ridges connecting them are clear; (3) arch-type patterns can be classified as such only if a sufficiently clear impression is obtained to permit identification of the pattern as belonging to the arch category. While a concerted effort is made to retain every fingerprint card forwarded us for processing, in some instances this is not possible. The FBI fully recognizes the occurrences of situations which challenge the ingenuity of the identification officer to secure legible impressions. All returned fingerprint cards do not necessarily reflect upon the ability of the operative taking the prints and no returns are made at any time with such a thought in mind. Your earnest co-operation is solicited in obtaining the best possible impressions in each block on each fingerprint card forwarded us for search. By so doing you are rendering a real service and making a major contribution to all agencies participating in the fingerprint exchange program."
}