{
	"anumber": "A21201153",
	"id": "A21201153_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/21/2023, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1946, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 (30) My occupation is NONE List the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 19 PRESENT TIME (b) 19 19 (c) 19 19 (d) 19 19 (31) Complete this block if you are or have been married. I am married The first name of my husband or wife is (was) LE CHITHI (Single, married, divorced, widowed We were married on 09 21 1946 at VIET NAM He or she was born at VIEINAM on 01 03 1915 He or she entered the United States at (place) on (date) for permanent residence and now resides with me apart from me at 8412 Tamura (Show full address if Dr. living Apt with you.) D, Hunlington Beach California 92647 not He or she was naturalized on None at ; Certificate No or became a citizen by His or her alien Registration No. is A21201155 (32) How many times have you been married? One How many times has your husband or wife been married? One If either of you has been married more than once, fill in the following information for each previous marriage. (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS HOW MARRIAGE CITIZEN ALIEN ENDED (a) NONE (b) (c) (d) (33) I have 26 children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- Number) wise give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date Born of Entry Port of Entry (g) Alien Country) Registration No. (h) Now Living at- FOIA (b)(6) me More (34) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) I want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $15 for each child for whom you want certificates, otherwise, send no money with this application.) ( Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages"
}
