{
	"anumber": "A21235980",
	"id": "A21235980_0045",
	"page_index": 45,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0045/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, NARA Form I-589A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1951, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 9. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date and place and nature of each charge and the final result.) 10. I have have not previously filed an application with the U. S. Government or any other government for a Refugee Travel Document under the U. N. Convention of July 28, 1951 relating to the status of refugees. (If you have ever filed such application, give the place and date of filing and final disposition.) 11. Check one: My Alien Registration Receipt Card is attached. Application Form I-90 or 1-102 for issuance of Alien Registration Receipt Card is attached. 12. FILL IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A REFUGEE TRAVEL DOCUMENT FROM THE U. S. I & N SERVICE. Issuance date of last document Location of I & N Service Office issuing last document (city and state) My last document is is not attached. If document not attached, state reason: 13. I have have not been under exclusion or deportation proceedings in the United States. If you have been under exclusion or deportation proceedings give date and place proceedings were started: 14. The following members of my family are also applying for a Refugee Travel Document: (Give name and relationship.) Bonard Yvonne 15 Date of proposed departure from U.S. Length of intended absence abroad october 11976 h month and half Mailing address abroad: (Number and street) (City/Town) (State/Province/District) (Country) 13 Ave de la Commune de saris is Garges les Gonnesses Countries to be visited (List each country) Reasons for going abroad (Be concise and complete): French visite the cousin 16. I did did not register for Selective Service. 17. Completed Form G-325A (Biographic Information is attached Completed Form G-325A (Biographic Information is not at- as part of this application. tached as applicant IS under 14 years of age."
}
