{
	"anumber": "A21201153",
	"id": "A21201153_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificate of Naturalization, 11207"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1982, 2023, 1915]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "N.A"
			},
			"marital_status": {
				"marital_status_llm_v1": "Married"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1982.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "Westminster, California"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "Screened by NARA, 9/21/2023 THE a TO BE FORWARDED TO No. 11162931 IMMIGRATION AND NATURALIZATION SERVICE ONE 1 Pelilion No. 19207 DUPLICATE AlienRegistration Ro A21 201 153 Personal description of holderas of date of naturalization: Date of birth August 1, 1915 sex Male ? complexion Medium colorofeyes Black colorof hair Black height 5 feel 4 inches; weight 98 pounds; visible distinctive marks Black mark, left cheek Maritalstatus Married Country of formernationality Vietnam I certify that the description, above given is hue, and that thephotograph.off hereto is a likeness of me. Jimmy Kay Phan Complete and true signature of holder) State of California } SS: County of Orange Beit known that ala term of the Superior Court of the State of California in and for the County of Orange held pursuants to lawal Santa Ana, California on April 14, 1982 the Court havingfoundshab JIMMY KAY PHAM then residing at 7172 Main Street, Westminster, California intends loreside permanently in the United States when sorequired by the Naturalization Laws of the United. States), had in all other respects complied with the applicable, provisions of such naturalization laws, and was entitled to be Seal admitted decilizenship thereupon order red that such person be and (s)hewas admilled as a citizen of the United States of America. In testimony whereof thesealof the courtis hereunto affired this 14th day of April in the year of our. Lord nineteen hundred and eighty-two STATISTICS LEE A. BRANCH IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By player Glerk of the Muldanto Superior Deputy Court. Glerk."
}
