{
  "anumber": "A21204721",
  "id": "A21204721_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21204721_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application or Petition Form No. I-485 ( (245), I-486, I-151, I--357, I--G153"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Tetition Form No. I-485 (245) File No. 421 204 7215 CHECK ONE --SUBJECT TO FOREIGN STATE CHARGE --FXFMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203(a) () NONPREFFRENCE 203(a) (8) Seciol DOCUMENTS NE EDED MEDICAL & INTERVIEW DISTRIBUTE (If checked) (If checked) Date Mailed Date Delay Notice B/C Medical I-181 to State M/C Interview G-325A Sheet #1 \" 2-17-78 Photos Rescheduled 2 \" 7-17-78 Support Medical 3 I-508 Interview 4 I-88 Other Consulates: P.C. (Location) I-485C G-325 T-94 CATEGORY A Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY B Prepare I-486, omitting date and insert in file. Type I-151, omitting entry date, place and lamination. Insert in file with 245 packet (1-357; G-153). OFFICER'S INSTRUCTIONS: DISTRIBUTE (If checked): I-181 to State Dept. I-181 to Consulate at I-181 to Sel. Serv. This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this sheet OR top of all material in file until initial decision is made Form I-468 (Rev. 11-1-70)"
}