{
  "anumber": "A21207655",
  "id": "A21207655_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21207655_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Refugee Travel Document Application Form, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Belgium",
        "Switzerland",
        "France",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 9. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date and place and nature of each charge and the final result.) 10. I have X have not previously filed an application with the U.S. Government or any other government for a Refugee Travel Document under the U. N. Convention of July 28, 1951 relating to the status of refugees. (If you have ever filed such application, give the place and date of fil- ing and final disposition.) 11. Check one: to My Alien Registration Receipt Card is attached. Application Form I-90 or I-102 for issuance of Alien Registration Receipt Card is attached. 12. FILL IN THIS BLOCK ONLY IF YOU HAVE PREVIOUSLY OBTAINED A REFUGEE TRAVEL DOCUMENT FROM THE U.S. I & N SERVICE. Issuance date of last document Location of I & N Service Office issuing last document (city and state) My last document is is not attached. If document not attached, state reason: 13. I have have not been under exclusion or deportation proceedings in the United States. If you have been under exclusion or deporta- tion proceedings give date and place proceedings were started: 14. The following members of my family are also applying for a Refugee Travel Document: (Give name and relationship.) TRAN, TUAT CONG, , Husband 15. Date of proposed departure from U.S. Length of intended absence abroad July I979 6 months Mailing address abroad: (Number and street) (City/Town) (State/Province/District) (Country) II ALLEE DU MALI 4-B. CLOS DE LA GARENNE, FRESNES 94260 FRANCE Countries to be visited (List each country) Reasons for going abroad (Be concise and complete): FRANCE ENGLAND BELGIUM FOIA (b)(6) SWITZERLAND * Sightseeing. 16.1 did did not register for Selective Service. 17. Completed Form G-325A (Biographic Information) is attached Completed Form G-325A (Biographic Information) is not attached as part of this application. as applicant is under 14 years of age."
}