{
	"anumber": "A21235980",
	"id": "A21235980_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DECISION ON APPLICATION FOR STATUS AS PERMANENT RESIDENT, Form I-291"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 300 North Los Angeles Street Los Angeles California 90012 Refer To This File Nn. A21 235 980 Ngoc Mau-Thi Tran Date: 5700 Etiwanda Ave. #219 Tarzana, Ca. 91356 DECISION ON APPLICATION FOR STATUS AS PERMANENT RESIDENT Upon consideration, it is ordered that your application for status as a permanent resident be denied for the following reasons: The record in your case establishes that you have been requested to appear in this office regarding your application for permanent resid- ence. Since you have failed to keep the scheduled appointment and have failed to notify this Service of your change of address, if moved, your application for permanent residence is denied for lack of prosecution. Inasmuch as you were admitted to the United States as a refugee your departure will not be enforced. You are granted to to effect your departure from the United States voluntarily, without the institution of proceedings to enforce your departure. You must notify this office before that date on the enclosed card (Form I-438) of the arrange- ments you have made to depart from the United States. A1 the time of your departure from the United States. do not fail 10 surrender Form I-94. Arrival-Departure Record. in accordance with the instructions on that form. If you fail to depart from the United States by the date specified. proceedings will be instituted to enforce your departure. You may renew your application for status as a permanent resident during such proceedings. Sincerely yours. District Director 1-438 Enclosure(s) I-94 Passport Form 1-291 (Rev. 11-30-721 N"
}
