{
  "anumber": "A21294604",
  "id": "A21294604_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21294604_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, NARA, 9/21/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2009,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT,OF JUSTICE WASHINGTON D.C. 20537 1 LOOP , APPLICANT CENTER of 2009 TO ORTAIN CLASSIFIABLE FINGERPRONTE USEPENTERSINK DISTRIBUTE THIS EVENLT OR INKINGSCAR , MASH AND ORY FUNGERS THOROUGHLY #OLL Finaste FRONCHAR TO HAIL AND AVOID ALLOWING FINGERS TO HiP , INFRESSIONS 602 RECORDED 1H CORRECT ORDER if or MATUTATION OF DEPORATION MAKES 17 IMPOSSIBLE TO PRINT A PINGER MAKE A MOTATION TO THAT OFFICI # THE INDIVIDUAL FINGER BLOCK DELTA 1 SOME PHYSICAL CONDITION MAKES 13 IMPOSSIBLE to ORTAIN PERFECT IMPRESSIONS THE DEST THAT CAN OF ODTAINED WITH . MEMO STAPLED TO THE CARD EXPLANING THE Citi CONSTANCES EXAMINE Tul COMPLETED PRINTI TO LEE IF THEY CAN HE CLASSIFIED REARING (If MIND THAT THE LINES BETWEEN CENTER OF work FINGENPMINTS FALL INTO THE PATTERNS MOTH ON THIS CARD (OTHER PATTERN OCCUR LOOP AND DELEA MUST SHOW INFREGUENTLY AND ARE MO7 SHOWNIERE 2 WHORE LEAVE-THIS SPACE BLARK THIS CARD FOR USE BY: DELTAS 160 ENFORCEMENT AGENCIES IN FINGERPRINTING AFFLICANTS FOR LAW EMPORCEMENT POSITIONS AND APPLICANT FOR EMPLOYMENT LICENSE OF PERMITS DR THOSE STATES WITH STATUTES PROVIDING FOR FINGER PRINTING AS A REQUIRTE FOR THE TYPE OF EMPLOY. MENT LICENSE OR PERMIT TO BE ISSUED LOCAL AND COUNTY ORDINANCES UNLESS SPECIFICALLY BASED ON APPLICABLE STATE STATUTES 00 NOT SATISFY THIS REQUIREMENT A 111 OF APPLICANT PRINTS MUST FIRST 01 CHECKED THROUGH THE APPROPRIATE STATE IDEM TIFICATION BUREAU ON IF HO SUCH BUREAU EXISTS THROUGH A CENTRAL AGENCY DESCRIPTION FOR SUCH PURPOSE WITHIN THE STATE ONLY THOSE FINGERFENTS THESE LINES RUNNING BETWEEN FOR WHICH HO DRIGUALIPYING RECORD HAS BEEN FOUND DELTAS MUST BE CLEAR LOCALLY SHOULD AR SUBMITTED FOR FBI SEARCH IF MORE CURRENT COPY OF AM EXISTING FBI IDENTIFIC 3. ARCH TION RECORD 13 REQUIRED SIMPLY SUPPLY.HAME FO NUMBER OR LOCAL ARREST NUMBER AND IF READILY AVAILABLE THE FEDIARY AND SECONDARY PARTS OF THE PANGERPRINT CLASSIFICATION 2 U.S. GOVERNMENT AGENCIES IM CONNECTION WITH CLEARANCES DECTION OF PRIVATE CONTRACTOR SHOULD BE SHOWN LA SPACE EMPLOYER AND ADDRESS.\" THE CONTRIBUTOR n THE BARE OF AGENCY SUBMITTING THE FINGERPRINT CARD TO THE FSI Fli NUMBER IF KMOHN SHOULD ALWAYS DE FURNISHED IH APPROPRIATE SPACE MISCELLANEOUS NO. - RECORD OTHER ARMED FORCES EDH NO. PASSPORT HD (PP). ALIEN REGISTRATION NO. (AR). PORT SECURITY CARD NO. IPS. SELECTIVE SERVICE HO ARCHES HAVE NO DELTAS (333, VETERANS ADMINISTRATION CLAIM NO. (VA). FD 258 (Ray 4.25-72 o 5 GOVERNMENT OFFICE 1924 113-312"
}