{
  "anumber": "A21235980",
  "id": "A21235980_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, Form I-44 or I-95"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1939,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 Block 1. - Information About Alien Beneficiary (Continued) 21. Address in the United States where beneficiary will peside (City) (State) 18449 collins rt # 19 (Apt. No.) Tarzana C.A. 91356 22. Address at which beneficiary is presently residing (Number and street) (Town or city) (Province or State) (Zip Code, if in U.S.) Same 23. If beneficiary is in the United States, give the following information concerning beneficiary: a. He last arrived in the U.S. on b. He last arrived in U.S. as c Show date beneficiary's stay expired or will (Month) (Day) (Year) (Visitor, student, exchange alien, crewman, stowaway, etc.) expire as shown on his Form 1-94 or I-95: 5-49-1975 Parelee refugee July 15 1975 d. Name and address of present employer e. Date alien began this employment 24. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at Losangeles C.A (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN Vancauser FOREIGN COUNTRY) (FOREIGN COUNTRY) Block 11. - Information About Petitioner 25. My name is (Last) (First) (Middle) 26. Other names used; (including maiden name if ma woman) Walker Lan 27. I reside in the United States at (C/O, if appropriate) (Apt. No.) (Number and street) Mong Pham (Town or city) the every Code) 18449 cellins st # 1 19 Tarzana e-l 91356 28. Address abroad (if any) (Number and street) (Town or city) (Province) (Country) NONE 29. I was born: (Month) (Day) (Year) In: (Town or city) (State or Province) (Country) 1939 NAM-DINH Whetroom 30. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage Walkery No- 9816870 Honolulu 4awan July 10-1974 (1) If acquired through naturalization, give which naturalized, naturalization certificate, place naturalization: Can Manga name under number of and date and of (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate and date and place of issuance: Certified a true and correct copy. (b) If not, submit evidence of citizenship in accordance with Instruction 4a. (2). natz# 9876870 Pat Casers b. Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. 31. If you are a lawful permanent resident alien of the United States, give the following: FOIA (b)(6) a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A C. Have you ever lost status as a lawful permanent resident alien? If so, explain: 200026 (If you are married to a citizen of the United States, read instruction 1b carefully) 32. Have you attached all required documents (see instruction No. 4) ? Yes Block 111. Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 6) payan M Walke Subscribed and sworn to (affirmed) before me this 15 day of Sept A.D. 1975 at Los Angel (SEAL) My commissios expires DESIGNATED TO ADVIT (SIGNATURE OF OFFICER ADMINISTERING OATH) CR,INOS,WS (TITLE) OATHS UNDER of Person Preparing Form, If Other Than Petitioner ZIVI I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (SIGNATURE) (ADDRESS) (DATE)"
}