{
  "anumber": "A21203763",
  "id": "A21203763_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE, 043-RO570"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service OMB No. 043-RO570 Fee Stamp APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS FOR Clow of Gov't TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSON TO WHOM INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED IN THE BOX BELOW: PERSON CONSENTING LAU SSA NAME AND ADDRESS NAME Banh Their STREET ADDRESS 841 5 Figueroa 860 Figueroa TerrApt4 CITY, STATE ZIP CODE L.A. 90017 12/5 Can 90012 613-070r 2/6 SIGNATURE OF PERSON CONSENTING ChronBonl 1. CHECK TYPE OF VERIFICATION REQUESTED: 2. STATE PURPOSE FOR WHICH DESIRED Above person is filing for SSI. Need 3. NUMBER OF COPIES DESIRED, IF ANY: AGE OR DATE OF BIRTH to determine if / INS files show / NATURALIZATION OR CITIZENSHIP 4. IF INFORMATION IS FOR GENEALOGICAL INFORMATION any outside resources the or SSIUS. income in U.S SOCIAL SECURITY BENEFITS, SHOW SOCIAL OTHER (CERTIFICATE OF BIRTH DATA, ETC.) SECURITY NUMBER: 586-32-8966 DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME MIDDLE NAME 6. ALIEN REGISTRATION NUMBER ThiEu Banh NMN A21-203-763 7. OTHER NAMES USED, IF ANY None 8. NAME USED AT TIME OF ENTRY INTO UNITED STATES #5 9. PLACE OF BIRTH Canton China 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES 1-1-1915 Saigon Vietnam 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY Los 7-3-75 GIVE THE FOLLOWING INFORMATION FOR VERIFICATION OF NATURALIZATION military 15. NAME ON NATURALIZATION CERTIFICATE 16. CERTIFICATE NUMBER 17. NATURALIZATION DATE 18. ADDRESS AT TIME OF NATURALIZATION 19. NAME AND LOCATION OF NATURALIZATION COURT Plot P/C Their Foul 20. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY DATE: THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: P/C LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON AT NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. NATURALIZATION IN (COURT) ON (DATE) AT (LOCATION) DATE OF BIRTH ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE COPIES UNABLE ATTACHED TO IDENTIFY AS ANY REQUESTED RECORD see attached SIGNATURE DEsquirel TITLE SSA 11/16/80 Approved By: DATE PRIVACY ACT IDENTITY ESTABLISHED IN PERSON IDENTIFICATION DOCUMENTS (WHEN REQUIRED) G-652 Affidavit OTHER (List) ATTACHED FORM G-641 (Rev. 4-1-76) N"
}