{
	"anumber": "A21294604",
	"id": "A21294604_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21294604_0042/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, FORM G-325A ( (REV. 10-74)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1976]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Form Approved UNITED Screened JUSTICE OMB Hai 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Ma.-Doy-Yr.) NATIONALITY ALIEN REGISTRATION NO. TINH FEMALE (If any) ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. BINH (If ony) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(IE known) CITY AND COUNTRY OF RESIDENCE FATHER MOTHER(Maiden name) HUSBAND none. so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give regiden name) WIFE JUNE FORMER HUSSANDS DR WIVES(il none,60 state) FAMILY NAME (For wile, give malden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST, FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STARLY AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATIONISFECIFYI MONTH YEAR MONTH YEAR PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OF PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER SPECIFY! IF TOUR NATIVE ALPHABET is IN OTHER IBAN HONAN LETTERS. WRITE YOUTE HAVE IN YOUR NATIVE ALPHABET in SPACE Are all copies legible? Yes FENALTIES SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) [Given name) [Middle name) (Allen registration number) (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: I-485 DATE: 4I-590 MIA J.C. BAN 09 1976 FORM G-325A (4) Consul"
}
