{
	"anumber": "A21206632",
	"id": "A21206632_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206632_0013/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/6/2023, FORM G-325A ( (REV.10-1-74) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"nationality": {
				"nationality_llm_v1": "VIETNAMESE"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/6/2023 Form Approved FORM G-325A (REV. 10-1-74) Y UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. (Family name) Bul HUYNH VAN FEMALE 9-24-15 ViETNAMESE (If any) 21 266 632 CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. ALL OTHER NAMES USED (Including names by previous marriages) NONE HAIDUONG VIETNAM (If any) 586-36-0027 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER Bui NGAi UNKNOWN ViET NAM { DECEASED MOTHER( (Maiden name) YU BAT HUSBAND none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE TRAN TRiNH NAMDINH 10-26-46 VIETNAM 3-1-24 FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE FROM TO APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR STREET AND NUMBER CITY PRESENT TIME 6623 FORESTDAIE GLENDORA CA USA 7 75 10E KHAi DINH SAIGEN VIETNAM 4 71 4 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 10F React KHAi DINH SAiGON U.N 4 71 4 25 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO OCCUPATIONiSPECIFY) MONTH YEAR MONTH YEAR FULL NAME AND ADDRESS OF EMPLOYER Custodian PRESENT TIME LD S CHURCH AT GLENDORA Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Bui 1/12/78 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN APPLICANT: THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) BUi HUYNH VAN 1-21206632 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: (3) C. FORM G-325A"
}
