{
	"anumber": "A21296599",
	"id": "A21296599_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21296599_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information Form G-325A ( (REV. 10-1-74), Form Approved OMB No. 4-43-R46"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1919, 1975]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['store keeper']"
			},
			"nationality": {
				"nationality_llm_v1": "VIRGINIA"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE Screened OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION A21 296 599 (Family name) Dut (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. HUYNH THUAN FEMALE OCT 10-1919 VIETNAM (If any) ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE HAiPHONE N.KIN (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH( (If known) CITY AND COUNTRY OF RESIDENCE FATHER HOLANG TEHOUNAN MOTHER (Maiden name) TIHAN CUF 101 HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give maiden name) LUANG Hut ANH oets 1919 HAIRLONG FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S STREET RESIDENCE AND NPII NUMBER LAST FIVE YEARS. No NE LIST PRESENT ADDRESS FIRST. FROM TO CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 122 THN HUNG SHIGONS VISINOM JAN PRESENT TIME 1970 MAY 1975 77 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR No CITY NG APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Self Service G PRESENT TIME SToRe KeepeR Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY) REFUGEE Lum 11/5/75 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes Huynit THANN TRIEU PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) HUVNH TRIEU ThuAN A21 296 599 (OTHER AGENCY USE) INS USE (Office of Origin) REFUGEE OFFICE CODE: TYPE OF CASE: NR DATEP PENDLETON, CA 05187 SL. Hd sz € H WV 0017223 SPECIAL FORM G-325A (3) c."
}
