{
	"anumber": "A21201153",
	"id": "A21201153_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0015/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION | RECORD OF LAWFUL PERMANENT RESIDENCE, A21-201-153"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED PUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION C RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angles, CALIFORNIA. File No. A21-201-153 Status as a lawful permanent resident of the United States is accorded: Name PHAM, Ke Duc SEX DATE OF BIRTH 6562 Farinella Drive Male Street 8-1-1915 Address HUNTINGTON BEACH, PLACE OF BIRTH City, State, Zip CALIFORNIA, 92647. Thai Binh, VIETNAM 12 01 WE abbload OI au abbilication pl NATIONALITY of we vojice COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) VIETNAMESE OHOLUGA PRIORITY DATE PETOL6 the LOLLD qual 12 REMARKS Indochina Refugee plock NONPREFERENCE: Section 212(a)(14) certification not required because: abbiobuale case Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) & N Act THE BAGU iponap as we HWG unwpet pecower Private Lawino of the Sec 244( 1(0) of the & N Act UOU Sec d of the Act of d 11/2/66 Congress sessions MILITIO we 26LAICE of the Debaywen Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 Public Law 95-145 (Other law Specify) As of Mag (Month) ANIVA (Day) 975 OU (Year) at A120 Los Angles, CALIFORNIA. IUG au PORT OF ENTRY FOR PERMANENT RESIDENCE bioxiged O 6 OL was IUS Class of admission (Insert symbol) apilisa IU IUS SCIGUCE? APPROVED INS CHK abbucau DATE OF OL RECOMMENDED BY: (Immigration Officer) (Date) ACTION 1-482 12 Undel 12 2 8 1979 great 1966 LOS ANGELES, CALIF: DISTRICT FOR USE BY VISA CONTROL OFFICE Date C 188 PROCESSED FOR I-55I. Foreign State D6 TEMPORARY EVIDENCE OF o C0262 MUGLE LAWFUL ADMISSION FOR Preference Category PERMANENT RESIDENCE abbiobuale GUGOL2GQ C0202 MUGLE VALID UNTIL SIJCE millions Number EMPLOYMENT AUTHORIZED TV20 droup Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}
