{
	"anumber": "A21296599",
	"id": "A21296599_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21296599_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, Form G-325B ( (Rev. 6-1-74N)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' customs inspector', 'saigon port custom']"
			},
			"nationality": {
				"nationality_llm_v1": "Viet"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 Form Approved Form G-325B (Rev. 6-1-74)N UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 BIOGRAPHIC Immigration and Naturalization Service INFORMATION Family name First name) Middle name, XXXXXXLE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. (If any HUYNH TRIEU THUAN FEMALE 10-12-15 Viet 421 296 599 ALL OTHER NAMES USED (Including names by previous marriages CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. HAS Phong, (If any) 586-36-1969 FAMILY NAME FIRST NAME DATE. CITY AND COUNTRY OF BIRTH (If known: CITY AND COUNTRY OF RESIDENCE FATHER Huynh, Nam 5/10/86 Hai Phong, VN Deceased MOTHER (Maiden name) Tane. Tuong 7/15/87 Hai Phone VN If HUSBAND If none. so state FAMILYNAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR For wife. give maiden name WIFE Hai Phong Hai Phong Luong ANH 10/5/16 VN 08/19/43 VN FORMER HUSBANDS OR WIVES (If none. so state) FAMILY NAME (For wife. give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE none APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR PRESENT TIME 37 Moody Drvie Sandwich MA USA 7 77 16 Appleby Road Sale MA USA 8 75 7 77 12 Pope Street Salem MA USA 6 75 8 75 Camp Pendleton CA USA 5 75 6 75 122 Tan Hung (Cholon) Saigon Vietnam 5 60 5 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 122 Tan Hunz (Cholon) Saigon Vietner 5 60 5 RE APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO 75 FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR PRESENT TIME None 1 75 Saigon Port Custom Saigon, VN Customs Inspector 6 60 1 75 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: NATURALIZATION OTHER (SPECIFY) ADJUSTMENT OF STATUS 95-145 If serving or ever served in the Armed Forces of the United States, complete the INS USE (Office of Origin) following: Branch of Service Rank Service Number Office Code 020 BOS Type of Case I-485C To Other Agency: Please furnish on the reverse of this form, or by attachment hereto, Date 08/10/78 any derogatory information that may be contained in your records concerning the above person, for use in connection with consideration of above application and return to VICAM .S. Immigration and Naturali zation Service. (OTHER AGENCY) FOR STATE DEPARTMENT USE (ALL DEFENSE CHECKS) SY MIL AIR MAIL TO: RSC PERS RESERVE OSI ONI DIRECTOR, (USAF) (USN) UNITED STATES ARMY INVESTIGATIVE RMR USAF ARMY RECORDS REPOSITORY PERS PERS STATE STATE C: Visa ATTN: ICIRR-A (P.P.) (S.Y.) OTHER SEE O.I. 328.1 FOR FORT MEADE, MARYLAND 20755 R: Visa MAILING ADDRESS MID PROV. ATTENTION: LIAISON OFFICE, ORM G-2 MAR. IMMIGRATION AND NATURALIZATION SERVICE SEE O.1. 105.4 FOR MAILING ADDRESS FORM G-325B"
}
