{
	"anumber": "A21293871",
	"id": "A21293871_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21293871_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 4-14-81)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "6-100 wingy Screened by NARA, 8/29/2023 UNITED STATES DEPARTMENT OF JUSTICE DMD NO. (115)-0009 IMMIGRATION AND NATURALIZATION SERVICE approval Expires 1/31/84 92% FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION 8-14-84 Mail or take to: 8:20 IMMIGRATION AND NATURALIZATION SERVICE ack 3 ALIEN REGISTRATION ( Show the exact spelling of your name as it appears CO your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register. so state.) QUESTION BEFORE YOU ANSWER PLEASE PRINT OR Name NGBYEN, TRAN BICH TYPE.) No. 421 293 871 Section of Law 316a Date: 8-11-83 (Leave Blank) (1) My full true and correct name is NGUYEN , TRAN BICH ( Full phue name without abbreviations) (2) ] now Live at 1802 E.Glenoaks Blvd #C (Number and street, GLENDALE Lostingcles. CA 91206 (City County, stare, zip code) (3) ] was born on Yo 10 X in CANTHO VIETNAM (Month) (Day)-(Year) (City or town) (County, province, or state) (Country) (4) I request that my name be changed to NONE (5) Other names I have used are: - TRAN TRAN D (Include maiden name) Sex: Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (9) Can you sign your name in English? Yes No (10) My lawful admission for permanent residence was on D5 02 75 under the name of NGUYEN, TRAN BISH (Month) (Day) Year) at LOSANGELES OA. (City) (State) (11) (a) I have resided continuously in the United States since 05 02 75 rMMonth) (Day) (Year) (b) I have resided continuously in the State of CALIFORNIA since 05 OR 75 (Month) (Day) (Year) (c) During the last five years I have been physically in the United States for a total of Go months. FROM To STREET ADDRESS CITY AND STATE (a) 6.1976 PRESENT TIME 1802 E. Glenoaks #c Glendale CA. (b) 19 19 No OTHER 2 (c) 19 19 (d) 19 19 (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP. OR OF AIRLINE HAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES Since $our lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No No state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. CO NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, Bus DATE-DEPARTED DATE RETURNED COMPANY OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You STATES RETURNED TO THE UNITED STATES 507 Form N-400 (Rev. 4-14-81)Y If g ms (OVER) (1) by"
}
