{
  "anumber": "A21294604",
  "id": "A21294604_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21294604_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2025,
        1978
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "[' retired', 'teacher']"
      },
      "nationality": {
        "nationality_llm_v1": "Vietnam"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS: USE TYPEWRITER. BE 9/21/2025 LEGIBLE. Failure to answer fully all questions delays action. 04312 Do Not Remove Carbons: If typewriter is not allable, print heavily in block letters with ball-point pen. LOSIMMENT PRINTING OFFICE978-253-574 FORM Q-325A (REV. 10-1-74) Y TIC - 245 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC (DATE) SEP 16 1978 INFORMATION For Sale by the Superintendent of Documents, U.S. Government Printing Office Washington, DC 20402 (Family name) (First name) (Middle nome) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. TRUONG TINH VAN FEMALE 3/4/15 VIETNAM. (If any) 421-294-604 ALL OTHER NAMES USED (Including nomes by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE QUANG BINH VIETNAM (If any) 586-32-0564 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(IF known) CITY AND COUNTRY OF RESIDENCE. Deceased Deceased. FATHER TRUONE TRONG MOTHER(Maiden name) NGUYEN WINH // u HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give reciden name) TRAN KIM-NGOC 6/1/16 KHANH HCA QUIETNAM 5/1/41 NHATRANG FORMER HUSBANDS OR WIVES(il none,sa state) NONE. FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 1067 w. 26th st 2. San Padro CA U.S 1 76 PRESENT TIME 10840 N.W. 37th ct. Coral Springs FLA \" 4 75 II 76. 7 LE QUY DON NHATRANG VIETNAM. / 55 4 75 APPLICANT'S LAST ADDRESS OUTBIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 7 LE QUY DON NHATRANG VIETNAM I 55 4 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATIONISPECIFYI MONTH YEAR MONTH YEAR RETIRED unemployeed 4 77 PRESENT TIME SEARS PORTER. 12 76 3 77. BROKEN WOOD CLUB KITCHEN HELPER. 2 76 11 76. ViEtNAM Teacher 7. 4 75 Show below last occupation abroad if not shown above. (Include all information requested above.) SAME AS Above THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUBTMENT OF STATUS 8-17-78 OTHER (SPECIFY) IF TOUR NATIVE ALPHABET is IR OTHER TRAN REMAR LETTERS WHO TE YOUR FUND IN TOUR NATIVE ALPHARMET IN THIS SPACE Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED or LAW FOR KNOWINGLT AND WILLFULLY FALSIFYLIFF OR CORKEALING A MATERIAL FACT. (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: FORM G-325A (3) C."
}