{
	"anumber": "A21235980",
	"id": "A21235980_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, 181 ( (Rev. 4-1-77)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES \"Screened by NARA, 9/21/2023 JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE 5700 of Etiwanda Ave. # 219 Place Los Angeles, CA Tarzana, CaliF.91356 File No. A21 235 980 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Ngoc Mau-Thi Tran F 1-1-15 Street Address 18449 Collins St #19 PLACE OF BIRTH City, State, Zip Tarjanca CA 91356 Vietnam abbucation NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam PRIORITY DATE petols IMMEDIATE RELATIVE REMARKS INONPREFERENCE: Section 212(a)(14) certification not required because: abbiobuale Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued 02 under the following provision of law: Sec 203(h) of the & N Act the Sec 249 of the I & N Act Sec 214(d) I & N Act opper as jue pecower Private Law no. of the Sec 244 of the I & N Act Sec 1 of the Act of 11/2/66 Congress session we we 01 blorgeq We Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) bioneq with OL 01 As of at Los Angeles, CA (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) TRO (3) OL IU HIB abbucau 5-31-78 C.Y. DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION live we DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State OWEL C0262 MUGLO on formalged Preference Category 181 sugarzeq Number the Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}
