{
  "anumber": "A21202116",
  "id": "A21202116_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202116_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR FINGERPRINTS AND/OR INFORMATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 Form Approved Budget Bureau No. 43-R405.2 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Please note the item(s) checked below: Within 30 days after reaching age 14, any alien in the United States not exempt from alien registration under the Act, shall present himself to an Immigration office for registration and fingerprinting in compliance with Section 262(b) of the Act. You must execute the en- closed Form I-90 in accordance with the instructions thereon and report to the nearest Immigration and Naturalization Service office for registration and fingerprinting. The attached fingerprint card is for your use in having your fingerprints taken by a law enforcement officer and return of the fingerprints to this Service. The fingerprint card is required for the reason checked below: Fingerprints which you submitted on a previous occasion are not satisfactory and you must be refingerprinted. A record of your fingerprints must be submitted before any action may be taken on your application. You must furnish the Biographical Information required on the attached Form G-325 and submit it with a record of your fingerprints before any action may be taken on the immigration matter in which you are interested. With the exception of an alien in the United States who, within thirty days after reaching his fourteenth birthday must present himself to an Immigration Office for registration and fingerprint- ing, fingerprint cards may be taken to any police station or sheriff's office, as well as to any office of the Immigration and Naturalization Service, where you may ask the officer to record your fingerprints on the card. The card must be signed by you in the presence of the officer taking your fingerprints. He must sign his name and the date in the space provided. Your alien regis- tration number, if any, must be inserted in the space on the card reserved for \"Number\". DO NOT BEND, FOLD, OR CREASE THE FINGERPRINT CARD! SHOW THIS LETTER TO THE OFFICER WHO WILL TAKE YOUR FINGERPRINTS. RETURN THIS LETTER WITH THE COMPLETED FINGERPRINT CARD. Form G-155 (Rev. 2-26-76) N REQUEST FOR FINGERPRINTS AND/OR INFORMATION GPO 901-225"
}