{
	"anumber": "A21206025",
	"id": "A21206025_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0054/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325 ( (REV. 5-1-79)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM Q-325 (REV. 5-1-79)Y Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE LOS BIOGRAPHIC Form Approved Boaster sent 3/17/84 Immigration and Naturalization Service CIT - 400 OMB No. 43-R436 INFORMATION JAN 27 1981 (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER LE THIN THI FEMALE 6-21-15 VIET (date) 21206025 ALL. OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE HANOI VCET NAM (If any) 586-34-4175 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE DECEASED FATHER LE MAV MOTHER (Maiden name) NGUYEN LiEN UNKNOWN, SAIGON, VIETNAM HUSBAND (If none, 80 state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife. give maiden name) WIFE Bul TUC DECEAS ED FORMER HUSBANDS OR WIVES (If none, so state) NONE FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 202 SAND BERG ST THOUSAND DAKS CA USA 10 78 PRESENT TIME 825 CALLE HAYA # 8 THOUSANDOAKS CA USA 2 76 10 78 8422 GRIMES WN MOOR PARK CA USA 7 75 2 76 WEIMAR HOPE VILLAGE WEIMAR CA USA 6 75 7 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 333/512 PHAN THANHGIAN SAIGON SAIGON VIETNAM 63 4 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER NONE OCCUPATION (Specify) MONTH YEAR MONTH YEAR PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) HOUSEWIFE IN V.N. THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) STATUS AS PERMANENT RESIDENT Itan 12/23/80 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
