{
	"anumber": "A21273126",
	"id": "A21273126_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21273126_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Freedom of Information Act ((b)(6), Form I-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/28/2023 Block 1. - Information About Alien Beneficiary (Continued) 21. Address In the United States where beneficiary will reside (City) (State) 1144 W 9th. Street Apt # D, Corona California # 91720 22. Address at which beneficiary is presently residing (Apt.No.) (Number and street) (Town or city) (Province or State) (Zip Code, if in U.S.) 26/ Thu Khoa Huan Saigon 2, South Vietnam 23. If beneficiary Is in the United States, give the following information concerning beneficiary: a. He last arrived in the U.S.on b. He last arrived in U.S. as C. Show date beneficiary's stay expired or will (Month) (Day) (Year) (Visitor, student, exchange alien, crewman, stowaway, etc.) expire as shown on his Form I-94 or I-95: N/A d. Name and address of present employer e. Date allen began this employment 24. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Block 11. - Information About Petitioner 25. My name is (Last) (First) (Middle) 26. Other names used; (including maiden name if married woman) FOIA (b)(6) FOIA (b)(6) 27. I reside in the United States at (C/O, if appropriate) (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) FOIA (b)(6) 28. Address abroad (if any) FOIA (b)(6) Number and street) (Town or city) FOIA (b)(6) (Province) (Country) NONE 29. I was born: (Month) (Day) (Year) In: (Town or city) (State or Province) (Country) FOIA (b)(6) 30: If you are a citizen of the United States, give the following: FOIA (b)(6) (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition ? Original seen and returned (a) If so, give number of certificate and date and place of issuance: Certified a true and correct/copy (b) If not, submit evidence of citizenship in accordance with Instruction 4a. (2). b. Have you or any person through whom you claim citizenship ever los United States citizenship? Contact Representat Christing NO If so, attach detailed explanation on separate sheet. 31. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A c. Have you ever lost status as a lawful permanent resident alien? If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) 32. Have you attached all required documents (see instruction No. 4) ? Yes Block 111. Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein frue and correct Signature of petitioner (See Instruction No. 6) FOIA (b)(6) Subscribed and sworn to (affirmed) before me this 25th day of April A.D. 19 75 at CORONA, California (SEAL) My commission expires July 16, 1978 (SIGNATURE OF OFFICER ADMINISTERING OATH) (TITLE) Block IV. -Signature of Person Preparing Form, If Other Than Petitioner I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (SIGNATURE) (ADDRESS) (DATE)"
}
