{
	"anumber": "A21207655",
	"id": "A21207655_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21207655_0034/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4 ( 900"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1980, 1977, 2023, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE Form Approved IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-R0079 FEE STAMP 3-7-83 APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: 8:19 IMMIGRATION AND NATURALIZATION SERVICE P ALIEN REGISTRATION Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name NGUYEN f BACHCHI THI TYPE.) No. A- 21-207-655 Section of Law 316(a) Date: DEC. 04 1980 (Leave Blank) (1) My full true and correct name is BACHCHI THI TRAN (Full true name without abbreviations) (2) I now live at 5028 COYOTE LANE SAN BERNARDINO S/B CALIFORNIA (Number and street, city, county, state, zip code) (3) I was born on 10-28-1915 in BACNERA VIETNAM slow (Month) (Day Year) (City or town) (County, province, or state) (Country) (4) I request that \"my name be changed to BACH-CHI TRAN (5) Other names I have used are: NONE (Include maiden nee: name) nguyen; no Sex: Male Female other.,3. (6) My father's name NGUYEN DE VAN DECEASED) (7) My mother's maiden name NGUYEN CHANH THI (DECEASED) (8) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (9) Can you read and write English? Yes No (10) Can you speak English? Yes No (11) Can you sign your name in English? Yes No (12) My lawful admission for permanent residence was on 08-23-75 under the name of (Month) (Day.) (Year) NGUYEN BACHCHI THI at HOUSTON, TEXAS on (City) (State) U.S AIR LIFT (Name of ship, airline or adjustment of status) (13) Since that date I have resided continuously in the United States and continuously in the State of CALLEORNNA where I now live since 10-04-1980 During the last five years I have been physically present in the United States for a total of 69 460 months. (14) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) 10-04 , 1980 PRESENT TIME 5028 COYOTE LANE SAN BER NARDINO CALIFORNIA (b) 9.06 1977 10-03 19.80 54 SOUTHERN OAKS COURT LAKE JACKSON TEXAS (c) 9-06 19.75 9-05 19.77 40 HOLLY CHASE CLUTE, TEXAS (d) 4-29 19.75 9.05 19.75 RESUGEE CAMP CALIFORNIA (15) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No if \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES NONE (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES NONE (16) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: Form N-400 (Rev. 9-1-78) N (OVER) (1)"
}
