{
	"anumber": "A21203763",
	"id": "A21203763_0055",
	"page_index": 55,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0055/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title of the image, Screened by NARA, 9/21/2023, Form number, NARA Form Number: 8564"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 18. COMPLETE THIS BLOCK ONLY IF YOU ARE A LAWFUL PERMANENT RESIDENT a. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States. (If you have engaged therein, briefly describe and show periods of such employment or business activity.) b. Since the time I became a permanent resident of the United States, I have filed a federal income tax return as a nonresident. Yes No. (If \"Yes\", state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of the Internal Revenue Service office where filed.) C. Since the time I became a permanent resident of the United States, I have failed to file a federal income tax return with respect to income I earned outside the U. S. because I regarded myself as a nonresident alien and therefore exempt from tax on such earnings. Yes No. (If \"Yes\", state the years for which you failed to file tax returns for that reason.) d. I do do not intend to return to the U. S. after my temporary visit abroad. If not, explain: e. I do do not intend to retain my status as a lawful permanent resident. If not, explain: f. I Have Have not been issued a reentry permit. (Any reentry permit in your possession must be attached to this application.) 19. COMPLETE THIS BLOCK ONLY IF YOU ARE AN APPLICANT FOR EXTENSION OF A REFUGEE TRAVEL DOCUMENT Date and place of issuance of attached Refugee Expiration date of attached Date by which I intend to return Travel Document document to the United States JUNE 11, .1976. Los ANGELES JUNE 10, 1977 December 1977 List of all countries visited since last departure from List of all countries I intend to visit the U. S., in the order visited TAIWAN HONG KONG FRANCE I have have not established a lawful permanent residence in another country since the date of issuance of the at- tached Refugee Travel Document. 20. The Refugee Travel Document, if issued or extended, should be forwarded to: My address as shown in Block #1. U. S. Embassy or Consulate at: U. S. Immigration and Naturalization Service Office at: Other (Specify) 21. If your native alphabet is in other than Roman letters, write your name I certify that the above true Signature of Applicant is and correct. in your native alphabet in this block. Date of Signature APRIL 26, 1977 22. (Signature of person preparing form, if other than applicant.) I declare Address of person preparing form, if other than applicant that this applicationwas prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Date: Occupation: APPLICANT-DO NOT WRITE BELOW THIS LINE ACTION DISTRICT DD OF Ange Suck 8/23/7 Document Number Valid To (Date) DELIVERY OF DOCUMENT BY: DATE 045068 6/10/98 MAIL Status which may be accorded alien upoh PERSONAL DELIVERY return to U. S. Darvelle EMPLOYEE EFFECTING PERSONAL DELIVERY Restriction on travel in following countries waived: LOS 1622 (Initials BY (Office) all LOS 8/33/71 (Date)"
}
