{
	"anumber": "A21201155",
	"id": "A21201155_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201155_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 U.S. DEPARTMENT OF JUSTICE APPLICATION TO FILE PETITION FOR NATURALIZATION IMMIGRATION AND NATURALIZATION SERVICE INSTRUCTIONS TO THE APPLICANT (Tear off this instruction sheet before filling out this form) You must be at least 18 years old to file a petition for naturalization. Using ink or a typewriter, answer every question in the appliçation form, whether you are male or female. If you need more space for an answer, write \"Continued\" in your answer, then finish your answer on a sheet of paper this size, giving the number of the question. YOU WILL BE EXAMINED UNDER OATH ON THE ANSWERS IN THIS APPLICATION WHEN YOU APPEAR FOR YOUR NATURALIZATION EXAMINATION. If you wish to be called for examination at the same time as a relative who is applying for naturalization is called, attach a separate sheet so stating, and show the name and the Alien Registration Number of that relative. 1. YOU MUST SEND WITH THIS APPLICATION THE FOLLOWING ITEMS (1), (2), (3) AND (4): (1) Photographs of your Face: a. Three identical unglazed copies, size 2 X 2 inches only. b. Taken within the last 30 days. C. Distance from top of head to point of chin to be 1 1/4 inches. d. On thin paper, with light background, showing front view without hat. e. In natural color or black and white, and not machine-made. f. Unsigned (but write Alien Registration Number lightly in pencil in center of reverse side). (2) Fingerprint Chart-Complete all personal data items such as name, address, date of birth, sex, etc. Write your Alien Registration Number in the space marked \"Your No. OCA\" or \"Miscellaneous No. MNU\" You must sign the chart IN THE PRESENCE OF THE PERSON taking your fingerprints and have that person sign his/her name, title and date in the spaces provided. Take the chart and these instructions to a police station, sheriff's office, or an office of this Service, or other reputable person or organization for fingerprinting. (You should contact the police or sheriff's office first since some of these offices do not take fingerprints for other government agencies.) DO NOT BEND, FOLD OR CREASE THE FINGERPRINT CHART. (3) Biographic formation.-Complete every item in the Biographic Information form furnished you with this appli- cation and sign your name on the line provided. If you have ever served in the Armed Forces of the United States, obtain and complete also an extra yellow sheet of the form, bearing the number G-325B. (4) U.S. Military Service.-If your application is based on your military service, obtain and complete Form N-426, \"Request for Certification of Military or Naval Service.\" 2. FEE.-DO NOT SEND any fee with this application unless you are also applying for a certificate of citizenship for a child (see Instruction 6). 3. ALIEN REGISTRATION RECEIPT CARD.-DO NOT SEND your Alien Registration Receipt Card with this application. 4. EXAMINATION ON GOVERNMENT AND LITERACY.-Every person applying for naturalization must show that he or she has a knowledge and understanding of the history, principles, and form of government of the United States. THERE IS NO EXEMPTION FROM THIS REQUIREMENT, and you will therefore be examined on these subjects when you appear before the examiner with your witnesses. You will also be examined on your ability to read, write and speak English. If on the date of your examination you are more than 50 years of age and have been a lawful permanent resident of the United States for 20 or more years, you will be exempt from the English language requirements of the law. If you are exempt. you may take the examination in any language you wish. 5. OATH OF ALLEGIANCE.-You will be required to take the following oath of allegiance to the United States in order to become a citizen: Form N-400 (Rev. 5-5-83) N (Over)"
}
