{
	"anumber": "A21235980",
	"id": "A21235980_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21235980_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1932]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"reason": {
				"reason_llm_v1": "N-NC"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION LZ (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr NATIONALITY ALIEN REGISTRATION NO. TRAN MAUNGOC TH FEMALE 01/01/15 ViETNAM (If any) AN1235980 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE NAM DiNH VETNAM 586.32.6996 (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE TRAN VAN UNK V.N. DECEASED FATHER MOTHER (Maiden name) NGUYEN TUNG -11- DECEASED HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE N/A FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE PHAM NEEDED 1902 1932 V.N. CLONG 2/1/50 DECENSED V.N APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER #9 CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 18449 COLLiNS ST TARZANA CA USA 6 75 PRESENT TIME is 2 TRAN QUANCIDELL SAiGEn U.N. 19 55 4 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 102 TRAN(NONANG HELSAGGN V.N 19 55 4 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATIONISPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME NONE Show below last occupation abroad if not shown above. (Include all information requested above.) NONE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS 3/29/78 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) TRAN MAUNGOC THi A01235980 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: (4) Consul FORM G-325A"
}
