{
  "anumber": "A21206632",
  "id": "A21206632_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206632_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 7/6/2023, 21 206 632"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA. 7/6/2023 SEX Male IMMIGRATION NATURALIZATION SERVICE DEPARTMENT Ut JUSTICE AND DESCRIPTION: MARITAL STATUS: MaRRiED Processing Shoot HEIGHT: Lt. 5in in. 2 Section of COUNTRY OF FORMER NATIONALITY Law Vietnan 3/6 FILC No. 21 206 632 JAN 07 1993 INITIAL INTERVIEW Id FINAL ACTION English: Speaks 50/100 Reads Date and Initials Writes I C 3 Denial: Date & Initials Government: INS Test STAND. TEST of C 3 Withdravals Date & Initials C J Oath Taken: Certificate issued. REEXAM: Date and Initials Documents presented: ACTION OR DOCUMENTS STILL REQUIRED ARC: A21206,632 C J See attached H-14 ( J Reexamination DOB: 09/24/15 ( J Visa File ( ) Other POE/COE he ICG ( ) Post Audit DOE 07/16/75 CID/COL: RECORMENDATION Id Date and Initials I.M.S APPROVED COMMENTS: JAN X7 Recommended by Lile LOS 4385 Approval (stamp) OATH OF ALLEGIANCE ( ) Modified Oath. Delete part(s) Oath with INS ( ) Promise to Bear Aras. C J Noncombat Duty NAME CHANGE Huynh But Oath with Court Court No. 246 and I HEREBY foreign DECLARE. on oach. chat I absolucely and entirely renounce and abjure all that I will prince. pocentate. state, or sovereignty of whom or which I have heretofore allegiance been and fidelity CO foreign and support and defend the Conscitution and che laws of the United States of America a against subject all or enemies. citizen: that I domestic; that I will bear crue faith and allegiance CO the that I will bear arms on behalf of che United States when required by the same: that I take work of national importance under civilian direction when required by the thac I will will perform perform noncombatanc service in the Armed Forces of the United law: States when law; In this obligacion freely without any mental reservation or purpose of required evasion: by so the HELP law; ME and COD. acknowledgement whereof I have hereunto affixed my signature. Signature mag Corn Day be ove: Ited or stamped to show instructions, items requested, items received, or other per cinent data which sy Laceletate processing. Xeep this above as 100 ci all material in file unril latelal decixion is Jeda 16 (RET. 23-2-701"
}