{
  "anumber": "A21202301",
  "id": "A21202301_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202301_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RESULT OF EXAMINATION, G-325"
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1992,
        2023,
        1991,
        2019
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/22/2023 District CIVIF (2EVE) RESULT OF EXAMINATION COURT ACTION English: Speaks Reads 00 Write Classes no Govt. ok Date DENIED City 6938 pa betting we oures of WG of G-325 ID. neg G-325B Grounds 1112 1a G-325 Rec. Br. neg BANE N-426 23 Examiner comu S COA qui of Cont'd 1a 91 G-325C Other Cont'd SPIR banpouse HS of carp 111 2819 besigned sug w gas (If Requested) any bennou suq Eligibility 101 (f): OK Action or documents still required: Documents presented: SCENK OE conse MARK OVEH BA CFEKK OK DEMOLA MHEW OVIER DIA GX SED BA DESIGNATED EXPRESS I-551 - A-21-202-301 S/R 1674 well Dob: 6/22/15 Doe (10) 6/19/75 Los IC-6 waq8c aug pages R pi use with WA will and usus 20 Hall W (199 (12) Ledness (use use). pc D as tps ORNG 219162 of VINGLICE www 1991 I kwas rps COMPUTE or EP12 beginer LOL UNIVERSITY (14) THE apple to 168q strig street rus guRjap jouknalic (mujosa crawbreg are 1 page suq or tpc - or ISA present SUG of 4% yug fotur of of gis aug RELAICE you as and up to yewag houses of IPC IU que Duncy 219162 SUG 10 san berious work made o a pin 10 pcm mugst STREE CLASSICU ou pepsil of sus exemberg gracer 10 (13) If R WA use III 800q (Hip to perong 3 CHINGE a tick 200102 19KC marpone democration tpc out or sug because & tpc #6() girbozen 10 q/6 Booq OLQCL suq of the nutrag 213162 (13) must auq USAG peep qquats 91) DJC beyona Ledning pix 18m or belion of 800q WOLD] CUSTOCIAL STESCHES to the buscibjes or yes CORRECTION of 1116 nums sug born mazi neg coffeeq as DL sua of cpc BCIZ or SCITATING on ancy you MUSH sua OLBRUISSION biozcupeq pa you a such accupation passes as application DOL MORE 1 (11) sw DOS sug MO pocu 117C measure LIVE sug you for states of 94 JAMES 10 buscequiti quic of sur Investigation Petitioner under oath all statements,made at the Recommendation waived. H of STICKER 6A approved oplezsol preliminary investigation, DEC 11c X7 CRUSH 1983 your wing poss 19 OC ou the ou (LOW incji naqui Preliminary and Designated Examiner (Date) 108 to beuco 38\" 1005 Xleander DE ya grant 13/7/83 and It address 6A 19 1022 que Recommendation (10) in 12 LARA mages Preliminary Examiner (536 (Date) (for or nukeq yps upus or was borroos pack (586 yung forese of nuger organ you CONQUIGER RELATOS with RELATOS missing na of (a) (If backson 12 UKG mugel Section 358°) pass ISSAGE possuppA to 1116 FOLCER of IPS nume 215102 for 8 bauag or helloqu spice 1217 Leaguesc (PIG green a about of and sprosq AUC anjoya # 5 pa 9 at pin ⑉ # 9 poor Ugs LIFE or 12 to (pc UNIVERSITY OL busing processes of If Lopsion 9 pour uge ty/s grands a 12 records wag 01 rpc Dance or SECURITY as 01 a bappe RECLUSIONS 111 spe Dunca 219162 or (LESS)A or yurucer ARRISON of locoturisoq 92 ancy pA spc Product 01 90 VISION 118,534 at curbousness ru mpore or (1) but (if 1125 of (g) (It 14 116g nuges pection 310 (p) you bucaus abone 12 s CHISEG of que neiring grasse of yes a que of ups numer gracez or of su OCTION R wags 35 16926 the equips because tps asses or (prz betinou DAY JUAN pour because a que Clinical # jours OUG-POT of ency bauog 1 USAC communonal 10 tick greec 112 1982 (PG gang of gare benifiou* soq vises will 101 quiut $11 of mpray beyon w 2019 borres 1992 pacu , (1) (IL was augus 313(#) I USAG commonajX PU no Daysog is wells navou MILE wa because abortas (OL at jours Acqua bleacus set the nursa 279102 for WI joyes out- ou ance 1266 ham bellog use (a) 95 port 21X buscequali qps quic of 1312 Securiou suq sign on Required for suq I USAC pscu business) (e) (11 business 02°9 magsi person 310(s) JIANS commonant 12 the you = 198R line Acaus you compunional) 10 the 21816 E. (111 DENITION it (2) I ABR required so 1126 LOL suq USAC not 2000 (4) Lodiscar IPSI will issue pc cpsu8cq 10 NONE (3) 1 MS polu as 02\\SS\\J2 AIRLAND (Comusal (21016) 1510 Cogs) roz YACEFER 31202 (3) WA bacage Spice or 12 3830 VAEROE® 16M may appointment (1) WA (011' ans' mug COLLECE USED 12 LOVI DINH DO and you NOME LMR bettyou (or MSLSPA waqe lysq wages 31€ 1° the HOBOLSPH COAL LOL spe at gagdaa' DIELKICA roa VICETE2 VK no V3T 503 30J Kebou ou SOLL Nv) no (10 accountant bangou DOSTICVILE VRD AVE Oh SOUICE LEDITION LOK WVIOKVTISVLION"
}