{
  "anumber": "A21201153",
  "id": "A21201153_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 11-26-79)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1979,
        2023,
        1975,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 UNITED STATES DEPARTMENT OF JUSTICE Form Approved IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-R0079 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you Mid not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name TYPE.) PHAM / RE DUE 316a0 No. A 21201153 Section of Law Date? Leave Blank) PHAM) KE DUCY (1) My full true and correct name is (Pull true name without abbreviations) (2) I now live at 7172 Main Street Assistant Number and street, Westminster Orange County California 92683 (City county, state, zip code) (3) I was born on 08 101.1915 in Thai Birh Birth VIET HAM (Month) (Day) (Year) (City or town) County province, or state) Country) (4) I request that my name be changed to Pham (5) Other names I have used are: (Include maiden name) Sex Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? (9) Can you sign your name in English? (10) My lawful admission for permanent residence was on Qos Q 5/1/75 Yes No Yes No 28. 1979 under the name of PHAM KE DUC n at Attrontington (Month) Beach (City) Year) 924 (State) (Day) (11) Since that, date I have resided continuously in the United States and continuously in the State of California where L now live since California During the last five years I have been physically present in the United States for a total of months. (12) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: (13) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE 04.01 19.80 PRESENT TIME 7172 Main St II 4 30 19.77 412 Phyllis Dr Westminster California 0501 1975 Kolleen Texas 19..77 06 30 19.79 Farinella Dr Beach California a7 19.79 0331 1980 1027 Mission Dr #B (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? Coota My California Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES Brown Form N-400 (Rev. 11-26-79)N (OVER) (1)"
}