{
  "anumber": "A21206632",
  "id": "A21206632_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206632_0054/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1935,
        1973,
        2023,
        1963,
        1994,
        1915
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['nurse']"
      },
      "nationality": {
        "nationality_llm_v1": "VIETNAM"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A (REV. 10-1-74) Screened by NARA, 7/6/2023 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) 21266.3.22 MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALPEN REGISTRATION Bui HUYNH /VAN FEMALE Sep 24.1915 YIETNAM (If 22/206 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE NAM FATHER MOTHER(Maiden name) HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE WIFE TRAN TRINH 1994 ANH 1044 FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Do CHIEU NPF WHOLING ,1.6 PRESENT TIME 2 1963 1973 KHAi NIMH 1973 1975 t b APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR A A FROM TO STREET AND NUMBER CITY PROVINCE FOR STATE COUNTRY MONTH YEAR MONTH YEAR KIAN DANI 3 4933 1935 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME VN GOVT. make Nu Rse Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION V. Refugee ADJUSTMENT OF STATUS OTHER (SPECIFY): Hum MAY 11. 975 IF YOUR NATIVE ALPHABET is IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) Bui HOUNH DUC 21206632 (OTHER AGENCY USE) INS USE (Office of Origin) NR Incrum OFFICE CODE: REFUGEE TYPE OF CASE! DATE: SL. Hd as E H AVW CP PENDLETON, CA SPECIAL (3) c. 0017408 MAY 12 1975 FORM G-325A"
}