{
  "anumber": "A21296599",
  "id": "A21296599_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21296599_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application or Petition Form No. I-485 ( (245), I-485 ( (245)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 UN ED STATES DEPARTMENT OF JUST IMMIGRATION AND NAT RALIZATION SERVICE Processing Sheet Application or Petition Form No. I-485 (245) File in. CHECK ONE SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203(a)() NONFREFERENCE 203(a)(8) DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If checked) (If Checked ) Date 7-27 Date Mailed B/C Medical Delay Notice XXXXXXXXXXXXXXXXXX M/C Interview 12:30 I-181 to State Photos Rescheduled G-325A Sheet #1 219.7 Support Medical 2 I-508 Interview 3 I-88 4 Other Consulates: P.C. from salem, Mass (Location) CATEGORY A Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY B Prepare I-486, omitting date and insert in file. Type I-151, omitting entry date, place and lamination. Insert in file with 245 packet (I-357; G-153). OFFICER'S INSTRUCTIONS: DISTRIBUTE (If Checked): I-131 to State Dept. XXXXXXXXXXXXXX I-181 to Consulate at I-181 to Sel. Serv. XXXXXXXXXXXXXX This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this ahool on top of all material in fila until Initial decision is made Form I-458 (Rev. 11-1-70)"
}