{
  "anumber": "A21206025",
  "id": "A21206025_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0056/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, 181 ( (Rev. 4-1-77)Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        9016,
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES Screened by NARA, 7/28/2023 CE Immigration and Naturalization Se. MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE SFR Place Los Angeles. CA File No. A- 2I 206 025 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street LE, Thin Thi F 6/2I/I5 Address 825 Calle Haya # 6 PLACE OF BIRTH City, State, Zip Thousand Oaks. CA 9I360 Hanoi.Vietnam 12 ou NATIONALITY lue volice COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam pejole alaunud PRIORITY DATE REMARKS 303(a)(a) Indochinese refugee NONPREFERENCE Section 212(a)(14) certification not required because: abbiobudge Indiv idual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the & N Act Sec 249 of the d & N Act Sec 214(d) I & N Act BASU wondp pecowe Private Law no. of the Sec 244(oi)( of the I & N Act Sec I of the Act of 11/2/66 Congress session we COLLINICATION Sec 245 of the & N Act Sec 13 of the Act of 9/11/57 Public Law 95-I45 bloreq 6/13/75 (Other law Specify) Los Angeles. CA OL 14 IUG 9016 As of at OLO (Month) of (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE en) bloaided a OL Class of admission (Insert symbol) Mupin IU live 2CIGUCS2 we obbycaup DATE 12 OF excebtional RECOMMENDED BY: (Immigration Officer) (Date) ACTION ou MAY 6 1978 Richard heelev 6 1978 Joseph Sureck DISTRICT FOR USE BY VISA CONTROL OFFICE G188 1/29/79/14 Date 1.55% Foreign State paper C0262 MUGLS Preference Category Number the SVR WG Month of Issuance the Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Wa shington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}