{
  "anumber": "A21204721",
  "id": "A21204721_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21204721_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY NONIMMIGRANT ALIEN FOR REPLACEMENT OF ARRIVAL DOCUMENT, Form 1-274"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 5.00 FEE PAID No. 32 DAL 76 2TQ MF32 WILL BE IMPOSED FEE Immigration and Naturalization Service UNITED STATES DEPARTMI Dallas, Texas M&F WHICOmmigration and Naturalize Date 9/14/76 Verified by be IF NOT it is 14 2 53 PM APPLICATION BY NONIMMIGRANT ALIEN FOR REPLACEMENT OF ARRIVAL DOCUMENT 75242 ROOM BLDG, Please read Instructions on the reverse 110°C COMMERCE ST DALLAS, TEXAS 75202 32) (Please check the appropriate block below to Indicate the purpose of your application.) REPLACEMENT OF LOST, MUTILATED, OR DESTROYED ARRIVAL-DEPARTURE RECORD (FORM 1-94) REPLACEMENT OF LOST, MUTILATED. OR DESTROYED CREWMAN'S LANDING PERMIT (FORM 1-95) 1. Name (Last) (First) (Middle) DO THAN THI 2. Country of Citizenship 3. Passport Number 4. Alien Registration Number (If any) REPUBLIC of VIETNAM A21-204-721 5. Present Address in the United States (Number) (Street) (City) (State) (Zip Code) 4364 Cole Fort Worth TX 76115 6. Address Outside the United States (Number) (Street) (City) (Province or State) (Country) 393/11 TRAN HUNG-DAO, SAIGON, SOUTH VIETNAM 7. Date of Birth (Month) (Day) (Year) 8. Country of Birth 9. Date of Last Arrival in the U.S. - - 1915 VIETNAM MAY 2, 1975 10. Port of Last Arrival in U.S. 11. Name Used When Last Admitted to the U.S. Camp Pendleton in Calif 12. Means of Arrival 13. Name of Transportation Company 14. Name of Vessel (If arrival was by ship) 15. Place (city) where transporta- tion was boarded AIR Military Aircraft California 16. Status at Time of Admission 17. Date to Which StayH as Been Authorized Agricultural Worker Crowman Other (Specify) May 7, 1975 FILL IN THIS BLOCKIF YOU ARE APPLYING FOR REPLACEMENT OF YOUR ARRIVAL-DEPARTURE RECORD OR CREWMAN'S LANDING PERMIT 18. My Arrival-Departure Record or Crowman' Lending Permit become lost mutilated destroyed on or about JUNE at UNKNOWN under the following circumstances (Date) (Place) 9 had my Form 1-94 with me to the Welfare Depart to make an application for MEDICADE with my daughter When we came back home we could not find if out If my document is recovered or I ascertain its whereabouts, I will surrender it or report the facts to the Immigration and Naturali zation Service. FILL IN THIS BLOCK IF YOU WERE ADMITTED AS AN AGRICUL TURAL WORKER 19. I am now contracted to (Name of employer) (Address of employer) SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT SIGNATURE OF APPLICANT 20. I declare that this document was prepared by me at the request of the 21. I certify that the above statements are true and correct to best applicant and is based on all information of which I have any knowledge. of my knowledge and belief. Signature: Complete signature of applicants m Address Date Date signed: 4364 Cole St, F.W, TX Sept 2, 76 Sept '2' 1976 FORM 1-102 (REV. 2-1-73) N cam 9-23-76"
}