{
	"anumber": "A21201155",
	"id": "A21201155_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201155_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/21/2023, N-4-568"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/21/2023 I hereby declare, on oath, that solutely and entirely renounce and abjure al legiance and fidelity to any foreign prince, potentate, state or sovereignty, of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and laws of the United States of America against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will per- form noncombatant service in the armed forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely without any mental reservation or purpose of evasion; so help me God. If you cannot promise to bear arms or perform noncombatant service because of religious training and belief, you may omit those promises when taking the oath. \"Religious training and belief\" means a person's belief in a relation to a Supreme Being involving duties superior to those arising from any human relation, but does not include essentially political, sociological, or philosophical views or a merely personal moral code. 6. THIS BLOCK APPLIES ONLY TO APPLICANTS WHO HAVE FOREIGN-BORN CHILDREN WHO ARE UNDER 18 YEARS OF AGE. Some or all of your own foreign-born children (Not Step-Children) who are not yet citizens may possibly become United States citizens automatically when you are naturalized. This will happen: (1) If the child is a lawful permanent resident of the United States and still under 18 years of age when you are naturalized, and (2) The child's other parent is already a citizen or becomes a citizen before or at the same time that you become naturalized. If, however, the child's other parent is deceased, or if you are divorced and have custody of the child, then it makes no difference that the child's other parent was or is an alien. (3) If your child is illegitimate and you are the mother, only (1) above applies. (4) If the child is adopted, and was adopted before its 16th birthday and is in your custody. If you wish, you can apply for a Certificate of Citizenship for any of these children, which will show that they are United States citizens. If you do not want such a Certificate, write \"DO NOT\" in Question (36), page 3; if you do want such a Certificate, write \"DO\" in Question (36), page 3, and send the following with this application. (1) Fee. Thirty-five dollars ($35) for each child for whom a certificate is desired. DO NOT SEND CASH IN THE MAIL. ALL FEES MUST BE SUBMITTED IN THE EXACT AMOUNT. If you mail your application, attach a money order or check, payable to Immigration and Naturalization Service (Exceptions: If you reside in the Virgin Islands, remittance must be payable to Commissioner of Finance, Virgin Islands; and if in Guam, to Treasurer, Guam). Personal checks are accepted subject to collectibility. An uncollectible check will render the application and any documents issued pursuant thereto invalid. A charge of $5.00 will be imposed if a check in payment of a fee is not honored by the bank on which it is drawn. The fee will be refunded if for any reason the child does not qualify for the certificate. (2) Personal Description Form.-A completed Form N-604 for each child. (3) Documents.-The documents applicable to your case listed in the blocks below. If you want any of the original documents returned to you, and if the law does not prohibit the making of copies, a photocopy of the document should be sent with the original document. Any document in a foreign language must be accompanied by an English translation. The translation must contain a certification from the translator as to his competency as a translator and the accuracy of his translation. (4) Photographs.-Follow Instruction No. one (1) and send three (3) photographs of each child. Write the child's Alien Registration Number on the back of the photographs, lightly in pencil. DOCUMENTS REQUIRED WITH THIS APPLICATION 1. Child's birth certificate. 2. Your marriage certificate to child's other parent. 3. If you or the other parent were married before the marriage to each other, death certificate or divorce decree showing the termination of any previous marriage of each parent. 4. If the other parent became a citizen at birth, birth certificate of other parent. 5. If the child's other parent is deceased, or if you are divorced from the child's other parent, the death certificate or the divorce decree. 6. If the child is adopted, adoption decree. SECONDARY EVIDENCE If it is not possible to obtain any one of the required documents shown in the block above, consideration may be given to the fol- lowing documents. In such case you must present a written explanation as to why the document listed in the block above is not being presented, together with a statement from the official custodian of the record showing that the document is not available. 1. Baptismal certificate.-A certificate under the seal of the church where the baptism occurred, showing date and place of child's birth, date of baptism, the names of the child's parents, and names of the godparents, if shown. 2. School record.-A letter from the school authorities having jurisdiction over the school attended (preferably the first school), showing date of admission to the school, child's date of birth or age at that time, place of birth, and the names and places of birth of parents, if shown in the school records. 3. If you or the other parent were married before the marriage tc each other, death certificate or divorce decree showing the termination of any person( listed. 4. Affidavits.-Notarized affidavits of two persons who were living at the time, and who have personal knowledge of the event you are trying to prove-for example, the date and place of a birth, marriage, or death. The persons making the affidavits may be relatives and need not be citizens of the United States. Each affidavit should contain the following infor- mation regarding the person making the affidavit; His (Her) full name and address; date and place of birth; relationship to you, if any; full information concerning the event; and complete details concerning how he (she) acquired knowledge of the event."
}
