{
  "anumber": "A21201153",
  "id": "A21201153_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1978,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/21/2023 DUPLICATE UNITED STATES DEPARTMENT OF JUSTICE (To accompany Immigration and Naturalization Service monthly report on Form N-4) UNITED STATES OF AMERICA PETITION FOR NATURALIZATION No. 276/P/19207 A.R. No. A21 201 153 To the Honorable The Superior State of California Court for the at Santa Ana This petition for naturalization, hereby made and filed under section 316 (a) Immigration and Nationality Act, respectfully shows: (1) My full, true, and correct name is Ke Duc Pham (Full, true name, without abbreviation) (2) My present place of residence is Apt. 4 7172 Main Street Westminster (Apt. No.) (Number and street) (City or town) Orange California 92683 (County) 8/1/1915 (State) Vietnam (ZIP Code) (3) I was born on , in JIMMY KAY PHAM (4) I request that my name be changed to (5) I was lawfully admitted to the United States for permanent residence and have not abandoned such residence. (6) (If petition filed under Section 316(a).) I have resided continuously in the United States for at least five years and continuously in the State in which this petition is made for at least six months, immediately preceding the date of this petition and after my lawful admission for permanent residence, and I have been physically present in the United States for at least one-half of such five year period. (continued over) AFFIDAVIT OF WITNESSES The following witnesses, each being severally, duly, and respectively sworn, depose and say: Long Chinh Le (1) My name is 8918 La Dona Court, Fountain Valley, California I reside at and (Number and street) (City or town) (State) Rosemarie N. Arce (2) My name is 15941 Plymouth Lane, Huntington Beach, California I reside at (Number and street) (City or town) (State) I am a citizen of the United States of America: I have personally known and have been acquainted in the United States with the petitioner named 1/2/6/1978 in the petition for naturalization of which this affidavit is a part, since at least : to my personal knowledge, based upon (Month) (Day) (Year) frequent observations and personal contacts with the petitioner within the State (s) of residence of the petitioner since said date, the petitioner has resided, immediately preceding the date of filing this petition, in the United States continuously since the date last mentioned; that the petitioner has been physically present in the United States for at least 31/24 months of that period; and that petitioner has been a resident in the State in which the petition is filed during at least the last 6 months. I have personal knowledge that the petitioner is, and during all such periods has been a person of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happiness of the United States, and in my opinion the petitioner is in every way qualified to be admitted a citizen of the United States. I do swear (affirm) that the statements of fact I have made in the affidavit to this petition for naturalization subscribed by me are true to the best of my knowledge and belief. So Help Me God. Rosemarie N. Avee (Signature of Witness) (Signature of Witness) WHEN OATH ADMINISTERED BY CLERK OR DEPUTY WHEN OATH ADMINISTERED BY DESIGNATED EXAMINER CLERK OF COURT Subscribed and sworn to (affirmed) before me by above-named peti- Subscribed and sworn to (affirmed) before me by above-named peti- tioner and witnesses in the respective forms of oath shown in said petition tioner and witnesses in the respective forms of oath shown in said petition and affidavit, and filed by said petitioner, in the office of the clerk of said and affidavit at this Santa Ana, California court at day of 19 9th June 81 Designated Examiner. this day of 19 LEE A. BRANCH I HEREBY CERTIFY That the foregoing petition for naturalization was by petitioner named herein filed in the office of the clerk of said court By Kaveu Seto Clerk. at this day of Deputy Clerk. 19 [SEAL] Clerk. By Form N-405 (Rev. 11-27-78)N Deputy Clerk."
}