{
  "anumber": "A21348654",
  "id": "A21348654_0052",
  "page_index": 52,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21348654_0052/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service, G-325C"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS: Use typewriter. Be sure all copfese ape 9/22/203mplete. DO NOT REMOVE CARBONS. Failure TO answer fully all questions delays action. If typewriter. is not available, print heavily in block letters with ball-point pen. U.S GOVERNMENT PRINTING OFFICE: 1974 - 560-807 FORM G-325C (9-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 BIOGRAPHIC Immigration and Naturalization Service INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FEMALE ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (if known) CITY AND COUNTRY OF RESIDENCE FATHER MOTHER (Moiden name) HUSBAND or WIFE FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (If none, so state) (For wife, give maiden name) FORMER HUSBANDS or WIVES (Fill in the blocks below. If none, state \"none\".) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR PRESENT TIME APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (if none, so state) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR PRESENT TIME IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: APPLICANT FOR CONDITIONAL ENTRY PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE SIGNATURE OF APPLICANT OR PETITIONER) COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) A (OTHER AGENCY USE) (INS USE) CONDITIONAL ENTRY APPLICANT Return to: Immigration and Naturalization Service OFFICE CODE: TYPE OF CASE: DATE: FORM G-325C (5) Consul"
}