{
	"anumber": "A21344739",
	"id": "A21344739_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21344739_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: UNITED STATES DEPARTMENT OF JUSTICE\\nForm Number: G-14 ( (Rev. 4-7-2)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service File No: 21 344 739 Date: 8/14/79 Director of Indochina Adjustment program 300 N. Los Angeles Los Angeles, CA 90012 ATTN: MR. Jack preston Your assistance in furnishing additional identifying information is requested so that we may act upon or reply to your communication. Please fill in the necessary information and return this letter and any attached material to this office. Any Other File Your \"A-\" (Alien Registration) No. 121 344 739 No., if Known Your Full Name NGuyen, Than The Complete Present Address 3116 Taft Way - Costa Mesa , CA 92626 Address in U.S. at Time of Entry Box 599 Fulton Kentucky 43041 Birthdate 10/21/15 Birthplace Saigon, Vietnam Date of Entry 6/1/75 Place of Entry SND- P Airline and Flight Number or Vessel of Arrival Military AiR plane Type of Entry (Temporary Visitor, Student, Permanent Residence Visa, Reentry Permit, etc.) parolee Destination in U.S. as Shown on Entry Document Name Used at Time of Arrival NGuyen, Than The Other Names Used at Any Time Please fill in the following if an application or previous correspondence concerning this matter was forwarded to this Service: Type of Application: Indochina Refugee Date of Application or Correspondence: September 9, 1978 Your address as shown on application or correspondence: 2999 Mendoza DR # A Costa Mesa, CA 92626 Address of Service office where application or correspondence was forwarded: Form G-14 Los Angeles, CA (Rev. 4-7-72)N"
}
