{
	"anumber": "A21344739",
	"id": "A21344739_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21344739_0034/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "INSTRUCTIONS: USE TYPEWRITER. BE SURE ALL Screened NARA, 9/22/2023 ure to answer fully sii queetin editions action. Do Not Remove Carbons: If typewriter is not available, print heavily in block letters with ball-point pen. U.S. GOVERNMENT PRINTING OFFICE:19 05 LOS FORM G-325A (REV. 10-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE I/C : 245 OMB No. 43-R436 Immigration and Naturalization Service SEP 9 1978 BIOGRAPHIC INFORMATION (DATE) (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. NGUYEN THAN (If any) THI FEMALE 10/21/15 Vietnam A 21 344 739 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Hung Yen, Vietnam (If any) 586-32-4586 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER NGUYEN Phuc Unknown Deceased MOTHER (Maiden name) NGUYEN The Unknown Deceased HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE Hung Yen NGUYEN Chinh 12/20/13 Hung Yen, VN 1935 Vietnam FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 2999 Mendoza, #A Costa Mesa California U.S.A. 07 77 PRESENT TIME £6229 Woodruff #53 Bellflower California U.S.A. 01 77 07 77 Route #5, PO Box 196 Fulton Kentucky U.S.A. 06 75 01 77 YYB/ Pendleton Camp San Diego California U.S.A. 05 75 06 75 Guam U.S.A. 04 75 05 75 115/158 Truong Minh Ky Gia Dinh Vietnam ? 54 04 75 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 115/158 Truong Minh Ky Gia Dinh Vietnam ? 54 04 75 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME NONE Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE INATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): than 9.09-78 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. OFFICE CODE: TYPE OF CASE: DATE: FORM G-325A (3) C."
}
