{
	"anumber": "A21347299",
	"id": "A21347299_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21347299_0033/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325A ( (REV. B-27-72IN)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 1945, 2023, 1926, 1915]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' page-communication inc.', 'driver']"
			},
			"reason": {
				"reason_llm_v1": "Naturalization"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 8-27-72)N UNITED STATENE DEPARTMENT OF JUSTICE Screened by NARA 8/29/2023 Form Approved OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. HOANG PHUNG VAN FEMALE 1915 VIET- NAM Assy 347 299 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. CAO Biring NORTH-ViET-NAH (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER HWAY. A. SAT QUAINGS, CHINA MOTHER (Maiden name) Dzin Ly GUANG CHINN HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE NOUYEN. THi- Previ PHUC 1926 HANDi 1945 HANSi FORMER HUSBANDS OR WIVES (if none,so state) FAMILY NAME (For wife. give maiden nome) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE Novyen- THI PHUC 1926 HANDI ig 45 APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR PRESENT TIME 16190 PHAN. THANH - GH-Dink ViET-NAM 1970 1975 GAN - Go. VA/2 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME PAGE - COMMUNiCATION INC. DRIVER MARS 1970 APRIL 1975 NORTHROP PAGE TECHNOLOGY PARK ViENNA VIRGINIA 22180 Show below last occupation abroad if not shown above. Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR DETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Refugee 9-5-7975 OTHER (SPECIFY): IF YOUR NATIVE ALPHABEI IS IN OTHER THAN ROMAN LETTERS WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE. Are all copies legible? Yes PENALTIES SEVERE PENALTICS ARE PROVIDED BY LAW FOR KNOWINCLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT"
}
