{
  "anumber": "A21348654",
  "id": "A21348654_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21348654_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "France",
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023,
        1950,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 (30) My occupation is NONE Ratical 10 List the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 19 PRESENT TIME (b) 19 ,19 NONE (c) 19 19 roak Q (d) 19 19 (31) Complete this block if you are or have been married. I am WIDDINED The first name of my husband or wife is (was) Bui,THIEW QUANG Single, married, divorced, widowed) We were married on 1932 at VIETNAM He or she was born at 1910 on VIETNAM He or she entered the United States at (place) died on (date) 12, for permanent residence and now resides with me apart from me at Necessed 1950 (Show full address if not living with you.) He or she was naturalized on at ; Certificate No or became a citizen by His or her alien Registration No. is (32) How many times have you been married? How many times has your husband or wife been married? 1 If either of you has been married more than once, fill in the following information for each previous marriage. (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE CITIZEN ALIEN ENDED (a) (b) (c) (d) (33) I have 3. children: (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- (Number) wise give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (c) Date (Country) of Entry (f) Port of Entry (g) Alien Born Registration No. (h) Now Living at FOIA (b)(6) 2820 W. 9th st Bui, My QUANE M VIETNAM 9-12-35 09-14-79 SFR LA CA 90006 BUI THANH-VAH F VIETNAM 17-28-3606 6-4-75 SNDP With me BLG BACH NGOO F VIETNAM 8-23-37 FRANCE Mary 4 (34) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) I do not want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $15 for each child for whom you want certificates, otherwise, send no money with this application.) Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages"
}