{
	"anumber": "A21348654",
	"id": "A21348654_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21348654_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, PD-258 ( Rev. 4.25.72"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 FEDERAL BUREAU OF.INVESTIGATION UNITED STATES DEPAI TMENT OF JUSTICE WASHINGTON, D.C: 20537 1. LOOP APPLICANT CENTER OF LOOP 10 OBTAIN CLASSIFIABLE FINGERPRINTS 1 USE PRINTER'S INK 2 DISTRIBUTE INK EVENLY ON INKING SLAB 3 WASH AND DRY FINCERS THOROUGHLY 4 ROLL FINGERS FROM MAIL TONAIL AND AVOID ALLOWING FINGERS TO SLIP 5 BE SURE IMPRESSIONS ARE RECORDED IN CORRECT ORDER 5 IF AN AMPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER MAKE A MOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER BLOCK DELTA 7. IF SOME PHYSICAL COND TION MAKES IT IMPOSSIBLE TO OBTAIN PERFECT IMPRESSIONS SUBMIT THE BEST THAT CAN BE OBTAINED WITH A MEMO STAPLED TO THE CARD EXPLAINING THE CIR. CUMSTANCES & EXAMINE THE COMPLETED PRINTS 10 SEE IF THEY CAN BE CLASSIFIED BEARING IN MIND THAT THE LINES BETWEEN CENTER OF MOST FINGERPRINTS FALL INTO THE PATTERNS SHOWN OH THIS CARD OTHER PATTERNS OCCUR LOOP AND DELTA MUST SHOW INFREQUENTLY AND ARE NOT SHOWN HERE) 2. WHORL LEAVE THIS SPACE BLANK THIS CARD FOR USE BY: DELTAS 1. LAW ENFORCEMENT AGENCIES IN FINGERPRINTING APPLICANTS FOR LAW ENFORCEMENT POSITIONS AND APPLICANTS FOR EMPLOYMENT LICENSES OR PERMITS IN THOSE STATES WITH STATUTES PROVIDING FOR FINGER PRINTING AS A REQUISITE FOR THE TYPE or EMPLOY MENT LICENSE OR PERMIT TO BE ISSUED LOCAL AND COUNTY ORDINANCES UNI FSS SPECIFICAL LY BASED ON APPLICABLE STATE STATUTES DD NOT SATISFY THIS REQUIREMENT A SET OF APPLICANT PRINTS MUST FIRST BE CHECKED THROUGH THE APPROPRIATE STATE IDEN. TIFICATION BUREAU OR, IF NO SUCH BUREAU EXISTS THROUGH , CENTRAL AGENCY DESIGNATED FOR SUCH PURPOSE WITHIN THE STATE ONLY THOSE FINGERPRINTS THESE LINES RUNNING BETWEEN FOR WHICH NO DISQUALIFYING RECORD HAS BEEN FOUND DELTAS MUST BE CLEAR LOCALLY SHOULD BE SUBMITTED FOR F81 SEARCH IF A MORE CURRENT COPY OF AN EXISTING FBI IDENTIFICA. 3. ARCH TION RECORD is REQUIRED SIMPLY SUPPLY NAME FDI NUMBER OR LOCAL ARREST NUMBER AND ,IF READILY AVAILABLE THE PRIMARY AND SECONDARY PARTS OF THE FINGERPRINT CLASSIFICATION 2. U.S. GOVERNMENT AGENCIES IN CONNECTION WITH CLEARANCES IDENTITY OF PRIVATE CONTRACTOR SHOULD BE SHOWN IN SPACE EMPLOYER AND ADDRESS.\" THE CONTRIBUTOR IS THE NAME OF AGENCY SUBMITTING THE FINGERPRINT CARD TO THE FBI. FBI NUMBER IF KNOWN SHOULD ALWAYS BE FURNISHED IN APPROPRIATE SPACE MISCELLANEOUS NO. - RECORD OTHER ARMED FORCES NO. PASSPORT NO. (PP) ALIEN REGISTRATION NO (AR). PORT SECURITY CARD NO. (PS), SELECTIVE SERVICE NO. ARCHES HAVE NO DELTAS (55), YETERANS ADMINISTRATION CLAIM NO (VA). FD-258 (Rev 4.25.72 s U. G. GOVERNMIENT PRINTING OFFICE"
}
