{
	"anumber": "A21344739",
	"id": "A21344739_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21344739_0046/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: BIOGRAPHIC INFORMATION\\nForm Number: OMB No. 4-4363"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 1955, 2023, 1913, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325 (REV. 8-1-74) Y Screened by NARA, 9/22/2023 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE INFORMATION Immigration and Naturalization Service Form Approved OMB No. 43-R436 (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY MGUYEN ALIEN REGISTRATION NO. THAN THI FEMALE 1915 (If any) ALL OTHER NAMES USED (Including names by previous marriages) VIETNAM CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) NGUYEN PHUC CITY AND COUNTRY OF RESIDENCE FATHER chiet MOTHER (Maiden name) NGUYEN THE HUSBAND (If none, so state) FAMILY NAME OR FIRST NAME BIRTHDATE (For wife, give maiden name) CITY & COUNTRY OF BIRTH DATE OF MARRIAGE WIFE PLACE OF MARRIAGE NGUYEN CHiNA 1913 HUNG YEM FORMER HUSBANDS OR WIVES (If none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR TRUONG MINH Ky PRESENT TIME S171 GOM VIETNAM 2 115/158 1955 4 1975 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR TRUONGMINH-KY115/158 SAiGON MONTH YEAR VIETNAM 2 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, SO STATE.) LIST PRESENT EMPLOYMENT FIRST. 1955 H 1975 FROM FULL NAME AND ADDRESS OF EMPLOYER TO OCCUPATION (Specify) MONTH YEAR MONTH YEAR PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION OTHER (SPECIFY) ADJUSTMENT OF STATUS 414-5-1975 Are all copies legible? IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
