{
	"anumber": "A21343567",
	"id": "A21343567_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21343567_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, Form 1 - 181 ( (Rev. 4-1-77)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES Screened by NARA,E8/17/2023 USTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE LOS Place Los Angeles, CA File No. A21 343 567 Status as a lawful permanent resident of the United States is accorded: SEX Name DATE OF BIRTH Street TO, Luong Thi F 1/1/15 Address PLACE OF BIRTH 6440 Michelson City, State, Zip Cholon, Vietnam LuLakewood, CA 90713 of ou addication pl NATIONALITY we mptcp COUNTRY TO WHICH CHARGEABLE (If any) cobi PREFERENCE (If any) Vietnam a PRIORITY DATE pefole belwaueur 191161 boyjou of REMARKS Indochineseable NONPREFERENCE: Section 212(a)(14) certification not required because: abbiobaja IIJ a voubletelence case Individual section 212 (a) (14) certification issued Blanket section 212(a)(14) certification issued under the following provision of lawa gale Sec 203(h) of the &N Act the Sec 249 of the d & N Act Sec 214(d) 1)& No Act offer EAGU at w nwo a pecower Private Law no. of the Sec 244 )( what the I & N Actionable Sec 1 of the Act of 11/2/66 Congress session we 26LAICE of we 01 rapou Sec 145 of the I & N Act Public 4/8 Law C6 95-145 Sec 13 of the Act of 9/11/57 blow 25 1975 (Other law Specify) pl SLOUCH of bettles Angeles OA ou As at blo (Month) of (Day) (Year) IUG UCPORT OF ENTRY FOR PERMANENT RESIDENCE en) bloaded LCC pa2!2' OL Class of admissi on (Insert sy mbol) apillia WE DATE the abbicous OF excebtional RECOMMENDED/BY (Immigration (Officer) (Date) ACTION ON 6. 1978 480 mpicuen Joseph abbilion DISTRICT Los WMG FOR USE BY VISA CONTROL OFFICE JV2 6188 AH Date G 361 12/28/78 N.R. Foreign State you pc bioboloq IU anbitcase oceq Ca262 MUGLE LGONILE Preference Category 181 IU we tps MUSLE PROCESSED FOR I-551. Number TEMPORARY EVIDENCE OF AP!9 LAWFUL ADMISSION FOR was we Month of Issuance auquit PERMANENT RESIDENCE VALID UNTIL EMPLOYMENT AUTHORIZED. Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}
