{
	"anumber": "A21430343",
	"id": "A21430343_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21430343_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 430 343"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES Screened NARA CF3/2023ICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE SFR Place Los Ange les, CA File No. A21 430 343 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street HUYNH, Binh 9/23/15 Address 1414 Magdalenla #288 PLACE OF BIRTH City, State, Zip Los Angeles, CA 90012 Cho Lon, Vietnam 01 we abbload obbucation NATIONALITY 116 DOLICE MPICU COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE(If any) XXXXXX Vietnam PRIORITY DATE petole betwouse REMARKS VOLICE ACI Indochinese Refugee NONPREFERENCE: Section 212(a)(14) certification not required because: abbiobuja ca26 Individual section 212(a)( (14) certification issued Blanket section 212(a)(14) certification issued as under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act OHIOL pondy of pecower Private Law no of the Sec 244 )( ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session IUG we 01 the CELLINCOTION Sec 245 of the I & N Act paz Sec 13 of the Act of 9/11/57 Public Law 95-145 (Other law Specify) bload ou Ma2 As of at Los Angeles (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE OLONIGEO OL Class of admission (Insert symbol) A OL apillid IU lue 2CIBUC82 DATE 100 12 OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION -782 tixeq p1 DISTRICT FOR USE BY VISA CONTROL OFFICE LOS Date Foreign State PROCESSED FOR I-551. CO262-MUGLE Lednit's TEMPORARY EVIDENCE OF 20 coulton Preference Category LAWFUL ADMISSION FOR abbiobu MUGLG PERMANENT RESIDENCE Number VALID UNTIL EMPLOYMENT AUTHORIZED MUSI Month of Issuance 273 Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1) AN EQUAL EMPLOYMENT OPPORTUNITY-AFFIRMATIVE ACTION EMPLOYER"
}
