{
  "anumber": "A21431061",
  "id": "A21431061_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21431061_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551, 4tw057917"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1982,
        2023,
        1983,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 U.S S. DEPARTMENT OF JUSTICE Form Approved Immigration and Naturalization Service OMB No. 43-R0040 (SEE INSTRUCTIONS ON REVERSE) Fee Stamp APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551 (TYPE OR PRINT IN BLOCK LETTERS WITH BALLPOINT PEN) HHW057917 1. Family Name (Capital Letters) First Middle 2. Alien Registration Number BUI NGA QUANG 421 431061 3. Mailing address in U. S. c/o (Number & Street) (City) (State) (ZIP Code) 98-999 PALULA WAY AiEA HAWaii 96701 4. Name used when I became a permanent resident: (If same as present, write 'Same 5. Country of citizenship SAME Viet NAM 6. Date of Birth (Mo./Day/Yr.) 7. Place of birth (City or town) Province or State) (Country) 266 8. My phone number is (Include Area Code) 12 - 31 - 1915 AHANH and State) HOA) 10. VietNAM Date of 808-488 8694 9. Originally admitted to U.S. at (City admission as Permanent Resident or adjusted to status as Permanent Resident HONOLULU HAWaii IC-6 (Mo/Day/Yr) APRiL 30th 1975 07-08-75 11. Destination in U.S. at time of original admission 12. My file is at the INS office in (City and State) HAWAII EWA BEACH Honolulu, HAWAII 13. List the dates of all absences from the U. S. of 1 year or longer, since admission for permanent residence N/A 14. City of residence when I applied for an immigrant visa or adjustment to permanent residence status Honolulu HAWaii EWA BEACH 15. Consulate where my visa was issued (or INS office where I was adjusted to permanent residence status) (Honolul) ) HAWAii 16. Mother's First Name Living Deceased 17. Father's First Name Living Deceased NHON HOANG 18. I NEED A CARD BECAUSE: (A) My alien registration receipt card was lost destroyed, or mutilated. (Attach remainder of card) (FEE, REQUIRED, SEE INSTRUCTION 3.) st THEAESA CHURCH ON Sunday December 26th 1982 Explain how card was lost, destroyed, or mutilated. My PURSE WAS STolen when I went TO (B) My name has been changed. (Attach the decree of the court or the marriage certificate and old card.) (FEE REQUIRED, SEE INSTRUCTION 3) (C) I am required to be registered and fingerprinted after my 14th birthday. (Attach old Card.) (You MUST use the fingerprint card Form FD-258 which you can get from any United States Consular or Immigration and Naturalization Service office.) (D) I am an alien commuter taking up actual permanent residence in the U.S. (Attach old card.) (E) I received an incorrect card. (Attach old card.) (F) I never received my card. (G) OTHER (Explain) Card 1 5 and Class(ICi) 19. and date of the form if other than applicant Signature Them W. person Johnn preparing 20. Signature of and date 1/2/83 Ngaquang/She DO NOT WRITE BELOW THIS LINE ACTION BLOCK (For use by Immigration or Consular officer) This applicant was interviewed by me under oath on (Date) at (City) REMARKS: (Signature and Title) GRANTED DENIED Fingerprint card forwarded to the FBI to comply with HHW 1315 JAN 5 1983 Section 262 b (Initials and Date) DATE DD Manley OF ACTION I Millard DISTRICT acts DD Pa Manaj I-89 to Immigration Card Facility 1/5/83 (Date) (Signature of Immigration Officer) HOW #1315 RECEIVED TRANS IN RETD TRANS: OUT COMPLETED FORM I-90 (Rev. 4-4-80) N 1/5/83 1/5/83"
}