{
	"anumber": "A21485800",
	"id": "A21485800_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21485800_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Processing Sheet, I-90 Processing Sheet"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 ment of Justice and Naturalization Servic I-90 PROCESSING SHEET To be Completed by INS Employee Pre-Screening Application C (Attach to Form I-90 Application when forwarding to Service Center) APPLICATION Application form: Form completed and signed. A# 21 485 800 Application fee (Check one): Correct fee attached. ATL Fee exempt. N90 Fee receipted locally. (Local receipt only required for cash.) Photos: INFORMED JAN 31 1995 Photographs are acceptable. (If not, do not accept application.) Sex (Check one): x Male THE Female Card (Check one): Valid Form I-151 seen and returned to applicant; and copy attached to application. (If Form I-151 looks questionable, check CIS to confirm status and attach screen print; if still questionable, refer to Investigations.) Applicant has lost card. (Check CIS before issuing any temporary document. If CIS checked, attached screen print to application.) Applicant never received card. IDENTITY VERIFICATION Check one: X Documents confirm identity. Identity otherwise established. (Where identity is not established at time of filing, refer applicant to Investigations for verification before accepting application.) ADIT PROCESS ADIT processing completed. (Signature, fingerprint, A-Number on Form 1-89, Form I-89 attached.) (If new Form I-89 based on rejection of earlier Form I-89, attach a copy of alien's notice to this Form I-89 when forwarding to the Service Center.) letter Remarks: Ca aged see medual INFORMATION RX Service and To be Completed by INS Employee Pre-Screening Application 1/31/15 DO are Signature Date Title INS Office 3 Letter Code 'ORWARD APPLICATION PACKAGE, INCLUDING PROCESSING SHEET AND I-89, NIGHTLY TO THE SERVICE CENTER. I-90-PS (7/24/92) *U.S. GPO: 1992-312-328/64892"
}
