{
	"anumber": "A21432221",
	"id": "A21432221_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21432221_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Present to Immigration Official when Interviewed, House # 74 Pacific Ave"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1916, 1975, 1970, 1954, 1973, 1940, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "House # 743 Pacific *Head of household means non -U.S. citizen member only. Present to Immigration Official when Interviewed Xuat trinh cho nhan-vié SO'Di Tru khi dudc phong van This form is to be answered by head of household and other members over 14 years and Phieu nay do chu gia dinh va nhung ngudi trong gia dinn tren 14 tuoi tra loi va chi include only those relatives traveling with him. Please answer in English. gom nhung than nhan cung di ma thôi. Xin tra loi bang tieng Anh. Name: PHAM - VAN - DiNH Sex: Male A 60 HO va ten Nam hoac Nu Date and Place of Birth: Ngay va noi sanh 15-7-1915 Chinding Lao, Nam Dinh Identification Document and NO: 02975538 Can cudc hoac thong hanh so Address in Viet Nam: 103/12 NGUYEN -BA -TONG the SAiGON Dia chi tai Viet Nam Address in United States: NONE Dia chi tai Hoa-Ky Residence last five years: Date From Date To Noi cul trú trong 5 nam sau cung Tu ngay Toi ngay From 12/1/1970 Tel4/7/1973 in SAiRon 15/7/1973 1 H 5/5/1975 in SAiGon Occupation and position last five years: Nghê nghiep va chuc vu trong 5 nam sau cung 1/1/1970-11/1/1973 custom staff 15/7/1973. 5/5/1975 : Retired onapension Father: PHAM - KIM Citizenship: VIET-NAM HO va ten nguoi cha Quoc tich Mother: DOAN -THI- SAO Citizenship: VIET NAM HO va ten me Quoc tich Spouse: PHAM.THI-DIEU HO va ten ngúoi hon phôi Date and Place of. Birth: 13-2-1916 Nam-Ainh Ngay va noi sanh Accompanying Family Members: Nhung than quyen mang theo Name Sex Date of Birth Place of Birth A No HO va ten Nam hay nu Ngay sanh Noi sanh so' A of Pham-NGOC Son (Son) male 6/2/1940 1936 Hai Phong 35 Age Natau (daughter in-law) Femal ChuQuan SONTAN 39 \" FOIA (b)(6) Wh Pham thi DLEG (wife) Flight of Arrival on Wake: Femal 13/02/1916 Nam Dins From Saigon/Clark 59. Chuyen bay toi Wake: Sponsoring Agency: April 30th 75 Tu Saigon/Clark Co quan bão trò Did Ban cho Hoa- Ky hoac you 8 lam work viec for the Chinh United Phu States or Viet Viet Nam Nam? Government? custom staff of Republic of VN Have you lived in the North? If SO when did you move South? 1954 Ban da tung cu ngu tai Bac Viet chua? Neu CO, ban vao Nam nam nao? Names and Addresses of friends/relatives in the United States: HO va ten va dia chi ban be/thân guyen tai Hoa Ky: FOIA (b)(6)"
}
