{
  "anumber": "A21432711",
  "id": "A21432711_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21432711_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 4-14-81)Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1979,
        1982,
        1981,
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 UNITED STATES DEPARTMENT OF JUSTICE OMB NO. 1115-0009 IMMIGRATION AND NATURALIZATION SERVICE Approval Expires 1/31/84 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION 102.00 Mail or take to: FEB 1982 IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION ( Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name NEUYEN, NGOC MINH THi TYPE.) No. A21 432 711 Section of Law 3/6 Date: 01-28-82 (Leave Blank) (1) My full true and correct name is MiNH THINGOC NGUYEN (2) I now live at 15433 //2 true MANSEL name Full without abbreviations) AVE. 396570 (Number and street, ) LAWNDALE, LOSANGELES, CA. 90260 (City county, state, zip code) 01-02-15 PHUC YEN MK (3) I was born on in @ ViETNAM (Month) (Day) (Year) (City or town) (County, province, or state) (Country) (4) I request that my name be changed to NONE SAMU (5) Other names I have used are: NONE (Include maiden name) Sex: Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (9) Can you sign your name in English? Yes No (10) My lawful admission for permanent residence was on 05 28 75 under the name of (Month) (Day) Year) NGUYEN, NGOCMINH THI at Los ANGELES CALIFORNIA (City) (State) (11) (a) I have resided continuously in the United States since 05 28 75 (Month) (Day) (Year) (b) I have resided continuously in the State of CALiFORNiA since 05 28 75 (Month) (Day) (Year) (c) During the last five years I have been physically in the United States for a total of 60 months. FROM To STREET ADDRESS CITY AND STATE (a) 04 1981 PRESENT TIME 154331/2 MANSEL AVE LAWNDALE, CA (b) 02 1979 03 1981 149171/2 LEMOLi AVE. GARDENA, CA (c) 07 1978 02 1979 1225 So. GREVILLEA AVE. INGLEWOOD CA (d) 07 1975 06, 1978 12700 CRANBROOK AVE. HAWTHORNE, CA (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES 5 (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES NONE Form N-400 (Rev. 4-14-81)Y (OVER) (1)"
}