{
	"anumber": "A21430343",
	"id": "A21430343_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21430343_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/3/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1975, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/3/2023 *Head of household means non-U.S. citizen member only Present to Immigration Official when Interviewed Xuat trinh cho nhan-vien so Di Tru khi dudc phong van This form is to be answered by head of household and other members over 14 years and Phieu nay do chu gia dinh va nhung ngúdi trong gia dinh tren 14 tuoi tra loi va chi7 include only those relatives traveling with him. Please answer in English. gom nhung than nhan cung di ma thoi. Xin tra ldi bang tieng Anh. Name : HUYNH BiNH Sex: FEMALE A 60 Ho va ten Nam hoac Nu Date and Place of Birth: Ngay va ndi sanh SEPT. 23,1915 CHOLON VIETNOM Identification Document and No: 00118842 Can cudic hoac thong hanh sô' Address in Viet Nam: Dia chi tai Viet Nam 88 IRAN Quy ST, raicin Address in United States : -Dia chi tai Hoa-Ky 19613 5 NORMANDALE AVE, CERRITIS CALIF Residence last five years: Date From Date To Noi cui trú trong 5 nam sau cung Tu ngay Toi ngay SAIGON VIETNAM 1969 1975 Occupation and position last five years: Nghê nghiep va chuc vu trong 5 nam sau cung HOUSEWiFE & BEANSTRESS Father: TE (DECEASED) Citizenship: CHiNESE HO va ten nguoi cha Quoc tich Mother: DANG Citizenship: CHINESE HO va ten me Quoc tich Spouse: GIANG GIA, HO va ten nguoi hon phoi Date and Place of Birth: Ngay va noi sanh 1912 DAIGIN VIETNAM Accompanying Family Members Nhung than quyen mang theo Name Sex Date of Birth Place of Birth A No Ho va tên Nam hay nu Ngay sanh Noi sanh so' A Flight of Arrival on Wake: 4/30/1975 From Saigon/Clark Chuyen bay toi Wake: Tu Saigon/Clark Sponsoring Agency: U.S. EMBASSY SAIGON Co' quan bao trò Did you work for the United States or Viet Nam Government? NO, Ban 8 lam viec cho Chinh Phu Hoa- Ky hoac Viet Nam? Have you lived in the North? If so when did you move South? NO, Ban dá tung cu ngu tai Bac Viet chua? Neu CO, ban vao Nam nam nao? Names and Addresses of friends/relatives in the United States: HO va ten va dia chi ban be/than guyen tai Hoa Ky: SON- U/o CHIANG CHIN TiEN 19613 NORMANDALE AUE, CERRITOS, CALiFORNiA 90701"
}
