{
  "anumber": "A21431061",
  "id": "A21431061_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21431061_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CREATION OF A RECORD OF LAWFUL ADMISSION FOR AN INDOCHINA REFUGEE, FORM 1-4b5-c(a) ( (SUPPLEMENT)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1926,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 FORM 1-485-C (a) (SUPPLEMENT) IMMIGRATION AND NATURALIZATION SERVICE FORM APPROVED NOVEMBER 1, 1977 OMB No 43-R APPLICATION FOR CREATION OF A RECORD OF LAWFUL ADMISSION FOR AN INDOCHINA REFUGEE (PLEASE TYPE OR PRINT) 1. (FAMILY NAME, IN CAPS) (FIRST) 2. ALIEN REGISTRATION No. (MIDDLE) BUI A21-431-061 NGA QUANG TELEPHONE NUMBER 689-5361 30 DATE OF BIRTH (MO)(DAY)(YR) 4. CITY & COUNTRY OF BIRTH 4A. NAT ONALITY 12/31/15 5. MALE 6. Thanh Hoa, Vietnam Vietnamese SINGLE MARRIED FEVALE DIVORCED SWIDOW 7. LIST ALL OF YOUR DEPENDENTS, INCLUDING SONS, DAUGHTERS, OR OTHERS WHOM YOU SUPPORT: NAME AND ADDRESS SEX PLACE OF BIRTH DATE OF BIRTH Dang, Tran Thi - wife F TYPE OF SCHOOL/GRADE COMPLETED Vietnam 6/1/20 Adult education Chau Bui 2. son M Vietnam 5/25/59 Nhu Y Bui Thi daughterF Vietnam Leeward comm. college 5/27/61 Campbell high school Tu Bui a. Son M Vietnam 3/24/62 11 Khoi Bui Re. Bui son M Nhu Chi T 8: THE FOLLOWING MEMBERS OF MY FAMILY ARE ALSO APPLYING FOR PERMANENT RESIDENT 6/9/65 STATUS: F Vietnam daughter 9/12/64 Ilima Intermediate Same as above 9. FAMILY NAME FIRST NAME FATHER: Bui DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) Hoang Vietnam CITY AND COUNTRY10F RESIDENCE Vietnam (dead) MOTHER (MAIDEN NAME) LE Nhon Vietnam Vietnam (dead) 10. APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. (EXCLUDE RELOCATION CAMP) FROM To STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR ONTH 91-918 Ahona st. YEAR Ewa Beach Hawail USA 1355 Manu-Mele st. July 77 Kailua Hawaii USA PRESENT June 1619 Ulupii Pl. 75 Kailua July 77 Hawaii USA 14/40G Ky Dong st. April June Saigon 75 Hawaii USA Jan. 70 April 75 11. AM CURRENTLY RESIDING IN: PARTMENT MOBILE HOME CONDOMINIUM HOUSE OTHER(SPECIFY) 12. ARE YOU LIVING RENT FREE? YES No 13. APPLICANT'S EMPLOYMENT LAST THREE (3) YEARS. (IF MORE, so STATE). LIST PRESENT EMPLOYMENT FIRST, FULL NAME AND ADDRESS OF EMPLOYER 14. FLUENCY IN ENGLISH JOB TITLE WAGE/HOUR (CHECK) POOR FAIR GOOD READ X J.C. Penny , Ala Moana Branch WRITING X 15. LAST JOB TITLE, ABROAD: Genator $2.40 SPEAKING X 1975-1926 16. NAME AND LOCATION OF SCHOOLS ATTENDED TYPE OF SCHOOL FROM TO HIGHEST GRADE COMPLETED TITLE OF DEGREE McKinney community school community 76 Nov 77 Ewa Beach community scholl 00 Nov/present 17. HAVE YOU RECEIVED ANY PUBLIC/PRIVATE ASSISTANCE? YES No IF YES, ANSWER THE FOLLOWING: PUBLIC ASSISTANCE(SOURCE) TYPE FROM / TO Welfare DOLLAR AMOUNT Jun 75 / present 781.00/month PRIVATE ASSISTANCE(SOURCE) wife a schild none 18. HAVE YOU BEEN: YES No TREATED FOR MENTAL ILLNESS, DRUG ADDICT ON OR ALCOHOLISM? YES No ARRESTED, CONVICTED OR CONF NED IN PRISON? YES No PERSECUTER OF ANY PERSON BECAUSE OF RACE, RELIGION, OR POLITICAL OPINION? IF YOU ANSWER YES, EXPLAIN ON A SEPARATE SHEET."
}