{
	"anumber": "A21485800",
	"id": "A21485800_0051",
	"page_index": 51,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21485800_0051/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/31/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Georgia", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 4024 Cedar Gate Road N. W. Huntsville, Alabama June 21, 1976 Mr. Alexander U. S. Immigration and Naturalization Service Savannah, Georgia Dear Mr. Alexander: This is in regard to the petition of immigration visa for my parents Mr. C. S. Pinjani and Mrs. S. B. Pinjani. I had initially applied for their immigration visa on October 16, 1975 to the Immigration office in Atlanta, Georgia while they were both still in India. Since then due to the urgency of the situation and not processing of the application in time both my parents entered U. S. A. on a visitor visa on May 1, 1976. (please refer to my enclosed letters of April and Mat 19CA 1976). I had therefore requested in my letter of May 6, 1976 that the port of the visa on their petition be changed from New Delhi, India to Atlanta, Georgia. Part of the petition application with the supporting documents and a note that I had not complied with the instructions for submitting support documents was re- turned to me by the Atlanta office on May 19, 1976. Upon this, not knowing what to provide further due to lack of clear instructions, I visited the Atlanta office of Immigration along with my parents on May 21, 1976. I was told that in the absence of my birth certificate I needed two affidavits confirming the marriage of my parents to support my relationship with them and that when I obtain such docu- ments, I should forward these along with the application directly to your office. Accordingly, please find enclosed the application for immigration visa of my parents, the supporting documents and affidavits from two of the relatives of my parents in India for further processing of their immigrant visa. I had sent the passports of my parents to the Atlanta office by certified mail and was told upon my personal visit that these passports and the rest of the application material had been sent to you. I will be very grateful if you will kindly process the application for immigration visa of my parents at your earliest convenience and return to me the supporting documents and the passports after you have duly examined these to your satisfaction. Thank you. Sincerely, Mote Puyan Moti Pinjani, D. V. M. Ph.D. Associate Professor MP/mh"
}
