{
  "anumber": "A21485800",
  "id": "A21485800_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21485800_0042/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR A SOCIAL SECURITY NUMBER, SS-5 (9-75)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 ID: CN: APPLICATION FOR A SOCIAL SECURITY NUMBER DO NOT WRITE IN THE ABOVE SPACE- See Instructions on Back. Print in Black or Dark Blue Ink or Use Typewriter. Print FULL NAME (First Name) (Middle Name or Initial-if none, draw line ) (Last Name) 1 YOU WILL USE IN WORK PINJANI CHETANRANI OR BUSINESS SHIVANDASS Print FULL CHETANAM SHIVANDAS YOUR (Month) (Day) (Year) 2 NAME GIVEN PINJANI DATE OF YOU AT BIRTH BIRTH June 6th 1905 1905 PLACE (City) (County if known) (State) YOUR PRESENT AGE 3 OF SHKKHE Smith W. Pakestan (Age on last birthday) 71 BIRTH MOTHER'S FULL NAME AT HER BIRTH (Her maiden name) YOUR SEX 4 Aluri Bar 8 MALE FEMALE FATHER'S FULL NAME (Regardless of whether living or dead) YOUR COLOR OR RACE 5 WHITE NEGRO OTHER SHIVANDASS HAVE YOU EVER BEFORE APPLIED FOR DON'T (If \"Yes\" Print State in which you applied and Date you applied and Social Security Number if known) OR HAD A UNITED STATES SOCIAL SECURITY RAILROAD OR TAX NO KNOW YES ACCOUNT NUMBER? Alatiama May 1976 420-98-7535 YOUR (Number and Street Apt No. P.O. Box, or Rural Route) (City) State) (Zip Code) MAILING ADDRESS 4024 CEDAR GATEROAD HUNTSVILL Alaliama 35810 TODAY'S DATE NOTICE: Whoever with intent to falsify his or someone else's true identity wilfully furnishes or causes to be 12 furnished false information in applying for a social security number, is subject to a fine of not more than $1,000 15 August or imprisonment for up to 1 year. or both TELEPHONE NUMBER 14 Sign YOUR NAME HERE (Do Not Print) 13 (205) 852-5596 RESCREEN ASSIGN DUP Return completed application to nearest Form SS-5 (9-75) ISSUED SOCIAL SECURITY ADMINISTRATION OFFICE"
}