{
  "anumber": "A21431061",
  "id": "A21431061_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21431061_0055/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 Present to Inmigration Official when Interviewed Xua't trinh cho nhan-vien so Di Tru khi dudc phong van This form is to be answered by head of household and other members over 14 years and Phieu nay do chú gia dinh va nhung nguoi trong gia dinh tren 14 tuoi trà loi va chi7 include only those relatives traveling with him. Please answer in English. gôm nhung than nhan cung di ma thôi. Xin tra lói bang tieng Anh. Name BUT QUANG NGA Sex: MALE A 60 HO va ten Nam hoac Nu Date and Place of Birth: 31 December 1915 THANH HOA Ngay va noi sanh Identification Document and No: Can cuoc hoac thông hanh sô' 08695497 21 February 1972 Address in Viet Nam: 14/40cr Ky DONG SAIGON3 VIETNAM Dia chi tai Viet Nam Address in United States 1619 ULUPII PL. KAILUA , HAWAII 96734 Dia chi tai Hoa-Ky Residence last five years: Date From Date To Nói cui trú trong 5 nam sau cung Tu ngay Toi ngay 14/40G KY DONG SAKGN 3 1970 1975 Occupation and position last five years: Nghê nghiêp va chuc vu trong 5 nam sau cung PROFESSER Father : BVI OVANG HOAN Citizenship: VIETNAMESE HO va ten nguoi cha Quoc tich Mother: LE THI NHON Citizenship: VIETNAMESE HO va ten me Quoc tich Spouse: TRAN, THI DANG A FERMALE A 55 HO va ten ngúdi hon phoi Date and Place of Birth: 1920 NAM DINH Ngay va noi sanh Accompanying Family Members: Nhung than quyen mang theo Name Sex Date of Birth Place of Birth A No HO va ten Nam hay nu Ngay sanh Noi sanh SO' A Flight of Arrival on Guam: From Saigon/Clark Chuyen bay toi Guam Tu Saigon/Clark Sponsoring Agency: Co' quan bao tro Did you work for the United States or Viet Nam Government? Ban 8 lam viec cho Chinh Phu Hoa-Ky hoac Viet Nam? Have you lived in the North? If so when did you move South? Ban da tung cu ngu tai Bac Viet chua? Neu CO, ban vao Nam nam nao? Names and Addresses of friends/relatives in the United States: HO va ten va dia chi ban be/than guyen tai Hoa Ky: FOIA (b)(6)"
}