{
  "anumber": "A21432711",
  "id": "A21432711_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21432711_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "The United States of America, 11591673"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1984,
        1915
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "fair"
      },
      "marital_status": {
        "marital_status_llm_v1": "WIDOWED"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1984
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "15433 1/2 Mansel Ave., Lawndale, CA"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "Screened by NARA, 9/22/2023 THE a TO BE FORWARDED TO No. 11591673 IMMIGRATION AND INATURALIZATION SERVICE CATE 1 Pelilion No. 497074 DUPLICATE AlienRegistration no. A21 432 711 Personal description, of holderas of date of naturalization: Date of birth JANUARY 2, 1915 sex FEMALE complexion FAIR colorobeyes BROWN color of hair BLACK height 5 feet 0 inches; weight 100 pounds; visible distinctive marks NONE Maritalstatus WIDOWED Country of former nationality VIETNAM I certify that the description above given is true, and that the photograph, affixed, hereto, is a likeness of me. much the were wringen / Complete and true signature of holder) UNITED STATES OF AMERICA SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States held pursuant to lawal Los Angeles on JUNE 28, 1984 the Court having foundthat MINH THINGOC NGUYEN then residing at 1/2 , 15433 MANSEL AVE., LAWNDALE, CA inlends loreside permanently in the United. States when so required by the Naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled to be admitted socilixenship thereupon ordered that such person be and (s)hewas Teat admitted as a citizen of the United States of America. day of JUNE In destimony whereofthesealof in the the year court of our. is hereunto, Lord, nineken affixed this hundred 28 TH and EIGHTY-FOUR LEONARD A. BROSNAN STATISTICS Clerk of the U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO PRINT OR PHOTOGRAPH THIS CERTIFICATE. By nancy maldonads Deputy Clerk."
}