{
  "anumber": "A21485800",
  "id": "A21485800_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21485800_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Processing Information ( (con't):"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 Part 3. Processing Information (con't): If you entered the U.S. with an Immigrant Visa, also complete the following: Destination in U.S. at time Port of Entry where Admitted of Admission DOES NOT APPLY to U.S. Are you in deportation or exclusion proceedings? No Yes Since you were granted permanent residence, have you ever filed Form I-407, Abandonment by Alien of Status as Lawful Permanent Resident, or otherwise been judged to have abandoned your status? No Yes If you answer \"yes\" to any of the above questions explain in detail on a separate piece of paper Part 4. Signature. (Read the information on penalties in the instructions before completing this section. You must file this application while in the United States.) I certify under penalty of perjury under the laws of the United States of America that this application, and the evidence submitted with it, is all true and correct. I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit I am seeking. Signature Aliejant Date Daytime Phone Number 12-12-94 (914) 496-5325 Please Note: If you do not completely fill out this form, or fail to submit required documents listed in the instructions, you cannot be found eligible for the requested document and this application may to be denied. Part 5. Signature of person preparing form if other than above. (Sign below) I declare that I prepared this application at the request of the above person and it is based on all information of which I have knowledge. Signature Print Your Name Date Daytime Phone Number Firm Name and Address Form I-90 (Rev. 07/28/92)Y *U.S. Government Printing Office: 1992-312-328/64894"
}