{
	"anumber": "A21430343",
	"id": "A21430343_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21430343_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 2023, 1935]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['vietnam', ' retired']"
			},
			"nationality": {
				"nationality_llm_v1": "Vietnam"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "FORM G-325A (REV. 10-1-74) Y Screened by NARA, 7/3/2023 Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. HUYNH BINH FEMALE 9-23-15 rietNAM (If any) 21-430-343 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE CHOLON ViETNAM (If any) 586-40-0428 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER HUGNH TE CHINA DECEASED MOTHER (Maiden name) DO DANG CHINA VIETNAM HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE 5-11 RANG 1910 SAiGON CHIANG VIETNAM 1935 ViEtNAM FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 1414 MAGDALENA ST L.A CA USA 10 77 PRESENT TIME 288 19613 S Narmandal An Cerrity CA USA 5 75 10 77 887 Tran Quy SI Saison Vietzum / 74 4 75 440 Trang Aveing Quan Sangon Vietnam 60 / 74 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 88 7 san Quy ST Sangon Victuan / 14 475 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR NONE PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) VIETNAM THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: sthling 65 69 SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS OTHER (SPECIFY): 4-10-78 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) HuyNH BiNtl A21-430-343 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: (3) C. FORM G-325A"
}
