{
  "anumber": "A21526240",
  "id": "A21526240_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526240_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 526 240"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Bos ton, Mass, File No. A21 526 240 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Govindram Totaram Lathi M 12-22-03 Street 34 Noanett Road 386 Conley PLACE OF BIRTH Address Needham, Mass 02912 objication P cobÀ OI India City, State, Zip PORTERVille CHOLUGA NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) DLW India 12 DETAX MPeu the wnst opidiu Alsa unwper PRIORITY DATE of 201 (b) Imm. Rel. Plock REMARKS we unwpel 12 pazeq ou 20CHOU 305(p)(1)' (s)' (3) OL () OL NONPREFERENCE: Section 212(a) (14) certification not required because: Check ipe Plock Ledalquua ou we forw 02 Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued gate* under the following provision of law: 200HOU get PA OLJEL Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act LOL mas OLICE 12 alleu Private Law no. of the Sec 244( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session pazeq OU op Ma2 accebied p aux KSec 245 of the I & N Act OI. Sec 13 of the Act of 9/11/57 Mas 01. (v) life AC IJOI piw! (3) (Other law Specify) As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE apiliti JU we lucinged go CLB B.O Class of admission (Insert symbol) (Applicable in all cases) ICE OU DATE abbijcallou LOLW 12 OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION U. S. A PROVED INS as nugel SV2' the pe uxeq LOCAL DD 9/16/20 SEP 16 1976 we byould DISTRICT Psuch Karry the SIX FOR USE BY VISA CONTROL OFFICE BOSTON, MASS. cobl 12 Lednifeq to Date COUILO OHICE spall pe biebaleq andificate auq the OL squdy offer CASE2 Lednile IUS LOLLE Foreign State 10 pe ] 181 uesq 14 case? MPGLE belwaueur &Laufeq excebt Preference Category 1112 bnibozal 01 GARLY alleu the adez OL IU live case Number DILECIOL ca26 (11e' spall pe voteq to we gate Month of Issuance STATISTICS mas Le- pecower the cobit 120 spall oue cobl 120 Mpew BLOUP of belwaugui Signed (Visa Office, Dept. of State) nuger of we Act of Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed UOL Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with - -59) Form I - 181 (Rev. 5-1 - - 74) N (Page 1)"
}