{
  "anumber": "A21534625",
  "id": "A21534625_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21534625_0046/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A2 534 625"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Chicago, Illinois File No. A21 534 625 Status as a lawful permanent resident of the United States is accorded: rph 5/21/77 TC 9 (ges) SEX DATE OF BIRTH Name Laxmiben M. PATEL F 6/4/04 Street 4642 North Karlov Avenue PLACE OF BIRTH Address Chicago Illinois au 60630 p1 Bardoli, India City, State, Zip cobl 10 the affolus NATIONALITY PREFERENCE (If any) UOI India COUNTRY TO WHICH CHARGEABLE (If any) we cela DETAI PRIORITY DATE Immediate Relative 201 (b) REMARKS Parent of USC per 12 pazeq ou 305(p)(1)* OI. OL 2echou NONPREFERENCE: Section 212(a)(14) certification not required because: CHeck the Plock Ledalquua ou Individual section 212(a)(14) certification issued Blanket section 212(a) (14) certification issued gate\" under the following provision of law: offet Sec 203(h) of the & N Act Sec 249 of the I & N Act Sec 214 (d) I & N Act mas OUCE Private Law no. of the Sec 244( )( ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session OU p1 aux Sec 245 of the I & N Act OL Sec 13 of the Act of 9/11/57 Ma2 live JUL 11 1977 we UOI abbid plus! (3) (Other law Specify) Chicago, Illinois As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Also CEB IR 0 Class of admission (Insert symbol) (Applicable in all cases) ICG lue DATE STATISTICS OF U.S. APPROVED RECOMMENDED BY: (Immigration Officer) (Date) ACTION the country OFFICEL 02 JUL 11 1977 p facious Bangher 7-11-77 SV2' DD DISTRICT CHICAGO FOR USE BY VISA CONTROL OFFICE au Date COULLO ISSEED IU offer Foreign State BIGCHAS ID ca202 MUSLE belwaueur Million Preference Category of we oder Number LUE HIS' pe OUL lerigeuce Month of Issuance Ca262 CODA MPICI Mas pecower the unwper OUS MPGU Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed UOI Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - - 181 (Rev. 5-1 - - 74) N (Page 1)"
}