{
	"anumber": "A21519707",
	"id": "A21519707_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0032/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1964, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 UNITED STATES DEPARTMENT OF ICE Form approved Immigration and Naturalization Service OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS: FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, HUY T. NGUYEN , residing at 199 N. Pasco Robles An (Name) (Street and number) Anaheim Ca. 92807 USA (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. I was born on 12/7/1944 at Halloi Vist Nam Also, answer either a, b or c, as appro- (Date) (City) (Country) priate, if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization . (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number A FOIA (b)(6) 2. That I am 30 years of age and have resided in the United States since 1964 . 3. That this affidavit is executed in behalf of the following person(s) at present residing at 199 N. Posto Robles Analisism G : NAME SEX AGE COUNTRY OF BIRTH MARRIED OR RELATIONSHIP TO SINGLE DEPONENT NGUYEN Duy QUANG M 60 Viet Nam Married Father KY NGOC LAi F 53 \" Mother FOIA (b)(6) 4. (Amounts shown in answer to this question must be in United States dollars.) (a) That I employed as, engaged in the business of Banking am or with Bauk (Name of of Auerica concern) at 401 N. Harbor, Fullerton and derive a net annual income of $ 15,000 (b) That I have on deposit in savings (Address) banks in this country $ 1500 - . (c) That I have other personal property, the reasonable value of which is $ 10,000 (d) That I have stocks and bonds in the amount of $ 600 , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at Anaheim valued at $ $ 50,000 , with mortgages or other encumbrances there- on amounting to $ 40,000 (f) That I have life insurance in the sum of $ 62,000 , cash surrender value of $ n/a (g) That if self-employed, I attach a copy of my last income tax return or report of commer- cial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) 5. That the following persons are dependent upon me for support: (Place a check in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) WHOLLY NAME OF PERSON PARTIALLY AGE RELATIONSHIP TO ME DEPENDENT DEPENDENT NGUYEN Duy QUANG 60 Father KY NGOC LAi 53 mother FOIA (b)(6) Form 1-134 (Rev. 5-31-72) N"
}
