{
	"anumber": "A21519707",
	"id": "A21519707_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A2 519 707"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1978, 2023, 1915, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Screened by NARA 9/22/2023 Immigration and Naturalization Service 2 MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California File No. A21 519 707 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH M 06/07/1915 Street Quang Duy Nguyen Address PLACE OF BIRTH 199 N. Paseo Robles City, State, Zip Anaheim, California 92807 Ha Dong M Vietnam NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam DETAI NOTICE MPOU opiaiu PRIORITY DATE Immediate Relative REMARKS Section 201 (b) A12C ou 2ection OI. NONPREFERENCE Section 212(a)(14) certification not required because: CERTIFICATION Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) & N Act Private Law no. of the Sec 244() ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session ou Maa Sec 245 of the & N Act Sec 13 of the Act of 9/11/57 JUL'1 1976 Los Angele California we (3) (Other law Specify) As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission. (Insert symbol) IRO (3) JUL (Applicable in all cases) 5/6/76 sbf the ou DATE OF 1978 RECOMMENDED BY: (Immigration Officer) (Date) ACTION office JUL 1 1978 M. DD Comingration Examines DISTRICT FOR USE BY VISA CONTROL OFFICE Date COUILO #7943809 Foreign State CLOSING ACTION REQUIRED IU MUBLE Preference Category Lednjec 1-151 Del 7/1/76 Of SAGLA G188 alleu Pelmseu we ade2 18 so OL 7-13-76-09 Number e-361 (11° Month of Issuance G-153 pecawer cobl I-530 Signed (Visa Office, Dept. of State) UNLUPEL of Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed UOL Form G-153 delivered CC: Visa Control Office, Visa. Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - - 59) Form I - 181 (Rev. 5-1 - - 74) N (Page 1)"
}
