{
	"anumber": "A21526240",
	"id": "A21526240_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526240_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RESULT OF EXAMINATION"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 Driver were RESULT OF EXAMINATION COURT ACTION English: Speaks OK Reads Write OK Classes NO Govt. Date DENIED PROVED ASTR pA beginner TO we guc CIELK ID. G-325B Grounds G-325 N-426 Examiner G-325 Rec. Br. qua of Cont'd come Other SLUGSAL #1 Cont'd G-325C become 10 ips (If Requested) bernoust III the Eligibility 101 (f): OK Action or documents still required: Documents presented: CFEBK OK COOBI or SA CIERK OK DEBOLA MBEW OVER / CW SSI the nazi ney ARC S&R 16th offadavit of support 2. Cx -IRS clearance (10) 3. CF- DO NOT POST AUDIT ph stay you ruc HEIN gust time botte (re) contact rpm am 20651 need application FRE (14) leagy dass cyclobicq mug I USAS atril of spec of the to (ifc your 000 HOLF OL YOUTH) musics gayes exedroy sug PEPPIL (1)) frooq 10 , direction aby the geboing to ipc mg (13) - IPC beyoge pm COURTENTION of any gavet beuog 10 3. Y4 benifor thamper or 01 ou (11) 1201 good micro 10c bour ipc qmc of 1012 Investigation waived. Petitioner under oath approved all statements made at the preliminary investigation. CZ to It Recommendation 04 JUN 1984 Preliminary and Designated Examiner (Date) 2430 occept Continue 19 Recommendation Preliminary Examiner (Date) ISSAN CHILOG 01 girg 01 in pegu rebovatory (LOUR the yunca Owner (a) in Denigon benjaga will 11c nbou busing rus 1046181 brippe name 2015 ou pa Vironso as m culturiso or 112 basis to (R) (R beneiou wing nugst Phone of 1366 Quitog is CONCLUSION or que 21 DENTION mage in journ 25% tps give sug press poco bauging yes construsionar) 10 195 10 am LOL become Lengesics group 01 abones pai piccu nonce 2016 (1) au comproved the numes gives 10 INVOICE an (can HAG Rose beton spre beneficiary (01 sur ( OIL benoos 1999 312(9) serique in IN for VT 10m Term (2) - tp nummy 2006 10 129 pass not mcj (v) Ledical cum in usure pc qualifica 10 (3) MN (s) nas no O& TORISCE BEILLION"
}
