{
	"anumber": "A21526240",
	"id": "A21526240_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526240_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 5-2-82) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 1903, 2023, 1983, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 lettersgy J 2 6/6/84 UNITED STATES DEPARTMENT OF JUSTICE OMB NO. 1115-0009 IMMIGRATION AND NATURALIZATION SERVICE Approval Expires 1/31/84 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION 6-4-84 Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE 83062 (Show the exact spe (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name LATHI TYPE.) 9:00 no AC ration No. A-21- Section of Law 3163 Date: Leave Blank) (1) My full true and correct name is Govindram Totaram JAN 14 1983 (Full true name without abbreviau (2) I now live at 5627 Lexington Ave Apt #6 (Number and street, Hollywood Calif. 90038 Cl. S.A. (City . county, state, zip code) (3) I was born on 12-22-1903 in AMODA, Maharashtra India. (Month) (Day) (Year) 0 (City or town) ( County, province, or state) (Country) (4) I request that my name be changed to None (5) Other names I have used are: Marwadi Gulab Tulsiramnooeh (Include maiden name) Sex Male Female (6) Was your father or mother ever a United States citizen? No Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (9) Can you sign your name in English? Yes No (10) My lawful admission for permagent residence was on Sept 16 1976 under the name of (Month) (Day) (Year) INS at Boskon Mass LATHI, GOVINDRAM TOTARAM City) (State) (11) (a) I have resided continuously in the United States since Oct 11 1975 Month) (Day) (Year) (b) I have resided continuously in the State of California 4 since June 6 1976 (Month) (Day) (c) During the last five years I have been physically in the United States for a total of 60-87 (Year) months. (12) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: (13) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) Nov 1976 PRESENT TIME 5627 Lexington Ave, Apt 6 Hollywood Calif (b) Jun 1976 Nov 1976 386 Conley Porterville Calif (c) Oct 1975 Jun 1976 34 Noanett Rd Needham, Mass (d) 19 1900 oon (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES Sept is 78 Sept.29,78 United Air Lines Shufthansa Los Angeles Calif. Air Lines no Oth (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. None NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES Form N-400 (Rev. 5-2-82) Y FAMILY GROUP (OVER) (1)"
}
