{
	"anumber": "A21557328",
	"id": "A21557328_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21557328_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS FOR AND CERTIFICATION BY the alien beneficiary named on page 1 of this Form, FORM DSP-66"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "INSTRUCTIONS FOR AND CERTIFICATION BY the alien beneficiary named on page 1 of this Form: Read and complete the Certificate, except for Item 6, prior to presentation to a United States consular or immigration official. Complete Item 6 when this fact has been determined in accordance with Part II of this Form, and sign the Certificate upon presentation to the consular or immi- gration official concerned. 1. I understand that the following conditions are applicable to exchange visitors: (a) Extension of Stay and Program Transfers: The initial period of stay in the United States authorized for an exchange visitor may not exceed one year, notwithstanding the fact that a sponsorship beyond that period may be contemplated. The completed Form DSP-66 which is required in order to apply for an extension or transfer may be obtained from or with the assistance of the sponsor. It must be submitted and surrendered to the appropriate office of the Immigration and Naturalization Service within fifteen to thirty days before the expiration of the authorized period of stay. (b) Limitation on Stay: STUDENTS - as long as they pursue a substantial scholastic program leading to recognized degrees or certifi- cates; however, students whom the sponsor recommends for practical training may be permitted to remain for such purpose for an additional period of up to 18 months after receiving their degree or certificate. BUSINESS AND INDUSTRIAL TRAINEES - 18 months. TEACHERS, PROFESSORS, RESEARCH SCHOLARS, and SPECIALISTS 03 years. INTERNATIONAL VISITORS - 1 year. PROFESSIONAL TRAINEES: Graduate Nurses 2 years; Medical Interns and Residents 5 years; Medical Technologists, Medical Record Librarians, Medical Record Technicians, Radiologic Technicians, and Other Participants in Similar Categories - the length of the approved training program plus a maximum of 18 months for practical experience, not exceeding a total of 3 years. (c) Documentation Required for Admission or Readmission as an Exchange Visitor: To be eligible for admission or readmission to the United States, an exchange visitor must present the following at the port of entry: (1) A valid nonimmigrant visa bearing classification J-1, unless éxempt from monimmigrant visa requirements; (2) A passport valid for six months beyond the anticipated period of admission, unless exempt from passport requirements; (3) A properly executed Form DSP-66. Copies one and two of Form DSP-66 must be surrendered to a United States immigration officer upon arrival in the United States. Copy three may be retained for re-entries within a period of previously authorized stay. (d) Change of Status: Exchange visitors are expected to leave the United States upon completing their objective. An exchange visitor who is subject to the two-year né-country physical presence requirement is not eligible to change his status while in the United States to any other nonimmigrant category except, if applicable, that of official or employee of a foreign government (A) or of an international organization (G) or member of the family or attendant of either of these types of officials or employees. (e) Two-Year Home-Country Physical Presence Requirement: Section 212(e) of the Immigration and Nationality Act, as amended, provides as follows: \"No person admitted under section 101(a) (15) (J) or acquiring such status after admission whose (i) participation in the program for which he came to the United States was financed in whole or in part, directly or indirectly, by an agency of the Government of the United States or by the government of the country of his nationality or his last residence, or (ii) who at the time of admission or acquisition of status under section 101(a) (15) (J) was a national or resident of a country which the Secretary of State, pursuant to regulations prescribed by him, had designated as clearly requiring the services of persons engaged in the field of specialized knowledge or skill in which the alien was engaged, shall be eligible to apply for an immigrant visa, or for permanent residence, or for a nonimmigrant visa under section 101(a) (15) (H) or section 101(a) (15) (L) until it is established that such per- son has resided and been physically present in the country of his nationality or his last residence for an aggregate of at least two years following departure from the United States: Provided, That upon the favorable recommendation of the Secretary of State, pursuant to the request of an interested United States Government agency, or of the Commissioner of Immigration and Naturali- zation after he has determined that departure from the United States would impose exceptional hardship upon the alien's spouse or child (if such spouse or child is a citizen of the United States or a lawfully resident alien), or that the alien cannot return to the country of his nationality or last residence because he would be subject to persecution on account of race, religion, or political opinion, the Attorney General may waive the requirement of such two-year foreign residence abroad in the case of any alien whose admission to the United States is found by the Attorney General to be in the public interest; And provided further, That the Attorney General may, upon the favorable recommendation of the Secretary of State, waive such two-year foreign residence requirement in any case in which the foreign country of the alien's nationally or last residence has furnished the Secretary of State a statement in writing that it has no objection to such waiver in the case of such alien.\" 2. I seek to enter into, or remain temporarily in, the United States as an exchange visitor under Section 101(a)(15)(J) of the Immigration and Nationality Act, as amended, for a total maximum stay of (months or years) for the purpose of (state type of degree, certificate, or other objective toward which your program participation will be directed. Doctors of medicine should indicate their medical specialty): and I understand that I shall be permitted to perform only those activities described in Item 2 and 4 on page 1 of this Form. 3. My passport numbered J787344 issued by INDIA (Country) expires on 21-00-1979 (Mo./Day/Yr.) 4. I have have not (check one) been in the United States previously as an exchange visitor. (If you have been in the United States previously as an exchange visitor, show total length of time: and dates: ): 5. (To be completed only if application is being made for extension of stay or Program transfer. Use a continuation sheet if necessary.) I first entered the United States as an exchange visitor, or acquired exchange visitor status, on (Mo./Day/Yr.) and have engaged in the following activities under the sponsorship of respective institutions listed for each activity (include program numbers): 6. I fully understand that I am am not (check one) subject to the two-year home-country physical presence requirement of United States law, quoted in paragraph 1(e) above, by virtue of the determination made in Part II of this or a previous Form DSP-66. If I am subject thereto, I acknowledge my responsibility thereunder. 7. I certify that I have read and understand the foregoing. wommunt (Signature of Applicant) (Place) (Date: Mo., Day, Yr.) FORM DSP-66 Page 2"
}
