{
	"anumber": "A21519707",
	"id": "A21519707_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0038/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Certificate, 11576361"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1915]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "medium"
			},
			"marital_status": {
				"marital_status_llm_v1": "MARRIED"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1983.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "930 S Champlain Circle, Anaheim, CA"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "Screened by NARA, 9/22/2023 CA TO BE FORWARDED TO No. 11576361 IMMIGRATION AND NATURALIZATION SERVICE 0 Pelition No. 483036 DUPLICATE AlienRegistration No A21 519 707 Personal of holderas, of Date of birth BLACK JUNE 7, 1915 MALE seeo ; complexions colorsheyes NONE color of hair height 5 feel inches; weight pounders visible distindive/mark Maritalstatus Country of formernationality VIETNAM I certify that the description, above given is have, and is a likeness ofm / Iuang Duy payer Complete and true signature of holder, UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known that al a termof the District Court of The United States held bursuant to lawal Los Angeles AUGUST 19 933 QUANG DUY NGUYEN the 930 S CHAMPLAIN CIRCLE, ANAHEIM, CA them residing at inlands, loreside permanently in the United. States when sorequired by the naturalizeation Laws of he United States), had in all other prespects, complied with the applicable, provisions, of such naturalizeation laws, and was entilled lobe Seal admilled dociliseenships thereupon ordered that such person be and(s)hewas admilled as acilizen of the United States of America, Intestimony hereunton affixced this 19TH dayof AUGUST in the year of our. Lord/nineteen hundred and EIGHTY-THREE LEONARD A. BROSNAN STATISTICS Glerk of the U. S. District Patredark leyed Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
}
