{
  "anumber": "A21557328",
  "id": "A21557328_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21557328_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS FOR PROGRAM SPONSOR"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS FOR PROGRAM SPONSOR TYPE OF FORM ORIGINAL: Check this box for an individual who is beginning an Exchange Visitor Program and who is not now an Exchange Visitor in this or any other Exchange Visitor Program. EXTENSION: Check this box for an Exchange Visitor who is continuing in the same Exchange Visitor Program. TRANSFER: Check this box for an Exchange Visitor who is transferring from one Program Sponsor to another. Do not use for change of activity or subject under the same Exchange Visitor Program Number. DUPLICATE: Check this box when the form is to be used by the Exchange Visitor's immediate family in order to travel separately from the Visitor. PART I Block 1. Fill in the FAMILY NAME first. Use numerals for the BIRTH DATE, in the order Month, Day, Year, e.g.; 07 22 39. Province, prefecture, township, district, etc., may be used in place of CITY OF BIRTH where local custom or regulation requires, followed by COUNTRY OF BIRTH. LEGAL PERMANENT RESIDENT is a phrase used to distinguish country of intended permanent residence from country of birth and/or citizenship in those few cases where permanent residence and citizenship are different. In most cases, the country of citizenship and the country of permanent residence are the same. Exchange Visitors are subject to the Skills List and two-year foreign residence requirement in the country of permanent residence if that is different from the country of citizenship and/or birth. POSITION IN THAT COUNTRY is the position or location of the Exchange Visitor in the economy/society of his country of permanent residence prior to becoming an Exchange Visitor. U.S. ADDRESS: If the Visitor has a residence address in the U.S., use that address. If not, use the address of the institution where the Visitor will carry out his program or the address of the Program Sponsor. Block 2. Write the PROGRAM SPONSOR'S NAME on the first line. The PROGRAM NUMBER consists of three parts, separated by dashes. The first is either \"G\" or \"P\", followed by a one-digit number, (do not use Roman Numerals) followed by a number from 1 to 4 digits. In the space below enter the entire PROGRAM DESCRIPTION as recorded by the Department of State. This description may be pre-printed or entered with a rubber stamp if all copies are legible. Block 3. Enter the DATES OF THE PROGRAM covered by this DSP-66, (One year maximum) Use numerals for the date as you did for the date of birth. The Immigration & Naturalization Service grants admission into, and extensions of stay in the United States in maximum periods of one year. Exchange Visitors planning programs in excess of one year must apply to the I.N.S. with a new DSP-66 (checked EXTENSION) at the end of the initial authorized period. If this form is a DUPLICATE enter the EXPIRATION DATE which appears on the Exchange Visitor's form I-94. Block 4. Definitions of VISITOR CATEGORIES will be found in Codes For Educational And Cultural Exchange. Below the visitor category enter the SUBJECT/FIELD code which most closely describes the principal activity to be engaged in by the visitor. Finally, describe in your own words the activity which you have coded. Block 5. Indicate the FUNDS to be supplied by the enumerated sources during the period of validity of this form. Consider the organization which gives the funds to the Exchange Visitor asithe source even though that money may have been provided to the giving organization by one or more other organizations. Do not make entries such as \"$450 per month\" - rather calculate out all sums entered. Anyl funds supplied by a program sponsor to its Exchange Visitors should be listed only on the first line, even though the sponsor may belong to one of the categories listed in subsequent lines. Block 6. Do not write in block 6. Block 7. Fill in the name and business address of the OFFICIAL SIGNING THE FORM and the date of execution. That official must be the Responsible Officer or an Alternate Responsible Officer of the program described in block 2 above. PART II Do not write in this space. PART III The Responsible Officer or alternate should fill in this block to indicate approval of a transfer of an Exchange Visitor from his program to the program of another sponsor (i.e.; to another program number). Changes in type of activity of Exchange Visitors within the same program number do not require a new DSP-66. EXCHANGE VISITOR FAMILY MEMBERS: If the Exchange Visitor's immediate family members will accompany him to the United States or if they will remain in the U.S. at the time the Exchange Visitor extends or transfers his program, attach a list (on the Sponsor's letterhead) giving the names, relationships to the Exchange Visitor, and dates and places of birth of the family members. If this form is a DUPLICATE attach a similar list. The codes required to execute the DSP-66 will be found in the publication, Codes for Educational and Cultural Exchange, which can be obtained from the Facilitative Services Staff; Bureau of Educational and Cultural Affairs; Department of State; Washington, D.C. 20520."
}