{
  "anumber": "A21570096",
  "id": "A21570096_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21570096_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DECLARATION, R.P.O./R.B.T."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "R.P.O./R.B.T. DECLARATION (1) Dr Gangadhar Laxman Maddiwar; MD; FRCS. Sponsor's name: Swar-Ganga; (2) Sponsor's address: 56-22;210 th street, Bayside NY 11364. (3) Sponsor's occupation: Practising General Surgeon. (4) Sponsor's earnings: Approximately $ 46,000.00 (To be supported, where necessary, by a certificate of employment indicating emoluments earned). (5) Other evidence of financial standing: (a) I hold $ 23,180.14 Bayside Federal Bank NYC Bank (b) I own property/properties situated at 56;22-210st Bayside NY (To be supported by Bank Pass Book, title deed to property or other evidence of ownership of immovable property in United States). (6) Number, date and office of issue of passport or Identity Certificate of Sponsor: J-563254, Dated May 23;73 at New York city. NY (7) Names, address and relationship of persons in India who are being sponsored: NAME: ADDRESSES: RELATIONSHIP: Post AHIRI (1) Laxman ( alias Lachaiyya) S/O Hanamant Maddiwar Dist Chanda MS. Father (2) Maddakini W/O Laxman Maddiwar Same Mother (3) (4) (8) Relationship with the sponsor of the person (s) whose visit is being sponsored: Parents, ( Father and Mpther) (9) Purpose of visit and duration: Visit USA and Sight seeing, tour. Dr Gangadhar Laxman Maddiwar; MD (10) I, son of hereby solemnly declare that I undertake to bear the cost of passage (s) of the above named person (s) from India to United States in rupees/dollars and to maintain him/her/them during his/her/their stay in United States and to repatriate him/her/them, to India at my cost, if and when necessary; also that in the event of his/her/their dying in this country, I undertake to bear all costs and expenses of his/her/their burial/cremation. Gansadhar Laxman Maddiwar (Signature of Sponsor) BEFORE 9/16/76 ME: ague Sansevereal Sept 15,1976. Date AGNES SANSEVERINO NOTARY PUBLIC, State of New York 30 No.,41-7569375 Qualified in Nassau County Cert. filed with Queens County Clerk Term Expires March 30, 18"
}