{
  "anumber": "A21555065",
  "id": "A21555065_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21555065_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Adjustment of Status,, I-130A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 TO THE SECRETARY OF STATE: AUG 10 1977 REMARKS The petition was filed on The petition is approved for status under PERSONAL INTERVIEW CONDUCTED section: U.S. APPROVED INS. DOCUMENT CHECK ONLY SPOUSE, 201 (b) CHILD 203 (a) (2) DATE 12-19-77 FIELD INVESTIGATION COMPLETED APPROVAL PREVIOUSLY FORWARDED 201 (b) PARENT 203 (a) 203 (a) (1) 203 (5) DISTRICT LOS ANGELES CALIF REMARKS (Continued) A21555065 pending I485 7/25/76 haiting for apperal of I ro For POST AUDIT OR o/N OF PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 20. Check the appropriate box below and furnish the for the box Beneficiary will apply for a visa abroad at the American in COUNTRY) (FOREIGN COUNTRY) see attashed Beneficiary is in the United States and will apply for of status to that of a lawful in the office of the 486 Immigration and Naturalization Service at Los ANGELES RR: A21-555-065. (CITY) (STATE) If the application for denied. the beneficiary will apply for a visa abroad Consulate in (CITY IN COUNTRY) 21. My residence in the United appropriate) (Apt. No.) (Number and Street) (Town city) (State) (ZIP Code) DR. WHITTIER CA 90606 22. My address abroad (if any) is: (Number and street) (Town or city) (Province) (Country) N/A 23. Last address at which and my spouse resided together From (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) 15510 BUDLONG PL #14 GARDENA,C 24. Address in the United States where beneficiary will reside (City) (State) 11768 E. DR. WHITTIER, A 90605 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) 15910 (ZIP Code) HOOVER ST. GARDENA, 90247 26. If this petition is for a child. (a). Is the child married? N/A (b) Is the child your adopted child? so. give the names, dates. and places of birth of all other children adopted by you. If none, so state. 27. If this petition is for a brother or sister, are both your parents the same as the parents? not. statement giving full details as to parentage. dates of marriage of number of of each parent 28. If separate petitions are also being submitted for other relatives. give names each and relationship to petitioner. SATNANT K. NARANG MOTHER (STEP) 29. Have you ever filed a petition for this alien before? No If so. give place and date of and result 30. If beneficiary is in the United States. give the following information Last arrived U.S. (b) Last arrived in as beneficiary's stay expired will (Visitor, alien, stowaway. etc. his Form 1-94 or 1-95 (d) Name and address of present employer Date began this employment N/A"
}