{
	"anumber": "A21555065",
	"id": "A21555065_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21555065_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form 1-465"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Los Angeles, California 90012 FILE NO.: A21 555 065 DIEXM/245 DATE: 7-13-77 vm MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW CONTINUED FOR I-130 Sewa Ram Narang 15910 Hoover Street NOT NONPREF Gardena, Ca 90247 SHOULD BE IR father of u.s.c. INSTRUCTIONS FOR MEDICAL EXAMINATION A medical examination is necessary as part of your application for adjustment of status to permanent 7/20/23 resident. If you have reached your fifteenth birthday you must IMMEDIATELY obtain and bring with you when you appear for your medical examination a serology report and 14\" X 17\" chest X-ray film with a reading by a licensed physician interpreting the X-ray film. The serologic test must be performed by a laboratory approved by a state or local health department. The X-ray film and serologic test for syphilis may not be more than 90 days old. YOUR MEDICAL EXAMINATION CANNOT BE COMPLETED WITHOUT THE (1) SEROLOGIC REPORT, (2) X-RAY AND (3) READING OF THE X-RAY FILM. Please note, also the boxes checked below with regard to your medical examination. Please obtain your seroiogic report, X-ray film and reading promptly. You may telephone your state or local Health Department for the name of an approved laboratory where you may obtain these. Bring them and copies of this letter with you when you appear for examination by a physician of the U.S. Public Health Service for which an appointment has been made at the place and date indi- cated below: ADDRESS: DATE: TIME: XXXX Please communicate immediately with the below listed physician or with one of the physicians on the attached list, if a list is at- tached, (1) to ascertain what arrangements you should make to obtain a serologic report. X-ray film and reading prior to your medical examination, to arrange your and (2) for medical examination by him, which must be completed before Saturday, July 30,197 All expenses in connection with this examination must be paid by you. 2:00 pr PHYSICIAN'S NAME, ADDRESS, AND TELEPHONE NUMBER: SEE ATTACHED LIST Please show this letter to any laboratory performing tests. Also present the copies of this letter to the physician performing the medi- cai examination, and furnish him with your signature written in his presence for inclusion with his report. INSTRUCTIONS FOR IMMIGRATION INTERVIEW AN APPOINTMENT HAS ALSO BEEN MADE FOR AN INTERVIEW BEFORE AN IMMIGRATION OFFICER AT: ADDRESS: 300 North Los Angeles Street DATESATURDAY, July 30, 1977 Los Angeles, Ca TIME: 2:00 pm ROOM 8024 - 8th FLOOR Bring with you at the time of interview the following: 1. The sealed envelope furnished to you by the physician who performed the medical examination. 2: Your passport and Form I-94. Current evidence of support from sponsor. NOTE: IF YOU DO NOT SPEAK ENGLISH, A PERSON OF YOUR OWN SEX WHO CAN ACT AS INTERPRETER SHOULD ACCOMPANY YOU TO THE MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW. FAILURE TO KEEP THESE APPOINTMENTS AND TO BRING THE REQUIRED DOCUMENTS WILL DELAY YOUR CASE. BRING PASSPORT AND I-94 District Director FORM 1-486 (REV. 6-1-73) Y (SPANISH LANGUAGE TRANSLATION OF ABOVE APPEARS ON REVERSE OF THIS PAGE)"
}
