{
	"anumber": "A21526239",
	"id": "A21526239_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526239_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Senater Edward Kennedy, A2 526 240, Aa 526 239"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 Kamille L.Mane, Ph D. 386 conley Porterville, calif. 93257 Senater Edward Kennedy may 19, 1976 Boston, mass. Re; ImmigranT Visa of my parents File A21 526 240 Mr. LATHI Govindram T. A 21 526 239 Mrs. LATHI Ayodhabai G. CurrenT address - C/o Dr. S. G. LATHI 34 Noanett Rd. Needham, mass. 02912 Dear Mr. Kennedy, I petitioned for my parents Immigrant visa on 10-17-75 at Los Angeles, Calif. which was approved en 12-7-75 On 12-12-75 I had not received this notice and requested the LA office to transfer the case to Fresno, Calif. since it is closer to my residence Later in the day I received the approval-notice I was going to Boston on Dec. 14, 75 and since these papers have to be filed within 30 days, when is Boston I contacted your Boston office for the most expeditious way to handle this matter. As suggested by your office, we filed the papers al- the Boston Immigration office on 12-16-75 The immigration office told me they will request the files to be transferred from LA, and all I had to do was file a change of address at the LA office. 9 did accordingly and also wrote on 12.20.76 to transfer the files to Boston. After waiting for 4 months, and a personal visit to the Boston office by my father, we discovered the files were never requested by the Boston office and were still in Calif. On inquiry from the Fresno office on 4.29.76 again on 5.4.76 and through Congressman Krebbs today may 17,76 I was told the files were transferred on 4-29-76"
}
