{
  "anumber": "A21526239",
  "id": "A21526239_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526239_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF APPROVAL OF RELATIVE IMMIGRANT VISA PETITION, A21 526 240"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1330
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE NOTICE OF APPROVAL OF RELATIVE IMMIGRANT VISA PETITION NAME AND ADDRESS OF PETITIONER NAME OF BENEFICIARY A21 526 240 - LATHI, Govindram Totaran A21 526 239 LATHI, Ayodhabai Govindram CLASSIFICATION FILE NO. Kamille Lathi Mane 201-b above 386 Conley DATE PETITION DATE OF APPROVAL FILED Porterville, Ca. 93257 OF PETITION 10-17-75 02-7-75 r petition has been approved and is valid for the duration of your present relationship to the beneficiary. be advised that approval of the petition confers upon the beneficiary an appropriate classification. The approval constitutes no assurance that the beneficiary found eligible for visa issuance, admission to the United States or adjustment to lawful permanent resident status. Eligibility for visa issuance is determined en application therefor is made to a consular officer; eligibility for admission or adjustment is determined only when application therefor is made to an ation officer. Also, please note the items below which are indicatred by \"X\" marks concerning this petition: YOUR PETITION TO CLASSIFY THE BENEFICIARY AS AN IMMEDIATE RELATIVE OF A UNITED STATES CITIZEN HAS BEEN FORWARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION. THE UNITED STATES CONSULATE, WHICH IS UNDER THE SUPERVISION OF THE DEPARTMENT OF STATE. WILL ADVISE THE BENEFICIARY CONCERNING VISA ISSUANCE Inquiry concerning visa issuance should be addressed to the Consul. This Service will be unable to answer any inquiry concerning visa issuance. F YOU BECOME NATURALIZED AS A CITIZEN OF THE UNITED STATES AND AN IMMIGRANT VISA HAS NOT BEEN ISSUED TO THE BENEFICIARY, NOTIFY THIS OFFICE IMMEDIATELY. GIVING THE DATE OF YOUR NATURALIZATION. AT THE SAME TIME, IF THE PETITION WAS IN BEHALF OF YOUR SON OR DAUGHTER ALSO ADVISE WHETHER THAT PERSON IS STILL UNMARRIED. THIS INFORMATION MAY EXPEDITE THE ISSUANCE OF A VISA TO THE BENEFICIARY. YOUR PETITION FOR PREFERENCE CLASSIFICATION AS SHOWN ABOVE. HAS BEEN FORWARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION. THIS SERVICE HAS NOTHING TO DO WITH THE ACTUAL ISSUANCE OF VISAS. VISAS ARE ISSUED ONLY BY UNITED STATES CONSULS WHO ARE UNDER THE JURISDICTION OF THE U.S. DEPARTMENT OF STATE. UNDER THE LAW ONLY A LIMITED NUMBER OF VISAS MAY BE ISSUED BY THAT DEPARTMENT DURING EACH YEAR AND THEY MUST BE ISSUED STRICTLY IN THE CHRONOLOGICAL ORDER IN WHICH PETITIONS WERE FILED FOR THE SAME CLASSIFICATION. WHEN THE BENEFICIARY'S TURN IS REACHED ON THE VISA WAITING LIST. THE UNITED STATES CONSUL WILL INFORM HIM AND CONSIDER ISSUANCE OF THE VISA. Inquiry concerning visa issuance should be addressed to the Consul. This Service will be unable to answer any inquiry concerning visa issuance. THE APPROVAL OF THE PETITION IS CONDITIONED UPON THE BENEFICIARY BEING ACCOMPANIED TO THE UNITED STATES BY THE PARENT OR SPOUSE THROUGH WHOM IT IS CLAIMED THE BENEFICIARY IS CHARGEABLE TO A COUNTRY IN THE EASTERN HEMISPHERE OR A DEPENDENT AREA AND. IF SUCH PARENT OR SPOUSE IS NOT A LAWFUL PERMANENT RESIDENT ALIEN, UPON THE ISSUANCE OF AN IMMIGRANT VISA TO SUCH PARENT OR SPOUSE PURSUANT TO APPLICATION FOR SUCH VISA MADE SIMULTANEOUSLY WITH THE BENEFICIARY THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAWFUL PERMANENT RESIDENT. THE ENCLOSED APPLICATION FOR THIS PURPOSE (FORM I-485) SHOULD BE COMPLETED AND SUBMITTED BY THE BENEFICIARY WITHIN 30 DAYS IN ACCORDANCE WITH THE INSTRUCTIONS CONTAINED THEREIN. (IF THE BENEFICIARY HAD PREVIOUSLY SUBMITTED FORM I-485 WHICH WAS RETURNED TO HIM, HE SHOULD RESUBMIT THAT FORM WITHIN 30 DAYS.) THE BENEFICIARY WILL BE INFORMED OF THE DECISION MADE ON HIS PENDING APPLICATION TO BECOME A LAWFUL PERMANENT RESIDENT (FORM I-485). THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAWFUL PERMANENT RESIDENT. HOWEVER, AN IMMIGRANT VISA NUMBER IS NOT PRESENTLY AVAILABLE, THEREFORE, THE BENEFICIARY MAY NOT APPLY TO BECOME A PERMANENT RESIDENT. SINCE THE BENEFICIARY IS A NATIVE OF THE WESTERN HEMISPHERE, HE IS INELIGIBLE TO BECOME A LAWFUL PERMANENT RESIDENT OTHER THAN BY DEPARTING FROM THE UNITED STATES AND REENTERING IN POSSESSION OF AN IMMIGRANT VISA ISSUED BY AN AMERICAN CONSUL. DOCUMENTS WHICH YOU SUBMITTED IN SUPPORT OF YOUR PETITION HAVE SERVED OUR PURPOSE AND ARE RETURNED. REMARKS Documents in support filed with A21 526 240 only. VERY TRULY YOURS, 1330 DEC 07 1975 J. SURECK, DISTRICT DIRECTOR 71 74)Y I certify this to be a true and correct copy of original document with which it was compared by as BOSTON, MASS this date 12/16/73 Kill"
}