{
	"anumber": "A21526240",
	"id": "A21526240_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526240_0039/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325A ( (REV. 8-27-72IN)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1919, 1975, 1903, 1970, 1972, 2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['retired']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "Indian"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 FORM G-325A (REV. 8-27-72)N Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. LATHI GOVINDRAM TOTARAM FEMALE 12-22-1903 Indian (If any) 421526240 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Marwadi Gulab Tulsiram Amoda, INDIA (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE LATHI Totaram Dhanji India Deceased FATHER MOTHER(Maiden name) - INDANI Ramabai India Deceased HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE LADHE Bhaga Gopaldas Bhaga 7-18-1907 Varadsim, India 1919 Varadsim, India FORMER HUSBANDS OR WIVES(if none, so state) None FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 34 Noanett Rd, Needham Mass, USA OCT 11 75 1975 PRESENT TIME B6 ishwardas mansion, Nana'sCharkBombay Maharastra India Oct 30 1972 Octil 1975 220 Randolph Drive Bangor Maine USA July I 1972 Oct28 1972 B.G Ishwardas mansion, Nanas Chawk, Bombay India June 30 1970 June30 1972 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR Retired None PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE INATURALIZATION ADJUSTMENT OF STATUS Govindram Totaram Lathi 12-15-75 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES : SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
