{
  "anumber": "A21555065",
  "id": "A21555065_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21555065_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1899,
        2023,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 Bus (8-40) Phone 213-480-6313 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service mr Narang (Sin) File No: Date: 3/7/77 Wishes to know status. Filed non-Pry no - change in address Your assistance in furnishing additional identifying information is requested so that we may act upon or reply to your communication. Please fill in the necessary information and return this letter and any attached material to this office. ob octeigeR) Any Other File Your \"A-\" (Alien Registration) No. No., if Known Your Full Name SEWA RAM NARANG Complete Present Address 15910 HOOVER ST. GARDENA CA. 90247 Address in U.S. at Time of Entry \"same.\" Birthdate 11-5-1899 Birthplace campbell Pur, Pakistan (INDIA) Date of Entry 10-4-1975 Place of Entry Los Angeles CA. Airline and Flight Number or Vessel of Arrival B.O. A.C. 599 Type of Entry (Temporary Visitor, Student, Permanent Residence Visa, Reentry Permit, etc.) VISITOR Destination in U.S. Shown Entry Document Los Angeles as on Name Used at Time of Arrival SEWA RAM NARANG Other Names Used at Any Time \"None\" # 524 date 2/4/76 d for 50 00 For two Applications) 2000 Please fill in the following if an application or previous correspondence concerning this matter was forwarded to this Service: Type of Application: I-485 Date of Application or Correspondence: 2/4/76 Your address as shown on application or Address of Service office where Los Wack in in application or correspondence was forwarded Form G-14 (Rev. 4-7-72)N (copy of the check attached) notesssili"
}