{
  "anumber": "A21534625",
  "id": "A21534625_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21534625_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 3. Processing Information., I-485 ( (Rev. 09-09-92) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by 8/1 1/2023 Part 3. Processing Information. A. City/Town/Village of birth NADNDA, BARDOLI, INDIA Current occupation HOUSE MOTHER Your mother's first name BENABEN Your father's first name LALLUBHAI Give your name exactly how it appears on your Arrival /Departure Record (Form I-94) PATEZ LAXMIBEN MAGANLAL Place of last entry into the U.S. (City/State) In what status did you last enter? (Visitor, Student, exchange S.F. calif. alien, crewman, temporary worker, without inspection, etc.) Were you inspected by a U.S. Immigration Officer? Yes No visitor Nonimmigrant Visa Number 104008 Consulate where Visa was issued BOMBAY INDIA Date Visa was Issued 11/5/86 Sex: Male Female Marital Status: Married Single Divorced Widowed (month/day/year) Have you ever before applied for permanent resident status in the U.S? No Yes (give date and place of filing and final disposition): A21-534-625 B. List your present husband/wife, all of your sons and daughters (if you have none, write \"none\". If additional space is needed, use separate paper). Family Given Middle Name PATEL Name SOMIBEN Initial M. (month/day/year) Date of Birth July 10, I Country of birth A Relationship SHANTABEN Applying with you? # DAUGHTER co. Yes No Family Given Middle Name PATEL Name SHANTABEN Initial M. Date of Birth 23 Nov. 30 (month/day/year) Country of birth A Relationship Applying with you? DAUSHTER # Yes No Family Given Middle Name PATEL Name PARNATIBEN Initial M. Date of Birth 31 21 July 32 (month/day/year) Country of birth A Relationship Applying with you? DAUGHTER # Yes No Family Given Middle Name PATEL Name NATHUBHAI Initial M Date of Birth 22nd August37 (month/day/year) Country of birth A Relationship Applying with you? son # Yes No Family Given Middle Name PATEL Name RAMANLAL Date of Birth 14th out. 44 Initial M. (month/day/year) Country of birth PATEL Ishwan Relationship / 02/03/41 usc son Applying with you? Yes No C. List your present and past membership in or affiliation with every political organization, association, fund, foundation, party, club, society, or similar group in the United States or in any other place since your 16th birthday. Include any foreign military service in this part. If none, write \"none\". Include the name of organization, location, dates of membership from and to, and the nature of the organization. If additional space is needed, use separate paper. NONE Form I-485 (Rev. 09-09-92) N Continued On Next Page"
}