{
	"anumber": "A21519707",
	"id": "A21519707_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0049/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR A SOCIAL SECURITY NUMBER, 12-73"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 ID CN DO APPLICATION FOR A SOCIAL SEC TY NUMBER IT WRITE IN THE ABOVE SPACE See Instructions on Back.- Print in .K or Dark Blue Ink or Use Typewriter. Print FULL NAME (First Name) (Middle Name or Initial - if none, draw line__) (Last Name) 1 YOU WILL USE IN WORK OR BUSINESS QUANG DUY NGUYEN Print FULL YOUR (Month) (Day) (Year) 2 NAME GIVEN same as above 6 DATE OF YOU AT BIRTH BIRTH 06 07 15 PLACE (City) (County if known) (State) YOUR PRESENT AGE 3 OF BIRTH VietNam 7 (Age on last birthday) HA DONG 59 MOTHER'S FULL NAME AT HER BIRTH (Her maiden name) YOUR SEX 4 8 MALE FEMALE LE XUYEN FATHER'S FULL NAME (Regardless of whether living or dead) YOUR COLOR OR RACE 5 NGUYEN Duy TIEN 9 WHITE NEGRO OTHER HAVE YOU EVER BEFORE APPLIED DON'T (If \"YES\" Print STATE in which you applied and DATE you applied and SOCIAL SECURITY NUMBER if known 10 FOR OR HAD A SOCIAL SECURITY, NO KNOW YES RAILROAD, OR TAX ACCOUNT NUMBER? YOUR (Number and Street, Apt. No., P.O. Box, or Rural Route) (City) (State) (Zip Code) 11 MAILING ADDRESS 199 N Paseo Robles Anaheim Ca 92807 TODAY'S DATE NOTICE: Whoever, with intent to falsify his or someone else's true identity, willfully furnishes or causes to be 12 5/15/75 furnished false information in applying for a social security number, is subject to o fine of not more than $1,000 or impri sonment for up to 1 year, or both. TELEPHONE NUMBER 14 Sign YOUR NAME HERE (Do Not Print) 13 9986746 TREASURY DEPARTMENT Internal Revenue x Service RESCREEN way ASSIGN DUP ISSUED Return completed application to nearest SOCIAL SECURITY ADMINISTRATION OFFICE FORM SS-5 (2.73)"
}
