{
	"anumber": "A21557567",
	"id": "A21557567_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21557567_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to United States Department of Justice Immigration and Naturalization Service for Alien Relative's Immigrant Visa, Form 1-30"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1979, 1971, 1910, 1938, 1924, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPA TMENTO JUSTICE Form Approved Immigration and Naturalization Service OMB NO. 43- RO 401 PETITION TO Fee Stamp PLEASE NOTE CLASSIFY STATUS OF YOU ARE THE PETITIONER ALIEN RELATIVE FOR AND YOUR RELATIVE REC'D T/C DEC 01 ISSUANCE OF IS THE IMMIGRANT VISA BENEFICIARY 1 Name of beneficiary (Last. in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Names. birthdates and countries of birth of PATEL MANIBHAI SHIVABHAI beneficiary's children: 4. Other names used: (including maiden name if married) #/ ANUPAM M. PATEL, JLINE 11 1946 MONE #2 INDIA 5. Country of beneficiary s birth 6. Date of beneficiary's birth (Month, day. year) DR. APARNA S. SHAH A4G. 131948 INDIA AUGUST 25 1910 INDIA 7. My name is: (Last, in CAPS) (First) (Middle) 8. My phone number is: BOTA CHILDREN ARE PERMANENT PATEL PARIMAL MANIBHAI (213) 848-0678 RESIDENT OF THE UNITED STATES 9. Other names used (including maiden name if married woman) 10. Relationshipsof beneficiary to myself NONE FATHER 11. I was born: (Month) (Day) (Year) in: (Town or city) (State OD Province) (Country) SEPT. 26-1938 NAR (GUJARAT) INDIA 12 If you are a citizen of the United States. give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. naturalization: 8-22-1971, (2)H acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? the th rough parents throug naturalization through marriage (1) If acquired through naturalization, give name nder which naturalized num ber of naturalizati on certificate, and date and place # 9315/37 of ANGELES (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in a cordance with struction B a (2) 79 13. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A- of 14. Beneficiary's marital status 15. Name of beneficiary's spouse. if married. and date and country of birth (Omit this item if petition is for your spouse) Married Widowed Divorced Single MRS. CHAMPA MANIBHAI PATEL AUGUST 19, 1924 INDIA 16. Full address of beneficiary's spouse and children. if any (Omit this item if petition is for your spouse) CHILD #1 312 E. CEDAR AVE. K SPOUSE : 4290 HALUPA ST. HONOLULU, HAWAII CHILD # 2 SAME As ABOVE BURBANK, CALIF.91502 17. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage Names of my prior spouses Names of beneficiary's prior spouses 18. Has this beneficiary ever been in the U. S.? YES NO 19. Are beneficiary and petitioner related by adoption? YES NO (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct Signature of petitioner (See Instruction No. 5) Rormal T7 M. latel Subscribed and before th swom day of A.D. 19 at Las lengoles Count OFFICIAL SEAL (SEAL) My commission expires were Frances E. Takahashi 9,1979 OF OFFICER Frances ADMINISTERING OATH) Takehaski NotaryQuotec (TITLE) (SIGNATURE NOTARY PUBLIC CALIFORNIA PRINCIPAL OFFICESIONATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER LOS ANGELES COUNTY I My Commission Expires dune p1070 ed by me at the request of the petitioner and is based on all information of which 1 have any knowledge. (SIGNATURE) (ADDRESS) FEB (DATE) FORM 1-130 RECEIVED TRANS. IN NET'D TRANS. OUT COMPLETED (REV. 1-1-77) N RECD 1/U FEB 1978 1978 1978"
}
