{
  "anumber": "A21519707",
  "id": "A21519707_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title of the image, Screened by NARA, 9/22/2023, Form number, NARA Form Number (145678"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1943,
        2023,
        1922,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 (3) (31) If serving or ever served in the Armed Forces of the United States, give branch NA ; from 19 to 19 and from 19 to 19 inducted or enlisted at ; Service No. ; type of discharge ; ; rank at discharge. ; (Honorable, Dishonorable, etc.) reason for discharge (alienage, conscientious objector, other) Reserve or National Guard from 19 to (32) My occupation is LAB TECHNICIAN List the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM To. EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) OCTOBER 6 1975 PRESENT TIME ICN Co 2727 CAMPUS Dr. LAB TECHNICIAN (b) 19 19 IRVINE, CA (c) 19 19 (d) 19 19 (33) Complete this block if you are or have been married. I am MARRIED The first name of my husband or wife is (was) LAI (Single, married, divorced, widowed) We were married on DECEMBER 24 1943 at HANOI, VIET NAM He or she was born at VINH, VIETNAH on JANUARY 16, 1922 He or she entered the United States at (place) EL JORO AIR BASE CALIFORNIA on (date) MAY 5, 1975 for permanent residence and now resides with me apart from me at NA (Show full address if not living with you.) He or she was naturalized on NA at ; Certificate No. NA or became a citizen by NA His or her Alien Registration No. is A21 418 726 (34) How many times have you been married? ONE How many times has your husband or wife been married? ONE If either of you has been married more than once, fill in the following information for each previous marriage (Check One) DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS How MARRIAGE CITIZEN ALIEN ENDED (a) NA N.A. NA NA NA NA (b) (c) (d) (35) I have Five children (Complete columns (a) to (h) as to each child. If child lives with you, state \"with me\" in column (h), other- Ox Number) wise give city and State of child's residence.) (a) Given Names (b) Sex (c) Place Born (d) Date (e) Date Born of Entry (f) Port of Entry (g) Alien (Country) Registration No. (h) Now Living at- 1/ NGUYEN Huy TRIEU M VIET NAM Den7,44 1964 L.A. Airport American PLACENTIA CA citizen 2/ QUYNH DEAN F VIET NAM Ap.22,46 1965 L. A. Anput American MONT CLAIR, CA citizen 3/ NGUYEN HOA THUY F VIET-NAR Octob 7,47 N.A N A. Canadian MONTREAL P.Q. citizen CANADA 4, FOIA (b)(6) (36) READ INSTRUCTION NO. 6 BEFORE ANSWERING QUESTION (36) C.A. I so not want certificates of citizenship for those of my children who are in the U.S. and are under age 18 years that are named below. (Do) (Do Not) (Enclose $15 for each child for whom you want certificates, otherwise, send no money with this application.) (Write names of children under age 18 years and who are in the U.S. for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages NA"
}