{
	"anumber": "A21555065",
	"id": "A21555065_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21555065_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A2 555 065"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1899, 1977, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 2 MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California File No. A21 555 065 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Street Sewa Ram Narang Male 11/5/1899 Address 15910 Hoover Street PLACE OF BIRTH City, State, Zip Gardena, California 90247 Pakistan NATIONALITY abbucanou COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India PRIORITY DATE Immediate Relative REMARKS NONPREFERENCE: Section 212(a)(14) certification not required because: abbiobuale ca26 Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act owe ponap pecower Private Law no. of the Sec 244( )( ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) As of DEC 28 1977 LOS Mas at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE IRO(3) MUSIC Class of admission (Insert symbol) U.S. APPROVED DATE abbucaus 12/19/77 sbf OF 28 DEC 1977 RECOMMENDED BY: (Immigration Officer) (Date) ACTION DEC 28 1977 DD H. D. BARNETTE Joseph Sureek IMMIGRATION EXAMINER DISTRICT FOR USE BY VISA CONTROL OFFICE Date G-188 2/7/78 Foreign State G-36/ OPEN C0262 MUGLE Preference Category Number Month of Issuance DEC 28 1977 Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. 10461499 mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}
