{
  "anumber": "A21557328",
  "id": "A21557328_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21557328_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF ELIGIBILITY FOR EXCHANGE VISITOR (J-1) STATUS"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTMENT OF STATE Form Approved BUREAU OF EDUCATIONAL AND CULTURAL AFFAIRS OMB No. 47-R0144 CERTIFICATE OF ELIGIBILITY FOR EXCHANGE VISITOR (J 1) STATUS PART IT IS HEREBY CERTIFIED THAT: THIS FORM IS A (AN) 1. SWAMINATHAN R V ) Male; ( ) Female ) ORIGINAL (Family Name of Exchange Visitor) (First Name) (Middle Name) ( ) EXTENSION OF PROGRAM born 8 in Paganera India ( ) TRANSFER OF PROGRAM (Mo.) (Day) (Yr.) (City) (Country) FILE FREE ert ( ) DUPLICATE FOR EXCHANGE a legal permanent resident of India IN whose position in VISITOR'S FAMILY (Country) (Code) that country is Member of Parliament 116 and whose U.S. address is or will be (Pos Code) c/o Visitor Service Program, 1776 Massachusetts Ave. N.W., Washington, D.C. 20036 2. will be sponsored by Department of State, Washington, D.C. 20520 to participate in Exchange Visitor Program No. 1 14 which is still valid and is officially described as follows: A program of the United States Department of State, Bureau of Educational and Cultural Affairs, to bring to the United States for a period of travel, observation of American institutions consultation with colleagues, practical professional training and experience, or a combination thereof, foreign nationals TLE nominated by American Foreign Service posts or United States odw Educational Foundations or Commissions abroad to promote the general interests of international.exchange. 3. This form covers the period from 10 7 75 J to 11, 20 75 (one year maximum.) (Mo.) (Day) (Yr.) (Mo.) (Day) (Yr.) If this form is a duplicate, the expiration date on the exchange visitor's 1-94 is 4. The category of this visitor is: ( ) Student, ( Trainee, ( ) Teacher, ( ) Professor, ( ) Research Scholar or Specialist, ) International Visitor, ( ) Professional Trainee, and the specific educational field or non-study activity to be engaged in is Code No. 6000 verbally described as follows: Mr. Swaminathan will observe the American (Subj/ F1d Code) agricultural and political scene and confer with colleagues. 5. During the period of validity of this form, the following estimated financial support will be provided to this Exchange Visitor by: X) The Program Sponsor in item 2 above $ 1000 Financial support from organizations other than the sponsor will be provided by one or more of the following: ( ) U.S. Government Agency(ies): (Agency Code), $ ; (Agency Code), $ ( International Organization(s): (Int. Org. Code), $ ; (Int. Org. Code), $ ( ) The Exchange Visitor's Government $ . (If necessary, use above spaces ( ) The Binational Commission of the visitor's Country $ for funding by multiple U.S. . Oil Agencies or Intl. Organizations) ( ) All other organizations providing support $ (X) Personal funds S PE1 $ 1300 6. I.N.S USE NOV 91975 7. James R. Roach Counselor for Cultural Affairs (Name of Official Preparing Form) (Title) J-1 ADMITTED American Embassy, New Delhi (CLASS) UNTIL nov-20.1975 Dames (Signature (Address) R/Ceacher 9/12/75 of Official) (Date) PART 11 - ENDORSEMENT OF CONSULAR OR IMMIG RATION PART 111 - STATEMENT OF RESPONSIBLE OFFICER FOR OFFICER REGARDING SECTION 212( OF THE I.N.A. RELEASING SPONSOR (FOR TRANSFER OF PROGRAM) I, Date Transfer of this exchange visitor from (Name) program No. sponsored by (Title) have determined that this alien in the above program to the program specified in item (2.) is necessary or highly desirable and ( is not subject to the two year residence requirement; is in conformity with the objectives of the Mutual Educational and is subject, based on Government financing; Cultural Exchange Act of 1961. Exchange Visitor Skills List. (Signature of Official) 9/12/95 bas even (Date) (Signature of Official (Title) FORM DSP-66 Page 1 1-73 Copy 1 For Immigration & Naturalization Service"
}