{
  "anumber": "A21557567",
  "id": "A21557567_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21557567_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "HINDIA, 3RS50nP"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1911,
        1942,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "3R$50nP PINDIAS LEARS GREENER STARY NOTARIAL STARY I, Mr. Mulshanker Someshwar Joshi, Principal, H.V. Shroff Memorial High School, Baroda, India residing at 'Shivjyoti', 17. Arunodaya Society, Baroda-5, born on 4th day of the November in the year One thousand Nine hundred eleven (4-11-1911) at Surasamal in India, hereby affirm on oath that Dr.Manibhai S.Patel has been intimately known to me as a former colleague and later as a friend since 1932, that his first wife Mrs. Kamalaben M.Patel died on April 28, 1942 and that he got married to his present wife, Mrs. Champaben M. Patel, on December 14, 1942. I make this statement from my personal experience based on the fact that I attended the funeral and cremation of Mrs. Kamalaben M.Patel and the wedding ceremony of Dr. Manibhai Batel to Mrs Champaben M.Patel. PARODA BROACH I also personally know and solemnly affirm that the said Minishai S.Patel a son named Parimal by his Sinch WAFE PANONMAHAI DISTRISTS OF Kamallaben, and another son named Anupam and a daughter named AUJARAT STATE Aparna by his present wife, Champaben. Bas NO A . (MULSHANKER Si JOSHI) Subscribed and swown 'affirmed) before ethis 29th day of December, A.D. 1971 at BARODA, India. Solemnly farmed before me by sun Mulshanica as Someshura rosh indenitived by Automatic whom 1 personally know. Dt. 29-12-71 NOTARY 29-12-71-"
}