{
	"anumber": "A21534625",
	"id": "A21534625_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21534625_0039/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 8/11/2023"
		},
		"years": {
			"ms_years_nlp_v1": [1932, 1937, 1976, 1944, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "2. Cont:- village Dhamdod Lumbha, Taluka Bardoli, District Surat on 23-11-1930 ( 23rd November 1930 ). 3. Mrs. PARVATIBEN. : Mrs. Parvatiben daughter of Maganlal Dhanabhai Patel and wife of Mr. Bhulabhai Maganbhai Patel was born at village Dhamdod Lumbha, Taluka Bardoli, District Surat on 31-7-1932 ( 31st July 1932 ). 4. Mr. NATHUBHAI. : Mr, NATHUBHAI son of Maganlal Dhanabhai Patel was born at village Dhamdod Lumbha, Taluka Bardoli, District Surat on 22-8-1937 ( 22nd August 1937 ) 5. Mr. RAMANLAL. : Mr. RAMANLAL son of Maganlal Dhanabhai Patel was born at village Dhamdod Lumbha, Taluka Bardoli, District Surat on 14-10-1944 ( 14th October 1944 ). 6. Mr. ISHWARLAL. : Mr. ISHWARLAL son of Maganlal Dhanabhai Patel is a CITIZEN of United States of America and is at present residing at 4642 N. Karlov Ave., Chicago, Ill. 60630, United States of America. That Mrs. SOMIBEN, Mrs. SHANTABEN, Mrs. PARVATIBEN are bread blood sisters and Mr. NATHUBHAI and Mr. RAMANLAL are the blood brothers of Mr. ISHWARLAL MAGANLAL PATEL resident of 4642 N.Karlov Ave., Chicago, Ill. 60630, United States of America; boxx BORN of the same father Mr. Maganlal Dhanabhai Patel and of mother Mrs. Laxmiben daughter of Lallubhai Nathabhai Patel. That as we are the friend of the above family and of the same caste and village, we know the above facts very well. That the above stated facts ae true and correct to the best of ourk knowledge and belief. That we also know to make a false affidavit is a criminal offence. Place: BARDOLI, District Surat. Dated:- 16 th July 1976 B.B. josen (1) sisginizines me Identified by O-14. The (2) Signatures Solemnly affirmed and signed before me by Mr. Dahyabhai Lallubhai Patel and Mr. Naro tambhai Bhagabhai Patel both resident of village Dhamdod Lumbha, Taluka Bardoli, District Surat who were identified to me by Mr. B.B. Joshi of Navsard to whom I know personally. MAGNET us BARDOLI, District Surat. EXECUTIVE MAGISTRATE, Dated: 16th July 1976. BARDOLI, District Surat. correct and satirus compared 4.9-81 returned"
}
