{
  "anumber": "A21556137",
  "id": "A21556137_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21556137_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 556 137"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California File No. A21 556 137 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street Santosh Kumar Kamboj Male 11/22/04 Address 12950 Maclay Street PLACE OF BIRTH City, State, Zip Sylmare, California 91342 India NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India PRIORITY DATE Immediate Relative REMARKS NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) As of at LOS (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission. (Insert symbol) IRO(3) (Applicable in all cases) 4/1/77 sbf DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION DD DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - 181 (Rev. 5 - 1 - 74) N PAGE 2"
}