{
  "anumber": "A21519707",
  "id": "A21519707_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 11-1-80)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1981,
        2023,
        1976,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 UNITED STATES DEPARTMENT OF JUSTICE Form Approved IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-R0079 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION 7.13-83 Mail or take to: JUL 141981 9:00 IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR Name NGUYEN, QUANG Duy TYPE.) No. A21 519 707 Section of Law 31((a) Date: July 6, 1981 (Leave Blank) (1) My full true and correct name is NGUYEN, QUANG Duy Full true name without abbreviations) (2) I now live at 930 So CHAMPLAIN CIRCLE (Number and street, ) ANAHEIM, ORANGE COUNTY CALIFORNIA 92807 (City county, state, zip code) (3) I was born on JUNE 7 1915 in HA_DONG VIET NAM (Month) (Day) (Year) (City or town) ( County, province, or state) (Country) (4) I request that my name be changed to NONE (5) Other names I have used are: NONE (Include maiden name) Sex: Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (9) Can you sign your name in English? Yes No JULY ist (10) My lawful admission for permanent residence was on 1976 under the name of (Month) (Day) Year) NGUYEN, QUAN G Duy DUY at LOS ANGELES CALIFORNIA (City) (State) (11) Since that date I have resided continuously in the United States and continuously in the State of CALIFORNIA where Lnow live since MAY 7, 1975 During the last five years I have been physically present in the United States for a total of 60 months. (12) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: 050ml 11 days (13) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) APRIL, 19.76 PRESENT TIME 930 to CHAMPLAIN CIRCLE ANAHAIR, CALL FORNIA (b) MAY, 7 1975 APRIL 5, 19.7.6 1101 PASEO ROBLES ANAHEIR, CALL FORNIA (c) 19 19 (d) ,19 19 (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? 3. times Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS but DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH YOU UNITED STATES RETURNED TO THE UNITED STATES 8 12 77 8-26-77 AIR CANADA Los ANGELES AIRPORT 7.6.78 7-20-78 AIR CANADA mid. 10-4-80 10-17-80 AIR CANADA Lid (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? NONE Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES NA N.A N.A 3 nony N.A. Form N-400 (Rev. 11-1-80)N (OVER) (1)"
}