{
  "anumber": "A21570096",
  "id": "A21570096_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21570096_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Migration and Naturalization Service, Form I-72 (SINGLE COPY"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE MIGRATION AND NATURAL ZATION SET was U. S. COURTHOUSE BLDG. LOUISVILLE, KENTUCKY 40202 NAME OF BENEFICIARY MADDIWAR, Laxman H. NAME AND ADDRESS OF APPLICANT/PETITIONER MADDIWAR Mandakini Laxman Gangadhar Laxman Maddiwar Box 768 DATE Martin, Kentucky 41649 3-28-78 FILE NO. A21 570 096 A21 570 097 PLEASE NOTE OR COMPLY WITH THE BELOW CHECKED INSTRUCTIONS. 1. The above applicatios/patition and its supporting documents are attached. 2 The above application/potition and its supporting documents have been forwarded to your attorney or representative. 3. Please complete the blocks on your enclosed application/petition which are checked in red. 4. Furnish the required fee of $ S. Furnish the birth or baptismal certificate of 6. Furnish the marriage certificate of 7. Furnish proof of death or legal termination of marriage of &. All foreign language documents must be accompanied by English translations thereof, including certification as to accuracy of translation and competency of translator. 9. Furnish the date and port of each of your entries into the United States and the name of the ship, plane, or other vehicle on which you traveled. 10. Accashed are Department of Labor Forms and instructions, Please comply and recurs your petition or application to us wish the proper attachments. 11. You have indicated that you do not intend to seek employment. You must furnish evidence that you have suffi- cient funds or other means of maintaining yourself in this country. 12. Furnish two photographs, 11/2 1 1/2 with distance from top of head to point of chin 11/\" Machine-made photos not acceptable. 13. It will be necessary for blood tests to be made of the following person(s) to help establish relationship, The person(s) being tested must follow the instructions contained on the attached Forms G-620. It is to be understood that the government is to incur no liability in connection with the tests and expenses thereof must be paid by you. 14. You may now apply for adjustment of status for yourself and the below listed persons on the attached forms. 15. Your proof of status document has been checked and is attached, Your application/petision is being processed and will be completed in the near future, 16. There appears to be a discrepancy in the names of the beneficiaries on the returned petitions and the names on the supporting documents. Your school record, which you have used as a record of birth does not appear to have your mother's name on it at all. There must be a birth record or supporting affidavits which show who your mother is and the record of marriage of your mother and father. Seperate documents must accompany each petition. Form 1-72 (SINGLE COPY) PLEASE RETURN THIS LETTER AND ALL ATTACHMENTS WITH (Rev.3-24-77)N YOUR RESPONSE"
}