{
  "anumber": "A21526240",
  "id": "A21526240_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526240_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2017,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA7731/2023 MOITASIIASUTAN MOITIT39 sorraus 10 B.U MOTTASLEASUYAM GMA OATH OF ALLEGIANCE I HEREBY DECLARE, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and the laws of the United States of America against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will perform noncombatant service in the Armed Forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely without any mental reservation or purpose of evasion: SO HELP ME GOD. In acknowledgement whereof I have hereunto affixed my signature. bas moilorgimmi IHTAJ has our Jun vM (1) location GOOW Y (Signature of Petitioner) sonsbiron to soalq 1052910 YM (5) inkos (ii) ban NOTE-In renunciation of title or order of nobility, add the following to the oath of allegiance before it is signed: \"I further renounce the title of (give title or titles) which I have heretofore held,\" or \"I further renounce the order of nobility (give the order of nobility) to which I have heretofore belonged.\" Petition granted and Certificate No. issued. EO\\SS\\SI no (E) Petition denied: List No. Oath of allegiance waived: List No. (5) begnado 50 one ym 10.1 resuper (A) does banabando avad bas sombizen 101 make of adi bas svil 10) beninü siti boblern bne numbin 10) nontrimbe lotwel em visite bus notific birth GPO : 1984 O - 431-948 bone mast 10) this noims lemam 291812 bottal) sdi (1) tobacco both 2016.12 and big bortaq dointer lo lla porobizon 10) nobsmits fulwal 2017 bos add lo stab and dolrty bebien avail bonoq dont to usol to boiinU mood svad bite side to sma adi aniboond admont xia use abam 05 to sdi banaU sell to 21 notre baln to state mil in 30 James amona ed basingoom danson to miss barinU sidique 0 to to Josest cusibladus berin0 to bas sban Regnol and = anivar accident a to motional chesing TO lenominic adi motion of bsshodius battail oris middlew notiszinagio as vd 10 nodsmimorab 2 (d is ybloo bogasm em daw broads nogu did boes bestai insavolgars dous mi bacadra beneitsto challigen 21 sevoqa dogs box Bands dour to none and bonieU set midtre sombing not barns 2dt n) sionod benes notice rabas hall 31 anoitibnos abno 237107 bennA griff and moisting ate not stadi to but sub been suber 1000004 to and to 31st 21677 01 used is 10 bottoo 10) DA has midliw ron STEO 100 vd drive to to eros arl) to YOU Damohao 10 balicovba ni bevaled line miss bodal and to adi to coloring with of badowize lason hoos In none besiupon ort) lis ghat mod belinU add to bot 15010 boos adi of adi vd commission bas to dizo arti modified subst bos 251832 bakaU sdi to 8 amooad or doint boos in 03 201812 bozi and to Holded wal ed briupan botinU in abizer of bes bas balqueza monit isban to how at box 2010 betin! od: to barnA and sd: to international boa agbstword wind best (morinedi balgress essugnsl dailgneT odi lange box SROW (61) ad to mist bas relationing not aids to sadi colomA to 291032 bone) sit) to missing bottimbs and can terti boo 2M of failed bns cm lasd Yd (al) MONTH Y8 MEHW YTU930 80 XAXID Ya boman-svode badhoadu2 beman-syods rd am boa nooped bise bas noiling binz ai awode ni biaz to kals set to office aid bisa to to"
}