{
  "anumber": "A21526239",
  "id": "A21526239_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21526239_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, Form 1-81 ( (Visa Office, Dept. of State)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Bos ton, Mass. File No. A21 526 239 Status as a lawful permanent resident of the United States is accorded: Name Ayodhabai Govindram Lathi SEX DATE OF BIRTH Street Address 34 Noanett Road 02912 386 Conley F 07-18-07 Needham Mass PLACE OF BIRTH City, State, Zip P cob 1 volice MUICH PoRteRville CA India 9325D NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE(If any) LLU India the a DETAI VOLICE MUGU PRIORITY DATE of India 201(b)Imm.Rel. REMARKS 12 pazeq ou (5)' OL OL NONPREFERENCE: Section 212(a)(14) certification not required because: TABOB CHECK auq plock ou we as Individual section 212(a)(14) certification issued Blanket/section 212(a)(14) certification issued under the following provision of law: 20CHOU Sec 203(h) of the T & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act OL Private Law no. of the alleu Sec 244 ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session accebied Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 IUG bio UOI (Other law Specify) As of Sept 1-6 1976 at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) R B-2 BOS (Applicable in all cases) ICO DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION U. S. APPROVED INS RClmillitt gate lixeq we facjola DD 9/16/76 SEP 16 1976 DISTRICT FOR USE BY VISA CONTROL OFFICE BOSTON, MASS. Kany 20LAJC6 Date auq Foreign State ou J Million 3 bjaceq excebt Preference Category SAGLA que OL Number qaje Month of Issuance cobi K Signed (Visa Office Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with I - 59) Form I - 181 (Rev. 5 - - 1 - 74) N (Page 1)"
}