{
  "anumber": "A21570096",
  "id": "A21570096_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21570096_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31-34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion LACHAYA, HEMANTOO, MADDIWAR M Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation INDIA L171878 INDIA A21 570 096 U. S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) Scars or Marks c/o G L MADDIWAR, BOX 768, MARTIN, KENTUCKY 41649 Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) Single Married 10/16/76 NYC B-2 2/17/77 BOMBAY Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension AHERI, TAL SIRONCHA DIST CHANDRAPUR MAHARASTRA, INDIA A/C Birthdate Date of Action Location Code (At/Near) Date & Hour 7/1/05 2/23/77 CIN CIN 2/23/77 City, Province (State) and Country of Birth AR Form: (Type & No.) By Lifted CHANDRAPUR MAHARASTRA, INDIA I-94 Not Lifted Boehm Visa Issued At - NIV No. Social Security Account Name Status at Entry Status When Found B-2 Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. To: CIN 4-30 days Immigration Record Criminal Record Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of Minor Children Mandakini Lachaya Maddiwar -India- Box 768, Martin, Ky 41649 Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality and Address, if Known Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 Yes No Not Listed Listed Code SEMIB Name and Address of (Last) (Current) U.S. Employer Type of Employment Salary From: To: $ hr. Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time. place, manner of last entry, and elements which establish administrative and/or criminal violation. Indicate means and route of travel to interior.) SUBJECT a citizen and national of India last entered the United States at NYC on 10/16/78 as a visitor for pleasure with a stay valid to 2/15/77. Letters written on behalf of SUBJECT indicate he is under treatment for cancer and are requesténg an extension of stay so his treatment can be continued. SUBJECT was not interviewed personally. As per AOIC, SUBJECT granted 90 days VD Boel (If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from 1-file Officer: Boehm l-log Feb 23 19 77 at ( ). M. V/D to 5/16/77 I-210 Disposition (Receiving Officer) GA moyer Form 1-213 (4-1-75)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}