{
  "anumber": "A21534625",
  "id": "A21534625_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21534625_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Abandonment of Lawful Permanent Resident Status, I-151"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1928
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 FCO-CHI achi U.S. Department of Justice Abandonment of Lawful Permanent Resident Status Immigration and Naturalization Service Pulffle SendtINDEX 1. FAMILY NAME Capital Letters) Laxmibed FIRST NAME MIDDLE \"A\" FILE NUMBER PATEL M A21-534-625 2. LAST PERMANENT ADDRESS IN UNITED STATES(N Number and Street) (City) (State) (Zip Code) 3. DATE OF BIRTH COUNTRY OF BIRTH Chicago LL COUNTRY OF CITIZENSHIP 6-4-04 India India 4. DATE OF LAST DEPARTURE NAME OF VESSEL, AIRLINE, OR OTHER MEANS OF DEPARTURE PORT OF DEPARTURE FROM UNITED STATES FROM UNITED STATES 7-19-77 5. A At= INTENDED 168f OR ACTUAL PERMANENT DHAMDOD-LUMBHA: DDRESS ABROAD BARDOLI Surat.-GYJ 6(a) I voiuntarily, willingly and affirmatively am abandoning have abandoned my status as lawful permanent resident of the United States. because: due to my health 1 moved back to India 6(b) Documents Surrendered: I-151 A +21-534-625 6(c) Date of Abandonment or Status as Lawful Permanent Resident of the United States: 7-19-1977 6(d) REMARKS OF IMMIGRATION/CONSULAR OFFICER: If you waive your right to a hearing now. you can have a hearing at any time hereafter before an immi- gration judge to determine your admissibility by presenting yourself at 3 port of entry to the United States and seeking entry. If you do seek a later hearing the immigration judge can and will take into account all statements you have made concerning your abandonment of residence in the United States. Appl for admission on TW - 801 presented Indian PP# Y 562092 which contains B-1/D-2visa issued in Bombay on 11-5-86 and I-151 Appl. was accompanied Nathsbhai Patel 37-068-105 phostated Mother visit was willing to give SIGNATURE BCuppelle OFFICE JFK-NYC AdmB-2to 6(e) I have read and understand the above statements or it has been read to me and is true and correct. I also understand (If I am at this time an applicant for admission into the United States) that I have the right to appear before an immigration judge for a hearing to determine my admissibility into the United States as a returning 1928 lawful permanent resident. I freely waive my right to a hearing before an immigration judge. SIGNATURE OF ALIEN: 12-3-86 t * DATE: applicant cannot sign N.M Pater (sow) FOR GOVERNMENT USE ONLY I HEREBY CERTIFY THAT THE ABOVE SIGNATORY WAS PERSONALLY INTERVIEWED BY ME AND THAT HE/SHE FULLY UNDERSTANDS THE NATURE OF THIS ACTION. SIGNATURE OF IMMIGRATION/CONSULAR OFFICER JBCappielio SIGNATURE OF WITNESS Lilects June FC SIGNATURE OF INTERPRETER N.W. Pater LANGUAGE Hindi ADDRESS OF INTERPRETER SIGNATURE OF SUPERVISOR a C10 Continental Motel Hwy #65,5.Conway 8. DISPOSITION OF DOCUMENTS I-151 deptroyed 9. TO FILES CONTROL OFFICE CNI the (FOR INCLUSION DATE (City) (State) IN ALIEN'S FILE) 12-3-86 10. COPY FURNISHED ALIEN THIRD PERSON/AGENCY ON 12-3-86 (DATE) FORM 1.407 (See Instructions on Reverse) Rev. 5-15-31)N"
}