{
  "anumber": "A21534625",
  "id": "A21534625_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21534625_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, I-486"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE PLEASE ADDRESS REPLY TO IMMIGRATION AND NATURALIZATION SERVICE COURTHOUSE & FEDERAL OFFICE BLDG. 219 SOUTH DEARBORN STREET AND REFER TO THIS FILE NO CHICAGO. ILLINOIS 60604 A21 534 625 1. The attached Form I-486. 2 Your (spouse) (children) (parents) should accompany you to this interview. 3. Birth certificate or other evidence of birth with certified and notarized English translation. 4. Affidavit from your parents or two other persons, certified and notarized who can verify your date and place of birth and parentage. 5. Current Employment letters from your employer/spouse's employer showing salary and duties performed. 6 Your passport and entry permit, Form I-94. 7. Your cancelled passport with the visa page. 8 Bank letters verifying any accounts. Two passport size photographs of yourself, taken within the last 30 days. 10 Current Affidavit of support in your behalf, with necessary financial evidence. 11. Current Affidavit of support in behalf of your spouse and children, with necessary financial evidence. 12. Necessary financial evidence to accompany the affidavit of support which has been filed in your behalf. 13 Marriage certificate with certified and notarized English translation. 14. Death certificate - divorce decree - proof of termination of your prior marriage with certified and notarized English translation. 15. Death certificate - divorce decree - proof of termination of spouse's marriage with certified and notarized English translation. 16. Complete the enclosed Form G-325A; Answer all questions. ALL COPIES MUST BE LEGIBLE AND SIGNATURES MUST APPEAR LEGIBLE ON ALL COPIES. ALL FOREIGN ADDRESSES ABROAD AND IN CANADA MUST APPEAR ON ALL COPIES. 17. Complete application - fingerprint chart where checked in red. 18. Complete the enclosed Form G-138 in Chinese characters. 19. Report to this office, Room 385, for recording of your fingerprints any weekday between the hours of 8:30 and 4:00 p.m 20. Notarized statement from your spouse indicating that he/she has no objections to your remaining permanently in the United States, with certified and notarized English translation. 21. Documentary proof that you have registered with the U. S. Selective Service. 22. Proof of your Cuban - Canadian citizenship with certified and notarized English translation. 23. Attached Form G-28 must be filed by your attorney if you wish to be represented. 24. Documentary evidence that you were ordained as a priest and have been a full-time practicing priest for two full years after your ordination. 25 Complete the enclosed Form SS-5, even if you have a Social Security number. 26. Original copy or copies of all photostat copies of birth, marriage, other certificates, and diplomas you have submitted. 27. Certified and notarized statement that you will not be employed in the United States."
}