{
	"anumber": "A21556137",
	"id": "A21556137_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21556137_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Los Angeles, California File No. A21 556 137 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street Santosh Kumar Kamboj Male 11/22/04 Address 12950 Maclay Street PLACE OF BIRTH City, State, Zip Sylmar California 91342 India 12 bau IJ!! forw NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) of ail PREFERENCE (If any) India of we volice we abbjicaup a we OI PRIORITY DATE Ca202 Immediate Relative the affolued petole alaumad belwaueur REMARKS MPG opio the of State NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) & N Act gate\" 120 unwper us 515(a)(1) Private Law of the Sec 244( (BH of the I & N Act Sec of the Act of 11/2/66 Congress session 100 qaje\" ouce p1 we allow See 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) qty MAY 1977 Top at LOS Ma2 accebes LOL p1 aux As office (Month) (Day) PORT OF ENTRY FOR PERMANENT RESIDENCE ING gate au 01 Class of admission (Insert symbol) IRO(3) to piw (3) the qate OU MPICH au ab- (10) UG 12 MIJUIO OL wal lie (Applicable in all cases) 4/1/77 01 sbf UOI DATE OF of rapais APPROVED INS (so CLB RECOMMENDED BY: (Immigration) Officer) (Date) ACTION H. D. BARNETTE 17 MAY1977 BRICH IMMIGRATION EXAMINER gase the DUE 1ER OUGGL we DISTRICT pe faciol2' FOR USE BY VISA CONTROL OFFICE LOS ANGELES, CALH, nugel 2echou Date JV2' the gate M!!! pe the gate exceb cobl 10 worth Foreign State IU OLOSING ACTION bjaced IIJ lue IU OTUOL ca262 MUGLE REQUIRED Preference Category 181 ID cases Number MUGLE STATISTICS G-188 Month of Issuance alleu SP OL the adez G-361 we Malgeq MID combiese the 21046 LOCIOL of G-153 WE case a IN the we gate belwauer 1.530 12 aLauIsq auq LOL- Signed aug biaceq IU the cobl Mas LG- Decower (Visa Office, Dept. of State) 120 Form 1-357 delivered Form 151 delivered Form 1-151 mailed Form G- 153 delivered CC Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. Aj2a unwper for a OL case nuger State Director, Selective Service (with I - 59 Form I - 181 (Rev. 5 - 1 - 74) N PAGE 1"
}
