{
  "anumber": "A21686132",
  "id": "A21686132_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21686132_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PEOPLES TRUST OF NEW JERSEY, BRA-757-P T"
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ORIGINAL 1 PEOPLES TRUST OF NEW JERSEY Date February 22, 1978 Continental Plaza, Hackensack, , NEW JERSEY (OFFICE OR BRANCH) GENTLEMEN: You are hereby requested to issue to the* To whom it may concern, , a certificate, in the form set forth below, relative to the account No. of the undersigned, setting forth the balance to the credit thereof as of the day before the date of issuance of such certificate. *Designate whether the certificate is to Yours very truly, OF 1/2 it be addressed to the Department of State, Visa Division, Washington, D.C., or to X Cshleeo the American Consul at a specified place. DEPOSITOR Date 2/22/78 DEAR SIR(S): In compliance with the foregoing request, we hereby CERTIFY that, at the close of business on February 21, , 19.78 , our records indicate a balance of $ see below to the credit of the above-designated account(s). Account Number 611 00347 3 Date Opened 4.11.74 Balance$ $512.73 Account Number 611 00687 : 1 Date Opened 6.20.75 Balance$ $1,084.91 Account Number Date Opened Balance$ Certificates similar hereto were issued by us during the past ninety days to the Department of State, Visa Division on the following dates and/or to the American Consuls at the places and on the dates indicated below: at date at date Yours very truly, Sworn before me this 22 PEOPLES TRUST OF NEW JERSEY day of February 1978 Kathlun NOTARY PUBLICAL Lamadi Kateleas AUTHORIZED SIGNATURE amoded NOTARY PUBLIC OF NEW JERSEY MY COMMISSION EXPIRES AUG. 22, 1982 I hereby authorize the abovementioned Office of Peoples Trust of New Jersey to charge my said account with to cover its fee for the issuance of this certificate. DEPOSITOR BRA-757-PT"
}