{
  "anumber": "A21637344",
  "id": "A21637344_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petitioner for Naturalization, NARA-14b"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 U. S. Immigration & Naturalization Service 300 North Los Angeles Street, Room 8010 Los Angeles, California 90012 TO PETITIONER FOR NATURALIZATION: A# A21-637- As a result of your preliminary hearing you are hereby notified of the following: You will be scheduled for another appointment in this office, at that time you will be required to present those items checked below. OR Your petition for naturalization cannot be acted upon until you have submitted additional information, document (s) and/or form(s) as checked below. Please read those items, and when you are able to comply, return them with this letter in the attached self-addressed envelope. You have 60 days to submit the items requested. Arrest report and/or court disposition for Birth certificate for Marriage certificate for Interlocutory and/or final divorce decree for Death certificate for Adoption decree and/or court order re: Name change. Proof of spousal and/or child support for Proof OF selective service registration. Tax clearance from the Internal Revenue Service for Tax year Letter from Welfare Dept. or Social Security Adm. re: Eligibility Notarized letter from church regarding religious belief in bearing arms. Letter should be on appropriate church stationary. Letter from Social Security Adm. regarding SSI eligibility and/ notarized affidavit from the person (s) who gave affidavit of support at time of lawful entry into the United States. Affidavit regarding: Form SSA 8000, copy of your original application, from the Social Security Adm. Other: 0 1 OCT 1984 Date Ernest Gustafson, District Director Upon the satisfactory completion of those items checked above we will then complete the processing of your petition for Naturalization. REMEMBER to always refer to your receipt, it contains you alien registration and petition numbers. NOTE: ALL DOCUMENTS SUBMITTED MUST BE ORIGINAL/CERTIFIED COPIES ISSUED BY COMPETENT AUTHORITIES. Documents in a foreign language must be accompanied by a notarized English translation, certified by the translator as to the accuracy of the translation and as to his competency to translate. If you want any original document returned, and the law does not prohibit the making of copies, a photostatic copy of the document must accompany the original document. N14b (9/28/84)"
}