{
  "anumber": "A21637344",
  "id": "A21637344_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CONFIDENTIAL SOCIAL SECURITY BENEFIT INFORMATION, SSA-2458"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 DEPARTMENT OF HEALTH AND HUMAN SERVICES SOCIAL SECURITY ADMINISTRATION REPORT OF CONFIDENTIAL SOCIAL SECURITY BENEFIT INFORMATION Information about a person's Social Security Benefits is confidential by law. Except under certain circumstances specified by law and regulations, the Social Security Administration does not reveal such information to any person except the beneficiary involved, or his or her authorized representative. Beneficiary's name SOCIAL SECURITY CLAIM NUMBER BIC 1. Name of person or agency from whom a and address 585259187 request for benefit information was received. Beneficiary Dorai David 10332 Lampson, Apt. 3 Other (Show name and address) Garden Grove, CA 92640 The person or agency named in item (1) above has requested information about your benefits. The information requested has been provided in the items checked () below, and is being sent to you for your convenience. If you want the requesting agency (other than yourself) to have this information, you may show or send them this official report. 2. The gross amount of your monthly social security benefit is $ none The amount deducted for Medicare is $ The net amount of your social security check each month is $ Month-Year 3. The above amount became effective 4. Your monthly benefit From (month-year) Through (month-year) (before deduction for Medicare) $ 5. The monthly amount of your Supplemental Security Income payment is $ 477.00 Month-Year - 6. The above amount became effective 2/84 7. The total monthly amount of your social security benefit and supplemental security income payment is $ Month-Day-Year 8. According to our records your date of birth is 11/02/07 9. We are unable, at this time, to tell you whether benefits may be payable in your case, because the processing of your claim for disability benefits has not been completed. If it is determined that benefits are payable, you will receive notification of the exact amount and effective date. 10. Other SS DISTRICT OFFICE ADDRESS SIGNATURE AND TITLE OF AUTHORIZED OFFICIAL Social Security Administration Davis, SR 10540 Chapman Ave. TELEPHONE NO. DATE Garden Grove, CA 92640 836-2681 10/3/84 FORM SSA-2458 (9-82) Prior editions may be used * U.S. Government Printing Office: 1984-421-187/180"
}