{
	"anumber": "A21686132",
	"id": "A21686132_0040",
	"page_index": 40,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21686132_0040/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Citizenship, A021686132"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1978, 2002, 1997, 2003]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "I HMRF Q March 17, 2003 ACTION COMPLETED APPROVED FOR FILING Ms. Ratnabai S. Rao Initials: 1pm Date: 7/14/03 c/o Rama Rao FCO/Unit 7 Nathan Drive North Brunswick, NJ 08902 Tel: (732) 422-0583 The Immigration & Naturalization Services 970 Broad Street Newark, NJ 07102 AUG 13 2003 CIS Ref: Application for Citizenship Name: Ms Ratnabai S. Rao Alien Registration: A021686132 Social Security: 157-66-4579 My letters to your office on November 16, 2002 and December 9, 2002. To whom it may concern, The purpose of this letter is to express my deep disappointment and frustration. I applied for citizenship in July 1997 and have written several reminder letters. On December 9, 2002, I sent an alien registration number as requested by your office. Since then, I have not received a response from your office in regards to my status and it has been almost six years since my first attempt. I am already 96 years old and eagerly awaiting to become a U.S. citizen. I came to this country in 1978 and all of my children, grandchildren and great-grandchildren are U.S. citizens. I too would like to be a U.S. citizen before it is too late. If your office could send any type of response about the status of my application, I would greatly appreciate it. If there are any problems, please let me know as soon as possible. Thank you for your time od main CC: Respected Senator Frank R. Lautenberg, I dearly request your good office to help me out to become a U.S.A. Citizen soon, 506 Hart Senate Office Building United States Senate Washington, D.C.20510 21-686-132 2913 AH 0086 EOHI MN 690000 JUN"
}
