{
  "anumber": "A21686132",
  "id": "A21686132_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21686132_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, 1-81 ( (Rev. 4-1-77)Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE 2-10-78 Place Newark, NJ File No A21686132 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street Ratnabai Srinivasa Rao 1/27/07 Address 17 Karen Street PLACE OF BIRTH City, State, Zip Kendall Park, NJ 08824 Madhugiri, India 12 au abbucouou NATIONAL ITY India - 45 vouce COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) CO262 PRIORITY DATE belwaueur REMARKS Act NONPREFERENCE: Section 2(a)(14) certification not required because: abbiobuale IU a voublejeleuce ca26 Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the & N Act Sec 214(d) I & N Act offer iponap at the pecower Private Law no of the Sec 244( all ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session of we rapol' blorideq Sec 245 of the &N Act LICOLIOU Sec 13 of the Act of 9/11/57 (Other law Specify) 01 NEWARK As of the () the gate at (Month) Del(Day) IR-O(z-2) PORT OF ENTRY FOR PERMANENT RESIDENCE OL Class of admission (Insert symbol) DOE: NYC 5/9/77 B-2 DATE wewps OF u.s. APPROVED INS RECOMMENDED BY: (Immigration Officer) (Date) ACTION Within frihr O abbucation are DD 2/24 c 978 e lixeq factors' DISTRICT FOR USE BY VISA CONTROL OFFICE gare NEWARK, N. J. of LUE Date Foreign State d-94 DESTROVE Co C0262 MUGLE 1-151 to NEW 20 CONSION Preference Category 1161.10 Number Tv2 Month of Issuance STATISTICS Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. 10946307 mailed delivered 3-7-78 CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. SFA Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}