{
	"anumber": "A21681533",
	"id": "A21681533_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21681533_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, G-28"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1979, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 NOTICE OF TRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE DATE In re: February 6, 1979 FILE No. SANKARANARYANAN NAIR i hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): Petitioner Applicant NAME Beneficiary Sankaranaryanan Nair ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) 11 Woodsedge Road, Audubon, Pa. 19403 NAME Petitioner Applicant Beneficiary Nagendran Thampi ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) 11 Woodsedge Road, Audubon, Pa. 19403 Check Applicable Item(s) below: 1 I am an attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia Pennsylvania Supreme Court and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2. I am an accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so recognized by the Board: 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS Suite 715 Widener Building Ane plffed 1339 Chestnut Street Philadelphia, Pennsylvania 19107 NAME (Type or Print) TELEPHONE NUMBER George Gershenfeld, Esquire LO3 3-7442 (215) PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: George Gershenfeld, Esquire (Name of Attomey or Representative) THE ABOVE CONSENT IS IN CONNECTION WITH THE FOLLOWING MATTER: 90161 Vd V.THa GAS ZIAN 8 WWI 'S'N I l 30 for father NAME OF CONSENTING EOF BERSON 9- UVN 6/61 SIGNATURE OF PERSON CONSENTING DATE NAGENER LINAMPI X Nagenchan Thamp Feb. 5. 1979 (NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented is a citizen of the United States or an alien lawfully admitted for permanent residence.) FORM G-28 UNITED STATES DEPARTMENT OF JUSTICE 9-27-75) N Board of Immigration Appeals and Immigration and Naturalization Service"
}
