{
	"anumber": "A21681533",
	"id": "A21681533_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21681533_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 APPLICATION FOR STATUS Form Approved AS PERMANENT RESIDENT O.M.B. No. 43-R0400 1. Name (Family) (First/Given) (Middle) 3. Male 4. Date of Birth 5. Telephone Number NAIR, SANKARANARYANAN N. Sex: Female 1-6-02 (215) 666-5742 2. Other names used; (including maiden name if married woman 6. Place of Birth (City or Town) (County, Province, or State) (Country) none Alleppy, Kerala India 7. I am a citizen of (Country) 8. Present Address (Number and Street) (City or Town) (State or Province) (Country) (Zip Code) India 11 Woodsedge Road, Audubon, Pennsylvania 19403 9. Have you ever applied before for permanent resident status in the U.S.? Yes No (If \"Yes\", give the date and place of filing and the final disposition) 10 My file number is: 10. a. I think my A file is at the Immigration Office in A-21681533 (City) 11. Name as appears on non-immigrant document (Form I-186, etc.) (If different from above) NAIR, Sankaranaryanan Narayana Pilla I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) by (Name of vessel or other means of travel) New York, New York February 24, 1978 Pan Am-001 as a (visitor, student, crewenan, parolee, etc.) my I-94 permit number is Visitor 6 000773 3 was was not inspected. 3 12. My nonimmigrant visa, number K-2397501 was issued by the on (Month) (Day) (Year) 13. am United States Consul at (City) (Country) single married Madras, India January 25, 1978 divorced widowed 14. I have been married one times, including my present marriage, if now married. (If you are now married give the following:) a. Number of times my husband or wife has been married b. Name of husband or wife (Wife give maiden name) n/a n/a C. My husband or wife resides with me apart from me at Address(Apt.No. (No. & Street) (Town or City) (Province or State) (Country) n/a 15. a. I have 3 sons or daughters as follows: (Complete all columns as to each son or daughter; if living with you state \"with me\" in last column; otherwise give city and state or country of son's or daughter's residence. Use separate sheet if necessary). Name Sex Place of Birth Date of Birth Now living at See Attached Sheet b. I have brothers nd sisters as follows (Complete all columns as to each as in 15. a. above). Name Sex Place of Birth Date of Birth n/a C. The following members of my family are also applying for permanent resident status: cm none MO co 16. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership in the United States or a foreign country, and the periods and places of such membership. (If you have never been a member of any organization, state \"None\".) 10 is none 17. I have have not been treated for a mental disorder, drug addiction or alcoholism. (If you have been, explain on separate sheet). 18. I have have not been arrested, convicted or confined in a prison. (If you have been, explain on separate sheet). 19. I have have not been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action. (If you have been, explain on separate sheet.) 20. I have have not received any public assistance. (If you have, explain on separate sheet.) 21. EXCEPT AS ERNISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE NOT ADMISSIBLE TO THE UNITED STATES AND ARE THEREFORE INELIGIBLE FOR STATUS AS PERMANENT RESIDENTS: Aliens who have committed or who have been convicted of a crime involving moral turpitude (does not include minor traffic violations) aliens who have been engaged in or who intend to engage in any commercialized sexual activity; aliens who are or at any time have been, anarchists, or mem- bers of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (1) opposition to organized government, (11) the overthrow of government by force or violence, (III) the assaulting or killing of government officials because of their official character, (IV) the unlawful destruction of property, (V) sabotage, or (VI) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States; aliens who intend to engage in prejudicial activities or unlawful activities of a subversive nature; aliens who have been convicted of violation of any law or regulation relating to narcotic drugs or marihuana, or who have been illicit traffickers in narcotic drugs or marihuana; aliens who have been involved in assisting nyother aliens to enter the United States in violation of law; aliens who have applied for exemption or discharge from training or service in the Armed Forces of the United States on the ground of allenage and who have been relieved or discharged from such training or service. Aliens who are mentally retarded, insane, or have suffered one or more attacks of insa- nity; aliens afflicted with psychopathic personality, sexual deviation, mental defect, narcotic drug addiction, chronic alcoholism or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting tneir ability to earn a living; aliens who are paupers, professional beggars or vagrants; aliens who are polygamists or advocate polygamy; aliens likely to become a public charge; aliens who have been excluded from the United States within the past year, or who at any time have been deported from the United States, or who at any time have been removed from the United States at Government expense; allens who have attempted to procure a visa by fraud or misrepresentation; aliens who have de- parted from or remained outside the United States to avoid military service in time of war or national emergency; aliens who are former exchange visitors who are subject to but have not complied with the two year foreign residence requirement. Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain on separate sheet). 22. (Signature of person preparing form, if other than applicant). I declare that Address of person preparing form, if other than applicant this document was prepared by me at the request of the applicant and is based on all information on which I have any knowledge. 2/15/79 715 Widener Building Date: Philadelphia, Pennsylvania 19107 Occupation: Attorney Form I-485H(3-1-78) UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service"
}
