{
  "anumber": "A21637344",
  "id": "A21637344_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0033/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Certificate,, 122272257"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "dark"
      },
      "marital_status": {
        "marital_status_llm_v1": "WIDOWED"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1985
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "Anahiem, CA"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "Screened by NARA, 7/26/2023 IN:OR 3 TO BE FORWARDED TO No. 12272257 IMMIGRATION AND INATURALIZATION SERVICE CANED 0 Pelition No. 538100 INS Registration no. A21 637 344 DUPLICATE Personal description, of holder as of Dale of birth NOVEMBER 2, 1907 sex MALE ; complexion DARK colorofoyer BROWN color of hair GREY height 5 feel 4 inches; weight 125 pounds; visible distinctive marks NONE Maritalstatus WIDOWED Country of formernationality INDIA I certify that the description above given is true, and that he photograph affired hereto is a likeness of me. Doen Jamestraws. Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beitknown that at a tormof the District Court of The United States held bursuamLdo AUGUST 1, lawal 1985 Los Angeles on the DORAI JAMES DAVID then residing at 2040 SPRAGUE LN #3, ANAHEIM, CA inlends loreside hormanently, in the United. States when sorequired by the Naturalization Laws of the United. States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entilled to be Seal admitted docilizenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. Intestimony whereoft thesealoft the courtis hereuntouffixed this 1ST dayol AUGUST nineleen hundred and EIGHTY-FIVE LEONARD A. BROSNAN IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
}