{
  "anumber": "A21686132",
  "id": "A21686132_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21686132_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. Returned Receipt Name Family RAO Given Middle Name RATNABAI Initial S U.S. Address Care Mailing - of MR. RAMA RAO Resubmitted Street Number Apt. and Name 7 NATHAN DRIVE # - City County NORTH BRUNSWICK MIDDLESEX State ZIP AUG N.J. Reloc Sent Code 08902 Date of Birth Country (month/day/year) JAN. 27th 1907 of Birth INDIA Social A Security # 157-66-4579 # 021686132 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B e. Other. (Please specify section of law) At interview request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 02-24-1978 NEW YORK Citizenship INDIAN Name on alien registration card (if different than in Part 1) Other names used since you became a permanent resident (including maiden name) Sex Male Height Marital Status: Single Divorced Female 5-0 Married Widowed Can you speak, read and write English ? No Yes. Action Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip SEPT.27,96 DEC. 11.96 Yes No BANGALORE INDIA VISIT SICK BROTHER NOV 11,94 MAR 12,96 Yes No BANGALORE TAKE CARE OF To Be Completed by INDIA BROTHER Attorney or Representative, if any SEP, 23,88 NOV 11,88 Yes No BANALORE INDIA MARRI (SON) Fill in box if G-28 is attached to represent the applicant JAN, 31,87 MAR 8,87 Yes No BANCACORE GRAND DAnghe Mariage VOLAG# INDIA Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}