{
	"anumber": "A21637344",
	"id": "A21637344_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0027/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and \"Naturalization Service OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS; FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, FOIA (b)(6) , residing at FOIA (b)(6) (Name) (Street and number) FOIA (b) (6) (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. FOIA (b)(6) FOIA (b)(6) I was born on at Also, answer either a, b or c, as appro- (Date) (City) (Country) priate, if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) an to permanent If alien lawfully admitted the United States for residence, give 'A' number FOIA (b)(6) FOIA (b)(6) 2. That I am years of age and have resided in the United States since FOIA (b)(6) 3. That this affidavit is executed in behalf of the following person(s) at present residing at 2713 WYOMING BLUD NE. # I.DELWOOD EAST APARTMENT. ALBUQUERQUE 87111. NEW MEXICO, COUNTRY MARRIED OR RELATIONSHIP TO NAME SEX AGE OF BIRTH SINGLE DEPONENT DORAI RAJ JAMES DAVID M 70 INDIA MARRIED FATHER 4. (Amounts shown in answer to this question must be in United States dollars.) (a) That I am employed as, or engaged in the business of FOIA (b)(6) with FOIA (b) (6) - (Name of concern) at. FOIA (b)(6) FOIA )(6) . and derive a net annual income of $ (b) That I have on deposit in savings (Address) banks in this country $ - (c) That I have other personal property, the reasonable value of which is $ (d) That I have stocks and bonds in the amount of $ 1 , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at - valued at $ , with mortgages or other encumbrances there- FOIA (b)(6) on amounting to $ (f) That I have life insurance in the sum of $ -, cash surrender value of $ (g) That if self-employed, I attach a copy of my last income tax return or report of commer- cial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See instructions for nature of evidence of net worth to be submitted) 5. That the following persons are dependent upon me for support: (Place a check in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) WHOLLY PARTIALLY NAME OF PERSON DEPENDENT DEPENDENT AGE RELATIONSHIP TO ME NONE. Form I-134 (Rev. 3-1-76)N"
}
