{
  "anumber": "A21637344",
  "id": "A21637344_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Cease Status of Alien Relative for and Your Relative Issuance of 6-100 to 6-129 is the Immigrant Visa,, Form Approved OMB No. 43-R0 41."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1979,
        2023,
        1976,
        1977,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 UNITED STATES DEPARTMENT OF JUSTICE Form Approved Immigration and Naturalization Service OMB NO. 43-RO 401 PETITION TO Fee Stamp PLEASE NOTE CHECKED CLASSIFY STATUS OF YOU ARE THE PETITIONER $ 16.00 FEE PAID 1 No. ALIEN RELATIVE FOR AND YOUR RELATIVE Immigration and Naturalization Service ABG-72-(35(3) ISSUANCE OF 6-100 tuELP IS THE Albuquerque, New Mexico IMMIGRANT VISA 10-5-78 BENEFICIARY Date 12-1-77 Verified by NO RECORD FIP OCT 3 1977/04 \"Upp He 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Names: Mingates and countries of Birth of DAYID DORAI JAMES 4. Other names used: (including maiden name if married) beneficiary's childrensed by Eyes NONE 5. Country of beneficiary's birth 6. Date of beneficiary's birth (Month, day. year) N.A. INDIA NOVEMBER 24 1907 7. My name is: (Last, in CAPS) (First) (Middle) 8. My phone number is: DAVID IRENE HENRIETTA (505)296-9021. 9. Other names used: (including maiden name if married woman) 10. Relationship of beneficiary to myself MABEN.. WIFE. HUSBAND 11. I was born: (Month) (Day) (Year) in: (Town or city) (State or Province) (Country) SEPT. 1st 190 1915 BALMATTA, MANGALORE, INDIA. 12. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate, and date and place of naturalization: (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with instruction 3 a (2) Up-front processed by How 13. If you are a lawful permanent resident alien of the United States. give the following: a. Alien Registration Number: A 21 211 907 Sinza b. Date, place, and means of admission for lawful permanent residence 14. Beneficiary's marital status: dugg August 18th, 1976, DETROIT, MICHIGAN. 15. Name of beneficiary's spouse, if married. and date and country of birth (Omit this item if petition is for your spouse) Married Widowed Divorced Single - 16. Full address of beneficiary's spouse and children. if any (Omit this item if petition is for your spouse) - N.A. W. If this petition is for your spouse or child, give the following: a Date and place of your present marriage Names of my prior spouses Names of beneficiary's ption spouses BANGALORE, K.G.F INDIA. 18. Has this beneficiary ever been in the U. S.? NONE NONE YES NO 19. Are beneficiary and petitioner related by adoption? YES NO (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 5) Mrs Jame David Subscribed and sworn to me (affirmed) before this / day of July A.D. 19 77 at Bernglillo County New Mexico (SEAL) My commission expires may 29,1979 Mary K. Smith, notary (TITLE) Public (SIGNATURE OF OFFICER ADMINISTERING OATH) SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (SIGNATURE) (ADDRESS) (DATE) FORM 1-130 PCT 1977 RECEIVED TRANS IN REI'D TRANS OUT COMPLETED (REV. 1-1-77) N 7-7-77 OCT"
}