{
  "anumber": "A21637344",
  "id": "A21637344_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization,, N-455"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "To Petitioner: Screened by NARA, 7/26/2023 In connection with the hearing to be held on your petition for naturalization; answer each of the questions below by Authority for collection of the checking \"Yes\" or \"No\" without giving any further explanation. information requested on Form N-455 is contained in Sections 101(f), 316, The questions refer only to what has happened AFTER THE DATE you appeared and filed your petition for naturaliza- 332, 335 and 336 of the Immigration tion. They do not refer to anything that happened before that date. and Nationality Act (8 U.S.C. 1101(f) 1427, 1443, 1446 and 1447). Submis- After you have answered every question, sign your name, give your address, and fill in the date and place of signing. sion of the information is voluntary. You must BRING THIS COMPLETED LETTER WITH YOU to the hearing and give it to the naturalization examiner, The principal purposes for requesting who will question you further on the answers. the information are to enable desig- nated examiners of the Immigration (Answers) and Naturalization Service to deter- AFTER THE DATE you filed your petition: mine a petitioner's eligibility for 1. Have you married, or been widowed, separated, or divorced? (If \"Yes\" please naturalization and to make appropriate recommendations to the naturalization bring documented proof of marriage, death, separation or divorce.) No courts. The information requested may, 2. Have you been absent from the United States? week 2. as a matter of routine use, be disclosed Yes No to naturalization courts and to other 3. Have you knowingly committed any crime or offense, for which you have not been federal, state, local or foreign law arrested; or have you been arrested, cited, charged, indicted, convicted, fined, or enforcement and regulatory agencies, imprisoned for breaking or violating any law or ordinance, including traffic violations? 3. Yes No the Department of Defense, including any component thereof. the Selective 4. Have you joined any organization, including the Communist Party, or become Service System, the Department of State, associated or connected therewith in any way? 4. Yes No the Department of the Treasury, the Department of Transportation, Central 5. Have you claimed exemption from military service? 5. Yes No Intelligence Agency. Interpol and in- 6. Has there been any change in your willingness to bear arms on behalf of the dividuals and organizations in the United States; to perform non-combat service in the armed forces of the United processing of any application or pet- ition for naturalization, or during the States; to perform work of national importance under civilian direction, if the law course of investigation to elicit further requires it? 6. Yes No information required by the Immigration 7. The law provides that a petitioner for naturalization shall not be regarded as a and Naturalization Service to carry out its functions. Information solicited person of good moral character who, at any time after the filing of the petition for which indicates a violation.or poten- naturalization. has advocated in polygamy or been a polygamist; received income tial violation of law, whether civil, mostly from illegal gambling; been a prostitute or procured anyone for prostitution; criminal, or regulatory in nature, may knowingly and for gain encouraged or helped an alien to enter the United States be referred. as a routine use, to the illegally; been an illicit trafficker in drugs or marihuana; or has been a habitual appropriate agency, whether federal, drunkard. Have you been such a person or committed any of these acts? 7. Yes No state, local or foreign, charged with the responsibility or investigating, I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. enforcing or prosecuting such viola tions. Failure to provide all or any Signed Anaheim,C.A. 1st August 1985 of the requested information may at result in an unfavorable recommenda- on tion as to a petitioner's eligibility (City and State) Full Signature) Joraignow 2040 spraque Ln. # 3 Anahemic CA. 92802 for naturalization and denial by the court of a petition for naturalization (Full Address and ZIP Code)"
}