{
  "anumber": "A21772021",
  "id": "A21772021_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21772021_0054/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCCIONES PARA EL RECOGNICIMIENTO MÉDICO Y ENTREVISTA, I-1329"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 (VEASE AL DORSO DE ESTA PÁGINA LA DIRECCIÓN, FECHA Y HORA RESERVADA PARA SU RECONOCIMIENTO MÉDICO Y ENTREVISTA) INSTRUCCIONES PARA EL RECONOCIMIENTO MÉDICO Como parte de su solicitud para modificar su status a uno de residente permanente, se exige un examen físico. Si ha cumplido usted 15 años de edad deberá obtener INMEDIATAMENTE, y traer consigo en el mo- mento de presentarse al examen físico, un informe sobre los resultados de un análisis de sangre y una radio- grafía del tórax de 14\" por 17\" (35,50 cm. por 43 cm.) con el informe interpretativo de dicha radiografía preparado por un médico autorizado. EV análisis de sangré deberá hacerse en un laboratorio autorizado por UTITY el Departamento de Sanidad de un gobierno local o del Estado: La radiografia y et analisis de sangre para sífilis no deberán haber sido hechos más de 90 días antes de la fecha de presentación. SU EXAMEN MÉDICO NO SE. PODRÁ COMPLETAR SIN (1) UN INFORME SEROLÓGICO, (2) UNA RADIOGRAFÍA Y (3) LA INTER- PRETACIÓN DE LA RADIOGRAFÍA. S' Jase TENGA LA BONDAD DE FIJARSE TAMBIÉN EN LAS CASILLAS MARCADAS A CONTINUACIÓN EN RELACIÓN CON SU RECONOCI- MIENTO MÉDICO. Sírvase obtener prontamente su informe serológico, radiografía y la interpretación de la radiografía. Usted puede llamar por teléfono a la oficina local o estatal del Departamento de Salud y solicitar el nombre de un laboratorio autorizado donde podrá obtener estos servicios. Sirvase traer estos documentos juntamente con copias de esta carta al presentarse a examen ante un médico del Servicio de Salud Pública de los Estados Unidos, examen para el cual se ha concertado una cita en el lugar y fecha abajo indicados: DIRECCIÓN: FECHA: HORA: Sírvase comunicarse inmediatamente con el médico abajo indicado o con uno de los médicos cuyos nombres aparecen en la lista adjunta, si se adjunta una lista, para 1) determinar qué medidas deberá usted tomar para obtener un informe serológico, una ra- diografía y la interpretación de la radiografía antes de su examen médico, y 2) concertar una cita con el medico para hacerse el examen, el cual deberá completarse antes del Todos los gastos relacionados con este exa- men deben ser sufragados por usted. Sírvase mostrar esta carta a cualquier laboratorio que haga estos examenes. Además, entregue las copias de la carta al médico que le examine, y firme su nombre en presencia del médico para que él incluya su firma en el informe. INSTRUCCIONES ACERCA DE LA ENTREVISTA DE INMIGRACIÓN TAMBIEN SE HA CONCERTADO UNA ENTREVISTA ANTE UN FUNCIONARIO DE INMIGRACION EN: DIRECCIÓN: FECHA: HORA: AL COMPARECER PARA ESTA ENTREVISTA, TENGA LA BONDAD DE TRAER CONSIGO LOS DOCUMENTOS SIGUIENTES: 1. EL SOBRE SELLADO QUE LE ENTREGÓ EL MÉDICO QUE LLEVO A CABO EL RECONOCIMIENTO. 2. SU PASAPORTE Y EL FORMULARIO I-94. 11322 VAGUAG S[ USTED NO HABLA INGLES, DEBE ACOMPAÑARLO(A) UNA PERSONA DE SU SEXO QUE SIRVA COMO INTÉRPRETE DURANTE EL RECONOCIMIENTO MÉDICO Y LA EN- TREVISTA DE INMIGRACIÓN. AVISO: EL NO PRESENTARSE A LA HORA Y FECHA INDICADAS PARA ESTAS EN- TREVISTAS U OLVIDARSE LLEVAR LOS DOCUMENTOS REQUERIDOS SERÁ MOTIVO DE QUE SU CASO SE ATRASE. TRAIGA SU PASAPORTE Y EL FORMULARIO -94"
}