{
	"anumber": "A21765855",
	"id": "A21765855_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325A ( (REV. 8-27-72)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1960, 1974, 1969, 2023, 1892, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 office code 0300 - NYC FORM G.325A (REV. 8-27-72)N UNITED STATES DEPARTMENT OF JUSTICE Form Approved BIOGRAPHIC Immigration and Naturalization Service type case Sec 24 OMB No. 43-R436 INFORMATION 9-11-74 (Family name) (First name) (Middle name) BIRTHDATE (Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. MALE IYER JANAKI VENKETACHNATA 9-18-1903 (If any) EMALE INDIAN A21 765 855 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH KERALA, SOCIAL SECURITY NO. NONE TRIPPAYYAR, INDIA (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER SUBBIYER SANKARAN TENKASI, INDIA NOT LIVING MOTHER (Maiden name) SUBBIYER KAMALA TRIPPAYYAR, INDIA HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give maiden name) IRINJALAKUDA I YER VENKETA CHALA 4-18-1892 INDIA 3/15/1915 INDIA FORMER HUSBANDS OR WIVES (If none, so state) NONE FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 141 BRADLEY ROAD SCARSDALE N.Y. U.S.A. JAN. 1974 PRESENT TIME 34 LAKE ROAD CALCUTTA W. BENGAL INDIA JAN. 1969 JAN 1974 51A HINDUSTAN PARK CALCUTTA W-BENGAL INDIA JAN 1960 JAN 1969 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 34 LAKE ROAD CALCUTTA BENGAL INDIA JAN. 1969 JAN 1974 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR PRESENT TIME NO N E Show below last occupation abroad if not shown above. (Include all information requested above.) NONE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NAPURALIZATION OTHER (SPECIFY) Marameavan (son & Petitioner) 8/29/74 ADJUSTMENT OF STATUS IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
