{
	"anumber": "A21772021",
	"id": "A21772021_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21772021_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Privacy Act Information Request, FORM G-657 ( (Rev. 8-9-78) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 RECEIVED U.S. GOVERNMENT PRINTING OFFICE 1979-304-423 INFORMATION 401 772-000 mt OCT 27 1982 Lachhmi sough UNITED STATES DEPARTMENTOF JUSTICE PRIVACY ACT INFORMATION REQUEST IMMIGRATION AND NATURALIZATION SERVICE Immigration and (FOR INS INTERNAL USE) NSEE EINSTRUCTIONSION REVERSE OFFICE SYMBOL New York, N.Y. False statements subject to criminal penalties. See P.L. 93-579,88 stat. 1902 (5 U.S.C. 552 a (i)) SECTION 1 - REQUESTER AND RECORD IDENTIFICATION A. COMPLETE NAME OF INDIVIDUAL TO WHOM RECORD PERTAINS B. ADDRESS (street/city/zip code) (last) (first) (middle) BLOCK NO. 45, HOUSE NO, 10 SINGH PIAR EAST PATEL NAGAR, N.DELHI-INDIA C. TELE. NO. D. ALIASES E. DATE AND PLACE OF BIRTH (area code) 4-1-1901 BASTI WARYAM (PAKISTAN) F. \"A\" NO. OR OTHER FILE NO. G. ACTION REQUESTED PERSONAL ACCESS AMENDMENT COPY A 21 772 021 OTHER (Specify) SEE ATTACHED SHEET H. LOCATION OF RECORD (office, city, organization) Immigrationand naturalizationservice, 26Federal Plaza, New York 1. DESCRIPTION OF RECORD (title, index no., etc.) NATURALIZATION CITIZENSHIP ENTRY/DEPARTURE OTHER (SPECIFY) SEE ATTACHED SHEET DATE & PLACE OF ENTRY INTO U.S. NAME USED AT TIME OF ENTRY INTO U.S. (F'PIAR SINGH (LAST) 1973 New York NAME USED ON NATURALIZATION OR CITIZENSHIP CERTIFICATE CERTIFICATE NO. DATE ISSUED - LOCATION OF COURT OR IMMIGRATION OFFICE ISSUING CERTIFICATE 26 Federal Plaza, NEW YORK NAME OF REQUESTER OR OTHER INDIVIDUAL IF DIFFERENT FROM INDIVIDUAL TO WHOM RECORD PERTAINS Home J. NAME (last) (first) (middle) K. ADDRESS (street/city/zip code) L. TELE. NO. 244 BUEL AVE (area code) CHAWLA BHAGWAN SINGH staten Island, ,NY10305 212-979-3717 212-330-3479 M. AUTHORIZATION (Attach authorization letter. Form G - 28, power of attorney, other authorization document, or complete authorization block below) AUTH. LETTER G-28 P / A OTHER AUT. DOCUMENT I AUTHORIZE (Name) TO SEE MY RECORD (Signature) N. SIGNATURE OF REQUESTER DATE O. SIGNATURE OF ACCOMPANYING PERSON 10/27/82 SECTION 2 - AGENCY RESPONSE (ITEMS MARKED \"X\" APPLY TO YOUR REQUEST) A. THE RECORD YOU REQUESTED IS ATTACHED C. WE NEED ADDITIONAL INFORMATION TO RESPOND TO YOUR REQUEST. PLEASE RETURN THIS REQUEST WITH THE NECESSARY NO FEE SUBMIT $ FEE INFORMATION. (See Remarks below) B. WE HAVE THE RECORD. FOR PERSONAL ACC- ESS PLEASE CALL OR WRITE THE PERSON WHOSE NAME APPEARS BELOW. FOR A COPY D. WE ARE UNABLE TO INDENTIFY ANY RELATING RECORD PLEASE SUBMIT $ FEE E. THE RECORD YOU REQUESTED IS EXEMPT FROM DISCLOSURE UNDER THE LAW (See Remarks below for specific exemption). ONLY INDIVIDUALS TO WHOM THE RECORD PERTAINS MAY APPEAL DENIAL OF ACCESS (See Instructions on Reverse). F. REMARKS SEE ATTACHED SHEET all the documents contained in file A21 772 021 are attached per your request. G. SIGNATURE OF OFFICIAL H. TITLE OF OFFICIAL Charles C. Sava District Director 1. ADDRESS OF OFFICIAL J. DATE 26 Federal Plaza, New York, NY 10278 11/4/82 SECTION 3 - FOR AGENCY USE ONLY A. REQUEST RECEIVED BY DATE B. IDENTITY ESTABLISHED IN PERSON APPROVED BY DATE C. ACTION ASSIGNED TO DATE D. RESPONSE DUE DATE E. FEE DATA: DATE AMOUNT DUE $ FORM G-657 (Rev. 8-9-78) N RECORD COPY (INS USE ONLY)"
}
