{
  "anumber": "A21765855",
  "id": "A21765855_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service Processing Sheet, I-485 ( (245)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 45 UNITED STATES DEPART NT OF JUSTICE IMMIGRATION AND NATURALIZATION S Processing Sheet Application or Petition Form No. I-485 (245) File No. A21 765 855 HR 2V CHECK ONE SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203 (a) () NONPREFERENCE 203 (a) (8) DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If Checked) (If Checked) 6/26 DATE Date Mailed Delay Notice XXXXXXXXXXXXXXX B/C MEDICAL I-181 to State M/C INTERVIEW 8:45 G-325A Sheet #1 9-11-74 Photos RESCHEDULED 2 Support MEDICAL 3 I-508 INTERVIEW 4 CALCUTA I-88 Other Consulate : (Location CATEGORY A. Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). SS-5 CATEGORY B Prepare I-486, omitting date and insert in file. Type I-151, omitting entry date, place and lamination. Insert in file with 245 packet (I-357; G-153) Officer's Instructions: clo Retired 6/26/95 JC. DISTRIBUTE (If Checked) : 1-151 Issued T-181 to State Dept. I-181 to Consulate AT I-181 to Sel. Serv. nate. OR This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this sheet on top of all material in file until initial decision is made GPO 946-883 Form I-468 (Rev. 11-1-70) RS"
}