{
	"anumber": "A21773532",
	"id": "A21773532_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21773532_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 773 532"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "IMPORTANT: PLEASE READ INSTRUCTIONS ON BACK OF PAGE ONE BEFORE FILLING OUT MEMORANDUM U.S. GOVERNMENT PRINTING OFFICE: 1974-535-200 bw UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place white NYC 245 File No. A21 773 532 Status as a lawful permanent resident of the Unifed States is accorded: Name SEX DATE OF BIRTH Parvati Devi Shukla Street F 8/21/05 3223 Gomer Street Address PLACE OF BIRTH City, State, Zip York town, N.Y. 10508 / 10598 Bilga, India NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India PRIORITY DATE Immediate Relative - o REMARKS NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session x Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 3 As of 17.376 at n yo (Other law Specify) (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission. (Insert symbol) IR-O (Applicable in all cases) DATE OF U25. APPROVED INS. RECOMMENDED BY: (Immigration Officer) (Date) ACTION I.E. Dough Q. Renda 3-17-76 DD MAR 1976 DISTRICT FOR USE BY VISA CONTROL OFFICE FAR NEW YORK, N.Y. Date Foreign State Preference Category Number Month of Issuance STATISTICS Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed Form G-153 delivered 3-10-26 CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. State Director, Selective Service (with - 59) Form - 181 (Rev. 5 - 1 - 74) N (Page 1"
}
