{
  "anumber": "A21773532",
  "id": "A21773532_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21773532_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service Processing Sheet, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Petition Form No. I-130 File No. A21773532 DATE: aug 28 1924 ATTORNEY: G-28 on File. ACTION REQUIRED: Documents Submitted: 1. Notify Attorney/Petitioner of Approval. (Check Off) Birth Pet. 2. Forward visa petition to American Consulate at: Cert. Bene. ; Marriage Pet. Cert. Bene. Parent 3. Return original documents to Attorney/Petitioner. Divorce Pet. Cert. Bene. 4. Advise Beneficiary to File I-485. Prepare G-100 for 120 days call-up. Death Cert. 5. I-485 to 245 Section with files. Natz. Pet. 6. I-156 to D D & P. Cert. 7. Place Beneficiary under Docket Control, Signature Prepare I-161, v/d to Form (Chinese) 8. I-171 D(Post Audit-Citizenship) FCO at: Photographs Pet. (Post Audit-Permanent Residence) Bene. Other 9. Return Petitioner/Beneficiary's File to Shelf. Documents, 10 Return visa petition to Attorney/Petitioner with Affidavits instruction documents. Request the following: and/or form Secondary 1-12 Evidence #17. Please mate the instructions Blood Pet. pertaining to the officiants. The person Tests Bene. making the affidant must have personal Parent knowledge of the your event berth Co your mother. far RECOMMENDATION Approve Deny Transfer example physical presence at the Out event or personal knowledge of Signature of Officer : Danary Bassin This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this sheet on top of all material in file until initial decision is made Form I-468 (Rev. 11-1-70) Ppd"
}