{
  "anumber": "A21765855",
  "id": "A21765855_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization with respect to my mother, U.S. Department of Justice Immigration and Naturalization Service"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 January 5, 1997 U.S. Department of Justice Immigration and Naturalization Service Vermont Service Center 75 Lower Welden Street St. Albans, VT 05479-0400 Mrs. Janaki V. Iyer Alien Registration Card No. A21 765 855 Dear Immigration Officer: I am necessitated to write this letter on behalf of my Mother who is already 93+ years old. I am attaching wih this letter the duly completed Form N-400 - Application for Naturlization with respect to my mother. You will kindly notice from the application that I have completed Part 12, and it was with utmost difficulty that I managed to get my mother's signature in one of the Indian languages on Part 11. Because of my mother's existing health status, it will be almost impossible for her to be able to physically visit the INS Office for any possible interviews that you might schedule for her, followed by any swearing-in ceremony. She is confined to the four walls of her apartment and her mobility is highly limited to taking care of her normal chores in a given day, more or less. Additionally, she does not speak, write or read English. Consequently, I being her son, am willing to cooperate with you to appear for any interviews if they deem to be necessary. My Mother has been a recipient of SSI benefits for more than 20+ years, and I was given to understand from the Social Security Office that my mother's benefits will be terminated effective August of this year if she is not a citizen by then. Given the above predicament surrounding my mother's situation, I would very much appreciate any assistance that you can provide to my mother with a view that she will continue to receive her SSI payments. Furthermore, any goodwill on your part to lessen any requirements - given my mother's ripe old age and mobility factor, will be certainly appreciated. A copy of my mother's Alien Registration Card is attached as per your request, as well as two (2) color photographs. Also attached is a check for $95.00. Thanking you again in advance for your kind consideration and cooperation on the above important matter. Yours sincerely, Vhh (Kris Venketachalam) P.S. Should you feel that my mother may not have the citizenship papers by August of this year, may I respectfully request of you to just send at least some formal letter which could be utilized in lieu of the actual citizenship papers, for timely presentation to the Social Security Office. Thank you. Kris Venketachalam 142-01, 41st Ave. (Apt. No. 506) Flushing, New York 11355"
}