{
	"anumber": "A21769890",
	"id": "A21769890_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21769890_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCCIONES PARA EL RECOGNICIMIENTO MEDICO"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 (VEASE AL DORSO DE ESTA PAGINA LA DIRECCION, FECHA Y HORA RESERVADA PARA SU RECONOCIMIENTO MEDICO Y ENTREVISTA) INSTRUCCIONES PARA EL RECONOCIMIENTO MEDICO Como parte de su solicitud para modificar su status a uno de residente permanente, se exige un examen fisico. Si ha cumplido usted 15 años de edad deberá obtener INMEDIATAMENTE, y traer con- sigo en el momento de presentarse al examen físico, un informe sobre los resultados de un análisis de sangre y una radiografía del tórax de 14\" por 17\" (35,50 cm. por 43 cm.) con el informe interpretativo de dicha radiografía preparado por un médico autorizado. El análisis de sangre debera hacerse en un laboratorio autorizado por el Departamento de Sanidad de un gobierno local o del Estado. La radio- grafía y el análisis de sangre para sífilis no deberán haber sido hechos más de 90 días antes de la fecha de presentación. SU EXAMEN MEDICO NO SE PODRA COMPLETAR SIN (1) UN INFORME SEROLÓGICO, (2) UNA RADIOGRAFÍA (3) LA INTERPRETACIÓN DE LA RADIOGRAFÍA. TENGA LA BONDAD DE FIJARSE TAMBIEN EN LAS CASILLAS MARCADAS X A CONTINUACIÓN EN RELACIÓN CON SU RECONOCIMIENTO MÉDICO. Sírvase obtener prontamente su informe serológico, radiografía y la interpretación de la radiografía. Usted puede llamar por tel- éfona a la oficina local o estatal del Departamento de Salud y solicitar el nombre de un laboratorio autorizado donde podrá obtener estos servicios. Sírvase traer estos documentos juntamente con copias de esta carta al presentarse a exámen ante un médico del Servicio de Salud Pública de los Estados Unidos, examen para el cual se ha concertado una cita en el lugar y fecha abajo indicados: DIRECCION: FECHA: HORA: Sírvase comunicarse inmediatamente con el médico abajo indicado o con uno de los médicos cuyos nombres aparecen en la lista adjunta. si se adjunta una lista, para 1) determinar quê medidas debera usted tomar para obtener un informe serologico, una radio- grafía y la interpretación de la radiografia antes de su examen médico, y 2) concertar una cita con el médico para hacerse el examen, el cual deberá completarse antes del NOMBRE, DIRECCION Y TELÉFONO DEL MÉDICO: Sírvase mostrar esta carta a cualquier laboratorio que haga estos examenes. Además, entregue las copias de la carta al médico que le examine, y firme su nombre en presencia del médico para que él incluya su firma en el informe. INSTRUCCIONES ACERCA DE LA ENTREVISTA DE INMIGRACION TAMBIEN SE HA CONCERTADO UNA ENTREVISTA ANTE UN FUNCIONARIO DE INMIGRACION EN: DIRECCION: FECHA: HORA: AL COMPARECER PARA ESTA ENTREVISTA, TENGA LA BONDAD DE TRAER CONSIGO LOS DOCU- MENTOS SIGUIENTES: 1. EL SOBRE SELLADO QUE LE ENTREGO EL MÉDICO QUE LLEVÓ A CABO EL RECONOCIMIENTO. 2. SU PASAPORTE Y EL FORMULARIO I-94. W I' SI USTED NO HABLA INGLES, DEBE ACOMPAÑARLO(A) UNA PERSONA DE SU SEXO QUE SIRVA COMO INTERPRETE DURANTE EL RECONOCIMIENTO MEDICO Y LA ENTREVISTA DE INMIGRACION. AVISO: EL NO PRESENTARSE A LA HORA Y FECHA INDICADAS PARA ESTAS ENTREVISTAS U OLVIDARSE LLEVAR LOS DOCUMENTOS REQUERIDOS SERA MOTIVO DE QUE SU CASO SE ATRASE. TRAIGA SU PASAPORTE Y EL FORMULARIO I-94"
}
