{
	"anumber": "A21769890",
	"id": "A21769890_0056",
	"page_index": 56,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21769890_0056/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice, Immigration & Naturalization Service California Service Center"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 U.S. DEPARTMENT OF JUSTICE IMMIGRATION & NATURALIZATION SERVICE CALIFORNIA SERVICE CENTER P.O. BOX 10400 LAGUNA NIGUEL a CA 92607-0400 N a Address of Applicant/Petitioner PADMAPRABHA P TRIVEDI Date: 2/12/97 4460 DAISY CRT MOORPARK CA 93021 File No.: 21769890 Form No.: N400 This is an initial screening only. Your application(s)/ petition(s) may be returned to you for additional information or documentation at a later date. Your application(s)/petition(s) is/are being returned to you for the following reason(s): Checks or money orders must be made payable to INS Please submit a check or money order that meets this criterion Post dated checks or money orders are not acceptable Please submit a check or money order with a current date Stale dated checks or money orders are 001 acceptable Please submit a check or money order with a current date Checks or money orders must be made payable through a United States bank Please submit a check or money order that meets this criterion. Please submit a check or money order in english Please submit a check or money order with corrected written guarantee amount. Unsigned checks or money orders are not acceptable Please submit a signed check or money order. The Service does not accept altered checks or money orders. Please submit a check or money order that meets this criterion We have boes informed that money orders drawn from \"General Money Orders or 'PAN American\" are DO longer negotiable Please resubmit with another check or money order Please complete the omitted items checked 5 red. The fee for your application(p) is incorrect. Please submit a check or money order with the correct fee. The total fe fer the application(s)/potition(s) is/are $ 95.00 Your check has been endorsed by another party. Please submit another check or money order. Legalization fees must be paid by cashier's check, money order or bank check only. Personal checks and cash are not acceptab Cashier's Checks, money orders or bank checks must br Other 02/12/1997 WAC-97-090-53970 WACRSB01 IMPORTANT NOTICE* Please put this notice on top of the application /petition (s) and return with correction (s) to the above address."
}
