{
  "anumber": "A21765855",
  "id": "A21765855_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, 4-3-R041"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1903,
        1974,
        1934,
        1892,
        2023,
        1930
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 UNITED STATES DEPAN or JUSTICE Immigration and Naturalization Service RECEIVED Form approved OMB No. 43-RO401 PETITION TO Date filed MATION Fee stamp CLASSIFY STATUS OF ALIEN RELATIVE FOR ISSUANCE OF APR 2 6 1974 IMMIGRANT VISA Immigration and Naturalization Service MeTO THE SECRETARY OF STATE: The petition was filed on 4/36/94 e.s. APPROVED INS. Remarks The petition is approved for status under section: SPOUSE, 201 (b) CHILD 203 (a) (2) DATE AUG 19 1974 201 (b) PARENT 203 (a) (4) ACTION DD DISTRICT OF NEW YORK, N.Y. 203 (a) (1) 203 (a) (5) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. I,looo Block 1. - Information About Alien Beneficiary 5X4-30-74 2. Name (Last, in CAPS) (First) (Middle) 3. Do Not Write in This Space 4. Relationship of beneficiary to petitioner IYER JANAKI VENKETACHALA A71705 855 MOTHER 5. Other names used; (including maiden name if married woman) 6. Are beneficiary and petitioner related by adoption? NO JANAKI AMMAL 7. Place of birth (Country) 8. Date of birth (Month, day, year) 9. Beneficiary's marital status: INDIA 9-18-1903 Married Widowed Divorced Single 10. Petitioner's name (Last, in CAPS) (First) (Middle) 11. Petitioner's phone 12. Has this beneficiary ever been in the U.S.? PARAMESWARAN Venketachalam 914-723-1200 Yes No. 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) PAYYAPPILLI RAMIYER VENKETACHALA IYER; 4-8-1892; INDIA 200 14. Names, birthdates and countries of birth of beneficiary's children, if any Parameswaran Venketachalam June 23,1930 India KRISHNAMURTHY VENKETACHALAM 12-1-43 Ramchandran Venketachalam May 29,1934 India INDIA 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Same as (14) above P. R. VENKETACHALA IYER 141 BRADLEY ROAD, SCARSDALE, NEW YORK 10583 16. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages c. Number of prior marriages of spouse d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) 17. If this petition is for a child, (a). Is the child married? (b) Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 18. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner P. R. VENKETACHALA IYER (FATHER) A 21-765- 853 20. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: AUG 9 FORM 1-130 RECEIVED TRANS. 1974 (REV. 1-1-73)N RE TRANS. OUT 8/16/ COMPLETED MAY 2 1974"
}