{
	"anumber": "A21769890",
	"id": "A21769890_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21769890_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization and Immigration Service Decision Notice, N-336(7)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2001]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 OF UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 300 N. Los Angeles Street Los Angeles, CA 90012 PADMAPRABHA TRIVEDI Refer to this File No. A 769 890 Prepared by: GARY TATE Date: 1-15-99 DECISION On 1-15-99 , you appeared for an examination on your Application for Naturalization, which was filed in accordance with Section 316 (a) of the Immigration and Nationality Act. Said section provides in pertinent part that [no] person, except as otherwise provided shall be naturalized, unless has resided continuously, after being lawfully admitted for permanent residence, within the United States for at least five years and during the five years immediately preceding the date of filing has been physically present therein for period totaling at least half of that time \" Pursuant to the investigation and examination on your application, it is determined that you are ineligible for naturalization at this time. Your application for naturalization was filed on 2-20-97 In the five years prior to the filing of your application, you lacked the required cumulative period(s) of over two and one-half years physical presence in the United States as you were absent from the United States during the following period(s): 1-15-95 1-30-97 A-25-83-1-21-94, 2-14-92 8-25-92 RE - ELIGIBLE 1-31-2001 You are not now eligible for naturalization under any other provisions of the Immigration and Nationality Act. This decision is made without prejudice toward the filing of a new application in the future. If you decide to request a review hearing on this decision pursuant to Section 336(a) of the Act, you must file a request for a hearing within 30 days of the date of this notice (33 days if this notice was received by mail). If no request for hearing is filed within the time allowed, this decision is final. A request for a hearing may be made to the District Director of the Immigration and Naturalization Service at the above address on Form N-336 (enclosed), Request for Hearing on a Decision in Naturalization Proceedings, under Section 336 of the Act, together with a fee of $110.00. A brief or other written statement in support of your request may be submitted with the Request for Hearing. Sincerely yours, HAND DELIVERED Many Fute GT 1-15-99 FOR Thomas J. Schiltgen Padmaprafra Treasuri District Director Enclosure Form N-336 N-335(7)"
}
