{
  "anumber": "A21765855",
  "id": "A21765855_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1979,
        1974,
        1948,
        2023,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 UNITED STATES DEPARTMENT OF JUSTICE : 1973-521-939 Immigration and Naturalization Service MAPPLECATIONIFOR STATUS AS PERMANENT RESIDENT Form Approved N.Y.C. MAIL UNIT O.M.B. No. 43-R0400 FEE STAMP File No. A21765 855 1974 SEP -4 AM 9:21 APPLICATION FOR THE BENEFITS OF SECTION: Sec. 203(a)(7) and Sec. 245, I&N Act Sec. 245 Sec. 214(d), I&N Act Sec. 249 I&N Act ng 67603(m) Sec. 13, Act of 9/11/57 ARS/8055364 (DO NOT WRITE ABOVE THIS LINE.) (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM, USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check box A, B, C, D, E. or F) A. As a refugee to whom an immigrant visa is immediately available (Section 203(a)(7) and Section 245, I&N Act). B. As a person who entered the U.S. with a visa issued to me as the fiancee or fiance of a U.S. citizen whom I married within 90 days after my entry, or as a child of such fiancee or fiance (Sec. 214(d), I&N Act). C. As a former government official, or as a member of the immediate family of such official (Section 13, Act of September 1957). D. As a person to whom an immigrant visa is immediately available, other than one described above (Section 245, I&N Act). E. As a person who has resided in the United States continuously since prior to July 1, 1924 (Section 249, I&N Act). F. As a person who has resided in the United States continuously since a date on or after July 1, 1924, but before June 30, 1948 (Section 249, I&N Act). 2. My name is (Last in capital letters) (First Name) (Middle Name) 3. Sex Iyer JANAKI VENKETACHALA Male Female 4. I reside in the United States at: (c/o) (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 5. Have you ever applied before for permanent resident 141 BRADLEY ROAD, SCARSDALE, NEW YORK 10583 status in the U.S.? Yes No 6. My alien registration number 7. I am a citizen of (Country) 8. Date of Birth (If \"Yes\", give the date and place of filing and is A 21 765 855 INDIA 9-18-1903 final disposition.) 9. Place of Birth (City or Town) (County, Province, or State) (Country) No ITM Problem TRIPPAYAR, KERALA, INDIA 10. Name as appears on nonimmigrant document (Form I-94) IYER JANAKI VENKETACHALA I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) by (Name of vessel or other means of travel) NEW YORK, N.Y. 1 9 1974 TWA 803 as a (visitor, student, crewman, parolee, etc.) B-2 my I-94 permit number is VISITOR 601792 J142286 I was was not inspected. 11. My nonimmigrant visa, number Bak was issued by the on (Month) (Day) (Year) 12 am First of only single married United States Consul at (City)(Country) CALCUTTA, INDIA / 3 1974 marrieges divorced widowed 13. I have been married ONE times, including my present marriage, if now married. (If you are now married give the following:) a. Number of times my husband or wife has been married b. Name of husband or wife (Wife give maiden name) ONCE TO ME ONLY (First tonly 1 VENKETACHALA P.R. IYER c. My husband or wife resides with me apart from me at Address (Apt. No.)(No. & Street)(Town or (Province or State) (Country) 14. a. I have 6 sons or daughters as follows: (Complete all columns as to each son or daughter; if living with you state \"with me\" in last column; otherwise give city and state or country of son's or daughter's residence). Name Sex Place of Birth Date of Birth Now living at VENKETACHALAM PARAMGSWARTN QUILAN. DY 1-INDIA 6-23-30- \"WITH ME\" AT SCARSDALENY VENKETACHALAM KRISHNAMURTHY M-QUILANDY. INDIA -12-1-43- MONTREAL, CANADA VENKETACHALAM RAMCHANDRAN PALLAM-INDIA 5-29-34 CALCUTTA, INDIA MRS KAMALAM KRISHNAN CAUVERI, INDIA 6-16-36 CALCUTTA, INDIA MRS BITAGYALAKSHHI KRISHNAN MIDONALDS 8-12-32 CALCUTTA, INDIA- MRS The MEENA following K RISHNAN QUILANDY INDIA 11-1-35 NEWYORK, USA- b. members of my family are also applying for permanentresident status: No OTHer Chridren) ( 6 only) IYER VENKETACHALA PAYYAPPILLI RAHIYER (HUSBAND) 15. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership in the United States or a foreign country, and the periods and places of such membership. (If you have never been a member of any organization, state \"None\".) NONE SEP UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service RECEIVED TRANS. IN RET'D-TRANS. 1979 OUT COMPLETED Form I-485 (Rev. 11-1-73) (Page 1)"
}