{
  "anumber": "A21772021",
  "id": "A21772021_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21772021_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit, I-225B"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1956,
        2023,
        1944,
        1920
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 18/1/2023 J. S. GOVERNMENT PRINTING OFFICE 1974-560-241 Form I-215B UNITED STATES DEPARTMENT OF JUSTICE (Rev. 9-1-72) Y IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT IN AFFIDAVIT FORM Plan AFFIDAVIT A2177204 IN RE: LACHHAM, SINGH FILE NO. A2272020 EXECUTED the following AT 20 officer w of Brooking the U.S. Immigration nyr Naturalization DATE Service: march 13, 1975 Before and in the Punjabi language. Interpreter Bhagwan SINGH 1 CHAWLA used. I, PIAR+LACHHAMI SINGH , acknowledge that the above-named officer has identified himself to me as an officer of the United States Immigration and Naturalization Service, authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He has informed me that he desires to take my sworn statement regarding: our, applicalipn to our play to that of perhament He has told me that my statement must be freely and voluntarily given and has advised me of these rights: \"You have the right to remain silent. Anything you say can be used against you in court, or in any immigration or administrative proceeding. You have the right to talk to a lawyer for advice before we ask you any questions and to have him with you during questioning. If you cannot afford a lawyer, one will be appointed for you before any questioning if you wish. If you decide to answer questions now without a lawyer present, you will still have the right to stop answering at any time. You also have the right to stop answering at any time until you talk to a lawyer.\" I am willing to make a statement without anyone else being present. I swear that I will tell the truth, the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: we went with our son to the american Consul to ablow our visitors visas we told the consul we wished to visit austrus to the Amendan Consul with us was a permanent sons and their family in the us. Our son who owenl resident the us. who had come to India had for vacation of we had round tup tickets and all intentions of returning to India. until Defear Singh t was a teacher in pakistan from 1920 1944 then tought in India until 1956 Iwas under Instruct board + not under the government and employees velive a pension my shouse did not receive any pension only government never"
}