{
	"anumber": "A21772021",
	"id": "A21772021_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21772021_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A21 772 021"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 LR UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 2 MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place NYC- 245 File No. A21 772 021 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH PIAR SINGH Male Street 4/1/01 147-10 41st Avenue #6K PLACE OF BIRTH Address Flushing, N.Y. Aaj 11355 abbucation we City, State, Zip PAKISTAN abbucaup cobl 10 NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) INDIA of VOLICE MPSU we was opia PRIORITY DATE PAKISTAN Z-2 (NP-1) NON-PREF. 6/13/74 REMARKS It IUS A120 OU (3) OI. OL NONPREFERENCE: Section 212(a)(14) certification not required because: Plock ou Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act OL Ma? DOUBLELELGUCE ouce Private Law no. of the Sec 244( )( ) of the & N Act Sec 1 of the Act of 11/2/66 Congress session OU jop accebied OL p aux Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 mas OL (v) we blow 1012 As of 4 go (3) (Other law Specify) at (Month) (Day) (Year) my PORT OF ENTRY FOR PERMANENT RESIDENCE we Class of admission. (Insert symbol) 2.2 OL (NP Also APPROVED (Applicable in all cases) ice the gate ou DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION abbicaus the nuger 4/9/78 we MOLILA APRO 7 1975 Ray Lear DD DISTRICT our the FOR USE BY VISA CONTROL OFFICE Lednifeq 10 Date COUILOI 20 NOV 1974 au 250 Declarant Pakistan Lednile Foreign State au with allabat.co auq bjaceq Preference Category Dayuperice CORG2 12 10 the excebt OL 342 DEIMSGU LUG OL live 32 Number DECEMBER DILECIOL of the BLOWER Month of Issuance blaced ancy the 4. 07. '75 LG- pecower APRIL STATISTICS 62 Signed (Visa Office, Dept. of State) nuger of we Act of Form 1-357 delivered Form 1-151 delivered Form 1-151 mailed UOI Form G-153 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of Immigrant visa number. AUG 2 State Director, Selective Service (with I - 59) Form I - - 181 (Rev. 5-1 - 74) N (Page 1)"
}
