{
  "anumber": "A21765855",
  "id": "A21765855_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21765855_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information about your residences and employment., N-4 ( (07/17/91)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/1/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever IS less. Begin with your current address. If you need more space, continue on separate paper: Dates (month/day/year) Street Number and Name, City, State, Country, and Zip Code From To 142-01, 41st Ave. Apt No. 506, Flushing, New york 11355 March 1982 Present B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write \"None\" If you need more space, continue on separate paper. \"NONE\" Employer's Name Employer's Address Dates Employed (month/day/year) Occupation/position Street Name and Number City. State and ZIP Code From To not Afflicable Part 5. Information about your marital history. A. Total number of times you have been married / If you are now married, complete the following regarding your husband or wife. Family name Given name Middle initial Address Date of birth Country of birth Citizenship (month/day/year) Social A# (if applicable) Immigration status Security# (If not a U.S. citizen) Naturalization (If applicable) (month/day/year) Place (City, State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. B. Total Number of Children 8 . Complete the following information for each of your children. If the child lives with you, state \"with me\" in the address column; otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" III the address column. If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address V. RAJAMMAL 10/13/19 INDIA INDIAN MADRAS, INDIA V. THAILAMBAL 01/30/22 INDIA INDIAN COIMBATORE, INDIA 35 stonhouse Road V. PARAMESWARAN 06/21/30 INDIA U-S. Scarsdale, Newyork 10583 149-05, 79 th Ave Me.410 BAGIYAM KRISHNAN 09/05/32 INDIA U.S. Flushing New york 11367 V. RAMCHANDRAN 05/29/34 INDIA INDIAN FOIA (b)(6) 133 Beech, 128 th st. Bell Harley New-york MEENA KRISHNAN 11/01/35 INDIA U.S. 901 Calory Point circle ALt-204 Pemback Pines, Florida 33026 KAMALAM KRISHNAN 06/16/36 INDIA INDIAN CALCUTTA, INDIA KRIS VENKETACHALAM 12/01/13 INDIA INDIAN FOIA (b) (6) 142-01, 41stAVe. Apt 506 Form N-400 (Rev 07/17/91)N Continued on next page Flushing, New york 11355"
}