{
	"anumber": "A21772021",
	"id": "A21772021_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21772021_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Privacy Act Information Request ( (INS Form G-657), Privacy Act of 1974, with certain exceptions,"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 PRIVACY ACT INFORMATION REQUEST (INS Form G-657) Instructions The Privacy Act of 1974, with certain exceptions, permits an individual (United States citizen or permanent resident alien) to gain access to information pertaining to him in federal agency records, to have a copy made of all or any part thereof, and to correct or amend such records; to permit an individual to prevent records pertaining to him from being used or made available to another person without his consent; and to permit an individual to determine what records pertaining to him are collected, maintained, used or disseminated. Requests may be submitted in person or in writing. If an application is mailed, the envelope should be clearly marked \"Privacy Act Information Request\". 1. Description of Request. The information in Section 1 of Form G-657 is needed to identify the requester, the records desired, and the individual to whom the record pertains. In order to identify the records desired, the request should include, name used at time of entry into U.S.; date and place of entry into U.S. and if record is of naturalization or citizenship, name used on naturalization or citizenship certificate; certificate number, date naturalized or date citizenship certificate issued; name and location of naturaliza- tion court or location of immigration office issuing certificate of citizenship. Failure to provide complete information may result in a delay in processing. 2. Identification of Requester. A. Individual. An individual appearing in person may identify himself by showing a document bearing a photograph (such as an Alien Registration Card. Form I-151, Citizen Identification Card, Form I-197, Naturalization Certificate, or passport); or two items which bear his name and address (such as driver's license or credit card). By mail, an individual shall identify himself by signature, address, date and place of birth, alien or employee identification number (if any), and one other identifier such as a photocopy of a document bearing name, address, and signature. If the above-mentioned identification is not available, Form G-652, Privacy Act Affidavit of Identity, or similar Department of Justice form may be used. B. Guardians. Parents or legal guardians must establish their own identity as parents or legal guardians and the identity of the child or other person being represented. C. Accompanying Persons. An individual seeking to review records about himself may be accompanied by another individual of his own choosing. Both the individual seeking access and the individual accompanying him shall be required to sign the required authorization on Form G-657. 3. Authorization or Consent. Other parties requesting information about an individual usually must have the consent of that individual. Consent may be given by signature of the individual on Form G-657, or by authorization letter, together with appropriate identification. 4. Fees. For copies of documents, $0.10 per page may be charged, provided that the total amount is $3.00 or more. A maximum of 10 copies of each document will be supplied. If the total fees amount to more than $25.00, an advance authorization will be requested and an advance deposit of part or all of the fee may be required. 5. Appeals from Denial of Access or Refusal to Amend. Except for certain records which are not subject to amendment or correction by individuals, an individual whose request for access to the records concerning himself or request for amendment or correction of information pertaining to himself in records main- tained by the Immigration and Naturalization Service has been denied, may appeal such refusal to the Deputy Attorney General within 30 days after receipt of notification of the refusal, to the following address: Office of the Deputy Attorney General, U.S. Department of Justice, Washington, D.C. 20530. Appeals from denial of access should be marked \"Privacy Appeal--Denia of Access\" on the face of the document and on the envelope. Appeals from refusal to amend or correct should be similarly marked \"Privacy Correction Appeal.\""
}
