{
	"anumber": "A22099370",
	"id": "A22099370_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22099370_0017/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, Form Number: 1-357"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1898, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED ScreenedDbyNARAA2/10/2023 JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place EL PASO, TEXAS File No. A22 099 370 Status as a lawful permanent resident of the United States is accorded: Name SEX DATE OF BIRTH Street NGUYEN, Lam Thi Ba Female 1898 Address 700 Willow Drive PLACE OF BIRTH City, State, Zip Odessa, Texas 79763 Ha Tinh, Vietnam NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam (V6) PRIORITY DATE NA NA NA REMARKS NONPREFERENCE: Section 212(a)(14) certification not required because: Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the 1 & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 P.L.95-145 11-21-25 (Other law Specify) As of at El Paso, Tx (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) IC6 DATE U.S. APPROVED INS OF ACTION RECOMMENDED Paul BY: (Immigration happe Officer) (Date) / AUG 2 1978 2 1978 DD Charles Pay DISTRICT FOR USE BY VISA CONTROL OFFICE PASO, TEXAS Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 2)"
}
