{
	"anumber": "A22099370",
	"id": "A22099370_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22099370_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 2/10/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1898, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form Approved OMB No. 43-R0595 DEMOGRAPHIC DATA TO ACCOMPANY APPLICATION FOR CREATION OF A RECORD OF LAWFUL ADMISSION FOR AN INDOCHINA REFUGEE (PLEASE TYPE OR PRINT) 1. (Family Name, in CAPS) (First) (Middle) 2. Alien Registration Number NGUYEN Lam Thi Ba A- 22 099 370 la. Name which you were admitted to the United States (if different from above) Telephone Number Same as above (915) 337 5137 3. Date of Birth (Month) (Day) (Year) 4. City and Country of Birth 4a. Nationality 5. Male 6. Single Married 1898 Ha Tinh, Vietnam Vietnam Female Divorced Widowed 7. List all of your dependents in the United States: NONE Name and Relationship Sex Place of Birth Date of Birth Type of School/Grade Completed NONE 8. Family Name First Name Date, City and Country of Birth (If known) City and Country of Residence FATHER DO NOT REMEMBER MOTHER (Maiden name) 9. Applicant's residence last five years. List present address first. (EXCLUDE RELOCATION CAMP) From To Street and Number City Province or State Country + Month Year Month Year 700 Willow Dr. Odessa Texas USA 8 77 Present 754 Towercircle Odessa Texas USA 11 75 8 77 158/4B Cu Hiep Thang Nhut Vung Tau Vietnam 66 4 75 10. I am currently residing in: Apartment Mobile Home Condominium House Other (Specify) 11. Are you living rent free? Yes No 12. Applicant's employment last three (3) years. List present employment first. 13. Fluency in English Full name and Address of Employer Job Title Wage / Hour (Check) Poor Fair Good NONE Reading Writing Speaking 14. Last job title, ABROAD HOUSEWIFE 15. Name and Location of Schools Attended Type of School From/To Highest Grade Completed Title of Degree NA 16. To be answered only by the head of household to the best of his / her ability: Have you received any public / private assistance? Yes No If yes answer the following: Public Assistance (Source) Type From/To Dollar Amount Supplement Income Cash 1976- present $4.622,00 Private Assistance (Source) NONE (Page 5) FORM I-485 C (10-25-77)"
}
