{
	"anumber": "A22099370",
	"id": "A22099370_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22099370_0031/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEDICAL EXAMINATION OF VISA APPLICANTS, FS-398"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 PLACE DEPARTMENT STATE 270 FOREIGN SERVICE OF THE UNITED STATES OF AMERICA DATE OF EXAMINATION MEDICAL EXAMINATION OF VISA APPLICANTS 24 Sep 75 At the request of the American Consul at CITY COUNTRY I certify that on the above date I examined NAME AGE SEX NGUYEN THI BA LAM 77 F WHO BEARS PASSPORT NO. ISSUED BY ON 9290065 I examined specifically for evidence of any of the following conditions: CLASS A: A22099370 DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Refeitions accurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Psychopathic personality Chronic alcoholism Insanity Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious It Degree of Permanent in Nature 284 Amounting to a Substantial Departure from SEWARA NONED HDAIT small Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, B, or C - diagnosis, and pertinent details*): PAROLED until: Inder Purpose: Refuse (Port) (Date) (Officer) e 11-21-75 DAIL Chest X-ray report Postove - mild cordiomeyally Tortunus calified Thomacic aorta - saging can't Rule out thouse aortie oneurysm from Dr. Blood serological report RPR N/R from Round HOAIT Other special report(s) (when needcare rs Bruno Eisen, COL, MC from Dr. SIGNATURE OF MEDICAL ADVISOR TITLE DATE OF FINAL REPORT Ft Chaffee AR 72901 Oct 16,75 FORM FS-398 *Continue on reverse side if necessary. 10-74"
}
