{
	"anumber": "A22106234",
	"id": "A22106234_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22106234_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A22 106 234"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 7/31/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Servi MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Boston, Mass. File No. A22 106 234 Status as a lawful permanent resident of the United States is accorded: Aug. 12, 1976 SEX DATE OF BIRTH Name Ashrita Zahoor Masih Street F 02-08-10 8 Burning Tree Road PLACE OF BIRTH Address Natick, Mass. 01760 City, State, Zip India NATIONALITY COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) India PRIORITY DATE India Nonpreference 06-30-76 REMARKS NONPREFERENCE: Section 212(a)(14) certification not required because: Will not enter the labor market. Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification issued under the following provision of law: Sec 203(h) of the I & N Act Sec 249 of the I & N Act Sec 214(d) I & N Act Private Law no. of the Sec 244( )( ) of the I & N Act Sec 1 of the Act of 11/2/66 Congress session Sec 245 of the I & N Act Sec 13 of the Act of 9/11/57 (Other law Specify) As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert symbol) (Applicable in all cases) DATE OF RECOMMENDED BY: (Immigration Officer) (Date) ACTION DD DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Form 1-357 delivered Form G-153 delivered Form 1-151 Serial No. mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. State Director, Selective Service (with 1 -59) Form 1 . 181 (Rev. 4 1 - 75)Y (Page 3)"
}
