{
	"anumber": "A22106234",
	"id": "A22106234_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22106234_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FOIA ( (b)(6), FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 6. (To be filled in, if appropria , That I have previously submitted affidavit(s) of pport for the following per- FOIA (b)(6) 7. (To be filled in, if appropriate.) That I have submitted visa petiton(s) to the Immigration and Naturalization Service, on behalf of the following person(s): Name Relationship Date submitted MRS A.Z. MASH MOTHER 1973, AND 1976 8. That I am willing and able to receive, maintain, and support the person(s) listed in item 3 above. That I am ready and willing to deposit a bond, if necessary, with the Immigration and Naturalization Service to guarantee that such person(s) will not become public charges during their stay in the United States, or that they will maintain their nonimmigrant status if admitted temporarily and will depart prior to the expiration of their authorized stay in the United States. 9. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become public charges in the United States. 10. (Complete this block only if the person(s) named in item 3 will be in the U.S. temporarily.) That I do intend, do not intend, to make specific contributions to the support of the person(s) listed in item 3 above. (If you checked \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly and for how long.) 11. That my reasons for signing this affidavit are: SHE IS A RETIRED WIDOW WITH NONE TO TAKE CARE OF HER IN INDIA, SUPPORTED IN FULL BY ME FOR PAST 16YEARS. I AM PERSONALLY RESPONSIBLE FOR HER WELFARE TILL HER DEATH. HER CONSTANT PRESENCE WITH US IS OF MUTUAL BENEFIT TO EACH MEMBER OF THE FAMILY Signature of person preparing form, if other than deponent EXECUTION OF AFFIDAVIT. You must sign the affidavit in your full, true, and correct name and affirm or make it under oath. I declare that this document was prepared by me at the In the United States the affidavit may be sworn to or affirmed request of the deponent and is based on all information before an immigration officer without the payment of fee, or be- of which I have any fore a notary public or other officer authorized to administer SIGNATURE FOIA (b)(6) oaths for general purposes, in which case the official seal or certificate of authority to administer oaths must be affixed. Address: 8 BURNING TREE Date: Outside the United States the affidavit must be sworn to or affirmed before a United States consular or immigration officer. NATICK, MASS 01760 JUNE 1976 SUBSCRIBED AND SWORN TO BEFORE ME THIS 30th day of June A.D. 19 76 Button, smoot (Signature of deponent) mass at Mae (Signature of officer) Barky Contact (Title of officer) Rep U.S. GOVERNMENT PRINTING OFFICE c70-16-83520-1 GPO 958-060"
}
