{
	"anumber": "A22106234",
	"id": "A22106234_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22106234_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325A ( (REV. 10-1-74) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['none']"
			},
			"nationality": {
				"nationality_llm_v1": "Indian"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 FORM G-325A (REV. 10-1-74) Y Form Approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. MASIH ASHRITA ZAHOOR FEMALE 02/08/1910 INDIAN (If any) A 22106234 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. BILASPUR, INDIA (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE ADAM INDIA PENDRA RD. INDIA FATHER MOTHER (Maiden name) HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE NONE FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 8 BURNING TREE ROAD NATICK MASS USA 03 76 PRESENT TIME PENDRA ROAD, JYOTIPUR BILASPUR, M.P. INDIA. 02 10 03 76 5240 STANTON AVE PITTSBURGH PA USA 04 14 05 74 226 MICHENER PARK EDMONTON ALBERTA, CANADA 05 74 07 -74 5240 STANTON AVE PITTSBURGH PA. USA 07 74 08 74 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR JYOTIPUR PENDRA RD. BILASPUR, M.P INDIA 08 74 0376 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME NONE RETIRED, COMPLETELY SUPPORTED BY My TWO SONS , IN USA, FOR PAST 16 YEARS Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE INATURALIZATION ADJUSTMENT OF STATUS Ashrita Zahoor masib 06/29/76 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes 3152 HERE PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}
