{
	"anumber": "A22106234",
	"id": "A22106234_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22106234_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration Visa File of Mrs. A. Z. Masih"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1974, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 8 Burning Tree Road Natick, Mass. 01760 U.S.A. June 24, 1976 U.S. Dept. offusture Consulate General of the United States of America J.F.K. Building INS Post Office Box 160 Halifax, Nova Scotia government center Canada Boston. Mass 02203 Re: Immigration Visa File of Mrs. A. Z. Masih Dear Sir: Your retter addressed to my mother, Mrs A. Z. Masih, along with the form FS 497 A has just come to my attention. A\\copy of your memo and the completed form are enclosed I wish to present a few facts concerning my mother's application which may be helpful in assessing her case. They are as follows: 1. I and my younger brother Silas of Pittsburgh, PA are the only sons and among the close living relatives to my mother, who is a retired widow. 2. We brothers are totally responsible for her personal, financial, and social needs and have been for the last 16 years. 3. We brothers and our families are alien residents of the U.S.A. 4. There are no close relatives in India who could take personal care of our widowed mother. 5. Realizing the mental torture and lonliness faced by our mother due to our absence from her, we filed an immigration petition (FS-496 plus DSP-70 and DSL-869) at the U.S. Consulate General in Calgary in April 1974. 6. My mother was personally interviewed by the U.S. Consulate General in Calgary and her fingerprints were taken and a $25 fee was collected."
}
