{
  "anumber": "A22497006",
  "id": "A22497006_0083",
  "page_index": 83,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0083/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2025
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "by NARA, 10/0/2025 (Please tear off this sheet before submitting Affidavit) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service AFFIDAVIT OF SUPPORT INSTRUCTIONS NATURE OF SUPPORTING EVIDENCE TO BE SUBMITTED. - The deponent should submit in duplicate evidence of income and resources, as appropriate: 1. Statement from an officer of the bank or other financial institution in which you have deposits giving the following details regarding your account: (1) Date account opened. (2) Total amount deposited for past year. (3) Present balance. 2. Statement of your employer, preferably on his business stationery, showing: (1) Date and nature of employment. (2) Salary paid. (3) Whether position is temporary or permanent. 3. If self-employed: (1) Copy of last income tax return filed or, (2) Report of commercial rating concern. 4. List containing serial numbers and denominations of bonds and name of record owner(s). The authority for the collection of the information requested on this form is contained in 8 U.S.C. 1182(a)(15), 1184(a), and 1258. The information will be used principally by the Service, or by any consular officer to whom it may be furnished, to support an alien's application for benefits under the Immigration and Nationality Act and specifically his assertion that he has adequate means of financial support and will not become a public charge. Submission of the information is voluntary. It may also, as a matter of routine use, be disclosed to other federal, state, local and foreign law enforcement and regulatory agencies, including the Department of State, the Department of Defense and any component thereof (if the deponent has served or is serving in the armed forces of the United States), the Central Intelligence Agency, and individuals and organizations during the course of any investigation to elicit further information required to carry out Service functions. Failure to provide the information may result in the denial of the alien's application for visa or his exclusion from the United States. Form I-134 (Rev. 3-1-76)N"
}