{
	"anumber": "A22428908",
	"id": "A22428908_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22428908_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Surety Insurance Company of California Power of Attorney, I-356"
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1980, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Surety Insurance Company of California POWER OF ATTORNEY HOME OFFICE MAILING ADDRESS: BOX 2430 LA HABRA, CALIFORNIA 90631 JESS ITEMORES OR: ITEM 2 ITEM 3 ITEM 4 AUTHORITY FOR: Not Valid For Not Valid If POWER NUMBER Bond In Excess Of Date Issued Used After ALBERT T. RAMIREZ 2,500.00 3 07 77 31 78 7-97784 TO ACT AS ATTORNEY-IN-FACT KNOW ALL MEN BY THESE PRESENTS: That the SURETY INSURANCE COMPANY OF CALIFORNIA has made, constituted and appointed, and by these presents does make, constitute and appoint the person whose name is set forth in item (1) above its true and lawful Attorney-In-Fact for it and in its name, place and stead, to execute, seal and deliver for and on its behalf and as its act and deed, as surety, an IMMIGRATION BOND on behalf of Mariano GALLEGOS-Rodriguez To be given to United States Immigration & Naturalization Service Court Provided: (A) That the authority of such Attorney-In-Fact to bind the company shall not exceed the sum set forth in item (2) above, and (B) That the Power of Attorney is used on or before the date set forth in item (4) above, and (C) That this Power of Attorney is filed with the bond and retained as a part of the court record. (D) That this Power of Attorney is void if more than one (1) Power of Attorney has been attached to any one bond. The said Attorney-In-Fact is hereby authorized to insert in this Power of Attorney the court and the name of the person on whose behalf this bond was given. This Power of Attorney can be used only for an Appearance Bond and cannot be used for any bond which can be construed as being a bond to guarantee for failure to provide payments, back alimony payments, FINES, or Wage Loss Claims. THIS POWER VOID IF ALTERED OR ERASED AND CAN ONLY BE USED ONCE. IN WITNESS WHEREOF, THE SURETY INSURANCE COMPANY OF CALIFORNIA has caused these presents to be signed by its duly authorized officer, proper for the prupose and its corporate seal to be hereunto affixed on the 20th day of August, 1976. SURETY INSURANCE COMPANY OF CALIFORNIA INCORPORATED By: STATE OF CALIFORNIA COUNTY OF ORANGE Johnst President memee On the 20th day of August, 1976 before me, a Notary Public of the State of California in and for the County of Orange duly commissioned and qualified came JOHN F. MERRILL of SURETY INSURANCE COMPANY OF CALIFORNIA, to me personally known to be the individual and officer described in, and who executed the preceding instrument and acknowledged the execution of the same, and being by me duly sworn, deposed and said that he is the officer of the said Company aforesaid and that the seal affixed to the preceding instrument is the Corporate Seal of said Company, and the said Corporate Seal and his signature as officer were duly affixed and subscribed to the said instrument by the authority and direction of the said Corporation, pursuant to the following By-Law adopted April 9, 1969, and now in force, to wit: \"Article IV Section 7(b) The President shall have power and authority to appoint Attorneys-In-Fact, and authorize them to execute, on behalf of the Company, bonds and undertakings, contracts of indemnity, and other writings obligatory in the nature thereof, and he may at any time in his judgment remove any such appointees and revoke the authority given to them.\" IN TESTIMONY WHEREOF, I have hereunto set my hand and affixed my officeal seal on the day and year set forth above. OFFICIAL SEAL ELIZABETH J. WILLIAMS By: Eoligabech Williams NOTARY PUBLIC - CALIFORNIA Notary Public ORANGE COUNTY CALIFORNIA My comm. expires APR 12, 1980 I-356 sent 11-1-82 c/o w/o obliga Page 2"
}
