{
	"anumber": "A22497006",
	"id": "A22497006_0090",
	"page_index": 90,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0090/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Texiguat, Departament El Paraíso, # 1726360"
		},
		"years": {
			"ms_years_nlp_v1": [1919, 1910, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "# 1726360 The undersigned Municipal Secretary for the Town of Texiguat, Departament El Paraiso: Certifies: from the Book of Births years 1910 to 1919, page 91 to 92, birth entry is found that literally says: No. 8. Maria Concepcion Flores - I.D.- At Texiguat the twentieth of December nineteen twenty nine, Before me, Benito A. Gomez, Municipal Secretary and before the witnesses Mr. Florentino Mejia & Mr. Eligio R. Oyuela, of age, Married, Farmers, Mr. Monico Sanchez F. appeared, of age, Married, Farmer, Reporting that the Eighteenth Day of this Month, at 9:00 A.M. At the Home of Francisco Flores, At the Village El Zapotal of this Town a girl was born to whom they gave the name Maria Concepcion: She is the Legitimate Daughter of Francisco Flores & Maria Isabel Rubio. Paternal Grand- Parents: Ildefonso Flores & Maria Espinal, Hondurans and from this neighborhood. I read the entry to the person who declared & He found it in agreement with the declaration. He did not sign it be- cause he does not write (signed) Florencio Mejia- (S) Eligio R. Oyuela- Seal Benito A. Gomez, Secretary In agreement with the original Issued at Texiguat, May 3, 1978 Signature Signature Isidro Torres G Oscar Pineda M. Municipal Secretary Mayor I, QUININ RODRIGUEZ. being proficient in the Spanish and English languages, do hereby certify that the foregoing is an accurate translation of the original Spanish document in reference to the Birth Certificate of Maria Concepcion 2 Flores this 12th day of September 1978. Jackson Brohagy Subscribed and sworn to before me, this 12th day of September 1978. Heman Machud"
}
