{
  "anumber": "A22403471",
  "id": "A22403471_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22403471_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31-34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion TORRES Valle, Estevan M Blk Brn Med Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation MEXICO A22 403 471 64\" 154 laborer U. S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) Scars or Marks 1522 Bentley Ave., Compton, Ca. 90220 NV Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) 6/15/66 EWI POE SYS Single Married Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension Leon, Gto., Mex. A/C Birthdate Date of Action Location Code (At/Near) Date & Hour 8/3/12 3/24/77 10s COMPTON 3/24/77 City, Province (State) and Country of Birth AR Form: (Type & No.) By Lifted LEON, GTO., MEX. Not Lifted Bracamonte/Flynn Visa Issued At NIV No. Social Security Account Name Status at Entry Status When Found Estevan Go Torres EWI IN INDUSTRY Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. To: 554-74-3635 LOS over 1 year Immigration Record Criminal Record CLAIMS MANY TIMES PRIOR TO 1966 ENT Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) yo Claims None Number & Nationality of Minor Children Abgelita Carranza, Max USC Same US address 0 Father's Name, and Nationality and Address, if Known- Mother's Present and Maiden Names, Nationality, and Address, if Known Angel Torres, Mexo, deceased Virginia Valle, Mex. deceased Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 Yes No Not Listed Listed, Code ROTEN Name and Address of (Last) (Current) U.S. Employer 3100 Las Hermanas Type of Employment Salary From: To: Shelly /Anderson Compton, ca. (LI) $ 2.50 Ihr. 9/76 present Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last. entry, and elements which establish administrative and/or criminal violation. Indicate means and route of travel to interior.) NO MONEY Subject states that he is a citizen of Mexico. He states that he entered the U.S. as set forth above alone o He states that he was not smuggled. Subject states that he has a preference letter which is at his house but he is unable to contact his wife to have her bring it in. Subject states that his wife in a USC by birth. Bwhite Not Smuggled C.B. White (If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION 1cc: \"A\" File Received (subject and documents) (report of interview) from STATS Same Officer: 3/24/77 1:05 (P). M. Disposition Officer) CHT u CASE 19 at (Receiving Form 1-213 (4-1-75)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}