{
  "anumber": "A22497006",
  "id": "A22497006_0088",
  "page_index": 88,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0088/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, Form I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1978,
        1929
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 UNITED STATES DEPARTMENTO JUSTICE Form Approved Immigration and Naturalization Service PETITION TO RECEIVED OMB NO. 43-RO 401 Fee Stamp CLASSIFY STATUS QF CI MALIEN REDATIVE and PLEASE NOTE you YOU ARE THE PETITIONSEP 201978 AND YOUR RELATIVE ISSUANCE OF 101yw IS U.S. IMMIGRATION & NATURALIZATION IMMIGRANT VISA BENEFICIARY BOSTON, MASS. Bos 261284 Name of beneficiary (Last. in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Names. birthdates and countries of birth of RUBIO MARIATSABEL beneficiary's children: 4. Other names used: (including maiden name if married) / 5. Country of beneficiary's birth HONDURAS C.A (First) July (Middle) 6, 1906 6. Date of beneficiary's birth (Month, day. year) 7. My name is: (Last, in CAPS) 8. My phone number is: FLORES MARIA CONCEPCION 522-3192 9. Other names used (including maiden name if married woman) 10. Relationship of beneficiary to myself MOTHER 11. I was born: (Month) (Day) (Year) in: (Town or city) (State or Province) (Country) DEC. 18,1929 TEXIGUAT eh PARAISO HONDURAS 12 If you are a citizen of the United States. give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1)If acquired through naturalization. give name under which naturalized, number of uralization certificate. and date and place of naturalization: MARIA CONCEPCION FLORES, H 10161671 July 17,1978 2500 (2) If acquired through parentage or marriage, have you obtained a Certificate of citizenship in you own name? Breton (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with instruction 3 a (2) remped t CNE107 I'd 13. If you are a lawful permanent resident alien of the United States. give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence FOIA (b)(6) 14. Beneficiary's mantal status: 15. Name of beneficiary's spouse. if married. and date and country of birth (Omit this item if petition is for your spouse) Married Widowed Divorced Single 16 Full address of beneficiary's spouse and children. if any (Omit this 'item if petition is for your spouse) 17. If this petition is for your spouse or child. give the following: Date and place of your present marriage Names of my prior spouses Names of beneficiary's prior spouses 48. Has this beneficiary ever been in the U. S.? YES NO 19 Are beneficiary and petitioner related by adoption? YES NO (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct Signature of petitioner (See Instruction No. 5) Dave Concepaion Have Subscribed and sworn to (affirmed) before me this 19 day of Sen A.D. 1.9 18 at. Bostove Mass (SEAL) My commission expires Hissage Notary Puber (SIGNATURE OF OF FFICER ADMINISTERING OATH) (TITLE) SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of all.information of which 1 have any knowledge. Fernande (SIGNATURE) E. mm Card. (ADDRESS) Cushing Center (DATE) FORM -130 RECEIVED TRANS IN RET'D TRANS OUT COMPLETED (REV. THEN ONT processed by CAVIE 10-12-78 10-1628 JMB"
}