{
	"anumber": "A22497006",
	"id": "A22497006_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Medical Certification for Disability Excepted, OMB #1115"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/8/2023 U.S. Department of Justice !mmigration and Naturalization Service OMB #1115 Medical Certification for Disability Excepti Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please print or type information) Last Name Rubio First Name Middle Name ISAbeL Social Security Number M. Address 034-58-7074 9003 S,W. 38 st Alien Number City A022497006 MiAmi State Florida Zip Case Telephone Number 33165 Date of Birth (365)-229-4981 7/06/06 Sex Female I, Isabeh Rubico authorize (Applicant: Name) Jain Du gue to release all reievant physical and mental health information related to my medical status to the INS for the (Licensed medical doctor or licensed clinical psychologist) applying under for an exception from the English language and U.S. civics testing requirements for naturalization. purpose I submitted penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information on the form and cer and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. with it is all true and correct. I am aware that the knowing placement of false information on the any Form evide N-. Signature Date Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINIC PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U.S. history and civics applicants for an exception based on disability submit this certification form, completed by a licensed medical doctor required of applicants for naturalization. The Immigration and Naturalization Service's regulations require to licensed clinical psychologist, along with a completed application for naturalization (Form N-400). and phrases. Please answer the following questions as clearly and completely as possible, using common terminology and complete WCI : Date of your most recent examination of the applicant. May 21 15 97 2. Is this your first examination of the individual? Yes No X If yes. who is the regular attending physician? 3. Based on your examination, describe any findings of a physical or mental disability or impairment which in and/or professional U.S. medical opinion, would prevent this applicant from demonstrating knowledge of basic English languag you DSM history and civics. Describe in detail. If applicant has a mental disability or impairment, please provic diagnosis. Senile Dementia: unable to learn any new material. Severe COPD: This is a chronic lung condition which impedes her of to much ambulation."
}
