{
	"anumber": "A22497006",
	"id": "A22497006_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "YOUR REQUEST FOR MEDICAL DISABILITY EXCEPTION REVIEW"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2000]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/8/2023 U.S. Department of Justice Immigration and Naturalization Service JAN 13 2000 DATE: ISABEL RUBIO 9003 SW 38 STREET A-NUMBER: 22 497 006 DOB: 06-Jul-06 MIAMI, Fl. 33165 SUBJECT: YOUR REQUEST FOR MEDICAL DISABILITY EXCEPTION REVIEW Dear ISABEL RUBIO You submitted a request for a disability exception, which the Immigration and Naturalization Service (\"Service\") determined was insufficient to establish your eligibility for an exception from the English language and/or Civics requirements of section 312 of the Immigration and Nationality Act (INA), 8 U.S.C. ยง 1423(b). Pursuant to a Settlement Agreement in Campos v.INS, the Service is providing you with another opportunity to establish that you meet the requirements for a disability exception under section 312(b). Please have an authorized medical professional read the enclosed information sheet, complete the attached N-648, and return the Form N-648 to the following address, within 120 days from the date of this notice: U.S. INS. Attn: MEDICAL P.O. Box 311027 Miami, FL 33231-1027 Upon receipt of your completed N-648, the Service will review the N-648 and notify you regarding any further action on your application for naturalization. Unless you are informed otherwise, it is not necessary for you to reapply for naturalization, even if you were previously denied. If your N-648 is accepted, your case will be reopened if necessary. Please note that the Service may release information regarding your current address, A-number, and other identifying information to counsel representing class members affected by the Settlement Agreement. IF YOU DO NOT WISH TO HAVE THIS INFORMATION RELEASED, PLEASE CHECK THE BOX BELOW AND SIGN ON THE NOTED LINE, AND RETURN THIS LETTER TO THE ADDRESS NOTED ABOVE. Sincerely Com also Robert Wallis District Director I do not authorize release of any information contained in my records or pertaining to my request for review of the Form N-648, Medical Certification for Disability Exceptions. Signature Date"
}
