{
	"anumber": "A22497006",
	"id": "A22497006_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0022/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (Rev 07/17/91)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/8/2023 U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. 55/15 Returned Receipt Family Name RUBIO Given Name Isabel Middle Initial 7 U.S. Mailing Address - Care of Resubmitted Street Number and Name 9003 S. W 38 St Apt. City MIAMI County DADE State ZIP FLA. 33165 Reloc Sent Code Date of Birth (month/day/year) 7-6-06 V of Country Birth HONDU. Social A Security 034-58-7074 022497006 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 01-31-79 SA1\\BOST Citizenship HONDUREAN 954C Name on alien registration card (if different than in Part 1) Rubio, Isabel MARIA Other names used since you became a permanent resident (including maidennname) '96 Sex Male Height Marital Status: Single CLUB Divorced Female 5'3 Married Widowed Can you speak, read and write English ? No Yes. Absence from the U.S.: Qualify (55-15) Action Have you been absent from the U.S. since becoming a permanent resident? No Yes If you answered \"Yes\" , complete the following Begin with your most recent absence If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip 7/25/91 8/29/91 Yes No Honduras Family Visit. 3/89 4/28/89 Yes No HONDUra Family Visit To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}
