{
  "anumber": "A22497006",
  "id": "A22497006_0092",
  "page_index": 92,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0092/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, I-485 ( (245)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Petition Form No. I-485 (245) File No. CHECK ONE SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203(a) ) NONFREFERENCE 203 (3) (8) DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If checked) (If Checked) Date Date Mailed B/C Medical 1.16 Delay Notice XXXXXXXXXXXXXXXXXX M/C Interview 11:15 I-181 to State Photos Rescheduled G-325A Sheet #1 Support Medical 11-27-78 2 I-508 Interview 3 I-88 4 Other Consulates: (Location) CATEGORY A Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY B- Prepare I-486, omitting date and insert in file. Type I-151, omitting entry date, place and lamination. Insert in file with 245 packet (I-357; G-153). OFFICER'S INSTRUCTIONS: Daughter (marin C Flores, use) is her support Daughter make 100/mc and shares a 1300 bank act at her own daughter. No health coverage HOLD XI-134's 01/16/29 BOS 2) evidence of med coverage sef DISTRIBUTE (If Checked): OK to issue I-151, by mail I-181 to State Dept. XXXXXXXXXXXXXX I-181 to Consulate st see affidants f letters of employment I-181 to Sel. Serv. XXXXXXXXXXXXXX 01/31/79 BOS, JEJ This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this about on top of all material in file until Initial decision is made Form I-468 (Rev. 11-1-70)"
}