{
	"anumber": "A22497006",
	"id": "A22497006_0058",
	"page_index": 58,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22497006_0058/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Department of Justice Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1991, 2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/8/2023 Department of Jus e Immigration and Naturalization Service 77 S.E. 5th St. Miami, Fl. 33131 Request That Applicant For Naturalization Appear for Interview 22491006 esabel Rubio Alien Registration no: Date: 16 July 1997 Your application for naturalization and request for medical exception has been reviewed and the medical exception has not been approved. You will be required to satisfy the English and Civics requirement of the INA. You are required to return for an examination on your application for naturalization, on the below date and time. Please bring this letter with you. Please come to: IMMIGRATION & NATURALIZATION SERVICE ON: 23 July 1997 77 S.E. 5TH STREET 2ND FLOOR AT: 12 30 pm MIAMI, FLORIDA 33131 EXAMINER M2 If for any reason you cannot keep this appointment, return this letter prior to your appointment with your explanation and a request for a new appointment; otherwise, your application will be denied pursuant to 3 CFR 335.7. You will be tested on your knowledge of the government of the United States and its history. You may also be tested 00 reading writing, and your ability to speak English. YOU MUST BRING WITH YOU: This letter Alien registration Receipt Card * All Passports * Completed N-648 form by licensed medical doctor, or licensed clinicai psychologist. * Complete list of trips outside of the U.S. from 1991 to the present * Proof of continuous residence and physical presence in the U.S. from 1991 to the present. * If you were ever arrested also include Certified copies of the Arrest Report. the information or indictment, the judgment, and the sentence for every arrest. including probation orders and evidence of completion of sentences. (Claims of no record. must be certified by the Clerk of Court in both the felony and misdemeanors division in the county of arrest. Sealed records must be reopened.) Please keep this appointment. even if you do not have all the items indicated above."
}
