{
	"anumber": "A23028731",
	"id": "A23028731_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support, Form 1-134 ( (Rev. 5-31-72)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS; FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, EDILBERTO ORTIZ-Rodriguez , residing at 14732 ERWIN STREET, APT 4 (Name) (Street and number) VAN NUYS CALIFORNIA 91411 U.S.A. (City) (State) (ZIP Code, il in U.S.) (Country) being duly swom depose and say: 1. I was born on Oct. 15,1936 HALACHO, YUCATAN, MEXICO so, answer either a, b or c, as appro- (Date) (City) (Country) priate, if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number FOIA (b)(6) 2. That I am 42 years of age and have resided in the United States since FEB. 23, 1969 3. That this affidavit is executed in behalf of the following person(s) at present residing at 14732 ERWIN ST., APT. 4, VAN NUYS, CALIFORNIA 91411 MARRIED OR RELATIONSHIP TO NAME SEX AGE COUNTRY OF BIRTH SINGLE DEPONENT PRISCILIANA PAREDES FERNANDEZ F. 63 MEXICO MARRIED MOTHER-IN-LAW 4. (Amounts shown in answer to this question must be in United States dollars.) ROWE FURNITURE CORP. (a) That I am employed as, or engaged in the business of FOREMAN with (Name of concern) 12840 BRADLEY AVE SYLMAR, CA. 91342 at and derive a net annual income of $ 13,000 (b) That I have on deposit in savings (Address) banks in this country $1,500.- (c) That I have other personal property, the reasonable value of which is $15,000. - (d) That I have stocks and bonds in the amount of $ XXX , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at XXXX valued at $ XXX , with mortgages or other encumbrances there- on amounting to $ XXX (f) That I have life insurance in the sum of $ XXX , cash surrender value of $ XXX (g) That if self-employed, I attach a copy of my last income tax return or report of commer- cial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See reverse side for nature of evidence of net worth to be submitted) 5. That the following persons are dependent upon me for support: (Place a check in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) WHOLLY PARTIALLY NAME OF PERSON AGE RELATIONSHIP TO ME DEPENDENT DEPENDENT FOIA (b)(6) Form 1-134 (Rev. 5-31-72) N"
}
