{
	"anumber": "A23028731",
	"id": "A23028731_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Matrimony of Edilberto Ortiz Rodriguez and Miss Delta Maria Fernandez Paredes"
		},
		"years": {
			"ms_years_nlp_v1": [1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "In the name of the Republic of Mexico and as Officer of the Civil State of this city, I state to those concerned and sertify that in Page 10 back of Book 96 of Matrimonies, corresponding to the year 1959; that e- xists in this Office under my charge, a certificate is entered as fol- lows: At Margin: Number 10 - Matrimony of Edilberto Ortiz Rodriguez, 22 yrs. of age, with Delta Maria Fernandez Paredes, 19 yrs. of age, Rights: 10 pesos, Recipt No. 115, At center. In Villa de Halacho, the 14 days of the month of Feberuary 1959, being the 11 hours, before me Ruperto Pavon Calderon, Officer of the Civil Registrar of this city, and this jurisdic- tion, appeared the citizen: Edilberto Ortiz Rodriguez and Miss Delta Ma- ria Fernandez Paredes, who manifested to be single, Mexican Nationality. The first 22 yrs, of age, carpenter, native and naeighbor of this city, address in house number 96 of Street 21 of the same, son of Sergio Ortiz Alozno, neighbor of Merida and Lilia Rodriguez deceased. The second 19 yrs. of age, her sex occupation labor, native and neighbor of this city, address in house number 106 of Street 21 of the same, daughter of Amado Fernandez Almeida, who is present and conscious of this act and Priscili- ana Paredes of this neighborhood, that they have the will to unite in Ma trimony, that they celebrate under regimen of Conjugal Society, They lack goods and debts, Each contracting Matrimony presented a Medical certifi- cate and are certain that they do not have any contagious or transferable illnesses by hereditary. Witnesses present: Andres Escalante Yah, Arese- mio Mijangos Ramos and Luis Felipe Ortiz Quintal, all married; the first 51 yrs. of age, carpenter, address in house number 96 and Street 21, the second, 41 yrs, of age, agriculturer, address in house number 98 of Street 22 and the last 36 yrs, of age, shoe repairer, address in house number 108 of Street 20 of this same city. Who manifested under protest to state truths that they know the contracting matrimony and that no legal impedi ment exist and are in aptitud to celebra te this matrimony, The subscribed Officer in view of having complied with the requirements of the Law and having the expontaneous will of the contracting matrimony. In the name of the Law and the Society, I declare perfectioned by all legal effects cor responding. In virtue and conformity with the disposed in Article 60 of the Code of the Civil Registrar, I raised this record that was read and conformed signed for constancy, the Contracting matrimony imprinted at mar- gin of this present record their finger prints in comformity with fraction 60 of the cited Article. Between Lines: Lilia Rodriguez - Ruperto Pavon"
}
