{
  "anumber": "A23028731",
  "id": "A23028731_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "En nombre de la República de México, Nº 688623"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "GENERAL DEL Ennombre de la Republicad México, DEPARTMENT SECURITY UNIDOS CIVIL y como Oficial del Estado Civil de este lugar, THE bago saber a los que la presente vieren, y certi- YUCATAN, fico ser cierto, que a la foja I56 y I57 del libro REGISTRO numero 7I de NACIMIENTOS correspondiente al DERECHOS: $ 5.00 año de I939 OVIL que existe en esta Oficina a mi Agistro de Emision cargo, se encuentra un acta del tstunr siguiente: RELACHO ruc., No. 688623 AL MARGEN: NUMERO 230. DOCIENTOS TREINTA. NACIMIENTO DE LA NIÑA DELTA MARIA FERNANDEZ, HIJA DE AMADO FERNANDEZ DE VEINTE Y SIETE AÑOS Y DE PRISCILIANA PAREDEZ DE VEINTE Y CINCO AÑOS. AL CENTRO.EN LA VILLA DE HALACHO, A LOS VEIN- TE Y SEIS DIAS DEL MES DE SEPTIEMBRE DE MIL NOVECIENTOS TREINTA Y NUEVE - AÑOS, SIENDO LAS OCHO HORAS, ANTE MI, BERNABE PAVON ESPADAS, OFICIAL DEL REGIS- TRO CIVIL DE ESTA VILLA Y SU JURISDICCION COMPARECIO EL CIUDADANO AMADO - FERNANDEZ DE VEINTE Y SIETE AÑOS DE EDAD, CASADO, ZAPATERO, NATURAL Y VECTNO DE ESTA VILLA Y DIJO: QUE EN LA CASA NUMERO CIENTO SEIS DE LA CALLE VEINTE Y UNO DE ESTA MISMA NACIO LA NINA DELTA MARIA FERNANDEZ, DIA VEINTE Y SIETE Fishad DE AGOSTO PROXIMO PASADO, A LAS OCHO HORAS, QUE ES HIJA SUYA Y DE SU ESPOSA - PRISCILIANA PAREDEZ DE VEINTE Y CINCO AÑOS DE EDAD, CASADA, COSTURERA, NATURAL Y VECINA DE ESTA VILLA, NIETA POR EL PADRE DE MARCELINO FERNANDEZ Y FILOMENA del ALMEIDA FINADOS,Y POR LA MADRE DE MANUEL PAREDEZ DE ESTA VECINDAD Y ANTONIA MANZANERO FINADA. PRESENTES LOS TESTIGOS MELECIO MIJANGOS DE TREINTA AÑOS DE Asses EDAD, CASADO, PLATERO Y AURELIO ALMEIDA DE CINCUENTA Y DOS ANOS DE EDAD, LA - BRADOR SOLTERO, AMBOS DE ESTA VECINDAD, SE LEVANTO ESTA ACTA QUE LES FUE LEI- DA Y QUEDARON CONFORMES FIRMANDO PARA CONSTANCIA. BERNABE PAVON E.-AMADO - iss FERNANDEZ. MELECIO MIJANGOS AURELIO ALMEIDA, RUBRICAS. ES COPIA FIEL DEL ORIGINAL QUE EXISTE EN EL ARCHIVO DE ESTA OFICINA Y A PE- DIMENTO DE PARTE INTERESADA EXPIDO LA PRESENTE CERTIFICACION EN HALACHO, YU- CATAN, A LOS DIEZ Y OCHO DIAS DEL MES DE MAYO DEL AÑO DE MIL NOVECIENTOS SE- TENTA Y OCHO. LA OFICIAL DEL REGISTRO CIVIL. para PAVON LOPEZ."
}