{
	"anumber": "A23028731",
	"id": "A23028731_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "La Oficial Intendencia del Resistio. Delgy Wiesn."
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "de edad, careintero domiciliado en 2a casa numero noventa Y seis de la calle veinte Y uno, el segundo de currenta Y un amos de edad. caricultor, domici- liado en 2a casa número noventa y ocho de Ice calle veinte I dos. Y e? ultimo de freinta ISEIS anos de edud, zacatero. domiciliado enla casa numero ciento ocho de Icc callE veinte de esta mis ma Villec a quienes manifestarion basio protesta de decir verdad, que conosen alos contrayentes, que no existe impedi- mento legal alguno. as que por consiguiente estan en aptitud de selebrar este Matrimonio FI 'suscrito OFicial an vista de huberse Menudo todas Y cada uno de los requisitos exisidos porta Ley, 7 habiendose serciorado de la exportance volunted de los contraventes de unirse en Matrimonio. En nombre dela Ley, Y de Ice sociedad to declare perfeccionado eard fodos los efectos legales correspondientes. En tal virtud y de conformidad can 20 dispuesto en el Articulo sesenta del Iódigo del Registro Divil, dispuse Zevantar esta actee, , que 2es SUFFER da my queducion conformes. Firmando para constancia imprimiendo los contrayen. tes at margen de Id presente. SUS buellas digitales de conformidad con 2a Fraccion sexta del citado Articulo. Entre lineas Lilice Rodriguez. Ruperto Pavon Ialderon Edilberto Oxtiz Rodriguez Delta Msc Fernandez Luis Felipe Ortiz. Amado Fernandez. Prisciliana Paredes de F. Risbricas. Es capics Fiel del Original que existe end Archivo de esta Oficina you pedimento de parte interesuda expide 2a presente Certificación en Halachi.Yuestan CI los ocho dias delmes de Ayosto del ano de mil inovecientos setenta siete La OFicial Interina dellRegistro tivil. Delgy Nieum"
}
