{
  "anumber": "A23028731",
  "id": "A23028731_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "In the Name of the Republic of Mexico and as Officer of the Civil Registrar"
    },
    "years": {
      "ms_years_nlp_v1": [
        1978,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "In the Name of the Republic of Mexico and as Officer of the Civil Registrar of the Civil State of this city, I state to those conerned and certify: That in Page 56 of Book Number One corresponding to the year 1915, that e- xist in this Office under my charg e, a certificate is entered as follows: At margin: Birth of the child PRISCILIANA PAREDES. May 31, 1915. At center. In the city of Becal, Municipal of Calkini, State of Campeche, the 15 hours of the 31st day of the month of May 1915, before me Clemente Herrera, Judge of the Civil Registrar of this locality appeared the citizen Manuel Paredes, married leather worker, native an nieghbor of this city and stated that at the 11 hours of the 25th day of the present month, in his home of this city a child who is presented alive in this office was born: PRISCILIANA PAREDES, legitimate daughter of the exponent and his wife Antonia Manzanero, occuoies her sex labors, native and neighbr of this city, Testified: this act the ci- tizens, Manuel Torres and Vicente Montero, elderly natives and neighbors of this locality. Read the present to them manifested their conformity and signed with me for constancy. Give Faith. The Judge of the Civil Registrar. Clemente Herrera (Rubrical) Is a true and exact copy of the original. In Petition of the intersted party the present Certification is issued, taken in the city of Becal, Municipal of Calkini, State of Campeche, the 22 days of the month July 1978. The Officer of the Civil Registrar Mr. Eraclio UC CH Seal: Government of the State of Campeche. SAMINEZ"
}