{
  "anumber": "A23028731",
  "id": "A23028731_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "En nombre de la República Mexicana, y como Oficial del Estado Civil de este lugar,, Nº 624713"
    },
    "years": {
      "ms_years_nlp_v1": [
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "GENERAL DEL Ennombre de la Republicade México, UNIDOS y como Oficial del Estado Civil de este lugar, hago saber a los que la presente vieren, y certi- YUCATAN fico ser cierto, que a la fojas VZauyvza del libro DEL REGISTRO numero 96. de Matrimonios correspondiente al DERECHOS $ 5.00 afo de 1959 que existe en esta Oficina a mi Registro de Entision cargo, se encuentra un acta del tenor siguiente: ARACHO, YUC., No. 624713 An Margen Numero 10. Diez Matrimonio de Edilberto Ortiz Rodriguez de veinte my dos años con Delta Maria Fernandez Paredes de diez Y nueve anos Derechos: diez pesos Recibo Ni. 115 A7 centra En 2a Villa de Halacho, a Zos cotorce dias delmes de Febrero de mil novecientes cincuenta y nueve años siendo los doc e horas, ante mi Ruperto Pavon Calderon, Oficial del. Registro Divil de stu Villa y 6w Jurisdiccion comparecieron el ciudadano Edilberto Ortiz Rodriguez, y Ice Senorita Delta Maria Fernan dez Paredes; quienes manifestaron ser softeros y de Nacionalidad Mexiccc na E7 primero de veinte of dos años deedad, carpintero, natural y vecino de esta Villa, domiciliado en la casa numero noventa y seis de lacalle veinte y uno de esta misma, hijo de Sergio Ortiz Monzo vecino de Merida, yde Lilta Rodriguez Finada La seyunda de diez y nueve años de edad, ocupa- da en las labores de su sexo, natural y vecina de esta Villa, domiciliada en la casa numero ciento seis de la catle veinte y uro de esta misma, hija de Amado Fernande t Almeida, quien se halla presente consiente en este acto, Y de Prisciliana Paredes de esta vecindud: que tienen lafirme volunted de univse on Matrimonio, que selebran bajoel regimen de socie- dad legal que caresen de bienes y deudas. Asi mismo presenta cada contrayente, un certificado Medico, en que consta que no padecen de enfermedad contagiosa 0 transmisible pay herencia. Presentes los testiyos Andres Esculante Yuh, Arsemio Mijangos Ramos, y Luis Feli pe Ortiz Quinta? ambos cusados, elprimero de cincuenta y un años"
}