{
  "anumber": "A23028731",
  "id": "A23028731_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23028731_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        1978
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['none']"
      },
      "nationality": {
        "nationality_llm_v1": "MEXICAN"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A (REV. 10-1-74) Y LOS Form Approved UNITED STATES DEPARTMENT OF JUSTICE I/C - 245 OMB No. 43-R436 Immigration and Naturalization Service BIOGRAPHIC NOW 2 7 1978 INFORMATION DATE 423028731 (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY ALIEN REGISTRATION NO. FERNANDEZ PRISCILIANA FEMALE 5/31/15 MEXICAN (If any) ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. PAREDES FERNANDEZI PRICILIANA BECAL MEXICO (If any) NONE FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE. PAREDEZ MANUEL MERIDA, MEXICO He isydead S FATHER MOTHER (Maiden name MANZANERO ANTONIA MERIDA, MEXICO She is dead HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give maiden name) HALACHO June 1937 Halacho Fernandez Amado 9/13/15 MEXICO FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 14732 Erwin Van Ny Calif. U.S 6 78 PRESENT TIME Calle 21 # 106 Halacho Yucatan Mexico 6 37 6 78 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Calle 21 # 106 Halacho Yucatan Mexico 6 37 6 78 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR NONE PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS Prisciliana Firnandez Oct. 30, 1978 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}