{
	"anumber": "A23792632",
	"id": "A23792632_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23792632_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Application Form, M-132"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/6/2023 Submit birth or baptismal certificate of Submit marriage certificate of Submit adoption decree for Submit proof of termination of marriage of Submit death certificate of Submit marriage certificate, divorce decree or other court order showing change of name. You must reside in your State for 6 months before you can apply for naturalization. Resubmit your application after Before you can apply for naturalization, you must reside in the United States for years after the date you entered for permanent residence. Resubmit your application after Your application shows you do not have the required knowledge of English. Have someone read the attached Form M-132 to you. Resubmit your application when you have learned to read and write and speak English and are ready to be examined. Submit identical, unglazed photographs taken within the last thirty days, 2 by 2 inches, on thin paper, light back., ground, showing froat view without hat, distance from top of head to point of chin approximately 116 inches. The photo- graphs may be in natural color or in black and white, but black and white photographs which have been tinted or otherwise colored are not acceptable. Machine-made photographs are not acceptable. Pohiroid photographs type 58, 667 and 668 are acceptable. Sign full name in ink on front of all photographs in the margin and not across the face or clothing. Submit naturalization or citizenship certificate of Give your Alien Registration number Submit a list of all your absences from the United States, the ports where you reentered, and the ship, plane, or other vehicle on which you traveled. Include abounces to contiguous territories. Submit evidence to show you resided in and were physically present in the United States for 10 years before the birth of your child(ren) at least s years of which were after your birthday. (SEE FOOTNOTES BELOW) Submit an English translation of the attached (SEE FOOTNOTES BELOW) Complete and return the enclosed Forms No. FOOTNOTES EVIDENCE. Evidence may consist of birth certificates, baptiemal certificates. marriage certificates, bankbooks, school records. insurance policies, receipts, licenses, letters, postal cards, employment records, Marking in city directories, membership in organizations, police records, cansus records, lesses, deeds, and any other records showing your presence in the United States during the requised period. DOCUMENTS. Any document in a foreign language must be accompanied by a translation in English. The translator must certify that he/she is compotent to translate and that the translation is accurate. If you want any original document returned to you, and If the law does not pro- hibit the making of copies, a photostatic copy of the document must accompany the original document. QPO 695-927"
}
