{
  "anumber": "A23792632",
  "id": "A23792632_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23792632_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 2/6/2023 Immigration and Naturalization Service Notice of Action SUITES en RECEIPT NUMBER CASE TYPE N400 WAC-96-240-52722 APPLICATION FOR NATURALIZATION RECEIVED,DATE PRIORITY.DATE APPLICANT A23 792 632 September 6, 1996 NGUYEN NGOI T NOTICE DATE PAGE September 9 1996 of 1 NGOI T. NGUYEN Notice Type: Receipt Notice 10242 STANFORD ST #5 GARDEN GROVE CA 92640 Amount received: $ 95.00 The above application has been received. You will be notified of the date and place of your interview when you have been scheduled at the LOS ANGELES District Office. The average processing time is Approximately 89 to 90 days. Please notify this office of any changes in your address. You can fulfill the government and history requirement prior to your naturalization interview by taking the Standardized Citizenship Test approved by INS and offered at many locations in/your community for small fee. The test takes about 30 minutes to complete. You must answer some basic questions on U.S history and government and write two simple sentences /in English. Passing this test does/not exempt you from the oral English language requirement However, at your naturalization interview with the INS you will be asked to respond in ordinary English only about information on your application. Call toll-free 1-800-755-0777 to find out where you can take the Standardized Citizenship Test prior to your interview with/the INS Please see the additional information on the back. You will be notified separately about any other cases you filed. IMMIGRATION & NATURALIZATION SERVICE CALIFORNIA SERVICE CENTER P.O. BOX 30111 LAGUNA NIGUEL CA 92607-0111 Customer Service Telephone: (714) 360-2769 Form I-797C (Rev. 09/07/93)N"
}