{
	"anumber": "A23732123",
	"id": "A23732123_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23732123_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS, 04-RO570"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved igration and Naturalization Service OMB No. 043-RO570 ee Stamp APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE CONVENIENCE OF U.S. GOV'T RECORDS TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSON TO WHOM INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED IN THE BOX BELOW: PERSON CONSENTING NAME AND ADDRESS NAME SSA UNIT LAU KONG PING LUONG STREET ADDRESS 419 S. Hill st. 5233 BALTIMORE ST CITY, STATE APT A ZIP CODE Les angeles Ca 90013 LOS ANGELES, CA 90042 SIGNATURE OF PERSON CONSENTING WONSPING KOING 1. CHECK TYPE OF VERIFICATION REQUESTED: 2. STATE PURPOSE FOR WHICH DESIRED 3. NUMBER OF COPIES DESIRED, IF ANY: AGE OR DATE OF BIRTH NATURALIZATION OR CITIZENSHIP SSI AGED 4. IF INFORMATION IS FOR GENEALOGICAL INFORMATION SOCIAL SECURITY BENEFITS, SHOW SOCIAL OTHER (CERTIFICATE OF BIRTH DATA, ETC.) SECURITY NUMBER: 586-30-2115 DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME MIDDLE NAME 6. ALIEN REGISTRATION NUMBER LUONG KONG PING A 23-732-123 permit # 067-65-06 7. OTHER NAMES USED, IF ANY 8. NAME USED AT TIME OF ENTRY INTO UNITED STATES none LUONG , PING KONG 9. PLACE OF BIRTH 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES HAI NINH, VIETNAM 8/20/09 KUALA LUMPUR 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY HONOLULU 12/13/77 NORTHWEST ORIENT GIVE THE FOLLOWING INFORMATION FOR VERIFICATION OF NATURALIZATION 15. NAME ON NATURALIZATION CERTIFICATE 16. CERTIFICATE NUMBER 17. NATURALIZATION DATE 18. ADDRESS AT TIME OF NATURALIZATION 19. NAME AND LOCATION OF NATURALIZATION COURT 20. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: DATE: 3/16/78 LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON AT NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. NATURALIZATION IN (COURT) ON (DATE) AT (LOCATION) DATE OF BIRTH 8/20/09 based on fingerprint Card filed 12/10/77 ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE UNABLE TO IDENTIFY ANY RECORD COPIES ATTACHED AS REQUESTED SIGNATURE B Capadanno Morther PQN file TITLE contact rep Approved By: DATE PRIVACY ACT IDENTITY ESTABLISHED IN PERSON IDENTIFICATION DOCUMENTS (WHEN REQUIRED) G-652 Affidavit ATTACHED OTHER (List) FORM G-641 (Rev. 4-1-76) N"
}
