{
	"anumber": "A23792632",
	"id": "A23792632_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23792632_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice for Fingerprinting,, Form G-56"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "C7 Screened by NARA 2/6/2023 UES Departmention Justice Signature Immigration and Naturalization Service 300 N.OS Angeles Street Los Angeles, CA 90012 nger the nguryen 10242 At anford St #5 FILE: A23 792 632 DATE: Garden Hrom, CA 92840 2/12/99 IMPORTANT: Please disregard this notice if you have received a notice for fingerprinting within the past sixty days or if you have already been naturalized and have received your naturalization certificate. To continue processing of your application Form N-400, INS must send your fingerprints to the Federal Bureau of Investigation for a criminal history check. You have been scheduled to be fingerprinted at the location listed below: OFFICE Application Support Center LOCATION 888 Wilshire Blvd Los Angeles, CA 90017-2602 DATE AND HOUR Hub 24 , 1999 9am ASK FOR: Fingerprinting Office REASON FOR Initial processing of your fingerprints. APPOINTMENT: The validity of your fingerprint check expired: Your fingerprints were rejected by the FBI on: BRING WITH YOU: THIS LETTER, your Alien Registration Card (if applicable), and photo identification such as passport, valid driver's license, national ID, military ID, State-issued photo ID, or other INS issued photo ID. If you do not bring this letter and proper photo identification, you will not be permitted to have your fingerprints taken. Please take note that the staff at the Application Support Center will not be able to answer any questions about the status of your application. Failure to appear may result in the denial of your application I CAN NOT APPEAR FOR THIS APPOINTMENT BECAUSE: Sincerely, Thomas J. Schiltgen SIGNATURE OF APPLICANT: DATE: District Director Form G-56"
}
