{
	"anumber": "A23792632",
	"id": "A23792632_0068",
	"page_index": 68,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23792632_0068/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEDICAL Examination of Visa Applicants, FS-398"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Malaysia"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/6/2023 M 8193. 254.28 ACHERAS TRA NSIT CAMP DEPARTMENT OF STATE KUALA LUMPUR. ,FOREIGN SERVICE OF THE UNITED STATES OF AMERICA DATE OF EXAMINATION MEDICAL EXAMINATION OF VISA APPLICANTS 19 APR 1979 At the request of the American Consul at CITY COUNTRY Kuala Lumpur Malaysia. I certify that on the above date I examined NAME AGE SEX NGUYEN THI NGOI 68 F WHO BEARS PASSPORT NO. ISSUED BY ON A23-792-632 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more . Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Psychopathic personality Chronic alcoholism Insanity Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Depar Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2) My examination, including the X-ray and other reports below, revealed: BP: 150/- GUYGN THINGO (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give cla 8113 C - diagnosis, and pertinent details*): it 25434 Allet Pterysian be the eyes, covers the cen free part of right eye. Fingervision / foot might eye 20/400 lift eye. Has t be followed in is U.S.A. JV.A Into T NON-SIGNIFICANT FINDINGS Chest X-ray Services Medical DEPARTMENT Z COMPUTERMEDIC. LAB. SDN BHD VDRL-NON REACTING KUALA LUMPUR Blood serological report from Dr. Other special report(s) (when needed) from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLER. TORE A. NITTER DATE OF FINAL REPORT 10-74 of ICEM MEDICAL OFFICER. 26/4/79 FORM FS-398 *Continue on reverse side if necessary."
}
