{
  "anumber": "A23732123",
  "id": "A23732123_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A23732123_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: BIOGRAPHIC INFORMATION\\nForm Number: OMB No. 4-436"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325 (REV. 5-1-79)Y Screened by NARA, 2/10/2023 BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE Form Approved INFORMATION OMB No. 43-R436 Immigration and Naturalization Service (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER LUONG KONG PiNG FEMALE 8-20-1909 ViETNAM 23-732-123 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. HAi NINH ViETNAM (If any) 586-30-2115 FAMILY NAME FIRST NAME DATE. CITY AND COUNTRY OF BIRTH [If known) CITY AND COUNTRY OF RESIDENCE FATHER LUONG HUONG Deceased MOTHER [Maiden name) TRAN THi Deceased HUSBAND (If none. SO state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife. give maiden name) WIFE WONG TA, CHiNA CHiNA FORMER HUSBANDS OR WIVES (If none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONe APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 5103 WILTS ph SANDIEGO CA U.S.A MAR 81 PRESENT TIME 2803 MAIN St. L.A CA U.S.A NOV 80 7eb 81 2603 SiCHEL St. L.A CA U.S.A JAN 79 OCT 80 5233 BALTiMORE St. L.A CA U.S.A JAN 78 Dec 78 591/4/6 BiNH THOI SaiGoN SaiGON V.N APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 591/4/6 BiNH THOi LAILTON SaiGON U.N APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR NONe PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) STATUS AS PERMANENT RESIDENT KONY PINY wolve 3/29/81 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT."
}