{
	"anumber": "A24614655",
	"id": "A24614655_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A24614655_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325C"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Austria", "Italy"]
		},
		"years": {
			"ms_years_nlp_v1": [1921, 1981, 1976, 1880, 1883, 1900]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n.a']"
			},
			"nationality": {
				"nationality_llm_v1": "ex-USSR"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "INSTRUCTIONS: Use typewriter. Be sure all copies are legible and complete. DO NOT REMOVE CARBONS. Failure to answer fully all questions delays action. If typewriter is not available, print heavily in block letters with ball - point pen. *U.S. Government Printing Office: 1981-333-835 FORM G-325C (Rev. 5-1-79) Y Form Approved BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R436 Immigration and Naturalization Service INFORMATION (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) MALE BIRTHDATE (MO.-DAY-YR.) NATIONALITY DONSKAYA Fanya EMALE Aug. 18, 1900 ex-USSR ALL OTHER NAMES USED CITY AND COUNTRY OF BIRTH nee RABIN Tomashpol, USSR FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (IF KNOWN) CITY AND COUNTRY OF RESIDENCE FATHER RABIN Leyb 1880, Tomashpol d.1921, USSR MOTHER (MAIDEN NAME) RABIN Gita 1883, # d.1953, USSR HUSBAND OR WIFE FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (IF NONE, so STATE) (FOR WIFE, GIVE MAIDEN NAME) none FORMER HUSBANDS OR WIVES (FILL IN THE BLOCKS BELOW. IF NONE, STATE ``NONE''.) FAMILY NAME (FOR WIFE, GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE DONSKOY Skharia 1896 1921, Tomashpol d.1970,USSR APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR H IAS Rome Italy July 2 1, 198FESENT TIME Int. Red Cross Vienna Austria Jul19, 81 Jul20,8 prosp. pyatides.Oktyabrya Chernovtsy 31A/6 Chernovtsy 1976 1981 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR none PRESENT TIME IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: APPLICANT FOR CONDITIONAL ENTRY DoHaRas PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING Juli 28, 1981 OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT) APPLICANT: BE SURE TO PUT YOUR NAME IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) DONSKAYA Fanya nee RABIN A24 $ 614 055 (OTHER AGENCY USE) (INS USE) CONDITIONAL ENTRY APPLICANT Return to: RONE- ITALY Immigration and Naturalization Service OFFICE CODE: TYPE OF CASE: DATE: 7/30/81 FORM G-325C (1) IDENT."
}
