{
	"anumber": "A24614655",
	"id": "A24614655_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A24614655_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REGISTRATION FOR CLASSIFICATION AS REFUGEE, 4-RO48"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Italy"]
		},
		"years": {
			"ms_years_nlp_v1": [1970, 1926, 1981, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "JUL. 29 1981 Form Approved REGISTRATION Budget Bureau No. 43-R0408 FOR CLASSIFICATION AS REFUGEE UNITED STATES DEPARTMENT OF JUSTICE Section 207 IMMIGRATION AND NATURALIZATION SERVICE File No. Immigration and Nationality Act A 24 614 655 REGISTRANT TO FURNISH THE FOLLOWING INFORMATION (READ INSTRUCTIONS ON REVERSE) TYPE OR PRINT 1. My name is: First Middle Last Fanya nee RIBIN DONSKAYA 2. My present address is: c/o HIAS Rome, Italy 3. I was born on: (month)(day)(year) Place of birth (city or town) (Province) (Country) My present nationality is: Aug. 18, 1900 Tomashpol USSR ex -USSR 4. Height Weight Eyes Hair Complexion Marks or Scars 5'2 198 green grey fair none 5. I fled or was displaced from (Name of country) On or about (month) (day) (year) USSR July 18, 1 981 6. Reasons: (State in detail) I left with my daughter 7. My present immigration status in Italy is: in transit (Country in which residing) The evidence of my immigration status in the country in which I am residing is: (Describe) USSR exit visa N. 430673 iss. Minsk, June 26, 1981 till July 17, 1981 8. name My spouse's is: 157 9. (His) (Her) present address is: 10. Spouse's nationality is: Skharia DONSKOY 1.1970,USSR 11. My spouse will will not accompany me to the United States 12. Name of child (ren) Date of birth Place of birth Present address Lyudmila KRAVCHUK Nov.7,1926 Tomashpol same as mine Place a mark (X) in front of name of each child who will accompany you to the United States 13. Schooling or Education Name and location of school Type Dates attended Title of Degree or Diploma None 14. Military Service Branch and Country Dates Serial No. Rank Attained Organization Form I-590 (Rev. 5-1-80) N"
}
