{
  "anumber": "A24614655",
  "id": "A24614655_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A24614655_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ASSURANCE BY A UNITED STATES SPONSOR IN BEHALF OF AN APPLICANT FOR REFUGEE STATUS, Form Approved OMB No. 443-R047"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1981,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form Approved IMMIGRATION AND NATURALIZATION SERVICE OMB No. 43-R0407 ASSURANCE BY A UNITED STATES SPONSOR IN BEHALF OF AN APPLICANT FOR REFUGEE STATUS (Section 207 Immigration and Nationality Act) JUL. 29 1981 (See Instructions on Reverse) Name of Sponsor: HIAS Present Address: (Number) (Street) (City) (State) (ZIP Code) New York Date of Birth: (Month) (Day) (Year) Place of Birth: I am a citizen of the United States by birth naturalization (If naturalized, show date, place naturalized and certificate number) The refugee status into the United States of the applicant, his spouse and children, as described below, is herewith sponsored, and transportation from a port of entry in the United States to final destination in the United States is assured. Principal applicant's name: (First) (Middle) (Last) Date of birth: Fanya nee RABIN DONSKAYA Aug.18, 1900 Place of birth: Present address: Tomashpol, USSR c/o HIAS Rome, Italy Name of principal applicant's spouse is: (First) (Middle) (Last) None Date of birth: Place of birth: Child(ren) Name Date of birth Place and Country of birth None Assurances are herewith given that for one year, and without displacing any other person, the principal applicant will be employed and that he and all members of his family will be housed. TO BE EXECUTED BY INDIVIDUAL SPONSOR I am am not related to the applicant. (If related show exact relationship) I have within the past five years sponsored the immigration of persons into the United States (state number) I understand that the assurances given by me as stated above are my personal obligations. I certify that I am financially responsible and fully capable of entering into this undertaking: Date: Place Signature of assurer TO BE EXECUTED BY VOLUNTARY AGENCY Name of Agency: Local Representative of Agency in United States in area where HIAS conditional entrant will be located. Date: Place: Name July 28,81 New York Address (Number) Signature of authorized official of agency (Street) (City) (State) (ZIP Code) bree Form I-591 GPO 871 421 (Rev. 5-1-80) N"
}