{
  "anumber": "A25105125",
  "id": "A25105125_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A25105125_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL Examination of Visa Applicants, 502/109-114 HK-8926"
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1889,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "502/109-114 HK-8926 P7 See Cooc Dit Lin KTE PLACE 107 Waterloo Road, KOwloon MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION October 13, 1980 CITY COUNTRY At the request of the American Consul at HONG KONG B.C.C. NAME AGE SEX I certify that on the above date I examined PHUNG THI MY DOB: 1889 F I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. N.A.D. (See back page) Grandmay CLASS C: King T. Chung, MCPS, Man. Minor Conditions. 1208 Melbourne Plaza, H.K. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease. or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, 8, or C- diagnosis, and pertinent details* QB - reduced vision. a B - ve duced hearing CLB - geneval wealness because of age. Chest X-ray report October 13, 1980 R0012-A: PA of the chest: No active lung disease. Heart enlarged. Calcific plaques in aortic arch. from Dr. KING T. CHUNG Blood serological report K.T. Chung M.C.P.S. MANITOBA October 13, 1980 Non-reactive from Dr. L.M.C.C. Other special report(s) (when needed) from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR T. Espegren, DATE 8 OCT 1980 50157-101 Continue on reverse side if necessary. ICEM Medica Officer OPTIONAL FORM 157 (Pormerly FS-398) January 1975 DEPT. OF STATE"
}