{
  "anumber": "A25424389",
  "id": "A25424389_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A25424389_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023, EMBASSY OF SWITZERLAND United States of America Interests Section"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Switzerland",
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 EMBASSY OF SWITZERLAND LA HABANA, Calzada entre Ly M United States of America Vedado Interests Section Tel.: 32-0551/52 32-9700 Ref.: DATE OF ISSUE: JUNE 19, 1991 EXPIRATION DATE: OCTOBER 19, 1991 The Transportation Company and The Supervisory Immigration Inspector United States Immigration and Naturalization Service at Port of Entry RE: Name of Alien: LESPERANCE, ETIENNE CILENCIEUX Alien Number: A25 424 389 (MEX) Date and Place of Birth: 6.2.1900, HAITI U.S. Destination (city and state) ALBUQUERQUE, NM Interested Party (VOLAG) : USCC Address of Interested Party: AILEEN GARRIOTT CATHOLIC SOCIAL SERVICE 801 MOUNTAIN RD. NE ALBUQUERQUE, NM 87125. (505) 247-9521. Sirs: The Central Office of the United States Immigration and Naturalization Service has approved indefinite parole into the United States, unless otherwise specified in the at- tached cable, for the above-named alien under Section 212 (d) (5) of the Immigration and Nationality Act. An Airline may accept this letter as assurance that the above-named alien may be transported to the United States without liability under Section 273 (b) of the Immigration and Nationality Act. Very truly yours, ERLAND Consul of the United States of America PASSED Attachment: Parole approved on 2.12.91 \"INDEFINITE PAROLE' MIAMI, FLORIDA (2) 19-1399"
}