{
	"anumber": "A26271163",
	"id": "A26271163_0064",
	"page_index": 64,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0064/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Continuance of N4 144 (Rev. 9/16/97)"
		},
		"years": {
			"ms_years_nlp_v1": [2011, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 DEPARTMENT Direct all responses by mail to the office listed below: U.S. U.S. Citizenship U.S. CITIZENSHIP AND IMMIGRATION SERVICES HOMELAND and Immigration 530 Fellowship Road SECURITY Mount Laurel NJ 08054 Services Margarita Sanchez Refer to this file: NBC*001474434 3805 Garden Ave Alien Number: A 026 271 163 Pennsauken NJ 08110 Date: March 22, 2011 CONTINUANCE Examination of your N400 application shows that additional information, documents or forms are needed before your application can be acted upon. Please return this letter with the requested information AT THE TIME OF YOUR NEXT SCHEDULED APPOINTMENT. Failure to do so may result in the denial of your application. Submission of this information, however, does not guarantee that this case will be approved. We strongly recommend that you submit all the requested information, documents, or forms as listed on the following pages as soon as possible SO that we can resume processing. Any interim benefits that may otherwise stem from the filing of this application or petition will be delayed while this case is in suspense awaiting your response. If you choose to submit only some or none of the requested information, then the application will be adjudicated on its merits. You may also request, in writing, to the Service that this application be withdrawn. If the district director consents to the withdrawal, the application will be denied without further notice to you and without prejudice to any future application. The withdrawal will constitute a waiver of any review pursuant to Section 336 of the Title 8 Code of Federal Regulations. If the district director does not consent to the withdrawal, then the application shall be adjudicated on its merits. Form N-14 (Rev. 9/16/97)"
}
