{
	"anumber": "A26271163",
	"id": "A26271163_0076",
	"page_index": 76,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0076/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOT AN INTERVIEW NOTICE, NBC*0014474434"
		},
		"years": {
			"ms_years_nlp_v1": [2010, 2011, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Applicant Department of Homeland Security Box 648006 Lees Summit, MO 64064 U.S. Citizenship HOMELAND and Immigration SECURITY Services Date: 2/25/2011 File: SANCHEZ, MARGARITA 3805 GARDEN AVENUE PENNSAUKEN, NJ 08110 NBC*001474434 In RE: THIS IS NOT AN INTERVIEW NOTICE Subject: Pre-Interview Case File Review, Prior to forwarding your case for interview, USCIS has performed a complete review of your file and Application for Naturalization (Form N-400). As a result of that review, we have identified additional documentation may be needed. We recommend that you bring the documents listed below to your naturalization interview to limit any potential delays that might result if needed documents are not available at interview. In the event additional documentation is required, you will be advised during your interview. All documents must be clear and legible. If you have a document in any language other than English, please provide an English translation along with the original document. The translator must certify that the translation is complete and accurate, and that he or she is qualified to translate. If you have any questions about your interview or about the information requested please contact USCIS National Customer Service Center at 1-800-375-5283. Thank You. USCIS recommends you bring the following documents to your interview: Bring your state-issued driver's license or state-issued photo identification card. Bring all passports and travel documents (including expired and current) issued to you by any government. Questions may be directed to the USCIS National Customer Service Center at 1-800-375-5283. Thank You. REMINDER: bring this original notice with your documents. Rev. 5/26/2010 20090211 Page 1 of 1"
}
