{
  "anumber": "A26271163",
  "id": "A26271163_0101",
  "page_index": 101,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0101/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICADO, Nº 138197"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 SERIE \"A\" CORDOBA No 1381987 GUSTAVO VILL ANUEVE GUTIERREZ, ADDGADD Y REGISTRADOR DEL ESTADO CIVIL DE LAS PERSINAS, C E R T I F I = A 4 Que en la nágina No. 200 del Tomo No. 46 del libro de partidas de naci- mientos que lleva esta oficina a su cargo, se encuentra inscrita el acts que in- 5 tegra y literalmente dice: 6 PART: No. 631.- En la ciudad de Chinandega a las nueve de le mañana del 8 dia veintiseis de agosto de mil novecientos cuarenta. Ante mi, Alcalde Municipal, encargado del Registro del Estado Civil de las Personas, compareció Luis Velesquez 9 10 E., mayor de edad, soltero, zapatero, de este domicilio y dijo: que a las cuatro de la mañana del dia catorce de abril del corriente año, sin ninguna señal parti- 11 cular, nacio en esta ciudad, MARIA LIDUVINA, hija legitima de Antonio Zeledón y 12 Margarita Sánchez, ambos mayores de edad, casados, de este domicilio, él de oficio 13 zapatero y ella de oficios domesticos. Se leyó esta acta al dicente, la encontró 14 conforme, la aprueba y firma.- ELISED VELASQUEZ LUIS VELASQUEZ E. M. AGURCIA 15 Srio. 16 Es conforme con su original y a solicitud de la parte interesada libro la 17 presente certificación, en la ciudad de Chinandega el día quince de noviembre de 18 ESTADO mil novecientos setenta y seis. 19 Civil Je is Winnered 600 7 20 21 And * Civil de las Personas. 22 23 nte mí: Sria. DR. CARLOS GRIOS CHAVEZ, Alcalde Municipal de Chinande- 24 25 ga, Nicaragua C.A. CERTIFICA: Que las firmas que anteceden y dicen: G. Villanueva G. C. Ocaña M. son las que usan el Dr. Gustavo Villanueva G+ 26 tiérrez y Srta. Clementina Ocaña Martínez, Registrador detristado Ci- 27 de las Personas y Secretaria respectivamente y son autent CARD Chinande 28 ga. quince dea noviembre de mil novecientos setenta seis This is 29 the original which was returned copy of Love & \\3othe applicant. DR. CAREOS GRIOS CH. America To Alcalde Municipal de Chinandega 12-12-86 N.O., LA. ate CONTACT REPRESENTATIVE NOL"
}