{
  "anumber": "A26271163",
  "id": "A26271163_0116",
  "page_index": 116,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0116/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 6/1/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2013,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Robertson, Paula M From: Robertson, Paula M Sent: Friday, August 02, 2013 12:09 PM To: NRC, Field-Processes Subject: RE: Axx XXX 163 A copy of the file will be fine. If you could please send it to my attention, that would be great. Thanks for all of your help and patience. Thanks, Paula M. Robertson Immigration Services Analyst DHS/USCIS/Records National Benefits Center, Lee's Summit, MO FOIA (b)(6) \"WARNING: This document is FOR OFFICIAL USE ONLY (FOUO). It contains information that may be exempt from public release under the Freedom of Information Act (5 U.S.C. 552). This document is to be controlled, handled, transmitted, distributed, and disposed of in accordance with DHS policy relating to Sensitive But Unclassified (SBU) information and is not to be released to the public or other personnel who do not have a valid \"need-to-know\" without prior approval from the originator.\" From: NRC, Field-Processes Sent: Friday, August 02, 2013 11:27 AM To: Robertson, Paula M Subject: RE: Axx XXX 163 The file will error out in NFTS due to CIS will not change FCO's when the file is sent out from each office. If copies of the files can be sent to MTL instead of the file that would be preferred, otherwise the file should be attempted to be returned to the NRC as soon as possible. Thank you, Joshua Dorman Program Assistant (Contract Performance) Department of Homeland Security USCIS/NRC, Lee's Summit, MO FOIA (b)(6) From: Robertson, Paula M Sent: Friday, August 02, 2013 11:12 AM To: NRC, Field-Processes Subject: RE: Axx XXX 163 Good morning Joshua, Thank you so much for looking into this. The file is needed for Naturalization application processing at the MTL field office, so I can put a memo with the file to return it to you as requested, but can't guarantee they would do it. If they do approve the application, they will more than likely retire the file anyway. Please advise further. Thanks. 1"
}