{
	"anumber": "A26271163",
	"id": "A26271163_0106",
	"page_index": 106,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0106/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Record of Inquiry - TECS ( (ROIT), 2671 163"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Record of FOR OFFICIAL USE ONLY Record of Inquiry - Do Not Distribute Beyond DHS without Prior Authorization rom the Originator Inquiry - TECS Record of Inquiry - TECS (ROIT) TECS (ROIT) (ROIT) A-Number or Receipt Number: 26271.163 NO Resolution # Last Name, First Name DOB DNR RELATES Memo MATCH Completed? I SANCHEZ MARgARitA 11/08/10 09/23/13 ms 2nd Check A P B D R 3rd Check NO Resolution # Last Name, First Name DOB DNR RELATES Memo MATCH Completed? 2 SANCHEZ AREAS, 11/08/10 09/23/13 ms MARGARITA 2nd Check A P B D R 3rd Check NO Resolution # Last Name, First Name DOB DNR RELATES Memo MATCH Completed? 3 SANCHEZ ARIAS, 11/08/10 09/23/13 ms MARgARitA 2nd Check A P B D R 3rd Check NO Resolution # Last Name, First Name DOB DNR RELATES Memo MATCH Completed? 4 SANCHES MARGARITA 11/08/10 09/23/13 ms 2nd Check A P B D R 3rd Check NO Resolution # Last Name, First Name DOB DNR RELATES Memo MATCH Completed? 5 ZELEDON, MARGARITA 11/08/10 09/23/13 mo 2nd Check A P B D R 3rd Check Properly annotate TECS results on the ROIT: NO MATCH - No information found in TECS A Applicant *Include the date of query in the appropriate box DNR - Information found in TECS but does not relate to the subject P Petitioner (NO MATCH, DNR or RELATES). RELATES - Information found in TECS that relates to the subject, B Beneficiary *Include the initials or identifying number of the USCIS personnel case referred for resolution D = Derivative/Household Member conducting the query in the same box as the date. R = Requestor *If the hit was a RELATES and a resolution memo was completed, check the Resolution Memo Completed Box in the last column FOR OFFICIAL USE ONLY Do Not Distribute Reyond DHS without Prior Authorization from the Originator"
}
