{
	"anumber": "A26271163",
	"id": "A26271163_0066",
	"page_index": 66,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0066/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 6/1/22023, NARA Form Number: 2023-0045"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Any document containing foreign language submitted to the Service shall be accompanied by a full English language translation which the translator has certified as complete and accurate, and by the translator's certification that he or she is competent to translate from the foreign language into English. The following are examples of secondary evidence which may be submitted for consideration: Baptismal certificate. - A certificate under the seal of the church where the baptism occurred, showing date and place of birth, date of baptism, the names of the godparents, if known. School record. - A letter from the school authorities having jurisdiction over school attended (preferably the first school), showing the date of admission to the school, date of birth or age at that time, place of birth, and the names and places of birth of parents, if shown in the school records. Census record. - State or Federal census record showing the name(s) and place(s) of birth, and date(s) of birth or age(s) of the person(s) listed. Affidavits. - Notarized affidavits of two persons who were living at the time, and who have a personal knowledge, of the event your are trying to prove - for example, the date and place of a birth, marriage, or death. The persons making the affidavits may be relatives and need not be citizens of the United States. Each affidavit should contain the following information regarding the person making the affidavit: His(Her) full name and address; date and place of birth; relationship to you, if any; full information concerning the event; and complete details concerning how he (she) acquired knowledge of the event."
}
