{
  "anumber": "A26271163",
  "id": "A26271163_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "USCIS Naturalization Test, Form M-100SC"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2013,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Form M-100. USCIS Naturalization Test Department of Homeland Security U.S. Citizenship and Immigration Services 65/20 Special Consideration Test-3 A-Number: A026271163 Date: 09/23/2013 U.S. NATURALIZATION TEST U.S. History and Government (Civics) 65/20 Applicant Test Form 3 FOR OFFICIAL USE ONLY The USCIS Officer will read a civics item orally to the applicant and the applicant will respond orally. The USCIS Officer will write the applicant's answer in the space provided. If an interpreter is used because the applicant qualifies for an exemption from the English requirements, the USCIS Officer will write the applicant's response as stated by the interpreter in the space provided below. Civics Items Correct Incorrect *1. Where is the Statue of Liberty? Answer: New York Harbor **2. What is one right or freedom from the First Amendment? Answer: No answer 3. When is the last day you can send in federal income tax forms? Answer: April 15 *4. Why does the flag have 50 stars? Answer: No answer *5. Who was the first President? Answer: George Washington *6. When do we celebrate Independence Day? Answer: July 4 *7. What is the name of the President of the United States now? Answer: Barack Obama **8. How old do citizens have to be to vote for President? Answer: eighteen and older 9. Who is one of your state's U.S. Senators now? Answer: 10. What was one important thing that Abraham Lincoln did? Answer: Total correct answers: 006 Interpreter Used: No Result: Pass Fail Yes (Language: SPANISH ) Form M-1002SC (10/11/10)"
}