{
  "anumber": "A26271163",
  "id": "A26271163_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0039/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, Form N-4, Form N-335"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2011,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Attachment(s) to Form N-335 Applicant: Margarita Sanchez Application for Naturalization, Form N-400 Alien Number: A026271163 Application ID: C*001474434 Your application is hereby denied in accordance with the Title 8 Code of Federal Regulations Section(s) listed below: Reason: Lack of knowledge CFR8 Reference: Part 312 Educational Requirements for Naturalization Section 312.2 Knowledge of History and Government of the United States Section 312.2 States: (a) General. No person shall be naturalized as a citizen of the United States upon his or her own application unless that person can demonstrate a knowledge and understanding of the fundamentals of the history, and of the principles and form of government, of the United States. A person who is exempt from the literacy requirement under Section 312.1(b)(1) and (2) must still satisfy this requirement. (Amended 3/19/97; 62 FR 12915) (b) Exceptions. (1) The requirements of paragraph (a) of this section shall not apply to any person who is unable to demonstrate a knowledge and understanding of the fundamentals of the history, and of the principles and form of government of the United States because of a medically determinable physical or mental impairment, that already has or is expected to last at least 12 months. The loss of any cognitive skills based on the direct effects of the illegal use of drugs will not be considered in determining whether an individual may be exempted. For the purposes of this paragraph, the term medically determinable means an impairment that results from anatomical, physiological, or psychological abnormalities which can be shown by medically acceptable clinical and laboratory diagnostic techniques to have resulted in functioning so impaired as to render an individual to be unable to demonstrate the knowledge required by this section or that renders the individual unable to participate in the testing procedures for naturalization, even with reasonable modifications. (Corrected 4/2/97; 62 FR 15751) (2) Medical certification. All persons applying for naturalization and seeking an exception from the requirements of Section 312.1(a) and paragraph (a) of this section based on the disability exceptions must submit Form N-648, Medical Certification for Disability Exceptions, to be completed by a medical doctor licensed to practice medicine in the United States or a clinical psychologist licensed to practice psychology in the United States (including the United States territories of Guam, Puerto Rico, and the Virgin Islands). Form N-648 must be submitted as an attachment to the applicant's Form N-400, Application for Naturalization. These medical professionals shall be experienced in diagnosing those with physical or mental medically determinable impairments and shall be able to attest to the origin, nature, and extent of the medical condition as it relates to the disability exceptions noted under Section 312.1(b)(3) and paragraph (b)(1) of this section. In addition, the medical professionals making the disability determination must sign a statement on the Form N-648 that they have answered all the questions in a complete and truthful manner. that they (and the applicant) agree to the release of all medical records relating to the applicant that may be requested by the Service, and that they attest that any knowingly false or misleading statements may subject the medical professional to the penalties for perjury pursuant to Title 18, United States Code, Section 1546 and to civil penalties under section 274C of the Act. The Service also reserves the right to refer the applicant to another authorized medical source for a supplemental disability determination. This option shall be invoked when the Service has credible doubts about the veracity of a medical certification that has been presented by the applicant. An affidavit or attestation by the applicant, his or her relatives, guardian on his or her medical condition is not a sufficient medical attestation for purposes of satisfying this requirement. (Corrected 4/2/97; 62 FR 15751) Explanation: You were unable to demonstrate sufficient knowledge of United States History & Government during your second and final naturalization interview, which you attended on June 22, 2011. Therefore, due to existing"
}