{
  "anumber": "A26271163",
  "id": "A26271163_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0033/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        2013,
        1910,
        1986,
        2012
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by 1216 Arch Street, 4th Floor MM Nat OIL alities Philadelphia, PA 19107 Phone: 215-893-8400 Fax: 215-735-9718 Service Center E-mail: info@nscphila.org www.nscphila.org June 14, 2012 USCIS P.O. Box 660060 Dallas, TX 75266 Fee Waiver Request Enclosed Re: SANCHEZ, Margarita (A 026-271-163) Form N-400 Application for Naturalization Dear Madam or Sir: Enclosed please find documentation in support of Margarita Sanchez' N-400 Application for Naturalization. Enclosed documents include: 1. Form G-28 Notice of Entry of Appearance 2. Form N-400 Application for Naturalization Two (2) passport-style photographs of Ms. Sanchez Copy of Ms. Sanchez\" Permanent Resident Card Copy of Ms. Sanchez' Passport 3. Form I-912 Request for Fee Waiver Copy of letter from the Social Security Administration, dated May 31, 2013, as proof that Ms. Sanchez receives Supplemental Security Income Please note that under INA ยง 312(b)(2)(A), Ms. Sanchez is exempt from the English language requirement, as she is over fifty-five years of age (DOB: 11/08/1910, making her 102 years old) and has been living in the United States for a period totaling over fifteen years subsequent to her lawful admission for permanent residence (she has been a permanent resident since 1986, or approximately 26 years). Under INA ยง 312(b)(3), Ms. Sanchez is eligible for special consideration and a reduced number of history and civics questions, as she is over sixty-five years of age and has been living in the United States for periods totaling at least twenty years subsequent to a lawful admission for permanent residence. United Serving immigrants and refugees in the Delaware Valley since 1921. Way United Way Donor #88 A United Way Agency"
}