{
  "anumber": "A26271163",
  "id": "A26271163_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 3. Notice of Appearance as Attorney or Accredited Representative, Form G-28"
    },
    "years": {
      "ms_years_nlp_v1": [
        2013,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Part 3. Notice of Appearance as Attorney or 7. Provide A-Number and/or Receipt Number Accredited Representative 026271163 This appearance relates to immigration matters before (select one): Pursuant to the Privacy Act of 1974 and DHS policy, I hereby consent to the disclosure to the named Attorney or Accredited 1. USCIS - List the form number(s) Representative of any record pertaining to me that appears in 1.a. N-400 any system of records of USCIS, ICE, or CBP. 8.a. Signature of Applicant, Petitioner, or Respondent 2. ICE - List the specific matter in which appearance is entered Margarito Sanshey 2.a. 8.b. Date (mm/dd/yyyy) 06/14/2013 3. CBP - List the specific matter in which appearance is entered Part 4. Signature of Attorney or Accredited Representative 3.a. I have read and understand the regulations and conditions contained in 8 CFR 103.2 and 292 governing appearances and I hereby enter my appearance as attorney or accredited representation before the Department of Homeland Security. I representative at the request of: declare under penalty of perjury under the laws of the United 4. Select only one: Applicant Petitioner States that the information I have provided on this form is true and correct. Respondent (ICE, CBP) 1. Signature of Attorney or Accredited Representative Name of Applicant, Petitioner, or Respondent 2. 5.a. Family Name Signature of Law Student or Law Graduate SANCHEZ Out 13 (Last Name) 5.b. Given Name Margarita (First Name) 3. Date (mm/dd/yyyy) 06/14/2013 5.c. Middle Name Part 5. Additional Information 5.d. Name of Company or Organization, if applicable 1. NOTE: Provide the mailing address of Petitioner, Applicant,o Respondent and not the address of the attorney or accredited representative, except when a safe mailing address is permitted on an application or petition filed with Form G-28. 6.a. Street Number 3805 Garden Avenue and Name 6.b. Apt. Ste. Flr. 6.c. City or Town Pennsauken 6.d. State NJ 6.e. Zip Code 08110 Form G-28 02/28/13 N Page 2 of 2"
}