{
  "anumber": "A26271163",
  "id": "A26271163_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice for Customers with Disabilities, N-648, Medical Certification for Disability Exceptions"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Notice for Customers with Disabilities USCIS is committed to providing customers with disabilities the same level of access to its programs and activities that customers without disabilities have (see the USCIS Web site for an explanation and examples of accommodations). If you need an accommodation for your appointment due to a disability that affects your access to a USCIS program or activity OR if a disability prevents you from going to the designated USCIS location for your appointment, please call the National Customer Service Center (NCSC) at 1-800-375-5283 (TDD: 1-800-767- 1833) to request an accommodation. Call the NCSC even if you indicated on your application or petition that you require an accommodation. Also, you must contact the NCSC to request an accommodation each time you have an appointment with USCIS. For example, you must call the NCSC to request an accommodation for your biometrics appointment and again for an accommodation for your interview appointment. NOTICE: All domestic USCIS offices are accessible to individuals with physical disabilities. You do not need to request an accommodation if your ONLY need is an accommodation that would enable or facilitate you having physical access to a domestic USCIS office. Note: Naturalization applicants should not call the NCSC to request an exception from the English and/or civics testing requirement. You must submit Form N-648, Medical Certification for Disability Exceptions to request an exception. See the form instructions for additional information."
}