{
  "anumber": "A26271163",
  "id": "A26271163_0119",
  "page_index": 119,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0119/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Thank You,"
    },
    "years": {
      "ms_years_nlp_v1": [
        2013,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Thank You, Shipping Desk External Request 140080 Team STS 150 Space Center Loop Lee's Summit, MO 64064 WARNING: This document is FOR OFFICIAL USE ONLY (FOUO). It contains information that may be exempt from public release under the Freedom of Information Act (5 U.S.C. 552). This document is to be controlled, handled, transmitted, distributed, and disposed of in accordance with DHS policy relating to Sensitive But Unclassified (SBU) information and is not to be released to the public or other personnel who do not have a valid \"need-to-know\" without prior approval from the originator. From: Robertson, Paula M Sent: Wednesday, July 31, 2013 1:40 PM To: NRC, Shipping Desk Subject: A026271163 Importance: High Please see the NFTS location for this file. I am unable to request through CIS as it is showing in NARA custody. Are you able to send the file? It is needed for expedited N400 processing. A026271163 000 NRC Status: AVAILABLE IN RECORDS Sect: AD - FILE ROOM NUMBER 1 LL D Audit Date: 07/01/2013 09:12:35 AM Resp: 1534 - ROW AD SHELF 1534 - AD1534 Last Action: 07/01/2013 09:12:35 AM Batch Audit Thanks, Paula M. Robertson Immigration Services Analyst DHS/USCIS/Records National Benefits Center, Lee's Summit, MO FOIA (b)(6) \"WARNING: This document is FOR OFFICIAL USE ONLY (FOUO). It contains information that may be exempt from public release under the Freedom of Information Act (5 U.S.C. 552). This document is to be controlled, handled, transmitted, distributed, and disposed of in accordance with DHS policy relating to Sensitive But Unclassified (SBU) information and is not to be released to the public or other personnel who do not have a valid \"need-to-know\" without prior approval from the originator.\" 4"
}