{
	"anumber": "A26271163",
	"id": "A26271163_0102",
	"page_index": 102,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0102/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Republic of Nicaragua Certificate, 1381987"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Value: One Cordoba Republic of Nicaragua Series \"A\" Central America No. 1381987 GUSTAVO VILLANUEVA GUTIERREZ, ATTORNEY AND REGISTRAR OF VITAL STATISTICS CERTIFIES: That on page 200 of Volume No. 46 of the BOOK OF BIRTHS that this office has in its possession is registered the complete certificate that reads as follows: Certificate No. 631. -- In the city of Chinandega at nine 'clock in the morning of the twenty sixth day of August in the year nineteen hundred forty, before me, the Mayer, in charge of the Registry of Vital Statistics, appeared Luis Velasquez E., of legal age, single, shoemaker, of this demicile, and stated: That at four 'clock in the morning of the forteenth day of April of this year, MARIA LIDUVINA was born in this city, without any unusual marks, legitimate daughter of Antonio Zeleden and Margarita Sanchez, both of legal age, married, and of this domicile. He is employed as a shoemaker and she is employed in domestic work. Having read this certificate to the speaker, it is found to be in order, and it is approved and signed. -- Elisee Velasquez Luis Velasquez E. M. Agurcia Srio. This Certificate is in accordance with the original, and, at the request of the interested party, it was issued in the city of Chinandega on the fifteenth day of November in the year nineteen hundred seventy six. Stamped: Registry of Vital Statistics Signed: Official Signature Registrar of Vital Statistics Before me: Official Signature DR. CARLOS GRIOS CHAVEZ, Mayer of Chinandega, Nicaragua, Central America, CERTIFIES: that the preceding signatures of G. Villanueva G. and C. Ocana M. are the ones that Dr. Gustavo Villanueva Gutierrez and Miss Clementina Ocana Martinez, Registrar of Vital Statistics and Secretary, use respectively, and are authentic. Chinandega, the fifteenth of November in the year nineteen hundred seventy six. Dr. Carles Grios CH. -- Official Signature -- Mayor of Chinandega Stamped: Office of the Mayer Chinandega, Nicaragua, Central America This IS a true, correct and compared CV of the original which was returned applicant. I certify that I have compared with true Tb complete 12-12-84 N.O., LA. Karren Seve, Attorney at law CONTACT REPRESENTATIVE- NOL Street Philadelphia P5. 19107 Admitted to Practice in State of Penna."
}
