{
	"anumber": "A26271163",
	"id": "A26271163_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26271163_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice of Entry of Appearance as Attorney or Accredited Representative, Form G-28"
		},
		"years": {
			"ms_years_nlp_v1": [2016, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 DEPARTMENT DHS Notice of Entry of Appea. ance Form G-28 as Attorney or Accredited Representative OMB No. 1615-0105 Expires 02/29/2016 Department of Homeland Security Part 1. Information About Attorney or Part 2. Eligibility Information For Attorney or Accredited Representative Accredited Representative Name and Address of Attorney or Accredited Representative (Check applicable items(s) below) 1.a. Family Name Rodriguez 1. I am an attorney eligible to practice law in, and a (Last Name) member in good standing of, the bar of the highest 1.b. Given Name Abel court(s) of the following State(s), possession(s), (First, Name) territory(ies), commonwealth(s), or the District of Columbia. 1.c. Middle Name 1.a. PA 2. Name of Law Firm or Recognized Organization Nationalities Service Center 1.b. I (choose one) am not am subject to any order of any court or administrative 3. Name of Law Student or Law Graduate agency disbarring, suspending, enjoining, restraining, or otherwise restricting me in the practice of law. (If you are subject to any order(s), explain fully in the space below.) 4. State Bar Number 312982 1.b.1. 5.a. Street Number 1216 2. I am an accredited representative of the following 5.b. Street Arch Street qualified nonprofit religious, charitable, social Name service, or similar organization established in the 5.c. Apt. Ste. Flr. 4 United States, so recognized by the Department of Justice, Board of Immigration Appeals pursuant to 8 CFR 292.2. Provide the name of the organization 5.d. City or Town Philadelphia and the expiration date of accreditation. 5.e. State PA 5.f. Zip Code 19107 2.a. Name of Recognized Organization 5.g. Postal Code 2.b. Date Accreditation expires 5.h. Province (mm/dd/yyyy) 5.i. Country 3. I am associated with USA 3.a. 6. Daytime Phone Number ( 215 ) 609 - 1546 the attorney or accredited representative of record who previously filed Form G-28 in this case, and my 7. E-Mail Address of Attorney or Accredited Representative appearance as an attorney or accredited representative arodriguez@nscphila.org is at his or her request. If you check this item, also complete number 1 (1.a. - 1.b.1.) or number 2 (2.a. - 2.b.) in Part 2 (whichever is appropriate). 4. I am a law student or law graduate working under the direct supervision of the attorney or accredited representative of record on this form in accordance with the requirements in 8 CFR 292.1 ((a)(2)(iv). Form G-28 02/28/13 N Page 1 of 2"
}
