{
  "anumber": "A26759925",
  "id": "A26759925_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26759925_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, I-539"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 300 N. LOS ANGELES STREET (612) 376-7904 LOS ANGELES, CA 90012 PADILLA. GENOVEBA File No.: c/o FOIA (b)(6) Date: 3/24/84 2537 HANCOCK ST., Apt2 LOS ANgeles, CA 90031 Please note the items checked below. They contain information of concern to you or instructions for you to follow. 1. Insufficient information was given for the items circled in red on your application. which is attached. Please furnish full inform- ation and return your application to this office. 2. Your authorized stay has been extended. (See endorsement on attached Form 1-94.) 3. Your application for a change of nonimmigrant classification is approved. (See endorsement on attached Form I-94.) 4. Your application to accept part-time employment is authorized. (See endorsement on attached Form 1-94.) 5. Your application to accept practical training is authorized. (See endorsement on attached Form 1-94.) 6. Your application to accept employment during the period of your stay as the spouse or child of an exchange visitor is approved. This employment must be discontinued immediately if it becomes unnecessary for your support. 7. Your request for permission to transfer to another school is approved. 8. Your request for permission to transfer to another exchange visitor program is approved. 9. Your school or exchange visitor program is located in an area within the jurisdiction of the Immigration and Naturalization Service office at: Your correspondence has been forwarded to that office. All future correspondence should be directed to that office. Always refer to your file number (shown above). 10. Furnish Form 1-20 from the school to which you desire to transfer. 11. In connection with your desire to effect an exchange program transfer, please furnish Form DSP-66 executed in accordance with the instructions on the form. 12. Complete and submit the attached Form 1.539, \"Application to Extend Time of Temporary Stay.\" 13. Submit a current Form DSP-66 executed by your program sponsor. 14. Complete and submit the attached Form I-538. 15. Your passport must be revalidated for a period to extend six months beyond the expiration date of your requested extension of stay When you resubmit your application, amend it to show the new expiration date of your passport. Also send in your tem- porary entry permit (Form 1-94. ARRIVAL-DEPARTURE RECORD). If your temporary entry permit is attached to your pass- port, the permit should be removed for this purpose. DO NOT SEND IN YOUR PASSPORT 16. This office understands you have not registered as a student at Please inform this office immediately of your present activity. Your reply may be made on the reverse of this form. 17. This office understands you are not carrying a full course of studies. Please explain on the reverse of this form. 18. This office understands you are not attending classes to the extent normally required Please explain on the reverse of this form. 19. This office understands that you are no longer attending school Please explain. If you do not intend to resume school attend- ance, inform this office immediately of the date, place, and manner of your intended departure from the United States. Your reply may be made on the reverse of this form. 20. This office understands you are no longer an authorized participant in an exchange visitor program. Please explain. If you do not intend to resume an exchange visitor program, inform this office immediately of the date, place, and manner of your intended departure from the United States. Your reply may be made on the reverse of this form. 21. REturn All ENCLOSURES Sincerely yours, Enclosures: Form 1-94 I-539 Your passport LOS/ROS OR Form 542 (Rev. 3-1-72)Y"
}