{
	"anumber": "A27436780",
	"id": "A27436780_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27436780_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "HOUSEHOLD CERTIFICATE, Q0168111"
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1917, 1975, 1979, 1954, 1911, 1952, 1953, 2023, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 OUSEHOLD CERTIFICATE (MOVED OUT) (TRANSLATION) Administrative District and Address Household No. Q0168111 Changes of Head of Household No. 13, Lane 88, Min Kuo Rd., Lin 9, Chih Hang Li, Chiayi City, Taiwan, R.O.C. Blank Movements of Originally lived at Ting Cheng Hsien, Honan Province, Whole House- moved in on Jan. 1, 1950. Original door-place number hold was reorganized on February 10, 1954. Rewrote on May 19, 1979. Beverience HEAD OF HOUSEHOLD Name in Chinese Name in English LIU CHEN I.D. Card No. Q100080842 Date of Birth November 16, 1911 Order of Birth 1st male Graduated from primary Chief of Factory school. Affairs Section, Education Occupation Wang Pang Electric Mfg. Company Father's Name LIU HSING-TANG Mother's Name LIU GUNG HSIAO-FENG Native Place Ting Cheng Hsien, Name of Spouse LIU PAN JUI-FEN Honan Province, ROC Corrected year of birth to 1912 on November 16, 1952. Branch: Regular Reserve Sergeant Remarks Blood type: 0 MEMBER(S) OF HOUSEHOLD Name in Chinese to Name in English LIU PAN JUI-FEN I.D. Card No. Q200085790 Relationship Wife Date of Birth Feb. 15, 1917 Order of Birth 1st female Illiterate None/Housekeeper Education Occupation Father's Name PAN HSIEN-CHANG Mother's Name PAN CHANG SHIH Native Place Same as the head of Name of Spouse LIU CHEN household Her name was corrected on November 11, 1953. Moved to Lin 4, Chun Gung Li, Hsin Chu City, Hsin Chu Remarks Hsien in Sept. , 1975. - 1 - It TEL.(04) 2233716, 2283687 : 178 TEL.(07) 2513955, 2314531"
}
