{
	"anumber": "A27436780",
	"id": "A27436780_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27436780_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF MARRIAGE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1985, 1917, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "(Translation) CERTIFICATE OF MARRIAGE Date: June 16, 1936 WEDDING PARTIES: LIU CHEN , a native of Ting Cheng Hsien, Ho Nan Province, Republic of China, aged 25, born on November 16, 1912. PAN JUI-FEN , a native of Ho Fei Hsien, Anhwei Province, Republic of China, aged 20, born on February 15, 1917. On the introduction of Mr. Luan Hsi-Min, the above named wedding parties personally attend the wedding ceremony held at Chujung Hsien, Kiangsu Province, R.O.C., with Mr. Hao Hung-Tsao as the principal witness. The wedding parties, through this wedding ceremony, demonstrate their willingness to marry each other and form a family this day, and will respect, love and help each other for their whole lives. Sealed By: Wedding Parties LIU CHEN PAN JUI-FEN Principal Witness HAO HUNG-TSAO Introducers LUAN HSI-MIN LU KAO-HUA Masters of Ceremony : LIU KUANG-HAN PAN HSIEN-CHANG Attested on 13th Man. 1985 at Taipei District q It in # it Court, Republic or China, That he UNIVERSE TRANSLATION SERVICE signature (s)/seal (s) in this docu- I CERTIFY THAT T 3 TRGUSTATION IS A TRUE ment is/are authentic. AND CORRECT ENGL VERMON OF THE ATTACHED Wang Jia-Ning along ORIGINAL TO THE BEST OF MY . KNOWLEDGE AND Signature of BELIEF. Jon Tzu is 30052 Rv Patlic MAR. 10 1985 TRANSLATOR Smith Universe Translation Service : : 178 x 3 # 242 4F-1,174 Sec. 1, San Ming Rd., Taichung 178, 3F, Chung Cheng 3rd Rd., Kaohsiung 242, Chung Cheng 4th Rd., Kaohsiung Taiwan R n.c Taiwan. R.O.C."
}
