{
	"anumber": "A27436780",
	"id": "A27436780_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27436780_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, FORM I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1911]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/1/2023 * U.S. GOVERNMENT PRINTING OFFICE: 1983-403-962 U.S. Department of Justice OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-86 PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp FOR ISSUANCE OF IMMIGRANT VISA (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: REMARKS The petition was filed on The petition is approved for status under PERSONAL INTERVIEW CONDUCTED section: DOCUMENT CHECK ONLY FIELD INVESTIGATION COMPLETED SPOUSE, DATE 201 (b) CHILD 203 (a) (2) OF SEP 1985 APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD Emert into 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status:- R0485 10 85.00 LIU, Chen Married Widowed Divorced. Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? China 11-16-1911 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 10. petitioner's phone No 11. The beneficiary is my: (relationship) LIU, Mike (504)925-5477 Father 12. Other names used by petitioner (including maiden name if married woman) LIU, Hsing-Sheng 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) LIU, Pan Jui-Fen 2-15-1917 China 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Spouse 20720 Community St., Canoga Park, Ca. 91306 Children: #13, Lane 88, Min Kuo Rd., Lin 9, Chih Hang Li, Chiayi Cityne Taiwan 8450 Airline Hwy., Baton Rouge, LA. 91306 15. Names, birthdates and countries of birth of beneficiary's children: coos\" COMPACE secto B FLITS gug. GOLLECT 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at Los Angeles, California (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 20720 Community St., Canoga Park, Ca. 91306 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) 20720 Community St., Canoga Park, Ca. 91306 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) #13, Lane 88, Min Kuo Rd. Lin 9, Chih Hang Li, Chiayi City, Taiwan (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) in H 13, 88 % EV TZ, 9 fop OVER RECEIVED TRANS. IN RET'D. TRANS. OUT COMPLETED FORM 1-130 (Rev. 5-5-83) N"
}
