{
  "anumber": "A27851175",
  "id": "A27851175_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27851175_0037/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GIAY The Vi Kha Sanh Cho, 216/DP159/HG3"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 VIET - NAM - CONG - HOA Mão só 216/DP159/HG3 TOA HOA-GIÃI Kho 21x27 Luc 800 y bnn chánh de tai Phong Luc.Sur Ton Hoa Giai Saigon SAIGON So 5730. (1) Ngay 05 thang IO num 19 6I (1) GIAY THÉ-VI KHAI-SANH CHO TRAN - MAI Nam môt ngan chin träm 6I ngay 05 thang IO hoi 8 gio Truóce mät chung toi Nguyen-Van-Doanh Chanh-An Toa Hoa-Giai Saigon. tai Van-phong Chung toi 115, Dai-l0 Nguyên-Hue có Lue-str Phan-Van-Tu phu-tá DA TRINH - DIEN : 1.... Vulong-Nege 2.- Huong-Tytu 3.-. Diêp-Quoc-Chan Nhiing nhan-ching nay dã tuyen-the vá khai quit quyet biet chäc TRAN-MAI (Nü), Sanh nam I9I4 tai Quang-Dong (Trung-Quoc) Là con cua Ong Loi (c) va ba Lam-Thi (s).- Va duyen-co má dudng sy khong có the xin sao lue khai-sanh durec. là vl Syl giao thong gián doan. May nhan-churg dã xác-nhan nhir trèn day, nen Chung tôi phat giáy the vi khai- sanh näy cho durong-st de sir dung theo luât, chieu theo Nghi-Dinh ngay 17 thang 11 nam 1947 cua Thü-Turn chanh phü Lam-Thori Nam-phan Viet-Nam. Các dieu 211 via 215 cua ho Hinh-luät Canh-cai phat toi nguy-chirng ve viec ho tir 2 den 5 nam iii và phat bac tir 1.000 den 3.000 dong da duoc doc cho các nhan churng vá nguyen don nghe. Va các nhan-ching có ky ten vói chung toi và Luc-sir sau khi doc lai. Ky ten khong ru LUC SAO Y, Saigon, ngdy 06 thang IO nam 19.62 CHANH - LUC - sy GII TIEN 1.500 liet can nhie moi Whi GVN CHOLONY .in cap them ban sao shows LÊ-CHI-MAU"
}