{
	"anumber": "A27852356",
	"id": "A27852356_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27852356_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Refugee Determination Application, I-589"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/25/2023 GHI SAU DAY CAC TO CHUC VA HOI DOAN XA HOI CHINH TRI LAO DONG VA TON CIAO MÁ DUONG sil DA HOAC DANG THAM GIA CHO BIET THOI GIAN VA DIA CHI CUA CAC TÓ'CHUC TREN (NEU KHONG có VIET \"KHONG\") 15. I list below all organizations, societies, clubs, and associations, past or present, in which I have held membership, and the periods and places of such membership. (If you have never been a member of any organization, state \"None\") none TOI có CHUA TUNG BI XU vi VI PHAM LUAT PHAP (NEU có CHO BIET NGAY VA NOI LUAT PHAP NÃO. VA KLT QUA) 16. I have have not been charged with a vioiation of law. (If you have ever been charged with a violation of law, give date and place and nature of each charge and the final result TOI DA CHUA TUNG of HOA KY (NEU có CHO BIET NGAY NHAP VÃO MY VA MUC DICH THI DU DU LICH LUU NGU HOC SINH THUY THU 17. I have have not been in the United States. (If you have ever been in the United States, show the dates of entry and departure and the purpose of your entry. Visitor, permanent resident, student, seaman, etc.) HO só HAY SO CHI TRU NGOAI KIEU File or Alien Registration number 18. I have the following close relatives in the United States: Names TÊN HO Relationship QUAN HÊ Present address DIA CHI HIEN TAI FOIA (b)(6) 19. I am being sponsored by (Give name and address of United States Sponsor) NGUOI BÁO TRO (TEN HO VA DIA CHI) 110 Chi Minh City be N,18 CA - 91775 Date NGAY Viet Nam Signature of registrant KY TEN 21 MAY 1987 DO NOT WRITE BELOW THIS LINE DUNG VIET DUOI DAY I, , do swear (affirm) that I know the contents of this registration sub- scribed by me including the attached documents, that the same are true to the best of my knowledge, and that corrections, numbered ( ) to ( ), were made by me or at my request, and that this registration was signed by me with my full, true name: TÔI THE RANG NÔI DUNG BAN GHI NAY VA CAC TÀI LIEU KEM THEO HOAN TOAN THAT NHUNG DIEU CAI CHÍNH sô ) TOI SÖ ) LA DO su YEU CAU CUA TÔI TÓI KY SAU DAY TÊN HQ DAY DU. + (Complete and true signature of to registrant) (TÊN HQ DAY DU CUA DUONG sy Subscribed and sworn to before me by the above-named registrant at Bangkok, Thailand on MAY 1987 DUONG su? KÊ TREN THÊ TRUOC TÔI TAI (month) (day) (year) NGAY (THANG) (NGAY) (NAM) drawars (Signature and title of officer) maya CONDITIONED UPON STONSORSHIP AND MEDICAL ADMITTED AS A REFUGEE INTERVIEW APPROVED CLEARANCE PURSUANT TO SEC. 207 OF CLEARED THE I&N ACT. IF YOU DEPART THE U.S., YOU WILL DATE 22 MAY 1987 DATE REF COORD NEED PRIOR PERMISSION Initials) FROM I&NS TO RETURN. Bangkok, Thailand EMPLOYMENT AUTHORIZED AT drawen Immigration Officer maya Acting Officer in (Port) (Date) (Imm. Offs Officer in Charge SPRIUN 01 INSTRUCTIONS NHUNG DIEU CHI DAN This form should be executed, signed and submitted to the Officer-in-Charge of the nearest overseas office of the United States Immigration and Naturalization Service. When your name has been reached as a registrant you will be furnished additional instructions. DON NAY PHAI GHI DAY DÚ KY TEN VA NÔP CHO so DI TRU HOA KY GAN NHUT TOI PHIEN CUA DUONG su SE DI CAP THÊM NHUNG DIEU CHI DAN 1. REGISTRATION - A separate Registration Form must be executed by each registrant and submitted in one copy. A Registration Form in behalf of a child under 14 years of age shall be executed by the parent or guardian. 1. DANG KY: MOI DUONG SU PHAI NÔP MÔT DON DANG KY RIÊNG BO ME HOAC NGÚ81 BÃO TRÔ PHAI NOPBAN CHO TRÉ CON DUOI 14 TUOI 2. ASSURANCES: Assurance Form I-591 executed by a United States sponsor will be required before your refugee status may be authorized but need not be submitted at this time. 2. BÃO DAM: TRUOC KHI DUONG su DUOC VAO HOA KY NGÚ31 BÃO TRÔ MY PHAI NÔP DON 1-59/1 NHUNG KHONG PHAI NÔP HIEN GIO"
}
