{
	"anumber": "A27851175",
	"id": "A27851175_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27851175_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TO' KHAI GIA - DINH, 2017/43"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "50 Screenediby NARA 9/22/2023 PHU BON 1 6-12-13 HOLON LOT CHI - DÁN VIET-NAM CONG-HOA 1. Lap to khai gia dinh: DÔ (TINH, THI) BOTHANH SAIGON Khl CU ngy & môt nol quá 3 tháng thi phal lap to khal gia dinh. Gla trurng xin Khom-truong hoãe Ap trucng klén thj vao to khai gio dinh, röl nap cho n-phong Phuong hoãc Xa de kiem nhan, kem theo to khai thay dol noi CU tru. II. Khai them hay bot tên trong to khai gia dinh: Khi Có them hay bot ngual frong gia dinh thi phal khal báo de cap-nhut hóa to khal gla dinh. Gia-trudng xin Khom-truäng hoge Ap truong kién thj vao to khal them hay bot ten frong to khai gia-dinh, rèl ngp cho vän-phong Phuang hoãe Xa de klèm nhan, kem theo to khai gia-dinh (bàn mau) và các giáy tà chung minh (khol-sinh, khai- TO KHAI GIA-DINH IU, to khai thay dol noi CU trú .y. v...) III. Khai tam tru trong gia dinh: Khi có than nhan den tgm trú trong gia dinh, phai khai boo de ghi vao so vang lai a) Tür 1 dén 30 ngay: Gia-Truöng ngp cho Khom-Truàng hoãe Ap-Truring to khai xin Nha so fam tru de xin kién-thj kèm theo the can-cure cua nguòt xin tgm trú, Khom-Truòng 231/5 Jointracion hoão Ap-Truring dugc quyen cho tam tru 101 da 30 ngay. Duong b) Tü 1 dén 3 thang: Gig-Truöng xin Khom-Trung hoãc Ap -Trurng Klén Thi vão tà khai xig fam trú, rôl ngp cho ván phong Phucng hoão Xa de xin kiem nhan kem theo Khom (Ap) 14 Lien Gin the can cuac cua ngual xin tqm trú. Phuöng-Truàng heac Xa-Truong duoc quyen cho tam tru tol da 3 thang Phrong (X) c) Trên 3 thang Nguôl xin tam trú hoãc phal trà ve nguyên quan, hoac phál xin Quan Saw ghi Ten hay lap To Khal gio dinh noi CU ngy mól. CUOC CHU: Khl thau nhan nguôt giúp viec, Gla-Trung cung phal khal báo theo I Ho và Ten Gia-Truong LU CAM TiEu trong 2 The-Thuc sau days neu ₫uang sy giup viêc lâu dàl, áp dyng-Thu-Tyc khal them hay bot Chung nhan có cho & dau Saigon ngay on thang Tên trong To khai gio 'dinh (Myc II) néu duang sy glúp viac t am thal áp dyng thu tyc khai tqm trú frong GIA-TRU'ONGO gia-dinh (Myc in (danh cho to khai cua gia dinh o dau) (ky ten) CHU NHA IV. Khai thay dói noi CU tru: Khi ról han noi CU ngy CU de di à noi khác thi phal khai bão thay dol not CU trú tien de duqc ghl Tên hay lap To khal gia-dinh tgi nal CU ngy mál. Duong Sig xin Khom-Truchng hoãc Ap Trurng Klén-Th vão To khai thay dol not CU trú, ròi ngp cho Von-phong Phuàng hoãe Xa kem theo To khal gia dinh (bàn mäu) hoãc Xa-Truong bol Ten duang sy trong Tà khal glo dinh noi CU ngy CU kiem nhan to khal thay dol not CU trú röl giao cho duang SY I bán dd nop vão hô so khal gla dinh tgi nal CU ngy môl. KIEN THI: 14 KIEM NHAN: KHOM-TRUONG AP-TRUONG) PHUONG FROING (XÄ-TRUONG) V. Bien pháp ché tài Gla Truöng có trách nhiém khal bão de cho To khal gio dinh 10c não cung phu hop vál hian tinh dan só trong gla dinh. Nhüng rigual không chju khai báo, hay khal khong thanh that (không ke viac khal gian trá có the bl truy to theo Hinh-fu&t), se bj phat vi canh, chieu dieu 9 Ngh|- djnh so 353-BNV/HC/NB ngay 30-6-1958 B6-N1 Vy v1 khong tuân lênh cua nha chuc sign day can trách hanh chanb, mà theo dieu 491 cua B& Hinh-lu& m61 bon hönh, thi nguôt não vi Yau Huain pham Sae lénh và Nghl Sinh hqp pháp cua chuc quyén Hanh chanh hay chirc quyen Dô HAM-KIM-TR Tinh, Th) se bj phqt. vg für 401$00 den 600$ 00 và theo diau 492 ké tiép thi ngoal hinh phot vg, can pham con có the tuy truding hap, bj phgt giam tis I ngay den 10 ngay nita. O danh rieng de dong dãu phan bist to khai cua chu nha hay CUB ngudi & day,"
}
