{
  "anumber": "A27852356",
  "id": "A27852356_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27852356_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SO YÊU LY LỊCH"
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1912,
        1882,
        1937,
        1960,
        1973,
        1901,
        2023,
        1879,
        1994
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/25/2023 CONG HOA XA HOI CHU NGHIA VIET NAM Dôc lap - ,Tu do - Hanh phác K SO YEU LY LICH Ho và Ten DIEC -THE chien Cao : 1th51 Ngay tháng nam sanh 07-9-1912 Bi Nam, danh Nu can-thing 36 ty Sanh quan X, Quân, Mic Thanh phan gia dinh Trú quan chô z hien tai 117 Vink ph Vien HAC F18 for Thành phan ban than Tam Cory Lam Dân têc HOA Trink do: Viet van Ton giao Kling Ngoai rgu (HOA) best Viet Va doc Anh van : Phap ven Trinh do ky thuat chuyen mon nghiep vu TINH TRANG GIA DINH Ho ten Cha DIEC TOAN Ngh nghiep tuoi Aat tuoi (1879) Ngh8 Ho Ch tên & nghiêp hien Me may Basicy Dachit The j (Bailory HAC Stn been) Juary Day tudi 98 two (1882) Ch Neu chet & hien thi may ghi da As chet chit nam (tren name dong 1973 noi & hien (86towe) nay). tai Binh CHolen Ho ten anh, chi em rudt. Ghi ro turing nguoi dang lam gi va & dau ? Ho va tên VQ' hoac chong lam gi va & dau ? Ching Lu Tech (1901) 84 tuai In chit nam 1960 (5gthel) for bink Vien CHOLOR Ho v& ten tudi các con. Ghi ro tirng ngudi dang lam gi va & dan DIEC-S6 48t(28- 10-1937 tai CHOLOR Lam for To-Hop HEEP-LINC yanh 3)Li XII-H'A HE (23-4-1994) An Bouls Xa to An Long fai 70,Holf HEEP Lic DIEC MISOT 43t (U6-6-19:10) for CHOLOR Hoi tro sumber link Diring Alb Q8 one ithua vat co khi H P Quan 10 name any othera Va Co' this Educity keet $20.000 4) Lic HAO 3 8 tast (10/21-1949 fai An Beah Xa Di-An-Bien-HoA Lam fai T5-Hip HIEP-Citc 2 Aganh only -ithua vacokhi oz 117 Virh Dien Tife Juan 10"
}