{
	"anumber": "A27851175",
	"id": "A27851175_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27851175_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 9/22/2023, PART THREE : IMPORTANT NOTICE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 PART THREE : IMPORTANT NOTICE If you are married, you must wait until your spouse also has an exit permit from the appropriate authorities, and an interview, so he or she may accompany you. The United States Orderly Departure Program will not close your file, but instead will actively, assist you in getting exit permits for your spouse and/or minor children, in order that you may travel as a family: If your marital status changes between the time of your interview and the time of your departure from vietnam, you must so inform UNHCR and the U.S. ODP office. (ODP You must identify yourself completely and truthfull. You must identify all your relatives above, living or dead, whether they are accompanying you or not. You will be questioned and examined by our representative in vietham, by United States, Consular Officers in Vietnam and in Thailand, and by Officers of the United States Immigration and Naturalization, Service in Thai- land and at the Port of Entry into the United States. You must answer all their questions truthfully and completely. If at any stage of this process you do not answer truthfully or completely, or if. you misrepresent or conceal any fact about yourself or your family, or if you make any false statements or declarations, you may be found guilty of haying committed a fraud. You will then be pronibited from ever being granted admission to the United States, and you may make it impossible for other members of your family to apply for admission to the United States. Remember, you must answer every question truth-fully and completely. Donald I. Colin Director U.S. Orderly Departure Program (H) PART FOUR: ACKNOWLEDGEMENT I hereby acknowledge that the facts I have presented in Parts One and Two, above are complete and accurate, and that I have read and understand the Important Notice in Part Three, above. I also promise to inform UNHCR and the U.S. ODP office if my marital status changes before my departure from vietnam. Signature MORNING UNHCR 1985 Date 04 MOV CITY H MINH Witness :"
}
