{
	"anumber": "A27851175",
	"id": "A27851175_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A27851175_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS, FORM G-641 (REV. 5-5-83IN"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U. 1056 OMB No. 1115-0088 UNITED STATES DEPARTMENT OF JUSTICE Expires 3-31-85 Immigration and Naturalization Service Fee Stamp APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE 24MAR,1985 RECORDS TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSONS TO WHOM INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED IN THE BOX BELOW: 810604 RSON CONSENTING NAME AND ADDRESS NAME STREET ADDRESS FOIA (b)(6) FOIA (b)(6) CITY. STATE ZIP CODE U. S. DEPARTMENT OF JUSTICE IMMIGRIA TION & NATURALITATION SERVICE 300 NORTH LICIS ANGELES STRIET 1. CHECK TYPE VERIFICATION REQUESTED LOS ANGMENS, 20012 OF FOR WHICH DESIRED u-los b/Ak 3. NUMBER OF COPIES DESIRED. IF ANY: LAWFUL ADMISSION FOR PERMANENT RESIDENCE AGE OR DATE OF BIRTH SANG KOK, THAILAND / NATURALIZATION ORCITIZENSHIP 2A. NAMES OF BENEFICIARIES 4. IF INFORMATION IS FOR SOCIAL SECURITY GEN ALOGICAL INFORMATION (See instruction #0 and 7.1 BENEFITS, SHOW SOCIAL FOIA (b)(6) SECURITY NUMBER: OTHER (CERTIFICATE OF BIRTH DATA ETC.) DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME MIDDLE NAME 6. ALIEN REGISTRATION NUMBER FOIA (b)(6) 7 OTHERNAMES USED IF ANY 8. NAME USED TIME FOIA (b) (6) 9. PLACE OF BIRTH 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES FOIA (b)(6) 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY FOIA (b)(6) GIVE THE FOLLOWING FORMATION FOR VERIFICATION OF NATURALIZATION OR CERTIFICATE OF CITIZENSHIP 15. NAME ON CERTIFICATE 16. CERTIFICATE NUMBER 17. DATE ISSUED 18. ADDRESS WHEN CERTIFICATE WAS ISSUED 19. NAME AND LOCATION OF NATURALIZATION COURT OR IMMI- GRATION OFFICE ISSUING CERTIFICATE OF CITIZENSHIP 20 SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - RESERVED FOR GOVERNMENT USE ONLY FOIA (b)(6) THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: DATE VERIFICATION OF INFORMATION REQUESTED WAS MADE ON THISHDATE SHOWN AT RIGHT Rov 28, 1979 3/20/86. LAWFUL ADMISSION FOR PERMANENT RESIDENCE ON AT NATURALIZATION INFORMATION AS SHOWN ABOVE IS CORRECT. ABQ CLASS RB6 NATURALIZATION IN (COURT) U.S. DEPARTMENT OF JUSTICE ON (DATE) AT (LOCATION) IMMIGRATION & NATURALIZATION SERVICE DATE OF BIRTH AHRIVAL RECORD DATED SHOWED SUBJECTS AGE AT TIME TO BE LAWFUL ADMISSION VERIFIED UNABLE TO IDENTIFY ANY RECORD COPIES ATTACHED AS REQUESTED SIGNATURE CERTIFICATE OF CITIZENSHIP IN (OFFICE) Contact Representative, USINS ON (DATE) TITLE Approved By: DATE PRIVACY ACT IDENTITY ESTABLISHED IN PERSON IDENTIFICATION (WHEN REQUIRED) DOCUMENTS G-652 Affidavit OTHER (List) ATTACHED FORM G.641 (REV. 5-5-831N 3D"
}
