{
  "anumber": "A28417099",
  "id": "A28417099_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF DEPORTATION CASE, NARA 672025"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "0 seguinte uma notificação oficial Foi ordenada a sua deportação para NARA, 6/19/2023 atenção, por favor. o senhor notificado tão logo fiquen prontos os pr rativos para embarque Se necessário, ajudá-io-emos tanto quanto asível no arranjo de seus assuntos pessoais para o embarque. Caso desejar voltar aos Estados Unidos, deverá escrever a esta repar- tição ou ao Consulado americano mais próximo do seu domicílio no exterior, informando-s de como obter permissão para regressar, após a sua deportação. Nos termos da lei (Título 8 do Código dos Estados Unidos, Seção 1326) qualquer pessoa deportada que regressar sem autorização incorre em delito grave. Se for condenada, a pena cominada poderá importar em reclusão até 2 anos e/ou multa não superior a $1.000,00. Guarde por favor esta carta e faça referência ao número do arquivo acima mencionado quando escrever a esta repartição. GREEK TRANSLATION 'H narouga aas, hore mapaxaletate va The Avayvibete nations . Exhipen SIGTOYA had Thv inclaner oas sig ed oãs cuous 110115 at THE drawn oas. 'Ev 19 HETREE xal tav our LOYOS ea xribe huvathv Boneenav vd TàG 025 hid va 81 'dvaxtionaty. 'Ev *...\" G& hollate va etc rds EOASTEIRS MEOV vit treuGuvenre sig The Sunnenlav uns K etc TO ands TOV TONOV THE tv in Allobann oas Auentxavixhv ToameTov old vh it's mods tas manoxis the tas 01 uerd . Karà The TWV Headlasov 8ov, \"Ap6pov 1326). of xar dveu doetas Dewrettas Evoxos of 11 HEXOI truv if HEXP: XIXCOVE dollapsw H xar 11 The MOIVAS. vr XCOTHOETE The Tanoügav NOTE va etc TOV dve transport maxellou etc REPEATURILY 11 Thr Ungreatav was. CHINESE TRANSLATION"
}