{
	"anumber": "A28417099",
	"id": "A28417099_0075",
	"page_index": 75,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0075/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, A28 417 099"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 A28 417 099 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31 - 34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion FONSECA , TERENCIO JESUS M Country of Citizenship Passport Number and Country of Issue File Number PLEASE Height Weight Occupation NICARAGUA U.S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) Scars or Marks 599 MONROE AVE APT3, ELIZABETH NJ07201 Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) 4-23-87 TEXAS BORDER EWI Single Married Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension BARRiO LAREINAGA, MANAGUA, NICARAGUA 518.1 Birthdate Date of Action Location Code Near) Date & Hour 15-1906 05-23-88 NEW NEW 5-23-88 City, Province (State) and Country of Birth AR Form: (Type & No.) Lifted By MANAGUA, NiCARAGUA Not Lifted BATTLES Visa Issued At-NIV No. Social Security Account Name Status at Entry Status When Found NONE LETTERS EWI IN SERVICE Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. NONE To: OVER ONE YEAR Immigration Record Criminal Record I 589 DENIED MARCH 2, 1988 NONE CLAIMED IN us. Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of minor Children ELVIRA BELLANGER, LARREYNAGAI NICARAGUA Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed NA ROTEN See Form 1-43 Yes No Not Listed Listed, Code Name and Address of (Last) (Current) U.S. Employer Type of Employment N A Salary NA From: To: $ hr. Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last entry, and elements which establish ad- ministrative and/or criminal violation. Indicate means and route of travel to interior) Alien has been advised of communication privileges pursuant to 8 CFR 242.2(e). Initial Date BASED ON REVIEW OF FILE LAST ENTRY: SUB JECT ENTERED THE U.S. ON 4-23-87 EWI (WiTHOUT INSPECTIONS AT AN UNKNOWN LOCATION ON THE TEXAS BORDER. AFTER ENTRY: ON JUNE 10, 1987, SUBJECTFILED I589 (APPLICATION FOR ASYLUMS CLAIMED THAT HE WOULD BE PERSECUTED IF HE RETURNED TO NICARAGUA (SEE COPY OF DENIAL ON FILE. ON APRIL 6, 1988 SUBJECT REqUESTED ISSUANCE OF OSC. anni Battler IE (If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from Officer: A. Buttle Junuco ( ). M. Disposition (Receiving Officer) flother at Form 1-213 (Rev. 4-16-79)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
