{
  "anumber": "A28428659",
  "id": "A28428659_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28428659_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service Memorandum of Creation of Record of Lawful Permanent Residence, I-181 ( (Rev.3-1-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Haiti",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Government Printing Office: 1985-493-741 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place NYC File No. A28 428 659 Status as a lawful permanent resident of the United States is accorded: Sex 1 Male Date of Birth (Month/Day/Year) Name In Care Of 2 Female 5-3-1907 Street Ferdinanad Edgar DE LOUIS City of Birth Country of Birth Address 116 15 222nd Street 104-28 211th Sheet Haiti haiti Apt. No. City, State, Zip Queens NO village, Ny 11429 Country of Nationality Country of Last Residence Haiti Haiti Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) 3 Widowed 4 Divorced 5 Separated UNR B-2 86 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) N-A SD-6 N-A Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable MARIE DESITUS Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification Canada 9-12-86 114497 of Last NIV B-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the [ & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session <Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act NYC As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE SD-6 Class of admission (Insert Symbol) REMARKS RECOMMENDED BY: (Immigration Officer) (Date) DATE OF ACTION Clakic: DD DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) 3-27-87 RW CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I- 181 (Rev.3-1-83) N 1. FILE COPY"
}