{
  "anumber": "A28417099",
  "id": "A28417099_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEportation Case Check Sheet, I-170"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 DEPORTATION CASE CHECK SHEET 28 417 099 Fixe: A- ATTORNEY OR FONSECA, Terencio Jesus REPRESENTATIVE: ALIEN: 599 Monroe Ave., , Apt. E3 Elizabeth, N. J. 07201 ADDRESS: ADDRESS: Com- Com- pleted Initials ACTIONS TO BE COMPLETED pleted Initials ACTIONS TO BE COMPLETED (Date) (Date) 1-94 6/22/88 Bb 252(b) CASES Stamped I-95 Notice of Revocation I-99 M-125 Docket Control Tape 6/22/88 Bb and Penalty Notice to Detain I-259 1-210 Voluntary Departure Notice and Deport ARRANGING TRANSPORTATION I-205 Warrant of Deportation Notice to I-229 Warning of Six-month I-288 Transportation Line Limit - 242(e) Record of I-217 Information-Travel I-380 Billable Expense I-217A Document Application Demand for Surrender I-340 I-141 Medical Certificate Under Bond Notice of Dep'n Destination I-294 I-323 Bond I-391 630-aff Notice to Surrender I-166 and Penalty for Reentry for Deportation Breach G-391 Detail of Det. Off. Cancellation Record of Person & T.D. Request Country I-216 I-241 Designated by Alien Property Transferred T.D. (C-N) Request I-164 Document Envelope Country of Nationality Passport Noted . O.I. 242.10(g) CLOSING ACTIONS DETAINED CASES Notice of Detention I-157 Notice of Deportation 1-286 or Release Conditions G-189 Statistical Punch Card Warrant for Arrest of Alien G-174 1-200 Lookout Notice G-143 I-203 Order to Detain or Release Alien Worksheet G-589 Property Receipt Disposition Notice - FBI Disposition Notice - RCMP G-590 Property Envelope I-43 Statement of Detained Alien Deportation Expense Billed Baggage & Personal Effects Notice re Detention and I-94 Stamped and I-284 Deportation Expenses I-95 Forwarded \"Closed\" Tape Placed on File I-247 Notice of Detainer To Rec. Adm. Re I-151 (I-551) File Stamped \"Statistics\" I-154 Closed Disposition Information furnished the following: Alien (is)(is not) detained and is ready for deportation to at the expense of Alien's condition is: Able Mental CINS Physically Incap. . (Name of SS Co. - Government) Deportation Officer Date Remarks: Form I-170 United States Department of Justice, Immigration and Naturalization Service (Rev. 9-15-78)N"
}