{
  "anumber": "A28417099",
  "id": "A28417099_0076",
  "page_index": 76,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0076/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31 34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion FAN Country of Citizenship Passport Number and Country of Issue File Number PLEASE Height Weight Occupation U.S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) TREWART Scars or Marks Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) OR Single Married Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence PRINT Method of location/Apprehension IN 5181 Birthdate Date of Action Location Code (At/Near) Date & Hour NEW City, Province (State) and Country of Birth AR Form: (Type & No.) Lifted CAPITAL By Not Lifted Visa Issued At-NIV No. Social Security Account Name Status When Found LETTERS Status at Entry Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. To: Immigration Record Criminal Record I 589 DENIED MARCH 2, 1988 NONE CLAIMED IN us. Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of minor Children ELVIRA BELLANGER, LARREYNAGAI NICARAGUA Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession NA ROTEN None Claimed See Form 1-43 Yes No Not Listed Listed, Code Name and Address of (Last) (Current) U.S. Employer Type of Employment Salary From: To: NA NA $ hr. Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last entry, and elements which establish ad- ministrative and/or criminal violation. Indicate means and route of travel to interior) Alien has been advised of communication privileges pursuant to 8 CFR 242.2(e). Initial Date BASED ON REVIEW OF FILE LAST ENTRY: SUBJECT ENTERED THE US. ON 4-23-87 EWI (WITHOUT INSPECTION) AT AN UNKNOWN LOCATION ON THE TEXAS BORDER. AFTER ENTRY: ON JUNE 10, 1987 SUBJECTFLLED I589 (APPLICATION FOR ASYLum) CLAIMED THAT 67088 HE WOULD BE PERSECUTED IF HE RETURNED TO NICARAGUA (SEE copy OF DENIAL ON FILE ON APRIL 6, 1988 SUBJECT REQUESTED ISSUANCE OF OSC annue Battle IE (If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from A Buttle Officer: Junulu 1988 NEW at ). M. Disposition (Receiving Officer) Hother Form 1-213 (Rev. 4-16-79)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}