{
  "anumber": "A28428659",
  "id": "A28428659_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28428659_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet, I-485 ( (243)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2000
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATLRALIZATION SERVICE Processing Sheet 1-485 (245) File No. A28428659 REV, JOHN GARKOWSKI CHECK ONE SUBJECT T. FOREIGY STATE CHARGE -- EXEMPT FOREIGH STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT SD-6 SECTION PRIORITY DATE COUNTRY OF REFERENCE 203 (a) () NONPREFERENCE 203(a) (3) DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If Checked) (If Checked) Date Mailed DATE Delay Notice 3/C MEDICAL I-181 to State M!L INTERVIER G-325A Sheet #1 3/33/52 Photos RESCHEDULED 2 9 Support MEDICAL 3 4 1-508 INTERVIEW 4 OTTAWAFERAM 1-88 Other Consulate (Location CATEGORY Aooo Prepare I-486 with date 45 days beyond date G-325A sens. Type I-151, caitting entry date, place and Immination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY 3.00 Prepare I-486, ositting date and insert in filo. Type I-151, onitting entry date, place and lamination. Insert in filo with 245 packet (I-357; G-153) Officer's Instructions: French Interp Cother Frenkel DISTRIBUTE (If Stecked) : Bene state that he perform 10.36 :0 State Door. gd to consulate AT priestly duties says Mass 0.56 to so. Sarv. at At Bouthologiew in PRIEST This 2000 my be overpristed 6 starped to above instructions, items requested, item received, or other persinent data which DAY facilitate processing. GPO MS Leep case about - to of all material is as was lattial decision is nets :-162 Rev. 22-1-10) Elmhurst even things they Ne is there on the site have regular print was"
}