{
	"anumber": "A28417099",
	"id": "A28417099_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 6/7/2023, Miami Managua Lions Club de Leones Miami Managua"
		},
		"years": {
			"ms_years_nlp_v1": [1989, 1991, 2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 DE SECURITY AMERICA CENTRAL Miami Managua Lions Club DR. POLIDECTO CORREA Presidente (305) 556-8928 Club de Leones Miami Managua CESAR N. CASTRO E. Founded in - Fundado en 1984 Secretario (305) 696-4893 P.O.Box 651045 - Miami, Florida 33265 DR. OSCAR SARAVIA Tesorero (305) 324-0238 DR. RENE QUINONEZ TO WHOM IT MAY CONCERN: 1er. Vice-Presidente (305) 559-2510 RODOLFO SILVA 2do. Vice-Presidente This is to certify, that the MIAMI MANAGUA LIONS CLUB (305) 554-8588 DR. RAMON ESPINAL has donated to Mr. TERENCIO FONSECA, a Nicaraguan Citizen, cu- 3er. Vice-Presidente (305) 596-2608 rrently living at 254 N. W. 35th Avenue, City of Miami, County RAUL ROCHA TERCERO Domador (305) 553-6326 of Dade, State of Florida, 33125, a WHEEL CHAIR, which was ADRIAN ESPINOSA O. Tuercerrabos (305) 324-0807 received from us from the Mayor of the City of South Miami : MARIO MIRANDA Past-Presidente Mr. PEDRO REBOREDO, whom made this gift. (305) 598-0869 IRVING SILVA 1er. Vocal (305) 871-6836 We do issue this certification at the City of Miami, - EDUARDO HISLOP JR. 2do. Vocal County of Dade, State of Florida, on November 6th, A.D. 1989. (305) 681-3718 RUFINO PIZARRO 3er. Vocal MIAMI MANAGUA LIONS CLUB (305) 435-4320 WILLIAM ZAPATA 4to. Vocal (305) 666-7206 H. L. GIOVANDY T RAMIREZ NICOLAS LOPEZ-MALTEZ Charter President Secretary a.i. (305) 553-6528 STATE OF FLORIDA ) SS COUNTY OF DADE ) Sworn to and subscribed before me this 6th day of November, 1989. NOTARY PUBLIC John State of Florida at Large Notary Public, State of Florida at Large Bonded thru General Insurance Underwriter My Comission Expires Dec. 22; 1991"
}
