{
	"anumber": "A28417099",
	"id": "A28417099_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 6/7/2023, Form I-166 Rev. 4-1-69"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 UNITED STATES DEPARTMENT C USTICE IMMIGRATION AND NATURALIZATION SERVICE 7880 BISCAYNE BOULEVARD MIAMI, FLORIDA 33138 CERTIFIED MAIL FILE NO: A28-417-099 RETURN RECEIPT REQUESTED DATE: January 11, 1997 YOU MUST BRING A FONSECA, Terencio PASSPORT OR OTHER 599 Monroe Ave Apt 3 DOCUMENTS Elizabeth NJ 07201 FACILITATING YOUR TRAVEL TO Nicaragua As you know, following a hearing in your case you were found deportable and the hearing officer has entered an order of deportation. A review of your file indicates there is no administrative relief which may be extended to you, and it is now incumbent upon this Service to enforce your departure from the United States. Arrangements have been made for your departure to Nicaragua on (country) February 7, 1997 from Miami, Florida on the (date) (port of departure) TRANSPORTATION ARRANGEMENTS CONVENIENT TO THE GOVERNMENT (name of vessel, airline, or other transportation) You should report to a United States Immigration Officer at Room 800 7880 BISCAYNE BOULEVARD, MIAMI, FL 33138 at 9:00am February 7, 1997 (address) (hour and date) completely ready for deportation. At the time of your departure from MIAMI, FLORIDA you will be limited to -44- pounds of baggage. (place of surrender) Should you have personal effects in excess of this amount you must immediately contact Deportation Officer at (305) 536-5745 , or (name of officer) (phone no, and ext.) call in person at the address noted above, and appropriate disposition of your excess baggage will be discussed with you. Very truly yours, cc: Form I-166 Robert A. Wallis Rev. 4-1-69) Acting District Director"
}
