{
  "anumber": "A28428659",
  "id": "A28428659_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28428659_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Excerpt from the Registries of Birth Certificates of Saut d’Eau community, filed at the National Archives of the Republic of Haiti, BBB No. 60668"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1907,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI Excerpt from the Registries of Birth Certificates of Saut d'Eau community, filed at the National Archives of the Republic BBB No. 60668 Today, July 13, 1907, 140th year of Independence at ten Seals and in the morning, Before us, the undersigned, Leonidas Rigaud, Stamps of Civil Registrar of Saut d'Eau; Have appeared Mr. Desilus the Depart- Delouis and the lady Marie Jeannot, both of legal age, farmers, ment of Taxa- domiciled and residing at Saut d'Eau who had presented us, tion and a child of masculine sex that they declared to be their Collection legitimate son, born at their home, on May 30 of this year of the Repu- at four o'clock in the morning; to that child they have blic of given the name of: FERDINAND. Document made in our office Haiti in the presence of Edgard Hyppolite and Villars Jeannot Jeune both of legal age, domiciled and residing. After our reading the first witness did not sign for not knowing how, the YEAR: 1907 second and the declarants have signed it with us; (Signed) See margin PAGE: 169 Signed LEONIDAS RIGAUD RECEIPT NO. 7587 X NO. : 251 Port-au-Prince, October 16, 1980 BIRTH CERTIFICATE OF FOR CONFORMED COPY FERDINAND DELOUIS COLLATED Natural child SIGNATURE JEAN CLAUDE BLANCHARD GENERAL DIRECTOR les # les# Seals and Stamps of the National Archives M/M of the Republic of Haiti CERTIFICATION OF ACCURACY I, JEANINE E. SCUTT, certify that I am fully qualified to translate from French to English and from English to French and that the above translation is accurabe to the best of my knowledge and belief, without any addition or omission. Jeanise JEANINE g E. Scutt SCUTT 243 Prospect Park West BROOKLYN, NEW YORK 11215 Sworn to and Subscribed before me this 6th day of GENZALEZ County York 87. March Gu 1987 Sanza Notary commission Qualified Cert. Public, No: in New in Kings March County 20.19- NOTARY Public Stateonly."
}