{
  "anumber": "A28417099",
  "id": "A28417099_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Patient Discharge Instructions, C-210"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 P...IENT DISCHARGE INSTRUCTIONS INSTRUCCIONES AL PACIENTE AL DARLE DE ALTA ACTIVITY - ACTIVIDAD BED REST (DURATION) RETURN TO WORK/SCHOOL Guarda Cama (Duración) Regrese al trabajo/colegic ON/ Fecha: OTHER (SPECIFY) OR/O PENDING EVALUATION Otro (Especifique) Puede regresar según la evaluación CLINIC: Clinica: DATE: Fecha: DISPOSITION - ORDEN AL PACIENTE: RETURN AS NEEDED CLINIC APPOINTMENT (NAME) Regrese cuando sea necesario Cita en la clínica (Nombre) Regrese a su Médico Privado NEUROLOGY CHICA RETURN TO PRIVATE PHYSICIAN Remest AMBULANCE TRANSPORTATION NEEDED Se necesita transporta en ambulancia New LABS/OTHER TESTS SPECIAL DIET (Dieta Especial) Pruebas: Laboratorio/Otras NURSING HOME (NAME) INSTRUCTIONS FORM: Hogar de Ancianos (Nombre) Hoja de instrucciones DISCHARGE MEDICATION OTHER INSTRUCTIONS Medicamentos Al Darie De Alta Otras Instrucciones THANK Physician/Nurse completing above form: PATIENT RESPONSIBILITY RESPONSIBILIDAD DEL PACIENTE Emergency care is by nature temporary care. La atención de emergencia tiene carácter temporal. You are responsible for seeing your physician for follow-up care. Usted es responsable de ver a su médicaparatawa continue tratandole. 20484 DATE DISCHARGED Physician/ Nurse signature (if different from above) FONSECA, IMPERENCE 10 JESUS 4227 NW S ST 4 2126 9271 MED 1/EJG I TIME DISCHARGED PATIENT SIGNATURE a.m. p.m. 092989 JACKSON MEMORIAL HOSPITAL MIAMI, FLORIDA C-210 PAGE 2 EMERGENCY CARE CENTER 01-0218-7 REV 1986"
}