{
  "anumber": "A28417099",
  "id": "A28417099_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 6/7/2023, Form I-294 Rev. 5-1-84XN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 UNIT STATES DEPARTMENT OF JUSTICE IMMIG TION AND NATURALIZATION SERVICE 7880 Biscayne Boulevard Miami, Florida 33138 PLEASE REFER TO THIS FILE NO. A28-417-099 FONSECA, Terencio c/o U.S. Immigration Service DATE: June 30, 1992 Miami, Florida Dear Sir or Madam: This is a warning. Please read carefully. Nicaragua It has been ordered that you be deported to You will be informed when departure arrangements are complete. If needful, we will assist you as much as possible arrang- ing your personal affairs for departure. Should you wish to return to the United States you must write this office or the American Consular Office nearest your resi- dence abroad as to how to obtain permission to return after deportation. By law (Title 8 of United States Code, Section 1326) any deported person who within five years returns without permission is guilty of a felony. If convicted he may be punished by imprisonment of not more than two years and/or a fine of not more than $1,000.00. Please keep this letter and refer to the above file number when writing to this office. Public Very truly yours. Richard B. Smith District Director Advertencia importante. Lea cuidadosamente este aviso. Se ha ordenado deportario a Nicaragua arregiar sus asuntos personales antes de su salida. Se le informará una vez finalizados los arregios para su salida. Si fuera necesario, le prestaremos la mayor ayuda posible para Si usted deseara regresar a los Estados Unidos, debe escribir a esta oficina o al Consulado de los Estados Unidos más cercano a su residencia en el enterior con el fin de informarse sobre la forma de conseguir permiso para regresar después de haber sido deportado. Por ley (Título 8 del Código de los Estados Unidos, Sección 1326), toda persona deportada que, en un plazo de cinco años, regrese a los Estados Unidos sin permiso incurre en un delito mayor. De ser declarado culpable, puede recibir una pena de prisión no mayor de dos años y/o una muita que no exceda de 1.000 dólares. Sírvase conservar esta carta y haga referencia al número de registro arriba indicado al escribir a esta oficina. Form I-294 See Portuguese. Greek. Chinese. and French transiations Rev 5-1-84)N on reverse"
}