{
	"anumber": "A28417099",
	"id": "A28417099_0059",
	"page_index": 59,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0059/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RESPONSE TO MOTION (S), Page Two"
		},
		"years": {
			"ms_years_nlp_v1": [1984, 1988, 1989, 2023, 1977]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 RESPONSE TO MOTION ( (S) Page Two November 27, 1989 6. A Hearing was set for December 22, 1988 in Miami for which the respondent failed to appear. He was ordered deported in absentia; 7. The case was reopened and a hearing took place on March 17, 1989; the case was again reset until July 13, 1989 at 10:30 A.M. due to considerations of the respondent's health; 8. On July 13, 1989, the case was again reset until October 19, 1989 for attorney preparation time; 9. On October 19, 1989, the respondent failed to appear; the case was again reset to November 30, 1989 at 9:00 A.M. in order to provide communication time for attorney and client. It is apparent from the above chronology that the government has given this respondent the utmost consideration due to his advanced age and failing health. We realize that his situation is difficult, and meritorious of such consideration. However, the Service is not empowered to pick and choose how the laws as set down by Congress are to be applied. During the hearing, the appellate process, and the enforcement procedures if any, \"humane and reasonable action\" will be taken towards Mr. Fonseca. THEREFORE, the government opposes the instant Motion to Terminate in that the respondent is deportable under Section 241 (a) (2) of the Immigration and Nationality Act as is evident in the record. No grounds have been proffered for the respondent's Motion to Terminate. Counsel offers that the respondent \"would be denied due process if these proceedings continue. Respondent cannot speak for himself \" An alien must demonstrate that he has been prejudiced by a violation of a procedural rule or regulation before his deportation proceeding will be invalidated. Matter of Santos, Interim Decision #2969 (BIA June 26, 1984) Even the right to counsel does not arise by operation of the 6th Amendment, because deportation proceedings are not criminal prosecutions. See Matter of Santos, supra; Ramirez V. INS, 550 F. 2d 563 (9th Cir. 1977). Mr. Fonseca has retained competent counsel to speak for him, who will adequately represent his interests. It is the government's position that the record taken as a whole presents a prima facie case of deportability thus far. \"Deportation is purely a civil proceedings, and thus, various protections that apply in context of a criminal trial do not apply in a deportation hearing.\" Bhima Nathubhai PATEL,"
}
