{
  "anumber": "A28417099",
  "id": "A28417099_0082",
  "page_index": 82,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0082/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Order and Bond/Custody Processing Sheet"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2000
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 U.S. Department of Justice Application for Orde , Show Cause (Relating Form 1-213 Immigration and Naturalization Service and Bond/Custody Processing Sheet must be attached) A. Name FONSECA, TERENCIO JESUS Office File NEW A28 417 099 Address Date 599 MONROE AVE APT 3 3, ELiZABETH NJ 07201 FACTUAL ALLEGATIONS 1. You are not a citizen or national of the United States 2. You are a native of NICARAGUA and a citizen of NiCARAGUA ; 3. You entered the United States at AN UNKNOWN LOCATION gr TEXAS BORDER ON 04-23-87 AT THAT TIME you WERE NOT INSPECTED BY ADne) OFFICER OF THE us, INS. 4. 5. Section 241 (a) (2) of the Immigration and Attorney of Record Supporting evidence (briefly itemize) Nationality Act, in that, you entered the SEE I589 W/FILE AS ATTESTED TO Bysuas United States without inspection. B. ADDITIONAL FACTORS TO BE CONSIDERED FOR BOND CUSTODY DETERMINATION 1. Is a petition. application pending for this alien or family member? (explain) NA 2. Total times apprehended Bonded before? How many times? Released o/r before Bond breached? How many times? Complied with o/r 3. Present state of health of subject. of spouse, children (if other than good. explain) 4. Total time in U.S., dates and location; residing with (Family members or others) 5. Personal property in U.S. (liquid and non-liquid assets) 6. Family members in U.S. (Wife, children, immediate relatives) address if different than subject: 7. Employment history: (Other than current) 8. Other factors i.e. false claim, attempted flight. unsupervised children at home, etc. C. The undersigned recommends: V/D without OSC OSC Charge(s) ROTEN (Code) (Page No.) Trial Attorney Interpreter (Language) Prosecution Violation W/A For the following reasons: Signature Signature and Title IE Supervisory Approval Title su D. Approved as to legal sufficiency; 6-2000 Date) (Signature) (Title) (Office) E. Based on the above information I have set the following bond $ DD Acting DD DDD ADDI OIC (Date) (Signature) (Office) Form I-265 (Rev. 4-15-81)Y"
}