{
  "anumber": "A28417099",
  "id": "A28417099_0058",
  "page_index": 58,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28417099_0058/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IN THE MATTER OF:, A28-417-099"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        1989,
        3000,
        1987,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 UNITED STATES DEPARTMENT OF JUSTICE Executive Office for Immigration Review Office of the Immigration Judge 7880 Biscayne Boulevard Miami, Florida 33138 IN THE MATTER OF: ) ) Terencio Fonseca Silva ) IN DEPORTATION PROCEEDINGS A28-417-099 ) ) Respondent ) ) NON-OPPOSITION TO WAIVING RESPONDENT'S MASTER CALENDAR APPEARANCE OPPOSITION TO RESPONDENT'S MOTION TO TERMINATE PROCEEDINGS COMES NOW, the government by and through its undersigned counsel and represents to this honorable court that it does not oppose waiving the respondent's appearance at the November 30, 1989 Master Calendar Hearing in that he is infirm. He is represented by competent counsel who will act in his best interest. The government opposes the respondent's Motion to Terminate proceedings in that it has been made without grounds. A perusal of the respondent's history is as follows: 1. He entered this country without inspection on April 23, 1987. He was 81 years old. 2. After he entered, the respondent filed an application for political asylum on June 10, 1987. A final denial of the application was sent to the respondent on February 25, 1988; 3. The respondent was served in New Jersey with an Order to Show Cause dated June 22, 1988; 4. A Hearing was set for October 18, 1988 in New Jersey for which the respondent failed to appear; 5. Venue was changed to Miami on November 3000 NOUVHSIWHI 30 Tell 4, Judge 1988; Horn delivered 4/27/89 It BANK NOUVESWHI 803 301.40 E2 LZ AON 600 3011S00 30 INSWINVARO This That to Mon. I Ms Nov. Fl. 2711889 at on on The 8th 9:30 liss AM food"
}