{
  "anumber": "A28621564",
  "id": "A28621564_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0054/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPÚBLICA DE NICARAGUA PASAPORTE ORDINARIO, C 012965"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1909,
        1981,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 El. titular de este pdsapr es ciudadano nicara guense. Por lo tanto el oierno de la República REPUBL CA DE NICARAGUA de Nicaragua, solicita a las autoridades nacionales y extranjeras darle las facilidades para su normal PASAPORTE movilización Yo brindarle, en caso de necesidad, la ayuda y cooperación que pueda serle útit. ORDINARIO Este pasaporte consta de 32 páginas. DE N The present is a Nicaraguan DE Therefore bearer applies the to Government the National passport and Republic Foreign EXPEDIDO EN citizen. Managua, Nic= Issued at of the of Nicard- Délivré à gua Authorities, to give the bearer of the present document all the facilities available for his normal movement and to EL Diciembre 1981= The give him, if necessary, any help and co-operation R Le that may be useful to him. This passport consists of 32 pages. TIME HASTA 6 Disiembre 1983= Le porteur dur présent passeport est un citoyen de Jeep VALIDO Valid until Valable jusqua Take Nicaragua. C'est pourquo Cle Gouvernement de la République de Nicaragua s'adresse aux Autorités na (Para revalidaciones ver pagina 5) (For renewals see page 5) tionales et étrangères, afin que toutes les facilités (Pour le renouvell ment de la validité voir la page 5) possibles soient accordées au porteur de ce docu- ment pour son mouvement et voyage normal et que toute coopération utile lui soit donnée en cas de besoin, No. de Registro 051279331- Ce passeport comprend 32 pages. C 012965 1 NOMBRE Jose Antonio Romen Name Avellan:- FECHA DE NACIMIENTO 17 Octb.1909 Date of Birth LUGAR DE Place of Birth ESTATURA 6/5'9\" Height COLOR moreno Complexion OJOS R Verdes Colour of Eyes SEÑAS PARTICULARES VISIBLES ninguna Personal Marks PROFESION Profession AMERICA CENTRE ESTADO CIVIL Civil Status DOMICILIO Managua,Nico Residence DEL FIRMA DEL TITULAR * Farms y Devioldel Funcionario Re MIGRACION gnature and Seals PASAPORTES C 012965 3 2"
}