{
  "anumber": "A28644418",
  "id": "A28644418_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28644418_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTAMENTO DE OLANCHADO, Nº 35105"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        1907,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTAMENTO DE OLANCTROED by NARA, 5/19/2023 IMPUESTOS Y JERVICIOS VARIOS SERIE \"N\" No 35105 Por L 1.00 manto 13 de Julio El Tesorern Original Sun 6-2-88 P.E. No 2814864 1 16] infrascrito Secretario Aunicipal y Encargado del esistro 2 Civil de este término; 3 Certifies que ha folio 31 del tomo 9 del libro origi- 4 nal de escimicatos que llevó esta oficina en los años de 1906 5 a 1907, se encuentra la partida que literalmente dice \"P.\" 5. - MEDARDO CHIRINOS -on wanto, D. las nueve dela mañana del dia 6 Junes diez de Junio de mil novecientos siete.- Ante mi, José - 7 GENERAL DE maria Avila Ruiz, Decretario Municipal y ante los testigos don JOSS maria panegas, y don Palvador Veldes hondureños, mayores HONDURAS de edad, solteros, labradores de este vecindario, compareció 0 10 SAMPLE LEAUUANASY This don #pancisco Chirinos, hondureño, mayor de edad, solted, la- brador y do este vocindario, dando cuenta: que el dia Baboo ocho del presente, a las diez de la noche, nació un nifio on la 13 CENTPS, aldea de Amscuapa en casa de don José Maria Chirinos, a quien #1 MEDICAL pusieron por nombre, MEDARDO .- as hijo de José Maria Chirinos 16 yo sitado, hon ureno, mayor de dad, casado, labrador de este ve- 17 cind rio.- y do quadalupe entúnez, hondureña, mayor de edad de oficiosdo ésticos, de este vecindario.- Abuelos paternos 18 del recion nacido JOSS maria Chirinos P. y Josefa Maradiaga- 19 hondurelios y de oste vecindario, y materna Baturnina Antunez, 20 21 hondureña y de este vecindario.- Lei lo escrito al conpareciete 22 y estando contores la ratificó - no firm 6 por no sabor.- JOSE Maria Banagas .- Salvador valdés.- J.M Avila Ruiz - Prio. 11 23 ext adida en +anto, los trece dias de Julio demil no 24 vecientos setenta y nueve. 25"
}