{
	"anumber": "A28666718",
	"id": "A28666718_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28666718_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR ASYLUM IN THE UNITED STATES, Form No. 1115-0086"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 1982, 1911, 1987, 2023, 1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 7/28/2023 Form Approved OMB No. 1115-0086 Immigration and Naturalization Service REQUEST FOR ASYLUM IN THE UNITED STATES INS Office: Date: 1. Family Name First Middle Name 2. A number (if any or known) MORAZAN OCTAVIO NMN A28 646073 None 666 718 All other names used at any time (include maiden name if married) 3. Sex 4. Marital status Male Single Divorced None Female Married Widowed I was born: (Month) (Day) (Year) in (Town or City) (State or Province) (Country) January 19th, 1904 Ocotal, Nueva Segovia, Nicaragua Nationality - at birth At present Other nationalities Nicaraguan Nicaraguan None 5. If stateless, how did you become stateless? PER PUTER NR FCO N/A APR 3)1987 6. Ethnic group 7. Religion 8. Languages spoken DISTRICT RECEIVED FEB 1987 OFFICE Hispanic Catholic Spanish MIAMI-IFR 9. Address in United States (In care of, C/O, if appropriate) FLA. Telephone number (Number and street) (Apt. No.) (City or town) (State) (Zip Code) (include area code) 801 N.W 47 Avenue #401, Miami, Florida 33126 305) 442-8781 11. Address abroad prior to coming to the United States (Number and street) (City) (Province) (Country) Frente a la Oficina de Correos, Somoto, Madriz, Nicaragua 12. My last arrival in the U.S. occurred on: (Mo/Day/Yr) As a X Visitor Student Stowaway Crewman April 4th, 1982 Other (Specify) At the port of (City/State) Means of arrival (Name of vessel or airline and flight number, etc.) Miami, Florida AIR FLORIDA IXX was was not inspected Date authorized stay expires (Mo/Day/Yr) 4/12/82 13. My nonimmigrant visa number is I got a visa, but I lost my passport it was issued by the U.S. Consul on I do not remember exactly. (If none, state \"none\") (Mo/Day/Yr) at Tegucigalpa, Honduras (City, County) 14. Name and location of schools attended Type of school From To Highest grade Title of degree or Mo/Yr Mo/Yr completed certification PUBLIC SCHOOL OF OCOTAL Elementary 1911 1917 6th Certificate 15. What specific skills do you have? 16. Social Security No. (if any) I was during all my life a Public Employee of the Somoza Government, where I occupied positions such as Mayor of the city of Somoto, Local None Judge of District of the city of Somoto. NR FCC 17. Name of husband or wife (wife's maiden name) HORTENCIA MORAZAN APR 03 1987 18. My husband or wife resides with me apart from me (if apart, explain why) She is residing with me at SApt.#401, 801 N.W. 47 Avenue, Miami, Florida, USA Address (Apt. No.) (No. and street) (Town or city) (Province or state) (Country) Form I-589 (Rev. 3-1-81) N (OVERMAY 1 RECEIVED 1987 TRANS IN RET'D TRANS OUT COMPLETED Page 1"
}
