{
  "anumber": "A28621564",
  "id": "A28621564_0088",
  "page_index": 88,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0088/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1937,
        1987,
        2023,
        1944,
        1950,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Sereened by NARA, 7/28/2023 AUG X 3 1987 Subject REQUEST FOR ASYLUM FILED BY: Date ROMAN- AVELLAN, JOSE ANTONIO A 28 621 564 To Supervisory Immigration Examiner (Asylum) From J.M.GUILLAN Interviewing Officer Interpreter SPANISH Attached are oopies of the request for Asylum in the United States filed by the above-named alien who claims that if be is not granted asylum he would be subject to persecution because of his: Race, Nationality, Political Opinion, Relegion, Membership in a Social Group, etc. Upon interviewing the alien, I found the applicant to be: 1. Age 77 4. Marital Status W 2. Occupation DOCTOR S. Last entered the U.S. (date) 8-12-84 MIA 3. Sex 6. Status at Port of last entry M B2 It is the recommendation of this officer that the request be: GRANTED or DENIED THE APPLICANT CLAIMS THAT HIS FATHER WAS A FORMER NICARAGUAN PRESIDENT FROM 1946-1950. HE STATES HE BELONGED TO THE FORMER NAT'L GUARDSMEN MEDICAL CORPS FROM 1937 TO ADOUT 1978. HE PRODUCED PICTURESV OF HIS FATHER AND OF OTHER FAMILY MEMBERS. HE CLAIMS THAT TAKEN IN 1944 HIS ENTRY INTO THE u.s., HE WAS REQUIRED TO PRIOR TO LADORATORY TESTS AT A CLINIC. HE EXPLAINS PERFORM BECAUSE WAS NEVER HE OFFICIALLY TRIED TO By A NICARAGUAN THAT HE BELONGED THE MEDICAL TRIBUNAL TO THE THE RANK U.S. OF SEVERAL CAPTAIN HE STATES THAT ALTHOUGH CORPS. HE ATTAINED QUESTIONED TIMES IN THE PAST, HE HE TRAVELED His LAW WERE GRANTED u.s. ON 6/6/85, HIS DAUGHTER REASONS AND FOR TRIPS INTO By STATE THE SECURITY CONCERNING THE WAS ALWAYS ASYLUM By THIS SERVICE. SON-191- THE APPLICANT APPEARS TO BE A CREDIBLE WITNESS, HOWEVER, FIVE IT IS YEARS UNCLEAR AFTER WHY THE HE SANDINISTA REMAINED IN REVOLUTION. HIS COUNTRY FOR ALMOST EMPLOYMENT AUTHORIZATION WAS GRANTED."
}