{
  "anumber": "A28621564",
  "id": "A28621564_0098",
  "page_index": 98,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0098/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA: 7/20/2023, Form Number: A28 621 564"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1984,
        1978,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 Name: Roman Avellan, Jose Antonio File: A28 621 564 Page: 4 7. What did you treat prisoners or enemies of the state under whose orders? As Laboratory Technician working in the \"Carcel Modelo\" and Penitentiary System, I dealt with both common and political prisoners. My treatment to the prisoners, many of them who were members of the now in power Sandinista Government: Lenin Cerna, Tomas Borje, Orlando Castillo, Rene Nunez, Carlos Guadamuz, Monica Baltodano, Edgard Lang, Michelle Najlis, was the normal treatment to any prisoner. I took blood samples, did urine analysis and sputum analysis for tuberculosis check. They were treated humanly. The proof is they all came out prison alive and well. In 1978 they were all freed when Commander \"Zero\" took the National Palace in siege and part of the arrangement with the Somoza Government, was the freedom of all. The political prisoners who belonged to the Sandinista Front. 8. Why do you not wish to return to Nicaragua After Somoza Was overthrown I went to work to the Center of Clinical Diagnostic which was a private medical enterprise. It was confiscated in 1983. I continued working here, until I left Nicaragua in 1984, after being harassed by members of the Sandinista Government requesting me to cooperate with them by obtaining information from the prisoners, former members of the National Guard. They wanted me to obtain information from them based on the trust they had because they knew who I was. They used someone who had worked with me at the \"Carcel Modelo\" Efrain Lopez. He was a paramedic at the time I was a Laboratory Technician. He cooperated with the Sandinistas while at the prison. Now, after the Revolution he was trying to get met to procure information from the former members of the National Guard, now in prison. 9. Did you apply for asylum at any foreign Embassy in Nicaragua? If so, were you issued a Dalvoconducto? What was your status in that county? I never applied for asylum at any foreign embassy in Nicaragua. I left Nicaragua directly to the United States, where I applied for political asylum. Jele Reminate"
}