{
	"anumber": "A28670639",
	"id": "A28670639_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28670639_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form C46"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "A28 670 639 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Matarallection Service 7880 Bisoayne Boulevard Miami, Flodda 33136 Your application or petition will be deemed Juliana Espinoza abendoned and action thereon will be terminated 4372 N.W. 7th Street If you fall to respond to this request.\" Miami, Florida 33126 TC/TM/ ATTN: Nic. ANY AUTHORIZATION IMPLIED OR CRANTED FOR EMPLOYMENT WILL BE REVOKED PURSUANT TO TITLE s: CODE OF FEDERAL REGULATIONS, PART 109,2(a) (b) FIFTEEN (15) DAYS AFTER THE DATE OF THE ABOVE APPOINTMENT IF YOU FAIL TO APPEAR OR PROVIDE AN ACCEPTABLE REASON WHY SUCH EMPLOYMENT AUTHORIZATION SHOULD NOT BE REVOKED. Please come w the office above below at the dime and place indicated in connection with as official mother. OFFICE LOCATION 7880 Biscayne Blvd. Direccion do is oficina Hiami, Florida Room Ka 420 Floor Ha 4th DATE AND HOUR Fecha y hora January 6, 1988. Fri. 9:30 a.m. ASK FOR Preguate por INMIGRATION EXAMINER-POLITICAL ASYLUM REASON FOR APPOINTMENT Razones. por la YOUR FORM I-589 - REQUEST FOR POLITICAL ASYLUM cita BKING WITH YOU THIS LETTER, DOCUMENTS SUBSIDITIATING YOUR ASYLUM CLAIM, ALL IMMIGRATION Traiga.consigo DOCUMENTS, PASSPORTS OF YOU SPOUSE AND CHILDREN AND TWO(2) PHOTOCOPIES OF ALL DOCUMENTS AND PASSPORTS (EXCEPT BLANK PAGES). A FOREIGN LANGUAGE DOCUMENT KIST n ACCOMPANIED BY A CERTIFIED ENGLISH TRANSLATION. MINOR CHILDREN NEED NOT COME TO THE INTERVIEW UNLESS MINOR IS THE PRINCIPAL OF THE APPLICATION. PLEASE BRING AM INTERPRETER IF YOU DO NOT SPEAK ENGLISH ***YOUR INTERVIEW MAY BE TERMINATED IF YOU DO NOT BRING BE.REQUIRED TWO (2) PHOTOCOPIES NO-ENGLISH TRANSLATIONS. Esta castas documentos park ou reclamacions passportes de usted, su conyage, hijoen todos: treer consigo doe Botooopies de todos los documentos.y de-los passportes, encepto las paginas on blanco. (Todo documento on lenguaje extranjero debe de our traducido al inglee, no treex a menores excepto si son ellos los.citados) si no habla ingles, por favor treer un interprete. ***Puede ser que su antrevista oca terminado ai usted no tree consigo las requeridas dos (2) fotooopias y las traducciones on ingles. IT M IMPORTANT THAT YOU KEEP-THIS APPOINTMENT AND BRING THIS LETTER WITH YOU. If you are unable so do on state your reason, diga below and return able better w ohio office of case I - enable to heep do appointment bocause. Very truly yours, B.R. District Director SIGNATURE DATE Form C (her $1.131 N"
}
