{
  "anumber": "A28621564",
  "id": "A28621564_0115",
  "page_index": 115,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0115/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, A28 621 564"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 A28 621 564 FILE NUMBER UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 7880 Biscayne Boulevard Miami, Florida 33138 \"Your application or petition will be deemed Roman Jose Antonio abendoned and action thereon will be terminated 13325 S.W. 47th Street Miami, Florida 33175 If you fail to respond to this request.\" TC/TM/ Nic. ( 1) ATTN: ANY AUTHORIZATION IMPLIED OR GRANTED FOR EMPLOYMENT WILL BE REVOKED PURSUANT TO TITLE 8, CODE OF FEDERAL REGULATIONS, PART 109.2 (a) (b) FIFTEEN (15) DAYS AFTER THE DATE OF THE ABOVE APPOINTMENT IF YOU FAIL TO APPEAR OR PROVIDE AN ACCEPTABLE REASON WHY SUCH EMPLOYMENT AUTHORIZATION SHOULD NOT BE REVOKED. Please come to the office shows below at the time and place indicated in connection with as official matter. OFFICE LOCATION 7880 Biscayne Blvd. Direccion de la oficina Miami, Florida Room No. 420 Floor No. 4th DATE AND HOUR August 3, 1987 Mon. 10:00 a.m. Fecha y hora ASK FOR Pregunte por INNIGRATION AMINER--POLITICAL ASYLUM REASON FOR APPOINTMENT Razones por la YOUR FORM - I-589 - REQUEST FOR POLITICAL ASYLUM cita BRING WITH YOU THIS LETTER, DOCUMENTS SUBSTANTIATING YOUR ASYLUM CLAIM, ALL IMMIGRATION Traiga consigo DOCUMENTS, PASSPORTS OF YOU, SPOUSE AND CHILDREN AND TWO(2) PHOTOCOPIES OF ALL DOCUMENTS AND PASSPORTS (EXCEPT BLANK PAGES). A FOREIGN LANGUAGE DOCUMENT MAT M ACCOMPANIED BY A CERTIFIED ENGLISH TRANSLATION. MINOR CHILDREN NEED NOT COME TO THE INTERVIEW UNLESS MINOR IS THE PRINCIPAL OF THE APPLICATION. PLEASE BRING AN INTERPRETER IF YOU DO-NOT SPEAK ENGLISH ***YOUR INTERVIEW MAY BE TERMINATED IF YOU DO NOT BRING THE REQUIRED TWO (2) PHOTOCOPIES AND ENGLISH TRANSLATIONS. Esta carta; documentos para substanciar su reclamacion; pasaportes de usted, su conyuge, e hijos, todos s los documentos de inmigration, debe traer consigo dos fotocopias de todos los documentos y de los pasaportes, excepto las paginas en blanco. (Todo documento en lenguaje extranjero debe de ser traducido al ingles, no traer a menores excepto si son ellos los citados). Si no habla ingles, por favor traer un interprete. ***Puede ser que su entrevista sea terminado si usted no trae consigo las requeridas dos (2) fotocopias Y las traducciones en ingles. IT IS IMPORTANT THAT YOU KEEP THIS APPOINTMENT AND BRING THIS LETTER WITH YOU. If you are unable to do so, state your reason, sign below and return this letter to this office at once. I am unable to keep the appointment because: Very truly yours, BaR a District Director SIGNATURE DATE"
}