{
  "anumber": "A28621564",
  "id": "A28621564_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICA, SERIE 'C' 1,173,424"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 60 8ee 00 SERIE \"C\" 1.173.424 1 EL INFRACCRITO REGISTRADOR DEL ESTADO CIVIL DE LAS PERSO- NAS DE LA CIUDAD DE JINOTEPE, DEPARTAMENTO DE DARAZO, RE= 2 PUBLICA DE NICARAGUA, AMERICA CENTRAL. 3 4 ue en el Tibro de REFORTION, de partidas de No imientos, que esta oficina 5 llevó durante el año de mil novecientos ocnenta y siete, se encuentra el 6 cta que Literalmente dice: PARTA No. 79.--FOLIO No. 38.-- 7 JOSE ANTONIC ROMAN AVELLAN 8 9 En la ciudad de Jinotere, Departamento de Carazo, a los dos y treinta y cin- CO minutos de 10 tarde del día cinco del mes de Agosto del año de mil nove- 10 cientos ochente y siete, Ante el infrascrto Registrador del Estado civil y 11 Secretario que autoriza comparecepjoite Antonio Roman Avellan, mayor de edad, 12 13 y presenta para su inscripción la sentencia de Reposi ión de Partida dicta- civil do ert: diuded de Jinotepe, 14 a Inc cuntro de la tarde del día veinte y tres del mes de julio de mil no 15 vecientos ochenta y siete, en la que ordena reponer la partida de Nacimien 16 to de JOB ANTONIO ROMAN AVELLAN, quien nació en esta ciudad, el día dieci- 17 siete delames de octubre de mil novecientos nueve, siendo sus padres Victor 18 Manuel Roman y Juana Avellan. 19 YO, el Registrador doy fé, de haber tenido a In vista 1 sentencia de repo- 20 sición habiéndose anotado al margen del lugar que jué omitida. Las diligen- 21 cias originales fueron archivadas on esta oficina, poniéndose constancia al 22 is ión con sofflamiento del numero y Techa de Ta pap 23 24 tida y la pagina del libro en que se asen tó. Leída la presente se encuentra e 25 conforme, se aprueba y firma. Rosa E. Campos R. Reg. Susana R. Dinarte H. 25 conforme con su original, y debidamente cotejada se extiende lo presente 26 certificación, en la ciudad de Jinotepe Departame: to de Carazo, a los cinco 27 días del mes de agosto del ciéntos ochenta y siete. 28 PERSONAL 29 CAMPOS R SUSANA R. DINARTE H Minth 30 DEL E.C. Jinotope CRIA."
}