{
	"anumber": "A28621564",
	"id": "A28621564_0102",
	"page_index": 102,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0102/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 OF U.S.DEPA TM T OF JUSTICE Immigration and Naturalization Service 7880 Biscayne Blvd. JUN 06 1985 Miami, Florida 33138 A26 698 668 Francisco Calonge 13325 S. W. 47th Street Miami, Florida 33175 Dear Mr. Calonge: This refers to your request for Asylum in the United States. I have concluded, upon consultation with the Bureau of Human Rights and Humanitarian affairs, Department of State, that you have established a well-founded fear of persecution upon return to your homeland. Therefore, in accordance with section 208 (a) of the Immigration and Nationality Act, your Request for Asylum in the United States is granted as of the date of this letter. If your spouse and/or children were included on your application, this authority shall also apply to them. Your asylum status may be terminated if it is subsequently determined you are no longer a refugee within the meaning of section 101 (a) (42) (A) of the Immigration and Nationality Act, or that you pose a danger to the community or to the security of the United States. You are authorized to remain in the United States until one year from the date of this letter, at which time you must arrange to be interviewed to determine your continuing eligibility for asylum. Employment is authorized during this period. If you plan to depart the United states, it will be necessary for you to obtain prior permission to return. You may apply for permanent residence under section 209 (b) of the Immigration and Nationality Act upon being physically present in the United States for at least one year after asylum was granted. Please keep this office informed of any change in your address. Sincerely, Alex perry A. Rivkind District Director STAPLE HERE"
}
