{
	"anumber": "A28621564",
	"id": "A28621564_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0034/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Ministerio de Justicia de la Republica de Nicaragua. CERTIFICA Que la firma que antecede y dice: ILEGIBLE., Ano 1987, 504 1987"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2000, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 Año Ministerie de Justicia de le República de Nicarecua. CERTIFICA Que la tima que 1987 äntecede y dico: ILEGIBLE. 500 CORDOBA es AUTENTICA y correst nue a la que usa: A open Numbre y ROSA E. CAMPOS R. Cargo REGISTRADORA DEL ESTADO CIVIL 2 s DE LAS PERSONASDE JINOTEBE. ! de MANAGUA 11 DE AGOSTO DE 1987. Registros: 3 Fecha: DE TUS 4 5 Gladys Ma. Delgadillo Salazar DIRECTORA GENERAL DE REGISTROS( (ii) 6 DE DEL DOCUMENT Ministerio as Hauring de in Republica a 7 Que In war my does GLADYSMDELGADILLO. 8 * : AUTENTICA, Centur LIBRE is 9 Newberr GLADYS MARIA DELGADILLO S. Days DIRECTORA GENERAL DE REGISTROS SECCION 10 AUTENTICAS MINISTERIO DE JUSTICIA. (A.I. 2000 a bross t 11 DERECHOS PAGADOS 88 Q$ 6043 AGO 12 1987 ANCELT GROSS GATE WA 12 DIRECTOR DIRECCION CONSULAR 13 14 15 REPUBLIC OF NICARAGUA CITY OF MANAGUA 16 EMBASSY OF TPE UNITED STATES OF AMERICA 17 # CERTIFY THAT THE OFFICIAL NAMED BELOW, WHOSE 18 TRUE SIGNATURE AND OFFICIAL SEAL ARE, RESP. CTIVELY SUBSCRIBED AND AFFIXED TO THE ANNEXED DOCUMENT, wis 19 ON THIS DAY, EMPOWERED TO ACT IN THE OFFICIAL CAPACITY DES GNATED IN THE ANNEXED DOCUMENT, TO WHICH FAITH AND CREDIT ARE DUE. 20 ANGELA GROSS GALEANO 22 23 21 Maura be Rolls Vice Consul of the 25 United States of America 26 and compared This is a true, original, correct which was returned 27 of the copy M. Dc 12/23/86 AUG 1 7 1987 Date 28 Immigration Officer) MIA 29 30"
}
