{
	"anumber": "A28621564",
	"id": "A28621564_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (Rev. 07/19/91)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Servic Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Name ROMAN Given Name JOSE Middle Initial U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 13325 S. W. 47 STREET # 1 City MiAMi County DADE State ZIP FLORIDA Reloc Sent Code 33175 Date of Birth (month/day/year) 10-17-09 of Birth Country NicARAGUA Social A Security # 595-52-1218 # 028621564 Reloc Rec'd Part 2 Basis for Eligibility (check one). ases a. I have been a permanent resident for at least five (5) years b I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. 31 MAR '97 Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B CLERK 27 At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Date you became a permanent Day Remarks Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. P.P 2C9 11-29-89 MiAMi, FL Citizenship NiCARAGUAN 4-8-97 Name on alien registration card (if different than in Part 1) I-55/Dundritured ROMAN AVELLAN, JOSE ANTONIO Ow 10-28-98 Other names used since you became a permanent resident (including maiden name) Same as above Sex Male Height Marital Status: Single Divorced Female 5'7\" Married Widowed Can you speak, read and write English ? No Yes. Action Absences from the U.S.: APPROVED INS DISTRICT DIRECTOR Have you been absent from the U.S since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate OCT 28 1998 paper. Claimsnone Frances Faltera Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip MIA 7607 N/A Yes No To Be Completed by Yes No Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}
