{
	"anumber": "A28666718",
	"id": "A28666718_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28666718_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, A28 666 718"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE IN REPLYING PLEASE REFER TO THIS WEST PALM BEACH. FLORIDA FILE NUMBER A28 666 718 OCTAVIO MORAZAN 3146 N.W. 35th ST. MIAMI, FL 33142 JUL30 1968 Dear OCTAVIO In reference to your request for asylum in the United States, the views of the Bureau of Human Rights and Humanitarian Affairs, United States Department of State were requested. The Department of State advised that, based on the information submitted, they were unable to conclude that you should be exempted from regular immigration proceedings on the grounds of a well founded fear of persecution because of race, religion, nationality, political opinion or membership in a particular social group upon return to your country. The Department of State's opinion strongly supports the decision that will be rendered in your request for asylum. Therefore, from the date of this letter you are hereby granted fifteen (15) days for the inspection, explanation, and rebuttal of the statement furnished by the Department of State. If this additional information is not received during this time, the decision in this matter will be based upon information contained in our records. Employment will not be authorized, and your claim to asylum may be withdrawn. Sincerely, Geri Perry A. Rivkind District Director PAR/ph"
}
