{
	"anumber": "A28621564",
	"id": "A28621564_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Certificate, FORM N-550 REV. 6-91"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1909]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "N.A"
			},
			"marital_status": {
				"marital_status_llm_v1": "WIDOWED"
			},
			"year_naturalization": {
				"year_naturalization_llm_v1": 1998.0
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "Miami Beach, Florida"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "Screened by NARA, 7/28/2023 No. 23024261 CANNER ODB VEN NATON Personal description of holder INS RegistrationNo. A028621564 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: OCTOBER 17, 1909 hereto is a likeness of me. Sex: MALE Height: 5 feet 7 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: MIAMI, FLORIDA NICARAGUA The Attorney General having found that: JOSE ROMAN then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. IMMIGRATION & NATURALIZATION SERVICE at: MIAMI BEACH, FLORIDA on: DEC 10 1990 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE Darcs meissaee WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization USTICE FORM N-550 REV. 6-91"
}
