{
	"anumber": "A28601314",
	"id": "A28601314_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28601314_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PRIMERA CLASE CINCUENTA CENTAVOS 1948-1951, Nº 241042"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1958, 1928, 1948, 1951, 2023, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 2- 3-18 filler 4- Time 7 PRIMERA CLASE CINCUENTA CENTAVOS 1948-1951 No 241042 1 Tegucigalpa, D.C., 26 de agosto de 1950. SUPERSON of FEB Señor Aurelio Peña Rodríguez, 7 Presente. 1958 Para su conocimiento, trascribo a usted el Acuerdo que li- teralmente dice: 6 \"SECRETARIA DE RELACIONES EXTERIORES DE LA REPUBLICA DE 7 HONDURAS. Tegucigalpa, D.C., 26 de agosto de 1950. Ac. N° 103.-Vistas 8 para resolver las diligencias de naturalización seguidas en la Go- 9 bernación Política de este Departamento, a solicitud del señor AU- 10 RELIO PEÑA RODRIGUEZ, mayor de edad, casado, constructor y vecino 11 de este Distrito Central, nacido en Islas Canarias, España, el 5 de 12 abril de 1907.--CONSIDERANDO: que el peticionario reside en Honduras 13 desde el año de 1928, teniendo en consecuencia más de dos años con- 14 secutivos de residir en el país, como lo requiere, para ser natura- 15 lizado el artículo 11, número 1° de la Constitución Política; y que 16 ha comprobado no estar comprendido en los casos de excepción previs- 17 tos por los artículos 14 y 15 de la Ley de Extranjería. -CONSIDERAN- 18 DO: que el señor Rodríguez ha renunciado a su nacionalidady española 19 y manifestado el deseo de adoptar la nacionalidad hondureño y que 20 también ha renunciado a toda sumisión, obediencia y fidelidad a to- 21 do otro Gobierno y especialmente al de su país de origen, y a toda 22 protección extraña a las leyes y autoridades de Honduras, haciendo, 23 además, protesta de adhesión y obediencia a las leyes y autoridades 24 hondureñas; EL PRESIDENTE DE LA REPUBLICA en uso de las facultades 25 que le confieren los artículos 121, atribución 23 de la Constitu--"
}
