{
	"anumber": "A28670639",
	"id": "A28670639_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28670639_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, A28 670 639"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FILE NUMBER A28 670 639 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalisation Service 7880 Biscayne Boulevard Miami, Florida 33138 \"Your application or petition will be deemed Juliana Espinoza abendoned and action thereon will be terminated 4372 N.W. 7th Street If you fail to respond to this request.\" Miami, Florida 33126 ATTN: TC/TM/ ) TO ANY TITLE AUTHORIZATION IMPLIED OR GRANTED FOR EMPLOYMENT WILL BE REVOKED Nic. 1 ACCEPTABLE THE DATE OF THE ABOVE APPOINTMENT IF YOU FAIL TO APPEAR (15) DAYS AFTER 8, CODE OF FEDERAL REGULATIONS, PART 109.2(a)(b) FIFTEEN PURSUANT Please REASON WHY SUCH EMPLOYMENT AUTHORIZATION SHOULD NOT OR BE PROVIDE AN come to the office shows below at the time and place indicated in connection REVOKED. with as official matter. OFFICE LOCATION Direccion de la 7880 Biscayne Blvd. oficina Miami, Florida Room No. 420 Floor No. 4th DATE AND HOUR Fecha y hora April 19, 1988 Tues. 9:00 a.m. ASK FOR Pregunte por IMMIGRATION EXAMINER--POLITICAL ASYLUM REASON FOR APPOINTMENT Razones por la cita YOUR FORM I-589 - REQUEST FOR POLITICAL ASYLUM BRING WITH YOU Traige consigo THIS LETTER, DOCUMENTS SUBSTANTIATING YOUR ASYLUM CLAIM, ALL IMMIGRATION OF DOCUMENTS, PASSPORTS OF YOU, SPOUSE AND CHILDREN AND TWO(2) PHOTOCOPIES COME DOCUMENT TO MUST BE ACCOMPANIED BY A CERTIFIED ENGLISH TRANSLATION. MINOR FOREIGN LANGUAGE NOT ALL DOCUMENTS AND PASSPORTS (EXCEPT BLANK PAGES). A INTERPRETER THE INTERVIEW UNLESS MINOR IS THE PRINCIPAL OF THE APPLICATION. CHILDREN NEED Esta REQUIRED TWO (2) PHOTOCOPIES AND ENGLISH TRANSLATIONS. BRING THE IF YOU DO NOT SPEAK ENGLISH YOUR INTERVIEW MAY BE TERMINATED PLEASE IF YOU BRING DO NOT AN hijosy-todos carter-documentos para substanciar su reclamacion; pasaportes de usted, su ellos los extranjero debe de ser traducido al ingles, no traer a menores si en lenguaje I de los passportes, excepto las paginas en blanco. (Todo documento los documentos doe documentos de immigration, debe traer consigo dos fotocopias conyuge, de todos su entrevista citados) S1 no habla-ingles, por favor traer un interprete. excepto ***Puede ser son y las traducaiones a en ingles. si usted no trae consigo las requeridas dos (2) fotocopias que If you are unable to do so, state your reason, sign below and return this letter to this office at once. IT is IMPORTANT THAT YOU KEEP THIS APPOINTMENT AND BRING THIS LETTER WITH YOU. I am unable to keep the appointment because: Very truly yours, District Director SIGNATURE DATE Form C 56 (Rev. 5-1.13) N"
}
