{
	"anumber": "A28688810",
	"id": "A28688810_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28688810_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1989]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Rotunda Plaza 18962 South Dixie Highway Miami, FL 33157 Refer to This File No: A28 688 810 Teresa Orozco 335 NE 2 5th St. Miami, Florida 33137 DATE: January 10, 1989 Please come to this office at the time and place indicated below in connection with an official matter. Your application will be deemed abandoned and action thereon will be terminated if you fail to respond to this request. OFFICE LOCATION: 18962 S. Dixie Hwy, Miami, FL DATE AND HOUR: 11:15 AM January 20 , 1989 REASON FOR APPOINTMENT: Asylum Interview NOTE: ANY AUTHORIZATION IMPLIED OR GRANTED FOR EMPLOYMENT WILL BE REVOKED PURSUANT TO TITLE 8, CODE OF FEDERAL REGULATIONS, PART 274a. 14 (b), FIFTEEN (15) DAYS AFTER THE DATE OF THE ABOVE APPOINTMENT IF YOU FAIL TO APPEAR OR PROVIDE AN ACCEPTABLE REASON WHY SUCH EMPLOYMENT AUTHORIZATION SHOULD NOT BE REVOKED. BRING WITH YOU: This letter; documents substantiating your asylum claim (a foreign language document must be accompanied by an English translation) your passport and two photocopies of each page (except blank pages); passports of spouse and children and one photocopy each; forms I-94 (work permit) for you and each family member; and any other immigration documents you may have. Family members included on your application do not need to come to the interview. Bring an interpreter if you do not speak English. TRAIGA CONSIGO: Esta carta; documentos para substanciar su reclamacion (todo documento en lenguaje extranjero debe de ser traducido al ingles); pasaporte de Vd. con dos fotocopias de cada pagina (excepto las paginas en blanco); pasaportes de cada miembro de su familia con una fotocopia; formularios I-94 (permiso trabajar) para Vd. y cada miembro de su familia; Y qualquier otro documento de inmigracion que tenga. Miembros de su familia incluidos en su reclamac ion no tienen que vener a la entrevista. IT IS IMPORTANT THAT YOU KEEP THIS APPOINTMENT AND BRING THIS LETTER WITH YOU. CC:"
}
