{
  "anumber": "A28670639",
  "id": "A28670639_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28670639_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice, FORM G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1890,
        1900
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "[' retired', 'political asylum']"
      },
      "reason": {
        "reason_llm_v1": "Political Asylum"
      },
      "nationality": {
        "nationality_llm_v1": "Nicaragua"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A OMB No. 1115-0066 U.S. Department of Justice BIOGRAPHIC INFORMATION Approval expires 4-30-85 Immigration and Naturalization Service BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE NUMBER (Family name) (First name) (Middle name) MALE EMALE Espinoza Juliana 01-09-1900 Nicaraguan A ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) Juliana Corea Granada, Nicaragua FAMILY NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE. FIRST NAME FATHER Corea Agustin Granada, Nicaragua Deceased MOTHER(Maiden name) Garay Gertrudis Granada, Nicaragua Deceased FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE HUSBAND (If none, so state) FAMILY NAME OR (For wife, give maiden name) WIFE N/A FORMER HUSBANDS OR WIVES(if none,so state) FAMILY NAME (For wife, give maiden name) DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE FIRST NAME BIRTHDATE Espinoza Jose 03-08-1890 12-12-15 Granada, Nicaragua Widowed FROM TO APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. COUNTRY MONTH YEAR MONTH YEAR STREET AND NUMBER CITY PROVINCE OR STATE 03 86 PRESENT TIME 4372 N.W. 7 St. Miami Florida U. S. A. caragua 08 70 03 86 Colonia Centroamerica A-49 Managua Managua FROM TO APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR MONTH YEAR MONTH YEAR CITY PROVINCE OR STATE COUNTRY STREET AND NUMBER Same as Above Nicaragua 08 70 03 86 Managua Managua FROM TO APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST OCCUPATIONISPECIFY MONTH YEAR MONTH YEAR FULL NAME AND ADDRESS OF EMPLOYER PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) DATE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT STATUS AS PERMANENT RESIDENT Vanueler Roment NATURALIZATION 08-19-87 MOTHER (SPECIFY): Political Asylum IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN APPLICANT: THE BOX OUTLINED BY HEAVY BORDER BELOW. (Middle name) (Alien registration number) COMPLETE THIS BOX (Family name) (Given name) Espinoza Juliana INS USE (Office of Origin) (OTHER AGENCY USE) OFFICE CODE: TYPE OF CASE: DATE: Form G-325 A (Rev. 10-1-82) (4) CONSUL"
}