{
  "anumber": "A28621564",
  "id": "A28621564_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1979,
        1988,
        1962,
        1972,
        1987,
        2023,
        1931,
        1967,
        1961,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 AFFIDAVIT There personally appeared before me, a Notary Public duly authorized to administer oath and acknowledged one FRANCISCO URCUYO MALIANO, M.D., to me known to be the person who executed the within affidavit and after being duly sworn and cautioned by me, he did depose and said: 1. That his participation in the political role of the Liberal Party in Nicaragua can be evidenced by the following: he was president of the House of Representatives and later ap- pointed President of the Republic and of the Nationalist Liberal Party of Nicaragua until July, 1979. 2. That having served as a public officer in the Public Health Department of Nicaragua, he held the following positions: Vice Minister of Public Health (1961-1962) Minister of Public Health (1962-1967) Minister of Public Health (1967-1972) In said capacity he came to know JOSE ANTONIO ROMAN AVELLAN, who worked in the Public Health Department of Nicaragua for a period of 48 years (1931-1979) under several Liberal govern- ments. As his superior, he can attest to his vast experience in all aspects of the Bacteriology field. He can say that he is one of the pioneers of the sanitation system in Nicaragua. 3. That he can attest to the fact that JOSE ANTONIO ROMAN AVELLAN is the son of Victor Manuel Roman y Reyes, who was President for the Liberal Party of Nicaragua from 1946-1950. He passed away while undergoing surgery in a hospital in Philadelphia while still in the Presidency. The Affiant further sayeth not. THE HACIO DESIGNETA FRANCISCO URCUYO MALIANO, M.D Duly sworn and subscribed before me, POLIKE NESS this twenty-first day of April, nineteen hundred and eighty-seven Glass NOTARY PUBLIC Reen STATE OF FLORIDA My Commission expires: april 21,1987 NOTARY PUBLIC STATE OF FLORIDA MY COMMISSION EXP. AUG 30,1988 BONDED THRU GENERAL IRS. UED."
}