{
	"anumber": "A28644418",
	"id": "A28644418_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28644418_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACION, Nº 02449394"
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1980, 2023, 1983, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/19/2023 PRIMERA CLASE NCUENTA CENTAVOS 1980-1983 CERTIFICACION No 0249394 El infrascrito Secretario Municip 1 y Encargado del Regístro Civil de este término; Certifica: que h folio 176 el tomo 37 del libro origin-1 de naci- mientos que llevo esta oficina en los años de 1946 a 1947, se encuentra la partída que literalmente dice: \"P.No 7.= NORMA ESPERANZA CHIRINOS ZELAYA .- m.l.- En Kanto, a los trece deas del mes de Diciembre de mil novecientos cuarenta y siete.- Ante mi, Jesú Zavala, Secretario Municipal y ante los testigos on Tranquilino Chirinos A y don Octavio unguía, hor ureños, mayores de edad, casa O y soltero, respectivamente naturales y vecinos de este pueblo, compareció el señor Med rdo Chirino A. hondureño, mayor de edad, carado, labrador e este vecindario, dando cuenta que el dia de - ayer doce de este mes, a las Joce el ia en la aldea de Amacuapa e este GENERAL punicipio, en su propia Casa, nació una niña 3 quien uso por nombre, - NORMA ESPERANZA.- Es hija legitima del compareciente y de su e pona Rosalía Zelaya Sanchez, hon ureña, payor de e ad, casada, de oficio omésticos , 16 y de erte vecindario.- on abuelos paterno de la recién nacida Jose Maria Chirinos M. y Guadalupr Antúnez, y maternos Santiago Zelaya y Felicitas - 18 Sanchez, tonos hondure os, naturales y vecinos de este pueblo, ya difun- 19 tos los tres primeros.- Lei lo escrito al conpareciente y estando conforme 20 con su manifestación, firmó.= Medardo Chirinos Antúnez.= Tranquilino Chi- rinos A.- Octavio Munguía.- sello.- Jesús Zavala.- Srio.\" 21 Extendida en Manto, a los ocho dias de Abril de mil novecientos ochenta 22 93 ISRAEL D.CHIRINOS H. voBo. PABLO DONALDO SANCHEZ E 24 SECRETARIO MUNICIPAL ALCALDE UNICIPAL. 25 Clinncho, Cofo, Olzncho. H"
}
