{
	"anumber": "A28621564",
	"id": "A28621564_0089",
	"page_index": 89,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0089/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR ASYLUM IN THE UNITED STATES, Form 1-589"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1984, 1979, 1987, 2023, 1909, 1940, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice Form Approved OMB No. 1115-0086 Immigration and Naturalization Service REQUEST FOR ASYLUM IN THE UNITED STATES INS Office: RESIDENT APR Date: DISTRICTIVED MIAMI OFFICE 1. Family Name First Middle Name 2. Aunumber alamy famown) STATES ROMAN JOSE 6 ANTONIO All other names at any tinality Stude maiden name if married) 3 Manital status Male Single Divorced Tono Roman Female Married Widowed I was born: (Year) in (Town or City) (State or Province) (Country) 10 17 1909 Jinotepe, Carazo, Nicaragua Nationality - at birth At present Other nationalities Nicaraguan Nicaraguan N/A A28 621 564 5. If stateless, how did you become stateless? After having worked for 39 years as a member of the Medical Corps of the National Guard, hold- ing the rank of Captain. At the end of July 1979, I was taken to the National Palace where I was interrogated by the Sandinistas and they realized that in spite of my relation and 6. Ethnic group 7. Religion 8. Languages spoken Hispanic Catholic Spanish 9. Address in United States (In care of, C/O, if appropriate) 10. Telephone number (Number and street) (Apt. No.) (City or town) (State) (Zip Code) (include area code) 13325 S.W. 47th Street, Miami, Florida 33175 PER COMPUTER (305) 227-2723 NR 11. Address abroad prior to coming to the United States (Number and street) (City) (Province) (Country) Bosques de Altamira #227 Managua, Nicaragua JUN 01 1987 12. My last arrival in the U.S. occurred on: (Mo/Day/Yr) As a Visitor Student Stowaway Crewman 08/12/1984 Other (Specify) At the port of (City/State) Means of arrival (Name of vessel or airline and flight number, etc.) Miami, Florida Taca Airlines was was not inspected Date authorized stay expires (Mo/Day/Yr) 02/11/85 13. My nonimmigrant visa number is 390506 it was issued by the U.S. Consul on 12/12/83 (If none, state \"none\") (Mo/Day/Yr) at Managua, Nicaragua AUG X 3 1987 (City, County) MIA #18 EMPLOYMENT AUTHORIZED THRU INDEFINITE From To 14. Name and location of schools attended Type of school Highest grade Title of degree or Mo/Yr Mo/Yr completed certification Instituto Juan J. Rodriguez, Nicar. High School 02/31 12th Grade Instituto Nacional de Higiene, Nic. Technical 1932 1940 Bacteriologist Ofic. Sanitaria Panameri cana Guat Courses 09/50 12/50 15. What specific skills do you have? 16. Social Security No. (if any) Vast technical experience: Bacteriology, Environmental, Epidemiology, Venereal Deceases, Tuberculosis, Serology n/a 17. Name of husband or wife (wife's maiden name) Otilia Mercado (Deceased) 18. My husband or wife resides with me apart from me (if apart, explain why) n/a Address (Apt. No.) (No. and street) (Town or city) (Province or state) (Country) n/a Form I-589 (OVER) (Rev. 3-1-81) N RECEIVED TRANS IN RET'D TRANS COMPLETED OUT JUN 09 1987 Page 1"
}
