{
	"anumber": "A28644418",
	"id": "A28644418_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28644418_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificación, 2814464"
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1979, 1906, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/19/2023 PRIMERA CLASE CUENTA CENTAVOS CERTIFICACION 1976-1979 No 2814864 1 E] infrascrito Secretario Municipal y Encargado del Resistro 2 Civil de este término; 3 Certifica. que ha folio 31 del tomo 9 del libro origi- 4 nal de nacimientos que llevé esta oficina on los años de 1906 5 a 1907, se encuentra la partida que literalmente dice : P. / 5.- - MEDARDO CHIRINOS. En anto, a las nueve dela mañana del dia 6 Dunes diez de Junio de mil novecientos siete.- - Ante mi, José - NERAL DE maria Avila Ruiz, Secretario Municipal y ante los testigos don José maria Danegas, y don Salvador Veldés hondureños, mayores HONDURAS de edad, solteros, labradores de este vecindario, compareció O 10 will AGUAMIST don Francisco Chirinos, hondureño, mayor de edad, soltco, la- brador V de este vecindario, dando cuenta: que el dia Subro Hondatas ocho del presente, a las diez de la noche, nació un niño en la 13 aldea de Amacuapa en casa de don José varia Chirinos, a quien pudieron por nombre, MEDARDO - Is hijo de José Maria Chirinos 16 ya sitado, hondureño, mayor de dad, casado, labrador de este VC- cindario.- - I de quadalupe Antúnez, hondureña, mayor de e and 17 de oficiosdomésticos de'este vecindario.- - Abuelos paternos 18 del recien nacido José maria Chirinos P. I Josefa Maradiaga- 19 hondureños y de este vecindario, y materna Saturnina Antúnez, , 20 hondureña y de este vecindario.- - Lei lo escrito al compareciete 21 22 y estando conforme la ratificó Y no firmo por no sabor.- - José 23 Maria Banegas. - Salvador Valdos.- J.M. Avila Ruiz.- Srio. 11 extendida en Manto, a los trece dias de Julio demil no- 24 vecientos setenta y nueve. 25 a"
}
