{
  "anumber": "A28621564",
  "id": "A28621564_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0024/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Permanent Residence, I-458"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1984,
        1988,
        1989,
        2023,
        1909
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice MES Application for Permanen Residence OMB # 1115-0053 Immigration and Naturalization Service (IND) Expires 8/85 Case ID# Action/Stamp G-28 or Volag# Quietterlu APPROVED DISTRACT NOV DO 29 no: CTOR 1990 WRITE IN THIS BLOCK isnecial DIR A# 28621564 Section of Law Eligibility Under Sec. 245 Sec. 209(b), INA MIA 1583 Approved Visa Petition Sec. 214(d). INA Dependent of Principal Alien Sec. 13. Act of 9/11/57 Special Immigrant Sec. 245. INA Other Sec. 249. INA Country Chargeable Preference A. Reason for this application - I am applying for lawful permanent residence for the following reason: (check the box that applies) 1. An immigrant visa number is immediately available to me because PER NR COMPUTENLA FCO/ A visa petition has already been approved for me (approval notice is attached) A visa petition is being filed with this application DEC23 1988 2. I entered as the fiance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are attached) no 3. I am an asylee eligible for adjustment 4. Other: B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? ROMAN Jose Antonio AUG. 12, 1984 2. Address (Number and Street) ) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 13325 S.W. 47 Street MiAMi, FLORIDA (Town or City) (State/Country) (ZIP/Postal Code) 13. What means of travel did you use? (Plane, car. etc.) Miami, Florida 33175 Plane 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? Jinotepe, NiCARAGUA Yes No 4. Date of Birth 5 Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) Male Married Single (Visitor, student, exchange alien, crewman, temporary worker, without inspection, etc.) 10-17-1909 Female Widowed Divorced Visitor - (B-2 VisA)- 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure 595-52-1218 A 128 621 564 Record (Form I-94). 9. Country of Citizenship ROMAN AVELLAN, Jose Antonio- NicARAGUA 17. Arrival/Departure Record (I-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? Yes No 312 13500 00 004286 (If Yes, give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date N/A MANAGUA, NiCARAGUA (Mo/Day/Yr) 12-12-83 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) Otilia Mercado (deceased) NiCARAGUA 04-12-62 21. Has your husband/wife ever been married before? Yes No If Yes, (Names of prior husbands/wives) DEC 22 1989 (Country of citizenship) (Date marriage ended) - - #187 N/A EMPLOYMENT AUTHORIZED INITIAL my be RECEIPT RESUBMITTED RELOCATED COMPLETED MILL and 2/23/85 Rec'd Sent Approved Denied Returned AP FORM I-485 (08-01-85) N"
}