{
	"anumber": "A28621564",
	"id": "A28621564_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0035/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TRANSLATION OF 'BIRTH CERTIFICATE'"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 1988, 1987, 2023, 1909]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 TRANSLATION OF \"BIRTH CERTIFICATE\" 1. Name: JOSE ANTONIO ROMAN AVELLAN MALE (first) (middle) (last) (sex) 2. Birth: Place JINOTEPE CARAZO NICARAGUA (city or town) (state or providence) (country) Date OCTOBER 17, 1909 (month) (date) (year) 3. Father's Name: VICTOR MANUEL ROMAN (first) (middle) (last) 4. Mother's Name: JUANA AVELLAN (first) (middle) (last) 5. Certificate Issued: Date AUGUST 5, 1987 (month) (day) (year) Place JINOTEPE CARAZO NICARAGUA (city or town) (state or providence) (country) ROSA E. CAMPOS R. Magistrate (full name) 6. Certificate Found: Archive or Register - Page 38 No. 79 7. Notations of Importance: THE ORIGINAL IS A REPLACEMENT OF BIRTH CERTIFICATE WHICH WAS NOT FOUND IN THE RECORDS. THE COURT ORDER FOR SAID REPLACEMENT WAS ISSUED ON JULY 23, 1987. THE REGISTRAR OF THE PUBLIC RECORDS OFFICE, CERTIFIED HAVING HAD SAID COURT ORDER BEFORE HIM, AND THUS ORDERED THIS REPLACEMENT TO BE ISSUED, TO WHICH FAITH AND CREDIT ARE DUE. CERTIFICATION OF TRANSLATOR'S COMPETENCE I, ROSARIO S. ROMAN , hereby certify that the above is an accurate translation of the original \"BIRTH CERTIFICATE\" in SPANISH , and that I am competent in both English and SPANISH to render such translation. Date MAY 5, 1988 Road (signature of Remier translator) Address 11011 S.W. 104 STREET MIAMI, FL. 33176 Phone: 347-2345 SWORN TO AND SUBSCRIBED BEFORE ME, THIS 5th DAY. OF May 19 88 (Notary Public) Notary Public, State of Horida My Commission Expires June 25, 1990 Bonded Thru Troy Fain Insurance Inc."
}
