{
	"anumber": "A28666718",
	"id": "A28666718_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28666718_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUESTS FOR ASYLUM IN THE UNITED STATES, Form 1-589"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 1982, 1911, 1987, 2023, 1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice As 8-22-87 Immigration and Naturalization Service MAA#276 EMPLOYMENT AUTHORIZED THRU Form Approved 8-21-88 OMB No. 1115-0086 PER COMPUTER U/A REQUEST FOR ASYLUM IN THE UNITED STATES 286460132 SEP 03 1987 INS Office: Date: 1-28-666718 1. Family Name First Middle Name 2, A number (if any or known) MORAZAN OCTAVIO NMN 100 None All other names used at any time (include maiden name if married) 3. Sex 4. Marital status None Male Single Divorced Female Married Widowed I was born: (Month) (Day) (Year) in (Town or City) (State or Province) (Country) January 19th, 1904 Ocotal, Nueva Segovia, Nicaragua Nationality - at birth At present Other nationalities Nicaraguan Nicaraguan None 5. If stateless. how did you become stateless? 3146 NW 35 Street N/A miami FL 33142 6. Ethnic group 7. Religion 8. Languages spoken Personal DISTRICT 1987 Hispanic Catholic Spanish 9. Address in United States (In care of, C/O, if appropriate) (Apt. No.) (City or town) NEW Telephone number (Number and street) (State) (Zip Code) (include Atea code) 801 N.W. 47 Avenue #401, Miami, Florida 33126 9442-8781 11. Address abroad prior to coming to the United States (Number and street) (City) (Province) (Country) Frente a la Oficina de Correos, Somoto, Madriz, Nicaragua 12. My last arrival in the U.S. occurred on: (Mo/Day/Yr) As a x Visitor Student Stowaway Crewman April 4th, 1982 Other (Specify) At the port of (City/State) Means of arrival (Name of vessel or airline and flight number. etc.) Miami, Florida AIR FLORIDA XXwas was not inspected Date authorized stay expires (Mo/Day/Yr) 4/12/82 13. My nonimmigrant visa number is I got a visa, but I lost my ft was passport issued by the U.S. Consul on I do not remember exactly. (If none. state \"none\") (Mo/Day/Yr) at Tegucigalpa, Honduras (City, County) 14. Name and location of schools attended Type of school From To Highest grade Title of degree or Mo/Yr Mo/Yr completed certification PUBLIC SCHOOL OF OCOTAL Elementary 1911 1917 6th Certificate 15. What specific skills do you have? 16. Social Security No. (if any) I was during all my life a Public Employee of the Somoza Government, where I occupied positions such as Mayor of the city of Somoto, Local Judge of District of the city of Somoto. PER COMPUTER None A28646074 17. Name of husband or wife (wife's maiden name) NR FCO HORTENCIA MORAZAN 18. My husband or wife resides with me apart from me (if apart. explain why) SEP 03 M She is residing with me at SApt.#401 801 N.W. 47 Avenue, Miami, Florida, USA Address (Apt. No.) (No. and street) (Town or city) (Province or state) (Country) Form I-589 (OVER) (Rev. 3-1-81) N RECEIVED TRANS IN RET'D TRANS OUT COMPLETED"
}
