{
	"anumber": "A28688810",
	"id": "A28688810_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28688810_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Asylum"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "30g Are you entitled to return to country of issuance of your passport Yes No Travel document Yes No Or other document Yes No (If not, explain why) any passp is expend 31. What do you think would happen to you if you returned? (Explain) York Hoop not community to return to my country I am against 32. When you left your home country, to what country did you intend to go? U. P.a 33. Would you return to your home country? Yes No (Explain) only if in my county change th from of govt 34. Have you or any member of your immediate family ever belonged to any organization in your home country? Yes No. (If yes, provide the following information relating to each organization: Name of organization, dates of membership or affiliation, purpose of the organization, what, if any, were your official duties or responsibilities, and are you still an active member. (If not, explain) 35. Have you taken any action that you believe will result in persecution in your home country? Yes No (If yes, explain) Have all you my been detained jamily interrogated was convicted persecutive and sentenced in to Ian lin Yes IN old No morrow for Iwent 36. ever imprisoned any country? (If yes, specify each instance: what occurred and the circumstances, dates, location, duration of the detention or imprisonment, reason for the detention or conviction, what formal charges were placed against you, reason for the release, names and addresses of persons who could verify these statements. Attach documents referring to these incidents, if any). lnes interrigate of by th CDS. politication 37. If you base your claim for asylum on current conditions in your country, dothese conditions affect your freedom more than the rest of that country's population? Yes No (If yes, explain) l love the betway 38. Have you, or any member of your immediate family, ever been mistreated by the authorities of your home country/country of nationality Yes No. If yes, was it mistreatment because of Race Religion Nationality Political opinion or Membership of a particular social group? Specify for each instance; what occurred and the circumstances, date, exact location. who took such action against you and what was his/her position in the government, reason why the incident occurred, names and addresses of people who witnessed these actions and who could verify these statements. Attach documents referring, to these incidents. my mishrate I has usually annaally puffed by of my county 39. After leaving your home country, have you traveled through (other than in transit) or resided in any other country before entering the U.S.? Yes No (If yes, identify each country, length of stay, purpose of stay, address, and reason leaving, and whether you are entitled to return to that country for residence purposes. 40. Why did you continue traveling to the U.S.? 41. Did Peeking you apply for asylum in any freedom other country? Yes-Give details No-Explain why not protection (3) (over)"
}
