{
  "anumber": "A28621564",
  "id": "A28621564_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/28/2023, NARA Asylum Application Form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1950,
        2023,
        1946,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 30. Are you entitled to return to country of issuance of your passport Yes No Travel document Yes No Or other document Yes No (If not, explain Yes, I have a Nicaraguan passport but I do not want to return to my country. Since I why) did not comply with the proposal to obtain information from the political prisoners, I know as a fact that I return I would be put in jail as it happen to my former co.-workers. 31. What do you think would happen to you if you returned? (Explain) All people deported from the US are subjected to interrogation at the airport as it happen to Rafael Gonzalez whom I train in the laboratory, from there a name check is conducted and if they find my name they will be aware of who I am and would put me in prison because beside being the son of a former liberal President, 32. When you left your home country, to what country did you intend to go? To the United States 33. Would you return to your home country? Yes No (Explain) I can not live in a country where the government in power conditioned my freedom in exchange of first training their communist colaborators and second, serving as an informant within the penitentiary system. My political convictions and loyalty to the institution I serve for more than 30 years would not allow me to do such a deed. 34. Have you or any member of your immediate family ever belonged to any organization in your home country? Yes No. (If yes, provide the following information relating to each organization: Name of organization, dates of membership or affiliation, purpose of the organization, what, if any, were your official duties or responsibilities, and are you still an active member. (If not, explain) After General Anastásio Somoza-Garcia had given Leonardo Argue- llo a coup-d'etat, Benjamin Lacayo was temporary in power but lasted less than a year. My father, Victor Manuel Roman y Reyes, a member of the Liberal Party and former Nicaraguan Ambassador to the United States, was chosen to be President of Nicaragua. He was President from 1946-1950 he died in a Hospital in Philadelphia while being President. He was then 35. Have you taken any action that you believe will result in persecution in your home country? Yes No (If yes, explain) From the moment I did not accept to subject my freedom to their demands, and of having rejec- ted the proposal made by Lenin Cerna thru Efrain Lopez a para-medic in charge of the medical assistance to the political prisonezs and in direct contact with Lenin Cerna, Tomas Borge 36. Have you ever been detained interrogated convicted and sentenced imprisoned in any country? Yes No (If yes, specify for each instance: what occurred and the circumstances, dates, location, duration of the detention or imprisonment, reason for the detention or conviction, what formal charges were placed against reason for the release, names and addresses of persons who could verify these statements. Attach documents referring to these At the end July you, 1979, I was interrogated at the Palacio Nacional, regarding my responsabili ties with the former Government. Although they found out about my participation with the 37. If you base your claim for asylum on current conditions in your country, do these conditions affect your freedom more than the rest of that country's population? Yes No (If yes, explain) The fact that I belonged to the National Guard during the Somoza government as a member of the Medical Corps, being a liberal for all my life are factors which I consider affect me directly, since members of the National Guard are considered enemies of the government now in power and the Liberal Party has been considered illegal in Nicaragua. 38. Have you, or any member of your immediate family, ever been mistreated by the authorities of your home country/country of nationality Yes No. If yes, was it mistreatment because of Race Religion Nationality Political opinion or XX Membership of a particular social group? Specify for each instance; what occurred and the circumstances, date, exact location, who took such action against you and what was his/her position in the government, reason why the incident occurred, names and addresses of people who witnessed these actions and who could verify these statements. Attach documents referring to these incidents. When I was interrogated at the Placio Nacional to find out about my connections with the pre vious government, they found about my political history--that I was a liberal and the son of a former liberal President, Victor M. Roman y Reyes, and a member of the Medical Corps of 39. After leaving your home country, have you traveled through (other than in transit) or resided in any other country before entering the U.S.? Yes No (If yes, identify each country, length of stay, purpose of stay, address, and reason for leaving, and whether you are entitled to return to that country for residence poses. I came directly to the United States 40. Why did you continue traveling to the U.S.? n/a 41. Did you apply for asylum in any other country? Yes-Give details No-Explain why not I came directly to the United States (over) (3)"
}