{
	"anumber": "A28601314",
	"id": "A28601314_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28601314_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Permanent Residence, I-485 ( (REV. 2-27-87)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "Spain", "Costa Rica"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1885]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 U.S. Department of Justice OMB # 1115-0053 Immigration and Naturalization Service (INS) Application for Permanent Residence DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp APPROVED Fee 50.00 Stamp A# IN.S DISTRICT DIRECTOR FEE NOL# PAID 053022 IMMIGRATION AND NATURALIZATION SERVICE G-28 or Volag# JUL 28 1988 DATE ORLEANS, LOUISIANA511 NEW Section of Law Eligibility Under Sec. 245 Sec. 209(b), INA Sec. 214(d), INA Recommended NOL by Agency 1723 Approved Visa Petition Dependent of Principal Alien See 13, Act of 9/11/57 Special Immigrant Sec 245, INA Other Sec. 249, INA Country Chargeable Preference A28601 314 A. Reason for this application 1-130/1885 I am applying for lawful permanent residence for the following reason: (check the box that applies) 1. An immigrant visa number is immediately available to me because APPLICANT EMPLOYMENT FOR AFTER ADJUSTMENT 0571288 A visa petition has already been approved for me (approval notice is attached) A visa petition is being filed with this application WILL NOT AFFECT 2. I entered as the fiance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are attached) IMMIGRA STATUS 3. I am an asylee eligible for adjustment EXPIRES 4. Other: UNLESS EXTENDED B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? PEÑA AURElio 5-31-87V 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 1BA CALLE Colonia Soto 3800 Udped NEW ORleANS, LA. (Town or City) (ZIP Postal Code) commyaquela 70043 LA PlANE 13. What means of travel did you use? (Plane, car, etc.) 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? IslAs CANARIAS spain Yes No 4. Date of Birth 5. Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) Male Married Single (Visitor, student, exchange alien, crewman, temporary worker without inspection, etc.) 4-5-07 Female Widowed Divorced Visitor 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure NONE NONE Record (Form I-94). 9. Country of Citizenship PENA AURE lio Honduras 17. Arrival/Departure Record (1-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? No 195160397 00 026225 Yes (If Yes. give the date and place of filing and final disposition 19. At what Consulate was your nonimmigrant visa issued? Date (Mo/Day/Yr) TEqucigAlpA, Honduras 12-24-842 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) ISAbEL Fernandez Costa Rica 12-14-84 deceased 21. Has your husband/wife ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned 5-12-88 FORM I-485 (REV. 2-27-87)N"
}
