{
  "anumber": "A28621564",
  "id": "A28621564_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Designated Fingerprinting Service Certified to Take Fingerprints, Form 1-850A ( (5-21-96)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 OMB # 1115-0194 Attestation by U.S. Department of Justice Designated Fingerprinting Service Immigration and Naturalization Service Certified to Take Fingerprints Part 1. Instructions To ensure the INS of the integrity of the fingerprint cards submitted by applicants for benefits. all DFS fingerprinters must fill out an attestation on Form 1-850A each time they take fingerprints for an immigration benefit applicant. The DFS's fingerprinters are required to execute the attestations in duplicate, giving the original copy to the person being fingerprinted and keeping the second copy, which may be a reproduced copy of the original attestation, on file for at least 3 months for Service inspection. Attestations must be submitted on Form 1-850A, Attestation by Designated Fingerprinting Service Certified to Take Fingerprints. Reproduced copies of Form 1-850A are acceptable. Reporting Burden. Under the Paperwork Reduction Act, a person is not required to respond to a collection of information unless it dispays a currently valid OMB number. We try to create forms and instructions that are accurate, can be easily understood, and which impose the least possible burden on you to provide us with information. Often this is difficult because some immigration laws are very complex Accordingly, the reporting burden for this collection of information is computed as follows: 1)Learning about the law and form 3 minutes 2) completing form 2 minutes and 3) Assembling and filing the application 5 minutes: ior a total estimated average of 10 minutes per response. If you have comments regarding the accuracy of this estimate, or suggestions for making this form simpler. you can WRITE to the Immigration and Naturalization Service. 425 I Street, N.W.; Room 5307. Washington, D.C. 20536. (Do not mail your completed application to this address.) Part 2. Information about DFS Middle name Last name First name Name and address of company/organization Vanging Daguel CITY OF SWEETWATER Suite # Street number and name 500 SW 109 AVENUE City State or Province SWEETWATER FLORIDA Zip/postal code Country U.S.A. 33174 Certification number of DFS (As assigned bylkhe INS) Expiration date Fee charged PENDING 10-30-99 $10.00 Part 3. Attestation I attest that I have complied with the requirements of 8 CFR 103.2(e) and I have properly checked the identity of this person whom I just fingerprinted by comparing the information on the fingerprint card with his/her. (i) passport number (2) alien registration card number A028621564 (3) other INS issued photo-ID: name of document document number (4) other documented proof of ID (state the type of ID document checked and list the document serial numbers. if any) I understand the fingerprinting procedures as required by 8 CFR 103.2(e)(6) and have received adequate training to perform fingerprinting responsibilities. This attestion is executed in the presence of the person listed below whom I have just fingerprinted JOSE ANTONIO ROMAN (Print name of person fingerprinted) (Signature of person fingerprinted) Part 4. Signature Signature of fingerprinter Date Print name of fingerprinter RAGUEL VAZqUEZ Telephone # Vagging Employee ID # (As assigned by INS) Raguef 3/21/95 EM P-Q3 ( 305 ) 221 - 0411 Form I-850A (5-21-96)"
}