{
  "anumber": "A28645376",
  "id": "A28645376_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28645376_0022/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Liberty, Equality, Fraternity, 66071"
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/14/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI First expedition from the registers of Certificates of the Civil Registrar of the Commune of Delmas. KKK No. 66071 Inscription of Birth Certificate The year 1983, Year 180th since the Independence and on Thursday October 6, at 3:00 in the afternoon. Before us, Louis Nazaire, Officer of Civil Registra of the commune of Delmas, Id. at No. 1010-H hereby certify in virtued of judgment rendered by the Civil Court of Port-au-Prince - in Public and Civil audience of 8/17/83 in conformity with law of 8/20/74. Following the request of the citizen Cemorin Louis. BY THESE MOTIVES. - The Civil Court declared that: CEMORIN LOUIS, a male was born at Savanette on August 7, 1907 from the legitimate relations of Morin C. Louis and of Charlerine Duvelsaint, both deceased. This present , judgment will take the place of the Birth Certificate. Orders the transcrip- tion of the said judgment in the registers of the Civil Registrar of the commune of Delmas. Given by us, Theophile Jean-Francois, Dean in the public and Civil audience for today August 17, 1983 in the presence of Me. Ulrick CEMORIN LOUIS Born at Savanette Rosarion, Substitut of Commissioner of Government with the assistance of on August 7, 1907 Ascencio Jumelle, Court Clerk. Page 1983 Orders In testimony thereof Register LN 5-A For copy conformed examined by S. F. Victorin. Registered at Croix-des-Missions Page 17 Coast A-18 on 8/25/83. Legalized by the Dean on 10/6/83 R.L.: 13507-MM We have done and signed this present in conformity with law in our office located at Delams rue du Foyer No. 34."
}