{
	"anumber": "A28601314",
	"id": "A28601314_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28601314_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "Spain", "Costa Rica"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1988, 2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR Case ID# Action Stamp EXAMINING Fee 35 OFFICE if ONLY NOL# 05 30 22 A# APPROVED IMMIGRA ION AND NATURALIZATION SERVICE LN,S DISTRICT DIRECTOR DATE 5/13/88 NEW ORLEANS, COLLECTED GX LOUISIANA G-28 or Volag # BY Section of Law: JUL 2.8 1988 Petition was filed on 5-13-88 201 (b) spouse 203 (a)(1) (priority date) 201 (b) child 203 (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Recommended by: SylbrasE Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously NOL 1723 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) BECERRA MARITZA PENA AURElio 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 3800 VolpE DR. 70043 3800 VolpEDR. (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) chalmette LOUISIANA Chalmette LOUISIANA 70043 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) TEqueigalpA D.C. Honduras. IslAs CANARIAS SPAIN 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 9-26-46 Female Widowed Divorced 4-5-1907 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) MARitZA PEÑA FerNANdez Aveelio PENA Rodriguez 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 10-2-63 TEqucigA/pA, HONdURAS. N/A 3/11/1940 SANdoSE, costa RicA 9. Social Security number 10. Alien Registration Number (if anvi 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) N/A FOIA (b)(6) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended N/A- 13. If you are a U.S. citizen, complete the following: Birth in the U.S. the N/A Isabel de deart FERNSANdez MUNOZ issued LA, add 8/23/85 Arrival/Departure 13. 14. Has If He Visitor your Yes or your relative ever been in the U.S.? My citizenship was acquired through (check one) No relative is currently in the U.S., complete the following: Naturalization she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was 12613413 NEW ORlANDS, Record (I-94) Number Date arrived (Month/Day/Year) Parents 195 116939700 MAy/31/87 Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued Nov-24-87 Extencion TORANted until MA4/29/88 15. Name and address of present employer (if any) NONE Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/A. and class of admission: N/A 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? No INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N 5011-28"
}
