{
	"anumber": "A28645376",
	"id": "A28645376_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28645376_0023/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificat de naissance"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 LIBERTE EGAT E FRATERNITI REPUBLIQUE D'HAITI Première Expédition relative registres des Actes de 1 --office .YAEtat - Civil de la Commune 20 de Delmas No Cmas ACTE D-UNSCRIPTION DE NAISSANCE 66071 L'AN mil neuf cent guatre-vingt-et-trois An 180 ème de l'indépendance, et le Jeudi six Octobre, à trois heures dix minutes de l'après-midi ; Vingt Centimes de gourdes NOUS LOUIS NAZAIRE, OFFICIER DE L'ETAT-CIVIL Cemain DE LA COMMUNE DE DELMAS, =7 Louis identifié au numéro : 1.010-H, pour l'exercice fiscal en cours, SOUSSIGNE ; CERTIFIONS : ne - Avoir inscrit, aux registres y afférents, en conformité de la Savanette loi du 20/8/74, le Dispositif d'un Jugement rendu par le Tribunal Civil de Port-au-Prince, séant au Palais de Justice de cette ville le en audience Publique et Civile le 17/8/83, SUR REQUETE du Aout1.907 citoyen Cemorin Louis, sous la constitution de Me. Roger M. Ancion de ce Barreau, dûment identifié, patenté et imposé ; LEQUEL DISPOSITIF EST AINSI LIBELLE 11 11 PAR CES MOTIFS Le Tribunal, après délibération con III formément aux dispositions de loi ré- 11 11 gissant la matière et sur les conclusions du Ministère Public, 11 99 DECLARE sous la réserve des droits de ceux qui ont intérêts et qualités QUE: CEMORIN LOUIS, DU SEXE MASCULIN, EST NE A SAVANET TB LE SEPT AOUT MIL NEUF CENT-SEPT, DES OEUVRES LEGITIMES DE: MORIN C. LOUIS ET CHARLERINE DUVELSAINT, tous deux décédés; DIT QUE LE DISPOSITIF DU PRISENT JUGEMENT TIENDRA LIEU D'ACTE DE NAISSANCE à Cemorin Louis; ORDONNE LA TRANSCRIPTION du dit dis- positif sur un registre spécial tenu en double à cet effet par l'Officier de l'Etat-Civil de la Commune de Delmas 11 99 DONNE DE NOUS, Théophile Jean-Francois, Doyen, on audience \" --- Publique et Civile de ce jour dix-sept Aout mil neuf cent quatr F vingt-et-trois, en présence de Me. Ulrick Rosarion, Substitut du Commissaire du Gouvernement de ce ressort, et avec l'assis - tance du Commis-greffier Ascencio Jumelle IL EST ORDONNE ETC EN FOI DE QUOI ETC (Pour Expédition Conforme et Collationnée, S) F. Victorin, Cs- greffier.- Enregistrée à la Croix-des-Missions, le 25/8/83.- 11 11 Légalisée par le Doyen, le 6/10/83 - R.L. : 13507-MM REPUBLIQUE D'HAIT Orts US AVONS OPERE ET SIGNE LA PRESENTE INS- JUSTICE TOUS POUR CRIPTION CONFORMEMENT A LA LOI En notre Bureau sis àDelmas3, rue du Foyer No. 34 REPUBLIDUE D'HAITILE 20g JUSTICE vous s) NU D'HAI Drts GOURDE JUSTICE TOOS POUR 87"
}
