{
	"anumber": "A28621564",
	"id": "A28621564_0113",
	"page_index": 113,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0113/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AS-6, I-45 ONLY ( NO FEE"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 A S - 6 I-485 ONLY (NO FEE) ASYLEE--AS-6 THE FOLLOWING DOCUMENTATION MUST BE PRESENTED ALONG WITH YOUR I-485 APPLICATION: ( ( ) (1) Your and document (I-94). Form I-643 (attached) passport entry completed in full. ( ) (2) Your birth certificate (original or certified copy) and a certified English translation (if needed). Your passport can replace your birth certificate, if such is unavailable. ( ) (3) If your name has changed since your asylum request was granted, submit (original cert. copy) of your legal name change document. ( ) (4) Current medical report (if one is NOT attached, please see forms attached to this letter). ( ) (5) Two color photos. These photos must be on a white back- ground. They must be a 3/4 frontal portrait with the right ear exposed. Hats, earrings, and glasses are NOT permitted. The photographic image must be SHARP and the size from the top of the head to the chin must not be larger than 1 1/8inch, not smaller than 7/8 inch. ( ) (6) Other: If you are age 14 or over, but under age 80, bring a completed G-325A form and a completed fingerprint chart. NOTE: Failure to present your application (s) with ALL the required documentation may result in the rejection of your application (s). Remember that all documents MUST be in original or certified copy form. If you wish that the document be returned to you after the interview, please ALSO provide a copy of the original or certified copy. Any document in a foreign language must be accompanied by a certified English translation. The translator must certify he is competent to translate and that the translation is accurate."
}
