{
  "anumber": "A28601314",
  "id": "A28601314_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28601314_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PRIMERA CLASE CINCUENTA CENTAVOS 1956-1959, Nº 17446198"
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1963,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 Day RECEIVING PRIMERA CLASE CINCUENTA CENTAVOS oing 1956-1959 No 1746198 1 CERTIFICCION 2 El Infrascrits, Secretaria del Cenc je del Distrite Central, 3 CERTIFIC : due a folios # .59 y 60 Tomo # 60 del Libra Original de 4 Matrimeni S encusntra el asients que literalmente dica: #628.- 5 FARCO TULIO BECERRA ZELAYA representado nor Rene Let Gvaróia Jura- 6 do can M.RITZA PEÑA FERNANDEZ. En Tegucialra, D.C., a los dos 0145 7 dil O ctubra de mil novociantes sesent y tres.-H1 Infrescri- 8 t Secrit.ric 61 Cenceja del Distrite Central, an cumplimiente de 9 1 Art. 17 all Codigo Civil hace constar: que in el Expeoient 10 Matriment 1 CT de a salicitud de Marco Tulie Becarr 2 Jaya ren GENERAL La Guardia Jurado con Marital Peña Reorigu. 2, SC COMPANIER 12 encuration 1 acta us lit calment cice:\"En la civoad CC T HONDURAS 13 D.C., 1.5 COS clas 0el mas de ctubre de mil n.v.cientos sessite y 14 tres.-Sicno Is tres der la tarde nore sanalada-para este acts, Yu, Alfred: I .I'M L., President del Cencejo dul D.C., constitution en mi HONDURAS.C Despache, assciac 64 mi Secretario Drecadi - la utirización 02 17 trimenio Civil convenico entre: RENE I.A GUARDIA JURADO n re- 18 prus ntaci'n de MARCO TULIO BECERRA ZELAYA, Perito Agrénims, nacido CENTRAL mische d Fuerte de La Ceiba Dento. Atlintidaé el 23 de Sentiem- 20 b or mil D.V ci ntss currenta y dos, hije 21 Migu 1 Ang ] Beca- 21 Marin 2 laya; nor moder que le confirió en Escriture Púuli- 22 rime on la civoad de New Or] runs Estado 00 Lussians Est - 23 Uliess 00 Nert America pur el Notario Eublic H my : G bb ] 24 01 e-15 0. agusto de 1963 y cuye testimonio come agreence las DC: 25 dilig.ncias; yMaritza Peña Recrigunz, Estudiant ,Racio- on ests"
}