{
	"anumber": "A28621564",
	"id": "A28621564_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LEA LAS INSTRUCCIONES CUIDADOSAMENTE, 1115-0083"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1984, 1986, 2023, 1909]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Soreened by NARA, 7/28/2023 TANTE: Tenga la bondad de leer las instructiones adjuntas antes de llenar la solicitud. Ejecute en ingles. Use máquina de escribir O letras de molde poligrafo. Asegurese de que esta solicitud y in \"Forma 1 - 539A\", asi como la etiqueta de envio estér legibles. Conteste todas las preguntas. Donde sea apropiado, indique \"NONE\" (por \"ninguno\") o T APPLICABLE\" (por \"no es pertinente\"). Si neces ás espacio para contestar plenamente cualquier pregunta en esta forma, use una hoja separada papel de este tamaño e identifique cada contestacio con el numero de la pregunta correspondiente. *U.S. GPO 1984-441-081 LEA LAS INSTRUCCIONES CUIDADOSAMENTE DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS OMB No. 1115-0083 SERVICIO DE IMMIGRACION Y NATURALIZACION NO SE DEVOLVERAN LOS DERECHOS COBRADOS Approval expires 1-84 SELLO DE DERECHOS SOLICITUD PARA PRORROGAR UNA ESTADIA TEMPORAL APPLICATION TO EXTEND TIME OF TEMPORARY STAY FOR LA PRESENTE SOLICITO UNA PRORROGA DE MI ESTADIA TEMPORAL EN LOS ESTADOS UNIDOS ESCRIBA FIRMEMENTE SE REQUIREN COPIAS LEGIBLES. ESCRIBA SU NOMBRE, A MAQUINA o EN LETRAS DE 6. FECHA HASTA LA CUAL SE SOLICITA LA PRORROGA IMPRENTA, EXACTAMENTE IGUAL QUE APARECE EN SU FORMULARIO I-94, REGISTRO DE LLEGADA-SALIDA. SI su DIRECCION POSTAL EN LOS ESTADOS UNIDOS es LA RESIDENCIA DE ALGUNA PERSONA CUYO APELLIDO ES December, 1985 DIFERENTE AL SUYO, SIRVASE ESCRIBIN EL NOMBRE APELLIDO DE DICHA PERSONA EN LA CASILLA MARCADA C/O. 1. NOMBRE Y APELLIDO (en - NOMBRES SEGUNDO NOMBRE APELLIDO ROMAN JOSE ANTONIO 7. MOTIVOS POR LOS QUE SE SOLICITA LA PRORROGA A CARGO-DE C/O On vacation- visiting family in Miami 2. DIRECCION NÚMERO Y CALLE (Apt. No.) 13325 S.W. 47ST. NÚMERO DE EXPEDIENTE and California POSTAL EN LOS ESTADOS CIUDAD UNIDOS MiAMi, ESTADO FL 33175 Nymero ZIP NÚMERO DE TELÉFONO (305)227-2723 3. FECHA DE NACIMIENTO (Mes Die Afial PAIS DE NACIMIENTO PAIS DE CIUDADANIA OCT. 17, 1909 NiCARAGUA NICARAGUA 8. MOTIVOS DE LA VISITA A LOS ESTADOS UNIDOS 4. CLASIFICACION DE NO EMIGRANTE B-2 FECHA EN QUE CADUCA LA ESTADIA AUTORIZADA FEB 11, 1985 Vacation 5. RECHA Y PUERTO DE LA ULTIMA ENTRADA A LOS BE UU. NOMBRE DEL BARCO, AEROLINEA U OTROS MEDIOS DE Miami, FL /Aug. 12, 1984 TRANSPORTE EN LA UL TIMA ENTRADA A LOS EE.UU. TACA AIRLINES 9. 2 SE HA SOLICITADO ALGUNA VEZ UN VISADO DE INMIGRANTE A NOMBRE SUYO? Sr NO DE RESPONDER \"SI\", ¿EN QUE LUGAR SE SOLICITO? EL NUMERO DE ADMISION EN MI FORMA 1-04 ES: 2:7: 17069973 PARA USO DEL GOBIERNO SOLAMENTE 10. OHA SOLICITADO USTED ALGUNA VEZ UN VISADO DE INMIGRANTE o RESIDENTE EN LOS EE.UU.? Sr NO DE RESPONDER \"sf\" ¿EN QUE LUGAR LO SOLICITO? DATE EXTENSION GRANTED TO (Date) OF ACTION 11. TENGO TENGO INTENCIÓN UN PASAJE DE PARA SALIR MI SALIDA DE LOS EE UU. SI EN Beginning NO 986 DD EXTENSION DENIED V.D. TO (Data) OR 12. NÚMERO DEL PASAPORTE PASAPORTE VENCE EL PASAPORTE EMITIDO OIC C 012965 (Fecha) POR (Pain) OFFICE Dec. 1986 NICARAGUA 13. NUMERO, CALLE, CIUDAD, PROVINCIA (ESTADO) Y PAIS DE RESIDENCIA PERMANENTE 14. MI OCCUPACION NORMAL ES 15. NÚMERO DEL SEGURO SOCIAL RETIRED (De no tenerio, indique \"none\". NONE 18. SOY CASADO. SOLTERO. Si dessa solluliar une proverge para su conyuge hijos, indique a continuacion: (Vee Instrucciones Núm. 1) NOMBRES DEL CONYUGE E NIJOS FECHA DE NACIMIENTO PAIS DE NACIMIENTO PASAPORTE EMITIDO POR (Pals) Y QUE VENCE EL (Fecha) 1 NOTA: a of COMPANY @ Jajins pour las cursion used solicite to prérroge no viver con usted, indique su dirección complete en una hoje aparte adjunta a esta solicitud 17. (Escribe \"HE\" o \"NO HE YO HE HAVE NOT ESTADO EMPLEADO o ME HE DEDICADO A NEGOCIOS EN LOS ESTADOS UNIDOS. Si HA ESTADO EMPLEADO o SE HA DEDICADO A NEGOCIOS EN LOS ESTADOS UNIDOS, LLENE EL RESTO DE LA CASILLA. NOMBRE Y DIRECCION DEL EMPLEADOR o DEL NEGOCIO SALARIO SEMANAL FECHA EN QUE DICHO EMPLEO o NEGOCIO EMPEZO Y TERMINO NOT APPLICABLE N/A N/A CERTIFICO QUE LO ANTERIOR ES CIERTO Y CORRECTO FIRMA DEL SOLICITANTE FECHA 4/08/85 FIRMA DE LA PERSONA QUE PREPARA ESTA SOLICITUD, DE NO SER EL SOLICITANTE DECLARO QUE PREPARÉ ESTE DOCUMENTO A PEDIDO DEL SOLICITANTE Y QUE EL MISMO SE BASA EN TODA LA INFORMACION DE LA QUE TENGO CONOCIMIENTO FIRMA DIRECCION FECHA"
}
