{
	"anumber": "A28621564",
	"id": "A28621564_0095",
	"page_index": 95,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0095/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Guatemala"]
		},
		"years": {
			"ms_years_nlp_v1": [1931, 2023, 1938]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 Name: Roman Avellan, Jose Antonio File: A28 621 564 Page: 1 QUESTIONNAIRE 1. (a) When and where did you join the National Guard? The Department of Health was militarized in 1938, under the Presidency of General Anastasio Somoza Garcia. Together with the Health Department, other public services were also militarized, such as Public Works, Water & Sewer and Telecommunications. I was working in National Institute of Hygiene as a Technical Chief of Biological Products (vaccines were produced as part of on the job training). At this time, Colonel Luis Manuel DeBayle was the Head of the Department of Health. My immediate Supervisor was Doctor Jacinto Perez Ponce. (b) What was your rank? I was given the rank of Lieutenant in view of the years that I had spent with the Health Department (since joining in 1931). (c) What Unit were you in? At this time a was Chief of Biological Products. I was a member of the Medical Corps of the National Guard, being that the Department of Health was militarized. We worked as part of the Inter American Cooperative Service for the control of Malaria. (d) What type of training did you receive? My training was basically Bacteriology, also Serology which was under the World Health Organizations Surveillance. I was sent to Guatemala where courses were hold by the WHO, in Spanish Other training training was on Tuberculosis, on Venereal diseases Typhoid Fever. This included diagnostic studies, as well as producing vaccines. These vaccines were produced on an experimental basis before going out to the public. They had to be tested and approved by the World Health Organization."
}
