{
  "anumber": "A28601314",
  "id": "A28601314_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28601314_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 6/6/2023, 1947-895"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 Tap CA-SVUNGNON UPCOTT op [ST SL69T9I ON 1261-8961 de41946 Pain Regrimez Isabel Fernandez, ambos comparecientes gelteres mayor y menor de adad respective Dente hondurenes y de este vacindaris de la manara que 1 tinuación 20 expresas PRIMERAMENTE: Ye, el Presidente del Concajo in- terregue = cada une de las cent trayentes can la siguiente farmula:Rene L= Gusroi Jurace, quereis por a de Marce Tulio Becerra Selaya a Maritza Ten Fernändez.? MARITZA PENA EERNANDEZ quereis rer espose a Marco 8 Tulie Bec rra?renresentide por el senor Boné de La Guardia Jurada? hubione e ntistade umbos par su orden \"SI QUJERO\"incontinanti pro- 10 signientes malebras QUEDATS UNIDOS EN MATRIMONTO EN POM- 11 BRE LA todo le cual se levants 14 presente ct si nda 12 testings les un aparecen firmando conmigo yo contrayentes nor ant 13 cl infrascrito escistario que da La 1.-M.T.Be- 1.1. CGPTa.- M. Pena Rscriguez.-Selle.-Jacebo Da Casta Gomez Fue- 15 ron testigus cel asients de esta acta, Gloria M. 00 Palacios y Celea 16 o Manualage, mabas cassuas, Secretarias, mayores de ecne, honor- 17 date vecindarie quienes firman conmigo.-Gloria M. 08 P.la- 18 A. de Maradiaga Sello. Jacobo Da vosta Gonez. 19 Extendida on la ciudad de Teguciga 1pa, D.C., ., a los cuatro dias 20 del mas de nevienbre de mil novecientes sesenta y tres. 21 JACORO DA COSTA COMEZ, 22 Secr tirie del Concejo del istrito Centr 1. 23 VORD Vilia F60ix Canales Salazar 24 president 601 Cencoje del Distrito 25 Central."
}