{
  "anumber": "A28700722",
  "id": "A28700722_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28700722_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DIAGNOSTIC POSSIBILITIES FOR INDIVIDUAL TEST RESULTS, ROB01234"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/2/2023 x DIAGNOSTIC POSSIBILITIES INTERPRETING INDIVIDUAL TEST RESULTS INCREASED DECREASED GLUCOSE Non fasting state, I.V. glucose, diabetes, liver disease, pancreatitis, Cushing's Pancreatic disorder cell tumor, pancreatitis, glucagon deficiency), Hepatic Syndrome, increased adrenalin (pheochromocytoma, stress), ACTH adminis- insufficiency, Functional hypoglycemia, extra pancreatic bulky neoplasms, En- tration, brain damage (subarachnoid hemorrhage, convulsive states), acromegally docrine disorders (Addison's disease, hypothyroidism)J/Enzymatic dysfunction (Glycogen storage, galactosemia), hypothalamic lesion malnutrition BUN (UREA Renal disease, congestive heart failure, shock, G.I. hemorrhage, dehydration, Hepatic failure, increased utilization of protein (late pregnancy, acromegally), low NITROGEN) high protein diet, stress protein diet, over-hydration CREATININE Renal disease (pre and post renal azotemia), high intake of creatinine (roast meat), muscle disease AST Liver disease, infarcts of heart, brain or kidney, hemolysis, surgery, trauma, Dialysis, pregnancy, B6 deficiency, beri beri burns, hyperthyroidism, congestive heart failure, alcohol ingestion, muscle disease, pancreatitis, neoplastic disease ALT Generally parallels SGOT but the increase is more marked in liver necrosis and acute hepatitis and less marked in M.I., chronic hepatitis, cirrhosis, etc. B-6 deficiency LDH Myocardial damage, muscle necrosis, pulmonary infarction, liver disease, pernicious anemia, hemolysis, alcoholism, renal infarction, convulsions, kidney disease, pancreatitis, malignancies CPK M.I., Muscle trauma, prolonged exercise GGTP Liver disease, (most sensitive), pancreatitis, renal disease, M.I., alcoholism TOTAL Hepatic cellular damage, biliary obstruction, hemolytic disease, prolonged BILIRUBIN fasting DIRECT Viral hepatitis, cholestatic hepatitis, infectious mononucleosis, biliary BILIRUBIN obstruction, pulmonary infarction, pernicious anemia, Dubin-Johnson INDIRECT Hemolysis, hepatitis, late cholestasis, cirrhosis, pulmonary infarction, Crigler- BILIRUBIN Najjar, hematoma ALKALINE Bone growth Paget's disease. hyperparathyroidism. pulmonary infarction. Excess Vitamin D ingestion, hypophosphatasis, hypothyroldism, malnutrition, PHOSPHATASE pregnancy, liver disease, renal infarction. biliary obstruction. osteoblastic collection of blood in EDTA or oxalate lesions. phosphatasia, marked hyperthyroidism CALCIUM Hyperparathyroidism (primary), multiple myeloma, sarcoid, bone metastases, Hypoparathyroldism, over-hydration, renal failure, acute pancreatitis, decreased excess Vitamin D, hyperthyroidism, immobilization, thiazides, milk alkali syndrome albumin, pregnancy, malabsorption PHOSPHORUS Hypoparathyroidism, excess Vitamin D intake, bone disease, Addison's Primary hyperparathyroidism, antacids, I.V. glucose therapy, Fanconi Syndrome non- Disease, hemolysis, renal rickets, (2° hyperparathyroidism) fasting specimen, malabsorption salicylate poisoning, diuretics. alcoholism SODIUM Dehydration, aldosteronism, Cushing's Syndrome, saline infusion, brain Over-hydration, renal failure, sodium loss (sweat, diarrhea), Addison's Disease, damage, excessive diuresis, hypothalamic lesion inappropriate ADH, elevated lipids, ascites, CHF, cirrhosis, vomiting, diarrhea POTASSIUM Hemolysis, uncontrolled diabetic acidosis, Addison's disease, infusion of Diuretics, Cortisone therapy, Cushing's Syndrome, Insulin/glucose therapy, K+, trauma, renal failure, platelet elevation, acidosis, K+ retaining drugs aldosteronism, metabolic alkalosis, diarrhea, periodic paralysis, vomiting, chronic (triamterene) laxative abuse CHLORIDE Metabolic acidosis, respiratory alkalosis, renal failure, dehydration, acetazo- Respiratory acidosis, metabolic alkalosis, vomiting, excess water, renal disease, lamide, salt infusion, hyperparathyroidism inappropiate ADH, Addison's Disease, aldosteronism, low salt diet CO2 Respiratory acidosis, metabolic alkalosis, diuretics, aldosteronism, Cushing's Metabolic acidosis, respiratory alkalosis, diabetic ketosis, renal disease, diarrhea Syndrome URIC ACID Gout, leukemia, lymphoma, renal failure, polycythemia, diuretics, hypothyroidism, Uricosurics, steroids, Wilson's Disease, some patients with pernicious anemia in acidosis, psoriasis, high protein diet, cancer chemo therapy, toxemia of relapse, neoplasm or healthy adults with isolated defect in tubular transport of pregnancy, Down's Syndrome, certain population groups urio acid. TRIGLY. Non-fasting state, familial hyperlipidemia, nephrosis pancreatitis, alcoholism Congenital a-beta-lipoproteinemia; malnutrition, liver disease CERIDES pregnancy, oral contraceptives, diabetes mellitus, gout, M.I., liver disease *CHOLESTEROL The available data suggests that levels above 200-300 mg/dl are associated with an increased risk of developing premature coronary heart disease Based on the Consensus Conference National Institute of Health Bethesda Maryland December 1984 (JAMA 1985: 253 2080-2086 HDL Low coronary risk, athletes High coronary risk LDL High coronary risk Low coronary risk TOTAL Dehydration, infections, myeloma, collagen disease, liver disease, Over-hydration, nephrosis, immunoglobulin deficiency, liver disease, burns, PROTEIN Waldenstroms' macroglobulinemia, hyperglobulinemia generalized dermatitis, malabsorption, malnutrition ALBUMIN Marked dehydration Nephrosis, liver failure, protein losing enteropathy, excess water, burns, general- ized dermatitis, low protein diet, chronic and acute inflammation, analbuminemia, myeloma, macroglobulinemia, systemic lupus erythematosus IRON Hemolytic anemia, lead poisoning. pernicious anemia, hemochromatoses, Low dietary iron, inadequate absorption, bleeding. nephrosis, infection transfusion siderosis FERRITIN Iron supplementation inflammation malignancy, hepatic disorders, females over Recent blood loss. unsupplemented pregnancy age 45. juvenile rheumatoid arthritis, X-ray irradiation DRUG/PHYSIOLOGICAL INTERACTION TABLE glucose BUPTAKE BILIRUSIN 1. Acetaminophen (Tylenol) IM LEGEND 2. Alum Mag Hydroxide (Gelusil) IM IM 3. Ascorbic Acid DM IM DM IM DM DM I = Increased Results 4. Aspirin IM IM DP IP DM D = Decreased Results DM DM 5. Chlorpromazine (Thorazine) IM IM IM IM P = Physiological Effect 6. Dexamethasone DP M = Methodological Effect 7. Ferrous Sulfate IM IP 8. Methenamine IM IP 9. Methyldopa (Aldomet) IM IM IM IM DM IM 10. Phenothiazine IP 11. Sulfisoxazole (Gantrisin) DM IM 12. Tolbutamide (Orinase) IM DP IP 13. Non-fasting I D I I 14. Pregnancy IP IP IP DP 15. Hospitalization DP SMAC RIA URINALYSIS \"The diagnostic possibilities for each test result are not exhaustive but represent the most commonly encountered possibilities."
}