{
  "anumber": "A28743491",
  "id": "A28743491_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1897,
        2023,
        1885
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/23/2023 7RS WINDIAN RIGT STORES STURT SEVENRUPEES SHRA SEVENRUPEES AFFIDAVIT I, DOSANDHA SINCH s/o S. Labh Singh after being duly Sworn according to law, hereby depose and say: That I am presently residing at Mukhtiar Bhawan, Wazir Singh Road, Ludhiana (Punjab), India. That I was born on March 18, 1885 in India. That I am brother-in-law of Jaswant Singh Keith. That Jaswant Singh was born on April 17, 1897 in Punjab, India at Multan, now in Pakistan. That his parents names are 3. Thakar Singh and Kaur Bhagwan Kaur. That I am executing this affidavit in lieu of Jaswant Singh's birth certificate which is not available, and also to state that he is the legitimate son of 3. Thakar Singh and Kaur Bhagwan Kaur. That since I am the brother-in-law of S. Jaswant Singh and very close to the family, I know the facts very well. That the stated facts are true and correct to the best of my knowledge and belief and I also know to make a false affidavit is a criminal offence. over & explained to the deponent Dasondha Singh Describing Deponent Certified that the affidavit has been read who seemed meetly to understand the same at the time making thereof. Verification Verified that the above statements of my affidavit are true and correct best of my knowledge and belief. 2995001 Dasundy COVT Dated: 1061 Deponent After as Identifice bill DEPARTMENT DEPARTMENT SING! Notary Public Lndhiana (Pb.) 13-8-87 NOTARIAL"
}