{
	"anumber": "A28707386",
	"id": "A28707386_0094",
	"page_index": 94,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0094/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "SECURITY AGREEMENT, 12088"
		},
		"years": {
			"ms_years_nlp_v1": [1954]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DR. SAMUEL LEVINE 543 S. BROADWAY Optometrist LOS ANGELES, CALIF. 90013 624-4516 625-1337 Name Pedro SECURITY AGREEMENT NEW REDPEN 211842 Account Number Address 1519 so Manhation 4-27-94 DATE 90019 AMT. RECD. DESCRIPTION OF SERVICES AMOUNT EYE EXAMINATION FRAMES ONLY LENSES ONLY 1954 - COMPLETE RX CONTACT LENSES SUN GLASSES C. L. W. ADJUSTMENT MISC. Total Above 195 Sales Tax 1. Total Cash Price 195 2. Trade In Or M/C I/we agree to pay the time balance of $ 185- in 6 3. Down Payment TO payments of 3176 and Unpaid Balance Of Cash Price 155 payments of $ 31- 5. Other Charges w and o final payment of $ 6 Amount Financed 175 The First payment will b.e due on 5-20-Et Finance Charge 10 and subsequent payments on 20th withs 8 Time Balance Total Of Payments 185 of each succeeding 9 Annual Percentage Rate % Conditions included in this agreement are IF ADD-ON SALE printed on the reverse side of this document Prior Unpaid 10. Balance NOT PURCHASED ON APPROVAL 11 Addition Deferred Payment 2. Consolidated Price (Total of 1+5+7) $ Time Balance 8410 NOTICE TO THE BUYER: 1. Do not sign this agreement before you read it or if it contains any blank space, 2. You are entitled to a completely filled in copy of this agreement, 3. Under the low, you have the right to pay off in advance the full amount due and under certain conditions to obtain a partial refund on the credit finance charge under rule of 78. EYEGLASSES ARE NON-CARCELLABLE 12088 Buyer has read both sides of this agreement and hereby LA (Pedsa tom breading acknowledges the receipt of a completed copy thereof. ox BUYER BUYER"
}
