{
	"anumber": "A28743491",
	"id": "A28743491_0050",
	"page_index": 50,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0050/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative Application for Permanent Residence, 12768707"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/23/2023 LAW OFFICES OF FRANK, GREENBERG & SIMONE A PROFESSIONAL CORPORATION Bert D. Greenberg (213) 655-4900 Leslie J. Frank 8484 Wilshire Boulevard, Suite 730 (213) 852-0021 Martin Simone Beverly Hills, California 90211 Telex Thomas J. Stefanski 691534 Daniel G. Gold Scott Brickell March 11, 1986 Immigration & Naturalization Service 300 North Los Angeles Street Los Angeles, California 90012 RE: SINGH, JASWANT - Beneficiary KEITH, NARINDERJIT S. - Petitioner No. 12768707 PETITION FOR ALIEN RELATIVE APPLICATION FOR PERMANENT RESIDENCE Gentlemen: Enclosed herein please find a petition to obtain immediate relative classification and an application for adjustment of status regarding the above-named alien, pursuant to Sections 201 (b) and 245 respectively of the Immigration and Nationality Act. The following forms and documents are enclosed herein in support of said petition and application. - Form G-28, indicating our representation, executed by the Petitioner; - Form I-468, ADIT; - Form I-130, Petition for Alien Relative; - Form I-485, Application for Permanent Residence; - Form G-325A, Biographic Information; - Fingerprint Chart of the Beneficiary; - Photographs of the Beneficiary; - Naturalization Certificate No. 12768707; - Form I-94, Arrival and Departure Record of the Beneficiary; - Pension Payment Order showing date of birth of the Beneficiary; - Affidavit regarding the Petitioner's birth certificate and relationship to the Beneficiary; - Check in the amount of $85.00 to cover the filing fee. Page 1 of 2"
}
