{
  "anumber": "A28707386",
  "id": "A28707386_0080",
  "page_index": 80,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0080/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 B BANK OF AMERICA Special Notice WESTERN-OLYMPIC BRANCH 3320 WEST OLYMPIC BLVD. LOS ANGELES, CA 90019 (213) 228-2373 OCTOBER 29, 1982 PEDRO P HERNANDEZ 0353 1519 SOUTH MANHATTAN PL NO 406 LOS ANGELES CA 90019 SUBJECT - TAX FREE TIME DEPOSIT MATURITY NOTICE DEPOSIT NO. 03538-01023 THIS IS JUST A REMINDER THAT THE FUNDS SHOWN BELOW ARE ABOUT TO MATURE AND WILL BE AVAILABLE ON THE MATURITY DATE FOR A NEW INVESTMENT, REINVESTMENT, OR WITHDRAWAL. MATURITY INTEREST DATE RATE TERM FUNDS 11-22-82 10.230 12 MONTHS $6,000.00 THE FUNDS ABOVE DO NOT INCLUDE INTEREST. ANY INTEREST YOU HAVE NOT WITHDRAWN PRIOR TO THE MATURITY DATE WILL ALSO BE AVAILABLE. THIS DEPOSIT WILL NOT EARN INTEREST AFTER MATURITY. ALSO, THE MAXIMUM LIFETIME FEDERAL TAX-FREE INTEREST YOU CAN EARN IS $1,000 FOR AN INDIVIDUAL OR $2,000 FOR THOSE WHO FILE A JOINT RETURN. IF YOU HAVE ANY QUESTIONS, PLEASE CALL OR STOP BY THE BRANCH. Bank of America NT&SA Member FDIC B BANK OF AMERICA 213-228-2373 Amount on Dep. $6,000.00 WESTERN-OLYMPIC BRANCH Account No. 353-8-01023 3320 WEST OLYMPIC BLVD. Interest Paid $52.35 LOS ANGELES, CA 90019 Interest as indicated above has been paid on your Time Deposit Account. We sincerely appreciate your selecting our bank as the place to put your dollars to work. We have a wide range of savings plans to serve our customers and would be happy to discuss these with you at any time. Interest From OCT. 1, 1982, PEDRO P HERNANDEZ Interest Paid To NOV. 1, 1982 1519 SOUTH MANHATTAN PL NO 406 LOS ANGELES CA 90019 Interest Rate 10.230 Maturity Date NOV. 20, 1982 Method of Pmt. SV 3535-02383"
}