{
	"anumber": "A28740267",
	"id": "A28740267_0102",
	"page_index": 102,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0102/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/28/2023, U. S. Department of Justice Immigration and Naturalization Service File: A28 740 267(E-24)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1988, 1975, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "August 2, 1988 U. S. Department of Justice Imigration adn Naturalization SErvice 630 Samsome St San Francisco, Ca. 94111 File: A28 740 267 (E-24) Gentlemen: I would like to testify on behalf of my father MARCELINO SOLIS ROMERO, a Nicarguan citizen, 83 years of age, who may face ver stiff penalties if he returns to Nicaragua. I was a member of the Sandinista Police force, (forced) and I can not live there anymore due to the condition of the military procedures. In July of 1986, I decided to leave the country (Nicaragua) but I did it without notifying the military commander that I belor to. In other words I am a deserter of the Sandinsita forces ai either me or my father return to Nicaragua we will be in very dangerous problem/situation. To be honest with you, I do not to much for my person, but my father is a very old man, with relatives in Nicaragua, nobody to take care of him and facin posiblities of being questioned or tortured by the Sandinista order to find out about my whereabouts. At this point, I beg and ask for mercy on behalf of my fathe be considerate and understand the potentiál problems that may for my father He can not go back to Nicaragua. The Sandista will make his life mi rable and many things could happenato him, taking into consideration his age, or the fact that we live i U.S. One more time, I want to ask youyto consider my father reques Political Asylum, taking into consideration the fact that whi has lived in the U.S. he never has received one penny from a agency or authority. He has lived with my sister, who is a 1e resident since 1966 and is the process to become an American buying her residence since 1975, Under penalty of perjury, I declare that the above statement but the trueve Road Florencio Solis 208 Santos St San Francisco, Ca. 94134"
}
