{
	"anumber": "A28766478",
	"id": "A28766478_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766478_0034/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. IMMIGRATION AND NATURALIZATION SERVICE, LOS 1006 AUG 3 1989"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [725, 1006, 1908, 1988, 1989]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "STATE OF. CALIFORNIA STATE FILE NUMBER Screenedshy BLACK INK ONLY3 LOCAL REGISTRATION DISTRICT AND CERTIFICATE NUMBER 1A. NAME OF DECEDENT-FIRST 10 MIDDLE 1C. LAST (FAMILY) (GIVEN) 2A. DATE OF DEATH-MO. DAY. YR 2B. HOUR 3. SEX Maura A. Rocha July 28, 1989 0725 Female 4. RACE 5. SPANISH/HISPANIC-SPECIFY 6. DATE OF BIRTH-MO. DAY. YR 7. AGE IN IF UNDER 1 YEAR IF UNDER 24 HOURS YEARS MONTHS White DAYS HOURS MINUTES YES Nicaragua NO Nov. 24, 1908 80 DECEDENT 8. STATE OF 9. CITIZEN OF WHAT 10A. FULL NAME OF FATHER PERSONAL BIRTH 10B. STATE OF COUNTRY 11A. FULL MAIDEN NAME OF MOTHER 11B. STATE OF BIRTH DATA Nicaragua Nicaragua Jose Luis Silva BIRTH Nicaragua Jeronima Silva Nicaragua 12. MILITARY SERVICE? 13. SOCIAL SECURITY NO. 14. MARITAL STATUS 15. NAME OF SURVIVING SPOUSE (IF WIFE. ENTER MAIDEN NAME) 19 TO 19 NONE 570-97-8975 Married Carlos A. Rocha / OFC 16A. USUAL OCCUPATION 16B. USUAL KIND OF BUSINESS 16C. USUAL EMPLOYER 16D. YEARS IN OR INDUSTRY 17. EDUCATION-YEARS COMPLETED OCCUPATION Homemaker Homemaking Self Employed 51 6 18A. RESIDENCE-STREET AND NUMBER OR LOCATION 18B. CITY 18C. ZIP CODE USUAL 238 S. Reno St. Los Angeles 90057 RESIDENCE 18D. COUNTY 18E. NUMBER OF YEARS 18F. STATE OR FOREIGN COUNTRY 20. NAME. RELATIONSHIP. MAILING ADDRESS IN THIS COUNTY Los Angeles AND ZIP CODE OF INFORMANT 5 Ca. Carlos A. Rocha - Husband 19A. PLACE OF DEATH 19B. IF HOSPITAL. SPECIFY 19C. COUNTY PLACE Midway Hospital ONE: IP. ER/OP. DOA 238 S. Reno St. IP OF Los Angeles L.A., Ca. 90057 DEATH 19D. STREET ADDRESS-STREET AND NUMBER OR LOCATION 19E. CITY TIME INTERVAL 22. WAS DEATH REPORTED TO CORONER? 5925 W. San Vicente Blvd BETWEEN ONSET REFERRAL NUMBER Los Angeles AND DEATH YES NO 21. DEATH WAS CAUSED BY: (ENTER ONLY ONE CAUSE PER LINE FOR A. B. AND C) 23. WAS BIOPSY PERFORMED? IMMEDIATE CAUSE {IAI Cardiac Arrest 30 Mins. YES NO CAUSE 24A. WAS AUTOPSY PERFORMED? OF DEATH DUE TO (B) Acute Myocardial Infarction 2 Days YES NO 24B. WAS IT USED IN DETERMINING CAUSE (C) Coronary Artery Disease OF DEATH? DUE TO 30 Yrs. YES NO 25. OTHER SIGNIFICANT CONDITIONS CONTRIBUTING TO DEATH BUT NOT RELATED TO CAUSE GIVEN IN 21 26. WAS OPERATION PERFORMED FOR ANY CONDITION IN ITEM 21 OR 25? Hypertension, Cardiomegaly IF YES. LIST TYPE OF OPERATION AND DATE. None 1 CERTIFY THAT TO THE BEST OF MY KNOWLEDGE DEATH 27B. SIGN TURE AND DEGREE OR TITLE OF PHYSICIAN PHYSI. OCCURRED AT THE HOUR. DATE AND PLACE STATED FROM THE M 27C. PHYSICIAN'S LICENSE NUMBER 27D. DATE SIGNED CAUSES STATED. CIAN'S 27A. DECEDENT ATTENDED SINCE DECEDENT LAST SEEN ALIVE G 27765 7-31-1989 CERTIFICA. MONTH. DAY. YEAR MONTH. DAY. YEAR 27E. TYPE ATTENDING PHYSICIAN'S NAME AND ADDRESS TION 7-6-1988 7-27-1989 Richard M. Powell,M.D 6317 Wilshire Blvd., L.A., Ca. 90048 I CERTIFY THAT IN MY OPINION DEATH OCCURRED AT 28A. SIGNATURE AND TITLE OF CORONER OR DEPUTY CORONER THE HOUR. DATE AND PLACE STATED FROM THE CAUSES 28B. DATE SIGNED STATED. CORONER'S 29. MANNER OF DEATH-specify one natural accident 30A. PLACE OF INJURY suicide. homicide. pending investigation or could not be determined 30B. INJURY AT WORK 30C. DATE OF INJURY 31. HOUR USE MONTH. DAY. YEAR ONLY YES NO 32. LOCATION (STREET AND NUMBER OR LOCATION AND CITY) 33. DESCRIBE How INJURY OCCURRED (EVENTS WHICH RESULTED IN INJURY) 34A. DISPOSITION(S) FUNERAL 34B. PLACE OF FINAL DISPOSITION NAME ,AND ADDRESS 34C. DATE Forest Lawn Hollywood Hills, 35A. SIGNATURE OR EMBALMER 35B. LICENSE DIRECTOR Burial MO. DAY. YEAR AND 6300 Forest Lawn Dr., L.A., Ca. Aug. 5,1989 Willian Stennett NUMBER 6343 LOCAL 36A. NAME OF FUNERAL DIRECTOR (OR PERSON ACTING AS SUCH) 36B. LICENSE NO. 37. SIGNATURE OF LOCAL REGISTRAR Aimstrong Family Malloy-Mitten FD 380 Rates REGISTRAR Main 38. REGISTRATION DATE AUG 01 1989 A. STATE B. C D. E. F. CENSUS TRACT REGISTRAR VS-11 (REV. 3-89) 410 MAKE NO ERASURES. WHITEOUTS OR OTHER ALTERATIONS THIS IS A TRUE CERTIFIED COPY OF THE RECORD FILED IN THE COUNTY OF LOS ANGELES DEPARTMENT OF HEALTH SERVICES IF IT BEARS THIS SEAL IN PURPLE INK. CRUMP AUG 2 1989 STATE 39 Director of Health Services and Registrar U. S. IMMIGRATION AND NATURALIZATION SERVICE I certify that I have this date compared this copy with the original document and found it to be a LOS 1006 AUG true 3.1.1989 copy. POLTIVE (Date) Immigrant Inspector/Examiner Los Angeles, Calif."
}
