{
  "anumber": "A28740267",
  "id": "A28740267_0111",
  "page_index": 111,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0111/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, 213"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "*UQS. GPO: 1987-197-523 Screened by NARA, 7/28/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31 . 34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion SOLIS-Romero - Marcelino Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation Nicaragua A28 740 267 U.S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) Scars or Marks 151 Sears Street, San Francisco, CA 94112 Date, Place. Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) Single Married 01-31-84 near San Ysidro, CA, EWI Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension Colonia Morazon Managua, Nicaragua 518.2 Date of Action Location Code (At/Near) Date & Hour Birthdate April 26. 1905 05/01/89 SPR SFR City, Province (State) and Country of Birth AR Form: (Type & No.) By Lifted Not Lifted Hanagua Nicaragua Visa Issued At-NIV No. Social Security Account Name Status at Entry Status When Found EWI SA N/A Send C.O. Rec. Check Length of Time Illegally in U.S. Date Visa Issued Social Security No. To: SFR Over one year N/A Criminal Record Immigration Record C/N C/N Number & Nationality of minor Children Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) None None Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known ROMERO, Lorenzo: Nicaragua: Deceased SOLIS, Maxima: NIC; Deceased Monies Due/Property in U.S. Not in Immediate Fingerprinted Lonkout Book Checked Deportation Charge(s) (Code Words) Possession See Form 1.43 Yes No Not Listed Listed, Code ROTEN 241(a)(2) None Claimed Type of Employment Salary From: To: Name and Address of (Last) (Current) U.S. Employer $ hr. Narrative (Outline particulars under which alien located/apprehended Include details, not shown above. re time, place, manner of last entry, and elements which CFR establish 242.2(e). ad- ministrative and/or criminal violation Indicate means and route of travel to interior) Alien has been advised of communication privileges pursuant to 8 Initial Date SUBJECT is not present; I-213 executed from file information SUBJECT last entered the United States as a EWI SUBJECT is in the United States in violation of the Immigration and Nationality Act. File shows no petitions or other applications, granted or pending, filed on behalf of the subject. (Signature and Title) (If space insufficient, show \"continued\" and continue on reverse, from bottom up): Received (subject and documents) (report of interview) from DISTRIBUTION Officer: -File. 1-log Larence Cammons ( ). M. -court 1-trial attorney May 11, 19 89 at Form I-618 served; list oflegal servi Disposition OSC requested (Receiving Officer) Form 1-213 (Rev. 4-16-79)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}