{
	"anumber": "A28701414",
	"id": "A28701414_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28701414_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CONFIDENTIAL 76 14184 RECORD OF CHURCH MARRIAGE bns eur alainT 76 14184 TO BE FILED \" TH THE COUNTY CLERR loss eri) eased IN PURSUANT TO 4213 CIVIL CODE arti to COUNTY CLERR $ NUMBER is NAME OF HUSBAND- FIRST NAME 10 MIDDLE NAME K LAST,NAME PERSONAL JAVIER SOLIS 2 DATE OF BIRTH CORTA bar TEAD 3 AGE ILACT 4 BIATHPLACE STATE 00 POSTAGE COUNTRY DATA OF 10-20-48 28 YEARS MEXICO HUSBAND Sa NAME OF FATHER OF HUSBAND of DIRIMPLACE OF FATHER 04 MAIDEN NAME OF MOTHER OF HUSBAND 00 BIRTHPLACE OF MOTHER VIDAL SOLIS MEXICO JESUS DIAZ MEXICO 7a NAME OF WITE-FIRST NAME 7a INDOLE NAME 7c LAST NAME PERSONAL DEISA AGUILAR a DATE or BIRTH - PAT read 0 AGE LAGE - 10 BIRTHPLACE - - - - DATA OF 6-11-41 35 YEARS HONDURAS WIFE 11a NAME OF FATHER OF WIFE \" BIRTHPLACE OF FATHER 12A MAIDEN NAME OF MOTHER OF WIFE 120 BIRTHPY ACE OF MOTHER WENCESLAO ARRIASA HONDURAS MIRTALA AGUILAR HONDURAS COLORED 134 RESIDENCE-GTREET ADDRE is - ADD - - 8 LOCATION: 130 CITY OR TOWN 13c. COUNTY . outside - state ADDRESS 7114 MIRAMONTE BLVD. Los ANGELES CALIFORNIA WE THE HUSSAND AND WIFE RAMED a THIS CERTIFICATE. EACH FOR HISSELF. STATE THAT THE FOREGOING INFORMATION is CORRECT TO THE BEST OF OUR KNOWLEDGE AND BELIEF AFFIDAVIT AND THAT WE ARE UNMARRIED PERSONS NOT ININONS AND HAVE BEEN LIVING TOGETHER AS MAN AND WIFE OF HUSBAND AND WIFE NATURE OF HUSBAND 140. 14a IS garies Salies SIGNATURE Dusa OF JUIFE asmiles CERTIFY THAT THE above NAMED MAN AND WOMAN was JOHNSO BY - - MARRIAGE - ACCOUNT IGA SIGNATURE OF PERSON PERFORMED CEREMONY AND OFFICIAL MILE WITH THE LIGS OF THE STATE OF CALIFORNIA Penna Ferrer MINISTER CERTIFICATION NOVEMBER 22 76 100. NAME OF PERSON PERFORMING CEREMONY I - - . POIGOT - 00 DADE OF PERSON on 10 bar PERFORMING ELENA FERRER FREND FOLLOWSHIP CEREMONY AT ABEL CHAPEL - Los ANGELES 100 ADDRESS-STREET ADDRESS. CITY OR TOWN AND STATE on 1 200 so. HILL ST. L.A. CALIF. 17. DATE ACCEPTED FOR FILING 10. COUNTY CLERM SIGNATURE COUNTY CLERK NOV 24 1976 labo 1 Carcerea, Acting G DEPUTY STATE OF CALIFORNIA DEPARTMENT OF HEALTH-OFFICE OF THE STATE REGISTRAR OF VITAL STATISTICS FORM VS-123 14-70 SEE REVERSE SIDE FOR FURTHER EXPLANATION AND APPLICABLE CODE SECTIONS BAR NO. 96869 I JEFFREY PORTNOY, ATTORNEY AT LAW: hereby certify to the best of my belief and knowledge, that this document IS a true and complete copy from the original. Signed Doted MAR/X6/987"
}
