{
  "anumber": "A28707386",
  "id": "A28707386_0117",
  "page_index": 117,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0117/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DATA COLLECTION FOR ALIEN DOCUMENTATION, IDENTIFICATION & TELECOMMUNICATION SYSTEM (ADIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Petition Form No. I- 485 File No. A28 707 386 DATA COLLECTION FOR ALIEN DOCUMENTATION IDENTIFICATION & TELECOMMUNICATION SYSTEM (ADIT) Please print or type information requested below: COMPLETE NAME PEDRO JOSE PORTILLO- HERNANDEZ COMPLETE MAILING ADDRESS (Include Zip Code) 1519 So. Manhattan P1. # 406 Los Angeles, California 90019 MOTHER'S FIRST NAME Luz FATHER'S FIRST NAME Pedro CITY/TOWN/VILLAGE OF BIRTH Sant a Ana, E1 Salvador CITY OF RESIDENCE WHEN APPLYING FOR A VISA OR IMMIGRANT STATUS Los Angeles, California CITY OF DESTINATION AT TIME OF ORIGINAL ADMISSION Los Angeles, California LOCATION OF CONSULATE WHERE IMMIGRANT VISA OBTAINED (OR IMMIGRATION OFFICE H HERE ADJUSTED) Los Angeles, California DATE OF BIRTH 04-12-15 PORT OF ENTRY WHEN ADMITTED AS IMMIGRANT OR OFFICE WHERE ADJUSTED TO LAWFUL PERMANENT RESIDENT SYMBOL ADMITTED UNDER (CLASSIFICATION) DATE ADMITTED OR ADJUSTED TO LAWFUL PERMANENT RESIDENT COUNTRY OF BIRTH E1 Salvador CARD NUMBER TRANSACTION NUMBER This form may De overprinted or strmped to show instructions, Items requested, Items received, or other partisent data which may facilitate processing. Long this that OS top of all auterial in If sad initial decision is made. Form -458 (ADIT) FPI-LOM (Rev. 11-1-70 2-63 500 Tabs 5673"
}