{
	"anumber": "A28766477",
	"id": "A28766477_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DECLARACIÓN BAJO PROMESA Y ANTE NOTARIO, SERIE 'D'"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1983, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 6/1/2023 SERIE \"D\" GAAPe7 DODO CORDOBAS 900 780 with a DECLARACION BAJO PROMESA Y ANTE NOTARIO 1 SOBRE IDENTIDAD DE DOS PERSONAS - EPICA SECURITY 2 45 cgado Y Notesto 3 Nosotros: ALBERTO MAYORGA ROCHA , Negociante YANDREA PASTORA 4 SILVA ROCHA, ama de casa , ambos mayores de edad y del domicilio de la ciudad de 5 Diriamba, Carazo, República de Nicaragua C. A. por este medio : CONFESAMOS Y DECLARAMOS : 6 IN 1- Dice don ALBERTO MAYORGA ROCHA, que él por toda su vida ha sido conocida como- 8 CARLOS ROCHA y así he firmado todas mis gestiones legales y somos la misma per 9 - dona.- 10 2- Dice doña ANDREA PASTORA SILVA ROCHA, que ella igualmente es la esposa legal 11 de don CARLOS ROCHA, y sólo es conocida como MAURA ROCHA en todas sus relaciones 12 legales en este país y fuera del mismo . Esto sin perjuicios de el Pasaporte - 13 de don Carlos Numero 120648; y y el de doña Maura No. C 120390- señalen los - 14 nombres antes apuntados. En fe de lo cual firmamos ante Notario en la ciudad 15 de Diriamba a los seis días del mes de Diciembre de 1983- 16 Maursdefocha CARLOS ROCHA. MAURA S. de ROCHA. 17 18 LEONEL TAPIA VALVERDE 9 Notario Público y Abogado de la República de Nicaragua, del domicilio de la ciudad de Diriamba, Carazo, Nicaragua . C. A, debidamente - 19 20 autorizado por la EXCMA. CORTE SUPREMA DE JUSTICIA, para ejercer la Notaría Pú- -blica que expirará el día 14 de Diciembre de 1986 doy fe y Certifico: \"Que las- 21 firmas que anteceden son auténticas y fueron puestas en mí presencia por los - 22 23 señores Rocha y son las que ellos usan en sus relaciones legales. Doy fe así -- 24 mismo de los conceptos vertidos por los declarantes. En la ciudad de Diriamba - - a los seis días del mes de Diciembre de mil novecientos ochenta y tres. 25 26 S Dr. LEONEL TAPIA HALVERDE 27 SECURITY TAPIA CADE a NOTARIO PUBLICO. 28 N TE DIC A 29 Natoria 30"
}
