{
  "anumber": "A28749561",
  "id": "A28749561_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0031/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MULTIPLE LISTING SERVICE - RESIDENTIA, NABR 4/27/93"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TN 4/27/2023 MULTIPLE LISTING SERVICE - RESIDENTIA REALTOR Address Code 2D Down Min. Dep. 1010- OWNER AUTHORIZES THE FOLLOWING: 1st. TD 42,220 Sign 16 be placed on property yes Pay 386 2, Key Box to be placed on property yes no. Lender 2nd. TD % For Agents Use: Pay 21.0 Agents inspection four no Fonds 2. Exits glossy prints no Taxes 41.5 Commission to cooperating office 33% Ex.: HO? Vet? 4. Property is located in Special Studies Zone ) yes IT Sewers in St.? Conn. 345 Paid? / OWNER'S NAME Owner Occup. Owner MARI NAIDA MAGANA Occup. Ph. 351-1112 CD Loc. Key Box Loc. no LR 14.86 Age 120 Th. Map Poss. C/E 13rm DR no OJ Const. stucco Lot Home Prot. no No. Stories / Zone ghl. Dist NEW Duait Den Sq. Ft. Roof corp Elem. blavwell FR Eleb.? m Fronts with Garage UD No. BRs D Floors Hw Basemt. BR 11314 Jr. HI. withful GD Fireplace no Pool no High Dunite listh BR have Heat wheer Fence yes BR A/C ww Sprink. uv BR Paris Lndry. To Show L.D. first (e mysest Parac. Remarks s Restrictions) Assumination 7AH -245 lian Judget to and ascion to cling mement. Resitor (1) In consideration OF the Review Blothe Resident named below. herein called adent, I hereby employ exclusively and irrevocably, for the period of time Beginning 1982 and ending December 28 1982 (12 o'clock midnight) to self the above extensed property County of Los Ange- les, California By Hirstview I've. 121 I hereby Irrevocable right 10 said property within said time for and to accept a deposit (3) The commissions not fixed by law. they are set by each broker individually and seller and broker. (4) commission agent agent, BureHaser and able to purchase said property upon the above terms and price, or should said property be sold by said per cent of the selling price should during the time set forth herein, approval Including myself, or if said property be withdrawn from sale, transferred, conveyed or leased without written (5) Said property is sold, transferred, conveyed or leased within 70 authority extension with whom agent has negotiations prior to final termination, provided I have received notice In writ- days after the termination of this ing. names of prospective purchasers, before of upon termination of this agreement or any extension thereof. However, I shall not be obligated said commission (If valid, listing is enfered Into during the term of said protection period with another licensed real estate agent the conveyance or exchange of the property is made during the term of said protection period. and (6) It member of the Multiple Listing Service of the above Board of Realtors. and It is further agreed that said agent of the Multiple Listing Services of ath Boards of Résitors within the 16th District of the California Association Brocuring or attempting to procure a purchaser in accordance with this agreement, and in the event a sale, (7) such ub-agênt, all of the terms of this agreement shall apply to such transaction. Certificately Completion Structural Pest Control Inspection report submitted by & licensed pest control operator and, If necessary, with the Structural Pest Control Act of the State of California, covering all buildings upon said property. (8) Evidence to 68 form or brant deed and à Standard Policy of Title Insurance Issued by a responsible title company. to be furnished (9) If half of the démindes recovered, BUT not to exceed the aboye fee, after first deducting title and escrow expenses and the expenses of collection, entitled to if one. any. agent shall be. (10) There are oral agreements promises or répresentations of agent to owner other than contained herein. Owner states that the information (11) herein is complete and securate, and that agent and ub-agents referred to in item 6 above will be relying thereon in performing their services said It is authorize completion of à fully executed sales agreement on listed property, agent will notify the above Multiple Listino Service of LINE dissemination or sales information to closing including selling price to agent and sub-agents referred to in therebiter Ven 6 prior (12) THIS to creed, color, or national origin. (13) I Insurance premiums and rents, pro-rated to close of escrow. If any agree to provide Certificate of Occupancy Issued by competent authority. required by the jurisdiction the prop. (14) in in addition the event should sulf bill Unstituted to enforce any provisions of this\\agreement the prevailing party shall 58 Lied reasonable Attorney's fees (15) I agree TO In WORKING property available for Inspection by prospective buyers and lenders. I stand: this agreement? and (THEY have received à copy hereof. that have read and Dated Moneon that 90013 x team California & 404 Heirs filled Owner ach Owner release & of Address City State State (16) IA consid Execution: or the foregoing, the undersigned Agent abrees to use diligence In endeavoring obtain purchaser Agent Property 1280 E. By Intagely Address Office Phone 772-33 audition,"
}