{
	"anumber": "A28740267",
	"id": "A28740267_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/28/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 30. Are you entitled to return to country of issuance O our passport Yes No Travel document Yes Or other document Yes No (If not. explain why) I do not like the present government of the Sandinistas, I am frustrated with the present regimen, I do not like, I do not want the Communist Government. 31. What do you think would happen to you if you returned? (Explain) Since I made it Public, my dislike my Frustra- tion, and since there is no freedom, I can not return, I fear for my freedom I fear persecution, since I have no collaborated with the preeent regimen 32. When you left your home country, to what country did you intend to go? U.S.A. 33. Would you return to your home country? Yes X (Explain) I fear for my freedom, I fear persecution and I can not return, the fact that I have never collaborated, the fact that I refused to do as they wanted me to say or do, and the fact that I made my dislike public. 34. Have you or any member of your immediate family ever belonged to any organization in your home country? Yes No. (If yes, provide the following information relating to each organization: Name of organization, dates of membership or affiliation, purpose of the organization, what, if any, were your official duties or responsibilities. and are you still an active member. (If not, explain) Julio A Lopez, was member of the Somoza Regimen, imprisonned after being captured by the Sandinistas sentenced to 30 years in prison, he is my relative my nephew, this created all kinds of tensions with the Sandinistas regimen and in our family, fear of persecution. 35. Have you taken any action that you believe will result in persecution in your home country? Yes No (If yes, explain) As I have made it Public my dislike and frustration with the present Government of the Sandinistas, suhc made a fear of persecution in our family and myself specially. 36. Have you ever been detained interrogated convicted and sentenced imprisoned in any country? Yes No (If yes, specify for each instance: what occurred and the circumstances, dates, location. duration of the detention or imprisonment, reason for the detention or conviction, what formal charges were placed against you, reason for the release, names and addresses of persons who could verify these statements. Attach documents referring to these incidents, if any). 37. If you base your claim for asylum on current conditions in your country, do these conditions affect your freedom more than the rest of that country's population? Yes No (If yes, explain) As stated above I made it public my frustration and my dislike against the Sandinistas, such public manifestation, has made me an enemy of the government to the point that I fear my return at this time. By all means I fear my return and I do not want to return at this time May problem is my country 38. Have you, or any member of your immediate family, ever been mistreated by the authorities of your home country/country of nationality Yes No. If yes, was it mistreatment because of Race Religion Nationality Political opinion or Membership of a particular social group? Specify for each instance; what occurred and the circumstances. date, exact location, who took such action against you and what was his/her position in the government, reason why the incident occurred. names and addresses of people who witnessed these actions and who could verify these statements. Attach documents referring to these incidents. 39. After leaving your home country, have you traveled through (other than in transit) or resided in any other country before entering the U.S.? Yes No (If yes, identify each country, length of stay, purpose of stay, address, and reason for leaving, and whether you are entitled to return to that country for residence purposes. I went thru Mexico in the way to the USA 40. Why did you continue traveling to the U.S.? I have relatives in the USA 41. Did you apply for asylum in any other country? Yes-Give details o-Explain why not Mexico is friendly to the Sandinistas, makes it impossible for any one to ask for such asylum (3) (over)"
}
