{
  "anumber": "A28749561",
  "id": "A28749561_0106",
  "page_index": 106,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0106/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, 213"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 UResiN. RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31 - 34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion FOIA (b)(6) FOIA (b)(6) Country of Citizenship Passport Number and Country of issue File Number FOIA (b)(6) A28749561 U.S Address (Residence) FOIA (b)(6) (Number) (Street) (City) (State) (Zip Code) FOIA (b)(6) Date Place Time Manner of Last Entry Passenger Boarded At F.B.I. No. 3-23-87 6 M. E. SYS POE 1:50 P.M. EWI FOIA (b)(6) Number Street City, Province (State) and Country of Permanent Residence Method of ocalion/Apprehension FOIA (b)(6) BORDER PATROL/LINEMATCH Birthdate Date of Action Location Code (AI/Near) Date & Hour FOIA (b)(6) 3-23-87 SDC-BRF SAN YSIDRO 3-23-87 2:10 P.M. City. Province (State) and Country of Birth AR Form (Type & No.) Lifted By FOIA (b)(6) Not Lifted C. ARNOLD/J. L. ROBERTS Visa issued AI NIV No. Social Security Account Name Status of Entry Status When Found EWI IN TRAVEL Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time illegally in U.S. To: AT ENTRY Immigration Record Criminal Record CLAIMS 2 PPIORS WITH USBP CLAIMS NONE Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of minor Children FOIA (b)(6 FOIA (b)(6) Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known FOIA (b)(6) FOIA (b)(6) Monies Due Property in U.S. Not in Immediate Fingerprinted LOOKOUT Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1.43 Yes No Not Listed Listed Code ROTEN Name and Address of (Last) (Current) U.S. Employer Type of Employment Salary From: To: $ hr Norrative (Outline particulars under which alien located/opprehended Include details, not shown above, re time, place, manner of lost entry. and elements which establish administrative and/or criminal violation indicate means and route of movel injecior Alien has been advised of communication privileges pursuant to B CFR 242.2(e). Initial Date MONEY: $40.00 US BAGGAGE: o Ca. plate 2CKJ08Y. STOLEN DRIVER CO PRINCIPAL with one in a 1986 White Toyota Camary JUD Subject was read his rights as per Miranda from a Service Issue Rights Card at Brown Field Station at 2:25 P.M. by Agent John L. Roberts with Agent Robert J. Fagan witnessing. Subject states that he understands his rights and was willing to answer questions without the presence of an attorney. Subject could not be questioned other than biographical data as it appeared he was under the influence of a controlled substance. Subject states that he injected Heroin into his system about 12:00 P.M. in Tijuana, B.C., Mexico. Subject states that he knowingly an willingly entered the United States at a place other than a designated Port of Entry in an effort to avoid inspection by Immigration Officer. At approximately 1:50 P.M. Border Patrol Communications notified Line Agents that. a vehicle sensor had been activated indicating that a vehicle had possibly entered the United States surrepticously east of Otay Mesa Port of Entry. After Agents were notified the Border Patrol Helicopter notified Agent s that he observed a white Toyota sedan leaving the-area of the sensor activation and turn west onto Otay Mesa Rd (If space insufficient show \"continued\" and continue on reverse, from bottom up) CONTINUED\" John Relate (Signature and Title 5PA DISTRIBUTION Received (subject dind documents) (report of interview) from ROBERTS, JOHN L. Officer: 3-23-87 of 3:15 P M Disposition [-247 executed (Receiving Officer) Form 1213 (Rev. 4.16.79)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}