{
	"anumber": "A28740267",
	"id": "A28740267_0108",
	"page_index": 108,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0108/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Oath and Bond/Custody Processing Sheet, A28 740 267"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department 01 justice Application for Uru snow Cause immigration and Naturalization Service and Bond/Custody Processing Sheet must DO attached A. Name Office I File SOLIS-Romero, Marcelino SFR A28 740 Address Date 151 Sears Street, San Francisco, California 94112 05/01/89 FACTUAL ALLEGATIONS 1. You are not a citizen or national of the United States 2. You are a native of Nicaragua and a citizen of Nicaragua : 3. You entered the United States at near San Ysidro, CA on Jan. 31, 1984 (Date) 4. YOU WERE NOT THEN INSPECTED BY A UNITED STATESIMMIGRATION OFFICER. 5. Attorney of Record Supporting evidence Ibrietiv itemizer SEE G-365. I-589. AND I-213 B. ADDITIONAL FACTORS TO BE CONSIDERED FOR BOND CUSTODY DETERMINATION 1. Is a Detition. application pending for this allen or family memoer (explain) ASYLUM DENIED 2. Total times apprenended 1 Bonded before? How many times? Released O/T before Bond breached? How many times? Complied with OII 3. Present state of health of subject. 01 spouse. children (if other than good. explain) 4. Total time in U.S.. dates and location: residing with (Family members or others) 5. Personal property in U.S. (liquid and non-liguid assets) 6. Family members in U.S. (Wire. children immediate relatives) address if different than subject: 7. Employment history: Other than current) 8. Other factors i.e. faise claim. attempted flight. unsupervised children at home. etc. C. The undersigned recommends V/D without OSC OSC Charge(s) /Code) ROTEN 241 (a) (2) (Pare No Trial Attorney Interpreter (language) Prosecution Violation W/A For the following reasons OSC MAILOUT Signature Signature Title Title Faume D.Q. Supervisory Approval SLE D. Approved as to legal sufficiency: (Date) (Signature) (Title) (Office) E. Based on the above information I have set the following bond : DD Acting DD DDD ADDI OIC (Date) (Signature) (Office)"
}
