{
	"anumber": "A28743491",
	"id": "A28743491_0052",
	"page_index": 52,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0052/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT, 10-31-87"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [821, 1987, 1986, 2023, 1904, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/23/2023 1 STATE OF CALIFORNIA ) ) SS. 2 COUNTY OF LOS ANGELES ) L.A 3 4 5 AFFIDAVIT 6 I, DR. BOOTA SINGH, after being duly sworn according to 7 law, hereby depose and say: 8 That I am presently residing at 2108 Gardi Street, 9 Bradbury, California 91010; 10 That I was born on October 22, 1904 in Nadala, India; 11 That I am the father-in-law of Narinderjit Singh Keith; 12 That Narinderjit Singh Keith was born on August 1, 1930 13 in Ponjab, India; 14 That his parents names are Jaswant Singh and Kaur Beant- 15 Kaur; 16 That I am executing this affidavit in lieu of 17 Narinderjit Singh Keith's birth certificate which is unavailable 18 and also to state that he is the legitimate son of Jaswant Singh 19 and Kaur Beant-Kaur; 20 That since I am the father-in-law - of Narinderjit Singh 21 Keith and very close to the family, I know the facts very well; 22 That the stated facts are true and correct to the best 23 of my knowledge and belief and I also know to make WITH a false affidavit 24 is a criminal offence. T ATIHAVE COMPARED AND COMPLETE COPY. IS A TRUE 25 DATED: Date 3-11-87 26 SIGNED FRANK, GET straw Sal 27 DR. BOOTA SINGH WILSBIRE ELVD.. SUND 28 Subscribed and sworn to before me this 0821 day of October, 1986. Roma Singh FEVERLY PRACTICE IN STATE SEAL OFFICIAL SEAL THE ADMITTED STATE ROMA SINGH Notary Public NOTARY PUBLIC CALIFORNIA PRINCIPAL OFFICE IN LOS ANGELES COUNTY MY COMMISSION EXPIRES AUG. 21, 1987"
}
