{
  "anumber": "A28755270",
  "id": "A28755270_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Gonzales & Gonzales Immigration Bonds, 28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 I Gonzales & 1/30/88 Gonzales IMMIGRATION BONDS By: Gonzales & Gonzales Bonds & Insurance Agency 412 Commercial Street Los Angeles, California 90012 (213) 628-8888 Cert. Mail, if any: None Date: May 5,1988 HAND DELIVERED Alien's Name: RODRIGUEZ-Valenzuela, Luisa Alien's \"A\" No. A28 755 270 Bond No. FW9006056 XX Deportation Travel Control Immigration and Naturalization Service 300 North Los Angeles Street Los Angeles, California 90012 Deportation Travel Control Western Regional Office Immigration & Naturalization Service 1. According to our indemnitor on the above numbered bond, principal complied with the conditions of the bond by leaving the United States to on Via , flight No. Since the above information is confidential, according to the airlines; and the information will only be released to a Police Agency or Government Agency; we will appreciate if your Department will communicate with the Airline mentioned above for confirmation of this vital information. Please advise. 2. Please accept the enclosed verification, which is self explanatory; that the principal on bond complied with the conditions of the bond. May we please have a cancellation of our bond. Thank you. Original letter from Embassy. 3. Notice has been received by this office that the above named principal is presently in custody at: , booking or I.D. No. , with an alleged charge of Since we no longer have control over our principal, please take necessary steps to cancel our bond of record with your Department. This is in accordance with Immigration & Naturalization Act, 242(c), 242(h) and Title 8, CFR 242.3(b). Thank you. 4. We will appreciate receiving a cancellation of the above numbered bond in the event the bond has already served its purpose. The bond was originally executed on Enclosed you will find photo copy of the bond for proper identification of the bond itself. Thank you. 5. We are unable to comply in paying the bond breach since the breach is presently on appeal ( ) or under reconsideration ( ). Enclosed is a photocopy of your bill and our receipt number, if any, as filed with INS. 6. Please accept the enclosed G-28 form. PHOTOCOPY OF BOND ENCLOSED, PLEASE CANCEL OUR BOND? 7. Other: , Sincerely, Gonzales & Gonzales By: Raul Alter Form No. 28"
}