{
  "anumber": "A28749561",
  "id": "A28749561_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, Form 1-488"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 Form approved Budget Bureau No. 43-R343 No. AFFIDAVIT OF WITNESS B IN THE MATTER OF THE APPLICATION OF EFREN MAGANA File No. AFFIDAVIT FOIA (b)(6) FOIA (b)(6) , occupation residing at FOIA (b)(6) Number and street) (City or town) (State) (ZIP Code) being duly sworn, deposes and says that (s)he a citizen of the United States of America: that is not (s)he has personally known and has been acquainted in the United States with EFREN MAGANA , the applicant above mentioned; his that to ber personal knowledge the applicant has resided in the United States as follows: BALDWIN PARK, CALIFORNIA from 1968 to PRESENT (City, town. and State) (Month) (Year) (Month) (Year) from to (City, town. and State) (Month) (Year) (Month) (Year) from to (Citv. town. and State) (Month) (Year) (Month) (Year) from to (City. town. and State) (Month) (Year) (Month) (Year) his that (s)he is able to determine the date of the beginning of her | acquaintance with the applicant in the United States from the following fact(s): I HAVE KNOWN HIM SINCE HE ARRIVED TO BALDWIN PARK, CALIFORNIA IN 1968. ; that (s)he has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is 0 (Years) 0 (Months) OFFICIAL SEAL BACK JAIRO M. BAUTISTA NOTARY PUBLIC-CALIFORNIA FOIA (b)(6) PRINCIPAL OFFICE IN LOS ANGELES COUNTY have My Commission Expires May 21, Subscribed and sworn to before me this 18 day of Maulti cett winning 1988 the fat) above anu -named witness at 98015 clu Rul Form 1-488 and Signature houses, Vera Spling: Attorney production St. of (Signature of attestory UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service 3116 to (Rev. 10-1-78)N Admitted No Tory Pulde (Title of attestor) GPO : 1985 0 - 495-263"
}