{
  "anumber": "A28701414",
  "id": "A28701414_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28701414_0029/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICACION DE ACTA DE MATRIMONIO, Nº 2449700"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 PRIMERA CLASE UN LEMPIRA 1984-1987 No 2449700 CERTIFICACION DE ACTA DE MATRIMONIO. 1 2 La Infrascrita Registradora Civil Municipal CERTIFICA:Que en el archivo que se 8 itiene en esta oficina, se encuentra el acta de matrimonio numero :00234 ubicada en 4 el folio 20 del tomo 5 del año 1985 y que pertenece a: INSCRITOS: Varon: : Jose Maria 5 Lopez Ayala, Mujer Mirtala Aguilar Sarmiento, En La Lima Cortes,el dia miercoles 6 veintiuno de agosto de mil novecientos ochenta y cinco YO:Nora Monday De Mazari- 7 egos, REGISTRADORA CIVIL MUNICI AL EN CUMPLIMIENTO AL ARTICULO 61 DE LA LEY DEL 8 REGISTRO NACIONAL DE LAS PERSONAS, PROSEDI A INSCRIBIR EL ACTA DE MATRIMONIO QUE 9 APARECE EN EL EXPEDIENTE NUMERO:85234 REMITIDO POR EL ALCALIE MUNISIPAL DE ESTA GENERAL LOCALIDAD CON FECHA:Dia 16. mes 08, LA INFORMACION DE ESTA ACTA ES LA SIGUIENTE: 11 #CONTRAYENTE VARON:Jose Maria Linez Ayala, Hondureño numero de identidad: 1612-08- ac HONDURAS 12 00017 edad 77 años, jornalero, con domicilio en La Lima Cortes, CONTRAYENTE MUJER: GENERAL Mirtala Aguilar Sarmiento, Hondureña, numero de identidad: 1603-15-00035 edad 70 14-2ños, de oficios domesticos, con domicilio en la Lima Cortes, TESTIGOS PRESENCIALES Raul Lopez Tobar, Hondureño, casado, numero de identidad: 0501-45-02102,1 Martin Enai 16 morado Trejo, Hondureño sastre, soltero, numero de identidad: 1611-34-00066 MINISTRO DE FE:Oscar Arturo Trochez, FECHA: Dia 16,mes 8,año 85,EN FE DE LO ANTERIOR, FIRMO 18 LA PRESENTE:Yalanda astro De Miranda, Registradora Civil Municipal, ES CONFORME 19 CON U ORIGINAL Y. Para los fines que al interesado convengan, se le extiende la to pre ente en la ciudad de La Lima Cortés.a los treinta Y un mes de marzo 21 d mil novecientos ochenta y seis. 22 Date LAS Yoalanda Castro Gertes 23 Registradora City deal. 24 25"
}