{
  "anumber": "A28749561",
  "id": "A28749561_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 4/27/2023, CO-19853"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 CO 3853 280 E. ARROWHWY COVINA, CALIF 91722 Telephone (213) 966-447 Other Carpeteris Locations Canage Francisco) North Hollywood Torrance, Hollywood, Long Beach, Ventura, Milbrae, Pasadena, San Carlos, Whitter, Montclair, Fountain Valley, Les Vegas Campbell Covina Mountain View, San Diego, Escandido, Bakersfield, Goleta, Riverside, Sacramento, San Rafael, San Bernadino, Fresno SOLD TO MALANA DELIVER TO ADDRESS 421 THAT use AVS ADDRESS CITY PHONE 3.9.172 CITY PHONE WHEN DELIVER ASCA R A.M. SALESMAN P.M. NELSON onlog INSTALL WALL TO WALL RUGS ONLY BIND REMNANT ARE LIVING DINING ROOM 459 Down ROOM HALL BED ROOM (1) BED ROOM (2) BED ROOM (3) BED ROOM (4) DEN P REMARKS Calif. St Contractor's PRICE License No. 201034 295. Customer Responsible SUB-TOTAL 295.1. for DEPOSIT 20 3. One Year unconditional BALANCE 2x Labor Date Installation TERMS IN CAS C.O.D INANCE BALANCE DUE no. Deposit NO REFUNDS ONICUT MERGHANDISE Title to Goods on this order.remains mains and shall be considered personal payment of the above amountains when does Have the right to possess property, and in cause the Sellerti on Attorney to collect some Buyer agrees to pay ell' New pertaining This order is valid only when-ap proved by an officer of ithe corporation Interest will be charged enthe-legal rate on past due accounts. No deposit will be returned. No refund on cut goodsurThis eb ever conditions accepted. Signed Purchaser x +1 Received the above listed Customer's in good order and condition Signature CUSTOMER'S COPY"
}