{
	"anumber": "A28755270",
	"id": "A28755270_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FINAL DISPOSITION REPORT, R-84 ( (Rev. 5-14-80)"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 R-84 (Rev. 5-14-80) FINAL DISPOSITION REPORT Leave Blank Note: This vital report must be prepared on each in dual whose arrest fingerprints have been forwarded to FBI Identification Division without final disposition noted thereon. If no final disposition is available to arresting agency, also obtain subject's right four finger impressions on this form, complete left side and forward the form when case referred to prosecutor and/or courts. Agency on notice as to final disposition should complete this form and submit to: Director, FBI, Washington, D.C. 20537, Attention: Identification Division. (See instuctions on reverse side) FBI No. Final Disposition & Date (If convicted or subject pleaded guilty to lesser charge, include this modification with dispostion.) Name on Fingerprint Card Submitted to FBI Last First Middle BaDRiquezy UALEUZUELA MELENDEZ Redrigerz Luisa Date of Birth 8-15-10 Sex F Henry Fingerprint Classification From FBI 1-B Response State Bureau No. (SID) Social Security No. (SOC) This Form Submitted By: (Name, Title, Agency, ORI No., City & State) Contributor of Fingerprints (Include complete name and location of agency, together with ORI number.) M.M. Marcia 9-16-87 Signature Date Title Arrest No. (OCA) Date Arrested or Received COURT ORDERED EXPUNGEMENT: 22 755 270 9/16/87 Return Arrest Fingerprint Card to Contributing Agency; Certified or Authenticated Copy of Court Order Attached. Offenses Charged at Arrest Right Four Fingers Taken Simultaneously DEP PROC If additional space is needed, check and continue on reverse side of this form."
}
