{
  "anumber": "A28707386",
  "id": "A28707386_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificado de Certificación, 0477485"
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        2023,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "011 Screened by NARA, 4/18/2023 pedes NE 0477485 ( EN DE EL 1966 1966 DEPARTMENT 1 , CUARENTA CENTAVOS CORTE DE Ejour CUENTIS T.R. 0426501 1 FRANCISCO MARTINEZ ZELAYA JEFE DE LA OFICINA DEL REGISTRO CIVIL DE LA a ALCALORA MINICIPAL DE ESTA (IUDID.- is CERTIFICA -- que a la pagina No. 174- del libro de partidas 4 de NACIONENTOS- que esta oficina llevo duranie el ano de 1975- se 25 5 encuentra la que literalmente dice:P.No. 691.- - Pedro José, varon, hijo 6 ilenitimo de Luz Portillo, originaria de Metapan 4 de este domicilio, nació a las tres de la tande del doce de este mes, en el barrio de 8 Santa Barbara. Da aviso Pablo Jovel y firma. - Santa Ana, quince de abril 1) de mil novecientos quince. To E Guzmán. Publo Jovel Jose Mo Orellana. 10 Snio. RUBRICADAS.- ES CONFORME CON su ORIGINAL CON EL CUAL FUE CONFRONTA- 11 DA y DE ACUERDO CON EL ARTO 307- C- EXPIDO LA PRESENTE EN EL REGISTRO 12 CIVIL- ALCALOGA MUNICIPAL SANTA ANA, A SIETE DE NOVIEMBRE DE MJL NOVECIEN- 13 TOS SESENTA y SEgS enmendado- avisa- Vale. 14 13 meany 16 COPINDA y CONFRONTADA POR Francisco Martinez Zelaya, JEFE DELAREGISTRO CIVIL 17 glast H. Blatica Lones, 18 AUXILI, IR DEL REGISTRO CIVIL 19 it 20 21 02 certify that I have compared this copy with its 23 original, and that it is a true and complete copy, 24 PHIL.P KARLIN, Attorney at Law 61. So, Flower St., Los Angeles, Calif. 90017 25 Aum ed to Practice in the State of California"
}