{
  "anumber": "A28766477",
  "id": "A28766477_0078",
  "page_index": 78,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0078/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 JAMAHIRIA AIR TRANSPORT FL-76T Libyan aircraft (above and right) transporting large quantities of weapons to Nicaragua (falsely manifested as medical supplies) were de- tained in Brazil in April 1983. Recruitment and Conscription summoned by their local Sandinista draft boards, while The Sandinistas initially had no difficulty in finding many others were captured in house-to-house sweeps, recruits for their military. The Nicaraguan people had roadblocks, and roundups at public places such as movie supported the revolution against Somoza, and many theaters, dance halls, and ball parks. youths eagerly joined the ranks of the EPS. Gradually, The Sandinistas have been indiscriminate about the however, voluntary enlistment declined as disillusion- age of those they impress, often seizing youths in their ment with the FSLN became widespread. To meet the mid-teens-below the official draft age. While most of goals for their military build-up, the Sandinistas began those drafted do enter the army rather than go to jail, using a variety of coercive measures at schools and thousands of youths have gone into hiding, and many workplaces, as well as the Sandinista Defense Commit- others have slipped across the borders into exile. 14 tees (Comites de Defensa Sandinista-CDS), the in- Many Nicaraguans have protested forced induction famous \"block committees\" modeled after the Cuban into the Sandinista military, which they perceive as the Committees for the Defense of the Revolution, to com- political army of the FSLN party and not the national pel men and women to enlist in the army, the reserves, army of Nicaragua. Also, there is broad resentment over or militia units. the inadequate training given SMP recruits. Often When these tactics failed to provide sufficient man- draftees without adequate military skills are sent to the power, the Sandinistas resorted to the draft. In July front to face the forces of the armed opposition. In- 1983, Defense Minister Humberto-Ortega proclaimed creasingly, many Nicaraguan parents believe that the that the government would adopt mandatory conscrip- Sandinistas are using their children as cannon fodder. As tion. Despite widespread opposition, the Sandinistas a result of this resentment, spontaneous anti-draft enacted the draft law in September, calling it Patriotic demonstrations have sprung up throughout Nicaragua. Military Service (Servicio Militar Patriotico- - SMP). For example, for 3 days in September 1984, hundreds of Technically, the law made males aged 18 to 40 eligible students in Chinandega marched in protest. In for the draft, with those in the 18 to 21 age bracket sub- December, the residents of Nagarote clashed with San- ject to being called up effective January 1, 1984, and dinista troops who had come to sweep the town for those over 21 subject to subsequent callups. It also pro- draft-age youths. Similar acts of protest have occurred in other locations. 15 vided deferments for those in special categories, such as government workers with key jobs. In practice, the San- Sue June Carolyn Erlick's \"Draft Dodgers Flee Nicaragua for dinistas began inducting youths by late 1983, and six Honduras,\" Miami Herald, January 4, 1985, p. 12; Steven Kinzer's rounds of callups had taken place by early 1985. The \"Nicaraguan Men Fleeing Draft Fill Honduran Refugee Camp,\" New York Times, April 11, 1985, p. 1; and Edward Cody's \"Nicaraguans Sandinistas have claimed that 30,000 Nicaraguans have Choosing Exile to Avoid Draft, Uncertainty,\" Washington Post, been drafted, but many Nicaraguans believe that the real April 12, 1985, p. A1. Sue \"Nicaraguan town fights recruiters,\" Chicago Tribune, number is far higher. Thousands of youths were simply December 29, 1984, p. 5, and Steven Kinzer's \"Town Battles Military Draft in Nicaragua,\" New York Times, January 2, 1985, p. 9. 35"
}