{
	"anumber": "A28706315",
	"id": "A28706315_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28706315_0023/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "xmale"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1987, 2023, 1926, 1961]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 8/2/2023 OMB No. 1115-0054 Immigration and Naturalization Service Petition for Alien Re' tive Expires 4-86 Annuper DO NOT WRITE IN THIS BLOCK Case ID# Action-Stamp Fee Stamp A# Taor G-28 or Volag# APPROVED I.N.S DISTRICT DIRECTOR Section of Law: Petition was filed on (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) JUN 22 1987 Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Document Check Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: 130485 10 85.00 REMARKS: LOS 2876 EMPL 22 03/27/87 A. Relationship 10002222A146*08 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) KESWANI Mohandas P. KESWANI Mulidevi 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 18528 Dylan Street 18528 Dylan Street (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Northridge, CA USA 91326 Northridge CA USA 91326 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Tando Adam Pakistan Matiari Pakistan 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status C90 (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single (919)9) Male Married Single 10/28/33 Female Widowed Divorced 3/14/11 Aonu Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) OLICE none SESWANI, Mulidevi; KESWANI, Bulibhai 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) Jaipur, India 12/8/1961 Tando Adam, Pakistan 1926 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6 FOIA (b) (6) none none 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended none Original seen and returned. Pitambardas Keswani 1985 Certified a true and correct copy. (deceased) Contact Representative, USINS 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, exchange alien, crewman, Give number of certificate, date and place it was issued stowaway, temporary worker, without inspection, etc.) No. 956 9207; Los Angeles, CA 1/11/74 visitor Parents Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No 10 6 5 8 7 2 9/3/86 certificate date and place it was issued Date authorized stay expired, or will expire as shown on Form I-94 or I-95 FOIA (b)(6) 3/3/87 15. Name and address of present employer (if any) 14. If you are a lawful permanent resident alien, complete the following. none Date and place of admission for. or adjustment to, lawful permanent FOIA (b)(6) hagan (month/dav/year) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (08-01-85) N LGISHAG"
}
