{
  "anumber": "A28729371",
  "id": "A28729371_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28729371_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "JUNTA MUNICIPAL DE RECONSTRUCCION DE NAGAROTE, SERIE 'C' 1,871,687"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 DO OOHO SERIE C' 1,871,687 JUNTA MUNICIPAL DE RECONSTRUCCION DE NAGAROTE OFICINA DEL REGISTRO DEL ESTADO CIVIL DE LAS PERSONAS El auscrito registrador del estado civil de las perso- nas de Nagarote, certifica que en ?a pagina 112, tomo I, del libro de REPO- SICIONES que ésta oficina lleva en el año de 1987, se encuentra e1 acta que 'itera'mente dice; Pda. No. 224. - ARMANDO JUAN SANCHEZ MUNGUIA.- En la ciudad de Nagarote departamento de Ieon a las diez y cuarenticinco de la mañana del dia treinta del mes de Noviembre de mil novecientos ochentisie to. Ante e infrascrito registrador de' estado Civil y Secretario que auto- 10 comparece; DORI MUNGUIA, solters, ama de casa, mayor de edad, de este domicilio y presents para su inscripción 7a sentencia de Reposición de Par- dictada por et señor Juez Iocal Unico de Nagarote a las ocho de 12 ma- veinticinco de' mes de Novlembre de mil novecientos ochentisies 11 que ordens reponer is partida de ARMANDO JUAR SANCHEZ MUNGUIA, quien nació en Nagarot a 'as ocho de 1a maftana de' treinta de Marzo de mi7 nove- 16 ien or treintidos, siendo hijo do FRANCISCA SANCHEZ ZEPEDA, Yo, et Regis - 1. rador doy If de haber tenido a la vista 'a sentencia de Reposicion.- Ieida 18 la presente se encuentra conforme y firms. -G. DIIVAS PAIZ, M. CONTRERAS 3,SKIA. 20 le extiende la presente a solicitud de parte interesada en 1a ciudad de da- garote a TOS treints dias de1 Les de Noviembre de mi ovecientos ochentisie- 21 te. 22 Chril de Las s Mountrees B PAIN. MARTHA CONTRERAS B. .CIVII DE 1, 2 PERSO SRIA. BEL REGISTRO. MUNICIPAL DE DE NAGAROTIC CERTIFICA QUE LAS FIRMAS U1 TECEDAN Y DICE account M. CONTRERAS B, 201 AUTENTICAS*- I certify that I have compared this copy with its GUSTAVO AMILEZ LOPE GOORDINAD DE LA JU LOVE original, and that it is a true and complete copy. GOBIN LEON. N/C C.N Date PHILIP J. KARLIN, Attorney at Law 615 So. Flower St., Los Angeles, Calif. 90017 Admitted to Practice in the State of California"
}