{
  "anumber": "A28740267",
  "id": "A28740267_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Master Calendar Hearing in Immigration Proceedings, A28-749-267"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE EXECUTIVE OFFICE FOR IMMIGRATION REVIEW OFFICE OF THE IMMIGRATION JUDGE SAN FRANCISCO, CALIFORNIA SOLIS-ROMERO MARCELINO 151 SEARS STREET SAN FRANCISCO CA 94112 FILE NO. A28-749-267 DATE.08/17/89 NOTICE OF MASTER CALENDAR HEARING IN IMMIGRATION PROCEEDINGS RE:SOLIS-ROMERO MARCELINO PLEASE TAKE NOTICE THAT THE ABOVE CAPTIONED CASE HAS BEEN SCHEDULED FOR A MASTER CALENDAR HEARING BEFORE AN IMMIGRATION JUDGE ON 08/25/89 AT 01.00PM, AT THE OFFICE OF THE IMMIGRATION JUDGE 630 SANSOME ST. ROOM 404 SAN FRANCISCO, CA, 94111 YOU MAY BE REPRESENTED IN THIS PROCEEDING AT NO EXPENSE TO THE GOVERNMENT BY AN ATTORNEY OR OTHER INDIVIDUAL AUTHORIZED AND QUALIFIED TO REPRESENT PERSONS BEFORE AN IMMIGRATION JUDGE. IF YOU WISH TO be so REPRESENTED, YOUR ATTORNEY OR REPRESENTATIVE SHOULD APPEAR WITH YOU AT THE HEARING. YOU WILL BE EXPECTED TO PLEAD TO THE ALLEGATIONS IN THE CHARGING DOCUMENT AT THIS HEARING. IN ADDITION, ALL APPLICATIONS AND MOTIONS FOR RELIEF SHOULD BE SUBMITTED. PREPARE SUFFICIENT COPIES OF APPLICATIONS OR MOTIONS TO SERVE ON ALL PARTIES. FAILURE TO APPEAR AT YOUR HEARING MAY RESULT IN ONE OR MORE OF THE FOLLOWING ACTIONS 1. YOU MAY BE TAKEN INTO CUSTODY BY THE IMMIGRATION AND NATURALIZATION SERVICE AND HELD FOR FURTHER ACTION. 2. IF YOU ARE IN DEPORTATION PROCEEDINGS YOUR HEARING MAY BE HELD IN YOUR ABSENCE UNDER SEC. 242(B) OF THE IMMIGRATION AND NATIONALITY ACT, AND AN ORDER MAY BE ENTERED AGAINST YOU, OR 3. IF YOU ARE iN EXCLUSION PROCEEDINGS a. YOUR APPLICATION FOR ADMISSION to THE UNITED STATES MAY BE CONSIDERED WITHDRAWN, OR b. YOUR HEARING MAY BE HELD IN YOUR ABSENCE AND AN ORDER ENTERED AGAINST YOU PURSUANT TO THE BOARD OF IMMIGRATION APPEALS DECISION IN MATTER OF NAFI, INTERIM DECISION 3024 (1987)."
}