{
  "anumber": "A28701414",
  "id": "A28701414_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28701414_0014/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1941,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 OMB No. 1115-0062 Expires 12/86 S. Department of Justice nmigration and Naturalization Service Affidavit of Support (ANSWER ALL ITEMS: FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) DEISY SOLIS residing at 2064 ZOE AVE. (Name) (Street and Number) HUNTINGTON PARK, CA. 90255 USA (City) (State) (ZIP Code if in U.S.) (Country) EING DULY SWORN DEPOSE AND SAY: I was born on JUN-11-1941 at ATIMA, SANTA BARBARA, HONDURAS (Date) (City) (Country) If you are not a native born United States citizen, answer the following as appropriate: a. If a United States citizen through naturalization, give certificate of naturalization number 12266099 b. If a United States citizen through parent(s) or marriage, give citizenship certificate number C. If United States citizenship was derived by some other method, attach a statement of explanation. d. If a lawfully admitted permanent resident of the United States, give \"A\" number That I am 45 years of age and have resided in the United States since (date) May 06, 1976 That this affidavit is executed in behalf of the following person: Name Sex Age AGUILAR DE LOPEZ MIRTALA F 72 Citizen [--(Country) Marital Status Relationship to Deponent HONDURAS MARRIED MOTHER Presently resides at--(Street and Number) (City) (State) (Country) 2064 ZOE AVE. HUNTINGTON PARK, CA. USA Name of spouse and children accompanying or following to join person: Spouse Sex Age Child Sex Age NONE NONE Child Sex Age Child Sex Age Child Sex Age Child Sex Age That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become a public charge in the United States. That I am willing and able to receive, maintain and support the person(s) named in item 3. That I am ready and willing to deposit a bond, if necessary, to guarantee that such person(s) will not become a public charge during his or her stay in the United States, or to guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior to the expiration of his or her authorized stay in the United States. That I understand this affidavit will be binding upon me for a period of three (3) years after entry of the person(s) named in item 3 and that the information and documentation provided by me may be made available to the Secretary of Health and Human Services and the Secretary of Agriculture, who may make it available to a public assistance agency. FAMILY PLANNING ASSOCIATES That I am employed as, or engaged in the business of MEDICAL ASSISTANT with MEDICAL GROUP. (Type of Business) (Name of concern) at 601 South Westmoreland, Los Angeles, CA. 90005 (Street and Number) (City) (State) (Zip Code) I derive an annual income of (if self-employed, / have attached a copy of my last income tax return or report of commercial rating concern which / certify to be true and correct to the best of my knowledge and belief. See instruction for nature of evidence of net worth to be submitted.) $ 23,295.- - I have on deposit in savings banks in the United States $ 1530. - I have other personal property, the reasonable value of which is $ 15,000. - orm 1-134 (Rev. 12-1-84) Y OVER"
}