{
	"anumber": "A28766477",
	"id": "A28766477_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ENGLISH TRANSLATION OF SPANISH LANGUAGE: BIRTH CERTIFICATE, BIRTH CERTIFICATE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 1980, 2023, 1902, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 ENGLISH TRANSLATION OF SPANISH LANGUAGE: BIRTH CERTIFICATE NAME OF THE CHILD: ALBERTO MAYORGA DATE OF BIRTH: APRIL 11, 1902 PLACE OF BIRTH: DIRIAMBA, CARAZO, NICARAGUA FATHER OF THE CHILD: RAMON ROCHA AGE OF FATHER: NOT GIVEN NATIONALITY OF FATHER: NICARAGUAN MOTHER OF THE CHILD: ANGELINA MAYORGA AGE OF MOTHER: NOT GIVEN NATIONALITY OF MOTHER: NICARAGUAN PATERNAL GRANDPARENTS: NOT GIVEN MATERNAL GRANDPARENTS: NOT GIVEN PLACE/DATE OF REGISTRATION: DIRIAMBA / APRIL 11, 1902 VOLUME/PAGE/NUMBER: NO. 62, PAG. 21. NO. 65 NAME OF CIVIL REGISTRAR OR JUDGE: RAGAELA PARRALES WITNESSES: NOT GIVEN DATE/JUDGE THIS COPY ISSUED: MARCH 12. 1983/ MARGARITA C. DE SANCHEZ PLACE THIS COPY ISSUED: DIRIAMBA, CARAZO, NICARAGILA I, MARIA FEIST, INTERPRETER AND TRANSLATOR ATTEST TO MY COMPETENCE TO TRANSLATE FROM SPANISH TO ENGLISH AND I CERTIFY THAT THIS IS A CORRECT TRANSLATION OF ALL RELEVANT INFORMATION FROM THE SPANISH ORIGINAL. Maria heist INTERPRETER AND TRANSLATOR EXECUTED ON APRIL 14, 1989 , AT LOS ANGELES, CALIFORNIA ON 4-14-89 BEFORE THE UNDERSIGNED A NOTARY PUBLIC FOR . THE STATE OF CALIFORNIA PERSONALLY APPEARED MARTA FEIST KNOWN TO ME TO BE THE PERSON WHOSE NAME IS SUBSCRIBED TO THE WITHIN INSTRUMENT AND ACKNOWLEDGED THAT SHE EXECUTED THE SAME. TITLE: NOTARY PUBLIC NOTARY PUBLIC OFFICIAL SEAL MARY LYNN MUCHA NOTARY PUBLIC . CALIFORNIA LOS ANGELES COUNTY My Comm Expires June 2. 1980"
}
