{
  "anumber": "A28755270",
  "id": "A28755270_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IMMIGRATION BOND, 2 28 755 270"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CHULA Screened by NARA, 4/18/2023 Co-maker It' main ENTRANCES HER U.S. GOVERNMENT PRINTING OFFICE: 19 SND 3-631 WAY to PICK them up U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE IMMIGRATION BOND File No. 28 755 270 A. Name and address of obligar: Far West Ins. Co. % GONZALES & GONZALES, 5042 E. 3rd St. Los Angeles, Ca. 90022 If this bond is executed by a surety company the following: Rate of premium: 10% per annum 1/28) 40.00 Amount of premium The name and address of the person who executed a written Instrument with the surety company requesting it to post the bond is: MARIA AMINTA GUILLEN. 1069 LEONARD AVE. LOS ANGELES CA. 90022 B. Name of allen for whom this bond is furnished: (If there is more than one alien, separate schedule showing name of each alien, date and country of his/her birth and arrival data, signed and sealed by the obligor and made part hereof, is attached.) Name: LUISA RODRIGUEZ VALENZUELA Date and country of birth of alien: 8-15-10 E) SALVADOR Date, port, and means of arrival in United States: Nationality of alien: NR sys EWI 9-16-87 EL SALVADOR C. In consideration of the facts recited in paragraph or paragraphs herein numbered TWO (2) and captioned BOND CONDITIONED FOR THE DELIVERY OF AN ALIEN (and In any rider or riders lettered and captioned attached hereto and made part hereof) the obligor above named, by subscribing hereto, hereby declares that he/she Is firmly bound unto the United States In the sum of TWO THOUSAND dollars ($ 2,000.00 ) (except that insofar as the bond is that the allen shall not become à public charge the obligor declares himself/herself bound In such amount or successive amounts as are prescribed In paragraph (3) herein) as liquidated damages and not as a penalty, which sum is to be paid to the United States Immediately upon failure to comply with the terms set forth In any such paragraph or rider. The obligor further agrees that any notice to him/her in connection with this bond may be accomplished by mail directed to him/her at the above address. If bond Is furnished for more than one allen, the obligor agrees that any references herein to allen in the singular sense shall be construed In the plural sense. The obligor acknowledges receipt of a copy of this executed bond and any attached rider or riders specified above. The burden of establishing compllance with the terms of the bond rests on happligon If this bone has Been executed In consideration of the facts recited in paragraph (1) captioned \"Bond for Maintenance of Status and Departure fNon-Immigraet Allen and has been furnished for more than one allen, the amount due for each allen who falls to comply with the terms the shall be dollars ($ ), not to exceed the total sum of dollars ($ ). D. Signed and sealed In the presence POWER FW Date: SEPTEMBER 17 1987 Name 9006056 Name Address Address (Witness) By: Ave after (Witness) Far West Insurance Company (SEAL) (Obligor) Attorney-in-Fact E. PLEDGE AND POWER OF ATTORNEY FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States Bonds/Notes described in the following schedule are hereby pledged as security for the performance and fulfillment of the foregoing undertaking In accordance with 6 U.S.C. 15, 31 CFR Part 225, and Treasury Department Circular 154 (Revised), dated October 31, 1969, and I the obligor named In this bond do hereby appoint the Attorney General of the United States as my attorney for me and in my name to collect or to sell, assign and transfer said United States bond or notes and agree that In case of any default In the performance of any of the conditions herein to which I have subsoribed, my said attorney shall have the power to collect said bonds/notes or any part hereof or to sell, assign, and transfer said bonds/notes or any part thereof, without notice, at public or private sale, free from equity of redemption and without appraisement or valuation, notice and right to redeem being walved, and to apply the proceeds In whole or in part to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best. COUPONS FACE INTEREST INTEREST TITLE OF BONDS/NOTES ATTACHED VALUE RATE SERIAL NO. DATES as PLEDGE AND POWER OF ATTORNEY FOR USE WHEN CASH IS DEPOSITED AS SECURITY The amount of ($ h cash money of the United States, Is hereby as security for the per- formance and fulfillment of the foregoing undertaking, and I, the obligor named In this bond, hereby appoint the Attorney Generator the United States as my attorney for me and In my name to collect or to assign and transfer the said sum of money, and 1 agree that, In case of default In the of anyof the conditions herein to which I have subscribed, my said attorney shall have full power to collect said sum of money or any part there orto assign and Transfer said sum or any part thereof, without notice and to apply said sum or any part thereof to the satisfaction of any damages, elencies arding by reason of such default, as my said attorney may deem best. I further empower my said attorney, the event all the conditions herein nearlien Phave subscrib- ed have been complied with and the bond Is canceled, to deliver the said sum of money plus any Interest accrued thereon, to me my risk-and expense by such means as he/she shall select. IN WITNESS WHEREOF, I have hereunto set my hand and seal this day of 19 (SEAL) Before me, within the county of In the State of (or the District of Columbia), personally appeared the above named and acknowledged the execution of the foregoing power of attorney. Witness my hand this day of 19 (Signature) (Title) F. Bond approved and accepted LOS ANGELES CALIFORNIA SEPT 17, 1987 19 (City) (State) (District Director) 1-352 (Rev. 6-1-84)N WILL RESIDE: SAME AS ABOVE"
}