{
  "anumber": "A28755270",
  "id": "A28755270_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, 167-408"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 INSTRUCTIONS 1. The purpose of this report is to record the initial data of an individual's arrest and thereafter secure the final disposition of the arrest at the earliest possible time from either the arresting agency, the prosecutor or the court having jurisdiction. (INTERIM DISPOSITION INFORMATION, e.g., RELEASED ON BOND, SHOULD NOT BE SUBMITTED.) The SUBJECT'S NAME, CONTRIBUTOR AND ARREST NUMBER should be exactly the same as they appear on the fingerprint card IN THE FILES OF THE FBI. The FBI number should be indicated, if known. Agency ultimately making final disposition will complete and mail form to: FBI Identification Division, Washington, D.C. 20537. 2. The arresting agency should fill in all arrest data on left side of form and obtain the finger impressions of the right four fingers simultaneously. This should be done at the same time as the full set of fingerprints are taken on the arrest fingerprint card. If the arrest is disposed of by the arresting agency, as where the arrestee is released without charge, then the arresting agency should fill in this final disposition and mail form to FBI Identification Division. Of course, if final disposition is known when arrest fingerprint card is submitted it should be noted thereon and this form is then unnecessary. In the event the case goes to the prosecutor, this form should be forwarded to the prosecutor with arrestee's case file. 3. The prosecutor should complete the form to show final disposition at the prosecution level if the matter is not being referred for court action and thereafter submit form directly to FBI Identification Division. If court action required, the prosecutor should forward form with case file to court having jurisdiction. 4. The court should complete this form as to final court disposition such as when arrested person is acquitted, case is dismissed, on conviction and when sentence imposed or sentence suspended and person placed on probation. 5. When arrested person convicted or enters guilty plea to lesser or different offense than that charged when originally arrested, this information should be clearly indicated. 6. If subsequent action taken to seal or expunge record, attach certified or authenticated copy of court order to this form so that FBI can return arrestee's fingerprints to original contributor. 7. It is vitally important for completion of subject's record in the FBI Identification Division files that Final Disposition Report be submitted in every instance where fingerprints previously forwarded without final disposition noted thereon. FOR ADDITIONAL INFORMATION GPO : 1986 o - 167-408"
}