{
  "anumber": "A28766478",
  "id": "A28766478_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766478_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325A ( (Rev. 10-1-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1925
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['n.a']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "Staleless"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Scree OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE NUMBER SILVA DE ROCHA , Andrea Pastoca FEMALE 11-30-08 Stateless 28766478 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. SILVA SIL VA 1 / Maura Managua NICARAGUA 590-97-8975 (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH( known) CITY AND COUNTRY OF RESIDENCE FATHER SILVA, Jose Luis: Unice. Maragua, NICARAGUA : Deceased MOTHER (Maiden name) SILVA Celonima Unka Managha NICAPAGUA Deceased HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR WIFE (For wife, give maiden name) ROCHA Carlos 1/yyoz Diliamba, Diliamba, NICARAGUA 1925 NICARAGUA FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE None N/A N/A APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 238 S Reno ST.#2 LOS Angeles CA USA 6 85 PRESENT TIME 2107 S. Normood 57 Los Anglels CA USA 12 83 6 85 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Calle Relig Divianba - NICAPAGUA - 10 12 83 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME None Show below last occupation abroad if not shown above. (Include all information requested above.) None THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: NATURALIZATION STATUS AS PERMANENT RESIDENT Mamas SIGNATURE N/A OF APPLICANT Roha 4/14/89 DATE OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes 8/31/89 PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. N/A APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) SILVA DE ROCHA And (Middle name) (Alien registration number) A26 766 478 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: Form G-325 A (Rev. 10-1-82) (2) Rec Br."
}