{
  "anumber": "A28707386",
  "id": "A28707386_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, Form G-28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 NOTICE OF ER. RY OF APPEARANCE AS ATTORNEY OR REPRESENT FATIVE Pedro Jose Portillo Hernandez In re: DATE AKA: PEDRO JOSE HERNANEEZ 04-03-87 MARIA LUISA PORTILLO HERNANDEZ FILE No. AKA : MARIA LUISA HERNANDEZ, MATILDE HERNANDEZ : hereby enter my appearance as attorney for (or representative of), and of the request of, the following named person(s): NAME Pedro Jose P. Hernandez Petitioner Applicant Beneficiary ADDRESS (Apt No.) (Number a Street) (City) (State) (22° Code) 1519 So. Manhattan P1. # 406 Los Angeles, CA. 90019 NAME Petisoner Applicant Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) Check Applicable Item(s) Below: if I on on attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia California and can not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disberring, or otherwise restricting me in practicing low. 2. 1 am on accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so recognized by the Board: 3. 1 am associated with s the attorney of record who previously filed o notice of approvence in this case and my appearance is of his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS P.O. Box 6199 M Los Angeles, Ca. 90055 NAME (Type or Price) TELEPHONE NUMBER Philip J. Karlin (213) 623-3007 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGR TION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: (Name of Attorney as Representation THE ABOVE CONSENT TO DESCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE Pedro Jose P. Hernandez Fedro PFormandeg 04-03-87 (NOTE: Execution of this boz is required under the Privacy Act of 1974 where the person being represented so a citizen of the United States or on alien lowfully admitted for permanent residence.) Form G-22 (OVER) UNITED STATES DEPARTMENT OF JUSTICE (Mov. 10-25-79)N Immigracion and Narmalization Service"
}