{
	"anumber": "A28743491",
	"id": "A28743491_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, G-28"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/23/2023 NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE In re: DATE SINGH, JASWANT October 3, 1986 FILE 4-28 109 114 named person(s): I hereby enter my appearance as attorney for (or representative of), and at the request of, the following 28743491 NAME Petitioner Jaswant Singh Applicant Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) 3115 Fish Canyon (State) (ZIP Code) Duarte, California 91010 NAME Petitioner Narinderjit Singh Keith Applicant Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) 3115 Fish Canyon (State) Duarte, California (ZIP Code) 91010 Check Applicable Item(s) below: 1 I am on attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia Supreme Court of California and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2 I am on accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so recognized by the Board: 3. I am associated with the attorney of record who previously filed a notice of appearance in this case and my appearance is at his , request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS 8484 Wilshire Boulevard, Suite 730 Beverly Hills, CA 90211 NAME (Type or FRANK, B.D. GREENBERG, Print) L.J. TELEPHONE NUMBER T.J. STEFANSKI and D.G. GOLD (213) 655-4900 and 852-0021 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SY:TEM OF RECORDS: L.J.FRANK. B.D. GREENBERG. T.J. STEFANSKI and D.G.GOLD (Name of Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: I-130 & I-485 NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING Narinderjit Singh Keith have DATE 10.3.86 (NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented 28 a citizen of the United States or an alien lawfully admitted for permanent residence.) Form G-28 (Rev.10-25-79)N UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
