{
  "anumber": "A28749561",
  "id": "A28749561_0112",
  "page_index": 112,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0112/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Memorandum, Form G-2 ( (Rev. 1-2-80)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 Memorandum Subject Date MAGANA-Torres, Efren 10-30-85 To From SIE JAMES DE BATES SA E. 0. MIERA USINS USINS LOS ANGELES, CA LOS ANGELES, CA It is requested SUBJECT be issued INS Form I 512 valid from 11-5-85 thru 1-5-86. The message from INS Central Office, CORAP, has authorized this travel during the period 10-1-85 thru 12-1-85. However, per telephone conversation with Mr Tony Lascaris, CORAP and SIE James De Bates, this date, authorization to change the dates from 11-5-85 thru 1-5-86 has been authorized. SUBJECT has provided this writer with information relating to the false recording of delayed birth certificates with the director of Vital Records, State of California, Sacramento, CA. As a result of information he provided 5 individuals were prosecuted in Federal Court in Los Angeles, CA. We are now faced with a situation of locating proof of alienage for some of the aliens we want to deport. These are aliens that have obtained visas bv fraud for their families. SUBJECT has known one FOIA (b)(6) a citizen and national of Mexico, all of his life. Since we have not been able to locate his true Mexican birth certificate, SUBJECT has agreed to go to Mexico, at no expense to the US Government, other than the cost of the documents, and obtain copies of SUBJECTS Mexican birth and/or baptismal certificate. comeen E. 0. MIERA SPECIAL AGENT, INS Form G-2 (Rev. 1-2-80 FPI LOM"
}