{
  "anumber": "A28729371",
  "id": "A28729371_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28729371_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRANSLATION OF A BIRTH CERTIFICATE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991,
        1987,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 TRANSLATION OF A BIRTH CERTIFICATE Name of the person registered ARMANDO JUAN SANCHEZ-Munguia Date of Birth March 30, 1932 Place of Birth Nagarote, Department of Leon, Nicaragua Date of Birth's Registration November 30, 1987 Name of the father NOT STATED Name of the Mother FRANCISCA SANCHEZ-Zepeda PATERNAL GRANDPARENTS NOT STATED and MATERNAL GRANDPARENTS NOT STATED and Witnesses NONE STATED CERTIFICATE ISSUED BY GLORIA OLIVAS PAIZ, REGISTRAR OF THE CIVIL STATUS OF THE PERSONS in Nagarote, Leon, Nicaragua on (date) November 30, 1987 CERTIFICATE FOUND: Archivo or Register of REPOSITIONS-Book 1 Page 112 No. 224 Reposition of Birth entry made in virtue of the sentence dictated IMPORTANT ANOTATIONS: by the Local Judge of Nagarote, Leon, Nicaragua, dictated on November 25, 1987. CERTIFICATION OF TRANSLATOR'S COMPETENCE I, JOSE E. CHAHIN HEREBY CERTIFY: That the above is an accurate , translation ofthe original BIRTH CERTIFICATE in SPANISH , and that I am - competent in both the English and SPANISH languages, to render such trans - lation. DATE Dec.23,1987 chakes Agency : OFICINA CHAHIN, 1041 So. Olive St., Los Angeles, California. 90015 748-4210, 628-1881, 628-6734 SUSCRIBED AND SWORN TO BEFORE ME OFFICIAL SEAL 23rd. Nov. ENRIQUE HUIDOBRO THIS THE DAY OF of 1987 NOTARY PUBLIC-CALIFORNIA PRINCIPAL OFFICE IN European Hundle LOS ANGELES COUNTY My Commission Expires Jan. 7, 1991"
}