{
	"anumber": "A28749561",
	"id": "A28749561_0118",
	"page_index": 118,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0118/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TELEGRAPHIC MESSAGE, 14-102"
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 TELEGRAPHIC MESSAGE NAME OF AGENCY PRECEDENCE SECURITY CLASSIFICATION District Director ACTION ROUTINE UNCLASSIFIED USINS INFO Los Angeles, CA ACCOUNTING CLASSIFICATION DATE PREPARED TYPE OF MESSAGE 1231 9-25-85 SINGLE FOR INFORMATION CALL BOOK NAME PHONE NUMBER SA E. 0. MIERA 2814 MULTIPLE-ADDRESS THIS SPACE FOR USE OF COMMUNICATION UNIT MESSAGE TO BE TRANSMITTED (Use double spacing and all capital letters) TO: CENTRAL OFFICE USINS ATTN: TONY LASCARIS, OFFICE OF ASST. COMMISSIONER, ASYLUM REFUGEE AND PAROLE SECTION. SUBJECT: ADVANCE PAROLE FOR EFREN MAGANA-TORRES, A27 403 499. REQUEST YOU AUTHORIZE ADVANCE PAROLE FOR SUBJECT WHO WAS BORN IN SAN JOSE DE CHILA, MICH, MEXICO ON 7-25-15 TO GO TO SAN JOSE DE CHILA ON OR ABOUT 10-1-85 AND RETURN ON OR ABOUT 12-1-85. REASON FOR THIS REQUEST IS BECAUSE SA E. 0. MIERA, THIS OFFICE, IS WORKING ON A LARGE SCALE CALIFORNIA DELAYED BIRTH CERTIFICATE SCAM INVOLVING ABOUT 100 ALIENS AND 10 US CITIZENS. THE BIRTH CERTIFICATES ARE USED TO OBTAIN IMMIGRANT VISAS AND OTHER BENEFITS. SO FAR, 3 CITIZENS AND 2 ALEINS HAVE BEEN CONVICTED IN FEDERAL COURT ON THIS CASE. WE HAVE BEEN ABLE TO OBTAIN PROOF OF ALIENAGE IN MOST CASES. WE HAVE ONE CASE INVOLVING FOIA (b)(6) FROM SAN JOSE DE CHILA WHO OBTAINED VISAS FOR HIS ENTIRE FAMILY AND EFFORTS TO LOCATE PROOF OF ALIENAGE HAS BEEN UNFRUITFUL. SUBJECT HA$ KNOWN MAGANA FOR A LIFE TIME AND IS WILLING TO SECURITY CLASSIFICATION OBTAIN THE NEEDED PROOF FOR INS. PAGE NO. NO. OF PGS. 1 2 UNCLASSIFIED STANDARD FORM 14 14-102 REVISED AUGUST 1967 U. S. GOVERNMENT PRINTING OFFICE 1977 O - 241-530 (3528) GSA FPMR (41 CFR) 101-35.306 14-102"
}
