{
  "anumber": "A28766477",
  "id": "A28766477_0077",
  "page_index": 77,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0077/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Assistance from-and to-Terrorists The Sandinistas' ties are not limited to groups in Central America, however, for they also have links with The FSLN has long maintained close ties with numerous groups such as the Montoneros of Argentina, the 19th of terrorist organizations and radical states. During the April Movement (M-19) of Colombia, the Movement of 1970s, a number of Sandinistas trained and fought with the Revolutionary Left (MIR) of Chile, the Tupamaros the Palestine Liberation Organization (PLO). After the of Uruguay, the Basque Homeland and Liberty (ETA) Sandinistas took power, the PLO opened an \"embassy\" separatist movement of Spain, the Baader-Meinhoff in Managua and assigned pilots and mechanics to assist gang of Germany, and the Red Brigades of Italy. 12 (In the Sandinista air force. Libya has provided the San- February 1985, Italian Prime Minister Bettino Craxi dinistas with both equipment, such as SF-260 aircraft complained in a public statement before the Italian and helicopters, and personnel, including pilots and Parliament that Nicaragua had become a safehaven for mechanics. fugitive Italian terrorists.) Some of these groups have The Sandinistas not only receive assistance from ter- been implicated in terrorist attacks against the San- rorists, they also provide assistance to terrorists. They dinistas' opponents carried out in third countries. 13 have collaborated closely with Marxist subversives For additional information on the FSLN's connections with in- throughout Cei - America, particularly the Salvadoran ternational terrorist organizations, see Juan O. Tamayo's \"Sandinistas guerrillas. Working with the Cubans, the FSLN provides Attract a Who's Who of Terrorists\" and \"World's Leftists Find a these groups with training camps, command and control Haven in Nicaragua,\" Miami Herald, March 3, 1985, p. A1. bases, and safe houses. The Sandinistas support a Sue Department of State/Department of Defense publication, Background Paper: Nicaragua's Military Build-up and Support for logistical system for the transport of arms through Central American Subversion, July 1984. Nicaragua to guerrillas in neighboring countries. In May 1984, Eden Pastora (Comandante Cero) was wounded in an assassination attempt in which four people-including an American reporter- were killed and 27 people injured. Pastora had been a Sandinista hero during the revolution but broke with the FSLN because of its efforts to im- plant Marxism in Nicaragua and its close ties with Cuba and the Soviet Union. In June 1983, Pastora and former Nicaraguan Junta member Alfonso Robelo, the principal leaders of the Democratic Revolutionary Alliance (ARDE), were targeted for assassination by the Nicaraguan General Direc- torate of State Security (DGSE). The attempt failed when the bomb detonated prematurely and killed the two would-be assassins. In November 1984, Robelo was injured and his fiancée crippled in yet another assassination attempt. 34"
}