{
  "anumber": "A28729371",
  "id": "A28729371_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28729371_0041/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Data Collection for Alien Documentation, Identification & Telecommunication System ( (ADIT), I-485"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Petition Form No. I-485 File No. A28729371 DATA COLLECTION FOR ALIEN DOCUMENTATION, IDENTIFICATION & TELECOMMUNICATION SYSTEM (ADIT) Please print or type information requested below: COMPLETE NAME FRANCISCA SANCHEZ ZEPEDA COMPLETE MAILING ADDRESS (Include Zip Code) 7602 San Vicente Ave. Paramount, California 90723 MOTHER'S FIRST NAME Maria FATHER'S FIRST NAME Indalecio CITY/TOWN/VILLAGE OF BIRTH Nagarote, Leon, Nicaragua CITY OF RESIDENCE WHEN APPLYING FOR A VISA OR IMMIGRANT STATUS Paramountm California CITY OF DESTINATION AT TIME OF ORIGINAL ADMISSION Los Angeles, California LOCATION OF CONSULATE WHERE IMMIGRANT VISA OBTAINED (OR IMMIGRATION OFFICE WHERE ADJUSTED) Los Angeles, California DATE OF BIRTH 10/04/12 PORT OF ENTRY WHEN ADMITTED AS IMMIGRANT OR OFFICE WHERE ADJUSTED TO LAWFUL PERMANENT RESIDENT Los Angeles, California SYMBOL ADMITTED UNDER (CLASSIFICATION) DATE ADMITTED OR ADJUSTED TO LAWFUL PERMANENT RESIDENT COUNTRY OF BIRTH NICARAGUA CARD NUMBER TRANSACTION NUMBER This form may be overprinted or stamped to show instructions, items requested, Items received, or other pertinent data which may facilitate processing. Keep this sheet 06 top of all material is file undi initial decision is made. Form 1-468 (ADIT) FPI-LOM (Rev. 11-1-70) 2-83 500 Tabs 5475"
}