{
	"anumber": "A28793184",
	"id": "A28793184_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28793184_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Adjustment of Status to Lawful Permanent Resident ( Form I-4-94, Arrival Deportation Record, Form FD-258"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1924, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "legally ended, unless those documents are being sub- Bureau of Investigation. You must sign the card in the mitted with your husband or wife's application. presence of the person taking your fingerprints. That person C. If you entered the U.S. as a fiancé(e), give INS your mar- must then sign his or her name and enter the date in the riage certificate. If you are the child of a fiancé(e), give spaces provided. It is important to give all the information called for on the card. INS your birth certificate and the marriage certificate for your parent's present marriage. 8. Medical examination D. If you have resided in the United States continuously since before June 30, 1948, give INS documentary You will be required to have a medical examination in con- evidence of that fact. Some examples of records that can junction with this application. You may find out more from be used to prove residence are bank, real estate, census, the INS office that will handle your application. school, insurance, or business records, affidavits of credi- ble witnesses, or any other document that relates to you 9. Where must you file? and shows evidence of your presence in the United States during this period. You must send or take this form and any other required documents to the INS office that has jurisdiction over the E) If you have resided in the United States continuously place where you live. You will be interviewed. You must since before July 1, 1924, INS may be able to create a bring your temporary entry permit (Form I-94, Arrival Depar- record of your lawful admission as of the date of your en- ture Record), and your passport to your interview. try. Therefore, if you have resided continuously in the United States since a date before July 1, 1924, it is very 10. What is the fee? important to give evidence establishing that fact. F. If you are a foreign government official or a represen- You must pay $50.00 to file this form. The fee will not be tative to an international organization, a member of the refunded, whether your application is approved or not. family or servant of that person, or a treaty trader or DO NOT MAIL CASH. All checks or money orders, whether treaty investor or the spouse or child of that person, you U.S. or foreign, must be payable in U.S. currency at a finan- must give INS Form I-508. Form I-508 waives all rights, cial institution in the United States. When a check is drawn privileges, exemptions, and immunities which you would on the account of a person other than yourself, write your otherwise have because of that status. name on the face of the check. If the check is not honored, INS will charge you $5.00. 5. How should you prepare this form? Pay by check or money order in the exact amount. Make the check or money order payable to \"Immigration and A. Type or print legibly in ink. Naturalization Service\". However, B. If you need extra space to complete any item, attach a A. if you live in Guam: Make the check or money order continuation sheet, indicate the item number, and date payable to \"Treasurer, Guam\", or and sign each sheet. B. if you live in the U.S. Virgin Islands: Make the check or C. Answer all questions fully and accurately. If any item money order payable to \"Commissioner of Finance of does not apply, please write \"N/A\". the Virgin Islands\". 6. Photographs 11. What are the penalties for submitting false information? Give INS two color photographs of yourself taken within 30 days of the date of this application. These photos must have Title 18, United States Code, Section 1001 states that a white background. They must be glossy, un-retouched, whoever willfully and knowingly falsifies a material fact, and not mounted. The dimension of the facial image must makes a false statement, or makes use of a false document be about 1 inch from the chin to the top of hair; your face will be fined up to $10,000 or imprisoned up to five years, should be in 3/4 frontal view, showing the right side of the or both. face with the right ear visible. Using pencil or felt pen, lightly print your name on the back of each photograph. 12. What is our authority for collecting this information? We request the information on this form to carry out the im- 7. Fingerprints migration laws contained in Title 8, United States Code, Section 1255. We need this information to determine Give INS a completed fingerprint card (Form FD-258) for whether a person is eligible for immigration benefits. The in- each applicant between 14 and 79 years of age. Applicants formation you provide may also be disclosed to other may be fingerprinted by INS employees, other law enforce- federal, state, local, and foreign law enforcement and ment officers, outreach centers, charitable and voluntary regulatory agencies during the course of the investigation agencies, or other reputable persons or organizations. The required by this Service. You do not have to give this infor- fingerprint card (FD-258), the ink used, and the quality of mation. However, if you refuse to give some or all of it, your the prints must meet standards prescribed by the Federal petition may be denied. It is not possible to cover all the conditions for eligibility or to give instructions for every situation. If you have carefully read all the instructions and still have questions, please contact your nearest INS office."
}
