{
	"anumber": "A28766602",
	"id": "A28766602_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766602_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ACTA DE NACIMIENTO, Nº 1498"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1967, 1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 El Ciudadano DARIO EZ GONZALEZ, HEALTH Presidente Municipal Constitucional y Juez del Estado Civil de es. te Municipio, correspondiente al Distrito Judicial de Pachuca del Estado de Hidalgo, Estados Unidos Mexicanos, Certifica: que en el HOMELANDING 06 libro original número VIII de NACIMIENTOS del Registro Civil que es a mi cargo, a fojas VT.1. se encuentra un acta que dice lo siguiente: SERIE A ACTA DE NACIMIENTO No 1498 En Pachuca de Soto. Hidalgo. Republica Mexicana. a las 10-15 horas del dia 17 Diecisiete de Agosto de 1967 mil novecientos; sesenta y siete, ante mi DARIO PEREZ GONZALEZ, Presidente Municipal y Juez del Estado Civil de este lugar. comparecen la señora Luz Tellez de Ortega. y presenta (n) al (a) MATOR JUANA BECERRA VALDE% a quien PACHUCA doy fé haber visto viv y que nació a las 20-00 horas del dia 24 Veinticuotro de Junio de 1908 de mil novecientos stackbex Ocho la casa H 26. de la calle de Hij a Natural Número de alumbramiento Meraz Rivera 46 esta Ciudad. PADRES Nombres Abraham Recerra Estefana Valdez Edad: años. años. Origen F.I. N.A.R.A.S Nacionalidad Estado Civil Ocupacion Domicil ABUELOS PATERNOS Nombres SE IGNORAN Origen F. Domicil ABUELOS MATERNOS SE IGNORAN Nombres Origen FINADOS Domicilio TESTIGOS Nombres Ruth Ortega de A. Félix Ramires. Edad: 26 años. Edad 27 años. Origen Pachuca, Hgo. Nacionalidad Mexicana Estado Civil Casadas Sus hogares Ocupacion Domicilio Meráz Rivera # 26 Moctezuma it 509-A Ciudad. Leida la presente acta. la ratifican. maniliestan su conformidad y firman los que saben, estampando su huella digital los imposibilitados lisicamente V los que no saben firmar. Doy fé. Darío Férez Genvález -Luz. T. de Ortega Ruth Ortega Félix Prefire firma ilegible.-oria. Fúbricas!' MARGINALES: Partida Número 3445 Tres mil cuatrocientos cuarenta y cinco.-NACIMIENTO:-BECERRA VALDEZ JUANAT Huelle digital de la mienia. le City SENCIA Es copia fiel tomada estexpide en la ciudad de Pachuca de Soto, BREAD Hidalgo, a los TREINTA dias del thes SEPTIEMBRE de mil novecien- tos SESENTA MISCREE Et Presidente Municipal El Secretario Municipal, DARPO PEREZ LIC. JAVIER ROMERO ALVAREZ. L-44"
}
