{
  "anumber": "A28766602",
  "id": "A28766602_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766602_0009/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1987
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['housekeeping']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "Mexican"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice ScreeneRly LOS TJC: 249 OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION NOV 3 0 Approval expires 4-30-85 .... (DATE) (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER BECERRA-VALDEZ, Juana FEMALE 6/24/08 Mexican 128746602 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Pachuca, Hidalgo-Mexico (If any) 555-93-8442 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE Becerra, Abraham- FATHER Unknown-Guanajuato,Mexico Deceased MOTHER (Maiden name) Valdez, Estefana Unknown-Guanajuato,Mexico Deceased HUSBAND (If none, SO state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE N/A FORMER HUSBANDS OR WIVES (if none, SO state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE N/A APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 10242 Oneida Ave. Pacoima CA USA 3 83 PRESENT TIME 13061 Eustase St. Pacoima CA USA 5 76 3 83 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Doctor Velasis 10 #4 Mexico Mexico D.F. Mexico 1 60 3 70 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE. SO STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR N/A PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) Housekeeping Housekeeper - 60 - 65 THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT 06-25-87 OTHER (SPECIFY): IF YOUR NATIVE WHITE NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Juana ALPHABET OTHER Berema THAN ROMAN LETTERS YOUR Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) BECERRA-VALDEZ, Juana NONE A28 766 602 LOS T/C: 249 NOV 3 0 1987 CORRER (DATE) Form G-325 A (Rev. 10-1-82) (1) IDENT."
}