{
	"anumber": "A28740267",
	"id": "A28740267_0048",
	"page_index": 48,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0048/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE TO RESPONDENT"
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 P 045 258 112 ACEIPT FOR CERTIFIED MAIL PROVIDED MAIL NOTICE TO RESPONDENT Marcelino SOLIS-Romero MAY BE USED AGAINST YOU IN DEPORTATION PROCEEDINGS Street and No RVED UPON YOU IS EVIDENCE OF YOUR ALIEN REGISTRATION 51 Sears Street PORTATION PROCEEDINGS. THE LAW RFOUIRES THAT IT BE San Francisco, CA 94112 ARRIED WITH YOU AT ALL TIMES Postage Certified Fee presented in this proceeding, at no expense to the Government, by an Special Delivery Fee ized and qualified to represent persons before the Immigration and Nat- ng with you any affidavits or other documents which you desire to have Restricted Delivery Fee I case. If any document IS in a foreign language, you should bring the Return Receipt showing hereof. If you wish to have the testimony of any witnesses considered, to whom and Date Delivered nesses present at the hearing. Return Receipt showing to whom Date and Address of Delivery he opportunity to admit or deny any or all of the allegations in the Order TOTAL Postage and Fees $ portable on the charges set forth therein. You will have an opportunity to If, to examine any evidence presented by the Government, to object, on Postmark or Date I of evidence and to cross examine any witnesses presented by the Gov. ring at the time and place designated hereon may result in a determina- Judge in your absence. Y ou WIII DC advised by the Immigration Judge, before whom you appear, of any relief from deportation, in- cluding the privilege of departing voluntarily, for which you may appear eligible. You will be given a rea- sonable opportunity to make any such application to the Immigration Judge. Failure to attend the hearing at the time and place designated hereon may result in your arrest and deten- tion by the Immigration and Naturalization Service. REQUEST FOR PROMPT HEARING To expedite determination of my case, I request an immediate hearing, and waive any right I may have to more extended notice. (signature of respondent) Before: (signature and title of witnessing officer) (date) CERTIFICATE OF SERVICE MAY 23 1989 This order and notice were served by me on in the following manner: sonal Service by (date) Receipt Reduested. P 045 258 112 (signature and title of employee or officer) Larence Cammons, Deportation Officer"
}
