{
  "anumber": "A28766477",
  "id": "A28766477_0081",
  "page_index": 81,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0081/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": " Tanks and Armored Vehicles , Screeneded by NARA, 6/1/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "Panama",
        "Guatemala",
        "Costa Rica",
        "Nicaragua",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 TANKS AND ARMORED VEHICLES 400 350 300 200 100 100 65 45 o NICARAGUA HONDURAS GUATEMALA EL SALVADOR Nicaragua has more tanks and armored vehicles than the other four countries of Central America combined. aware that the Choluteca Gap, which stretches from poses a real as well as a psychological threat. A 1983 western Nicaragua into southern Honduras, could pro- Gallup International Poll showed that Nicaragua's grow- vide an avenue of attack for a Sandinista armored thrust ing military strength and support of subversive into their nation. movements in other countries was a source of concern Honduras' primary deterrent to a Sandinista attack throughout the region. In Honduras, for example, about is its air force. The Honduran air force is considered one 80 percent of the respondents saw Nicaragua as the prin- of the best in Central America. The Hondurans' defen- cipal cause of instability and as the primary military sive plans have rested in large part on the ability of their threat faced by their country. 19 In early 1985, an af- aircraft to destroy an attacking force and launch filiate of Gallup released the results of a poll conducted retaliatory strikes. Over the past few years, the credibili- in Costa Rica in which 87 percent of those polled be- ty of this deterrence has steadily eroded as the San- lieved that the Sandinistas represented a threat to Costa dinistas have developed a nationwide radar system and Rica. In October 1984, the commander of Panama's deployed hundreds of antiaircraft guns and surface-to-air Defense Force, General Manuel Noriega, said that the missiles. The Sandinistas' procurement of jet fighter air- Sandinista arms build-up was a danger to the entire craft would effectively neutralize the Honduran air region. In reporting Noriega's views, the principal force, as its aging Super Mysteres would be no match newspaper of San Jose, Costa Rica, La Nacion, noted for such jets. Thus, the creation of a Sandinista force of that \"Sandinista militarism has to be halted before it jet fighter aircraft would further skew the balance of produces a holocaust in the entire region.\" 20 military power in Central America and would be Nicaragua's military build-up has complicated the dangerously destabilizing for the whole region. 18 search for peaceful resolution of the crisis in Central The people of Central America perceive that the America. Because of their military power, the San- leftist dictatorship that has developed in Nicaragua now dinistas have felt no need to enter into a meaningful 'For a more complete analysis of this poll, see La Nacion Inter- 18The U.S. Government has made clear that the introduction of jet nacional (San Jose, Costa Rica), November 20-24, 1983. fighter aircraft into Nicaragua would be a serious development which it 20\"Noriega's Statement,\" La Nacion (San Jose, Costa Rica), Oc- would view with the utmost concern. tober 16, 1984, editorial. 38"
}