{
	"anumber": "A28749561",
	"id": "A28749561_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BUYER'S ESCROW INSTRUCTIONS, 04-27/2023"
		},
		"years": {
			"ms_years_nlp_v1": [1979, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/27/2023 Pat Alford Escrow Officer BUYER'S ESCROW INSTRUCTIONS NO pat Alford DATE: Nov. 20, 1978 To PAT ALFORD ESCROW We hand you herewith the sum of ,000 scrow id side of Escrow Cash through Escrow 2,750. 00 and will hand you an additional cash Encumbrances of Record sum of $1,750.00 prior to close 1010 S Baldwin Ave. of esdrows will procure a new THA Arcadia,California 91006 loan under FHA 245-3 program in the New Encumbrances 41,250. 00 amount of ,250.00 to complete a (213) 445-5282 (213) 681-5093 TOTAL CONSIDERATION total consideration of $44,000.00 44,000. 00 Buyer has the option of purchasing new fire insurance from agent of buyers choice or to prorate and assign existing fire policy at close of escrow. and any additional funds and instruments required from me to enable you to comply with these instructions, which you are to use on or before Jan. 19 sooner by 1979 and when you can procure Standard Policy of Title Insurance from California Land mutual Title Company with liability of $ 44,000.00 covering Lot 1 of Tract No. 14201 as per map recorded in book 286 page(s)1 all of maps in the office of the County Recorder tos Angeles County, State of California, showing title vested in EFREN P. MAGANA AND MARIA J. MAGANA, husband and wife, and single woman, parents and daughter, all as joint tenants. FREE OF ENCUMBRANCE EXCEPT: All general and special, taxes for /Institute 19 Assessments and/or Bonds: none EASEMENTS, RIGHTS OF WAY, BUILDING SET-BACK LINES, CONDITIONS, RESTRICTIONS AND RESERVATIONS OIL, GAS, HYDRO-CARBON OR OTHER MINERAL RESERVATIONS OF RECORD INCLUDING SO-CALLED ZONING ORDINANCES: and a first Trust Deed to file executed by above vestees in favor of to come under FHA 245-3 program securing a note for $ 41,250.00 : obtain Beneficiary plincipal bálanch of $ should said Beneficiary's 5 Statement show the principe to more or lace than said amount, you are to keep the total consideration the same as shown above by adjusting economy Suyer to obtain a new maximum FHA 245-3 loan # interest rate at 9.50% per annum plus 1/20 MMI Insurance for a period of 30 years. Buyer's deposit of executed loan documents late escrow shall be deemed as their full acceptance of new loan terms. and a Trust Deed to be executed by above vestees in favor of for $ payable $ or more monthly including interest at the rate of % per annum from (endorse note to show interest to commence as of ): first payment due and payable and continuing monthly théreafter until SUBJECT TO: 1) Buyer and property qualifying for new loan as setforth above. 2) Buyer obtaining financing approval from new lender. 3) Seller to comply with FHA requirements, and pay normal sellers FHA costs as required by FRA, including FHA Appreciat and lenders discount points, HOWEVER DISCOUNT POINTS ARE NOT TO EXCEED 5 (FIVE) percent. 4) Buyer to pay normal Buyers FHA costs as allowed by FRA, including 10 origination loan fee, alta lender policy, credit report, allowable ascrow fee and sufficient funds to set loan trust fundy we zender. AS A MATTER OF RECORD ONLY THE FOLLOWING ITEMS ARE MENTIONED 1) All taded down carpeting is included in total purchase price. 2) Seller warrants down are in, connected and paid for. 3) All heating electricalsystems and roof to be in good working order at close of escro however broker or agent are not liable for any malfunctions of the above. Seller will furnish you with à current structural pest control report by a state licensed operator that said property complies with the requirements of the California Pest Control Act and any recommended work to be paid by seller. EACH PARTY SIGNING THESE INSTRUCTIONS HAS READ THE ADDITIONAL ESCROW CONDITIONS, GENERAL PROVISIONS AND INSTRUCTIONS ON THE REVERSE SIDE HEREOF AND APPROVES, ACCEPTS AND AGREES TO BE BOUND THEREBY AS THOUGH THE REVERSE SIDE APPEARED OVER THEIR SIGNATURES. The following prorates and adjustments are to be made in this escrow to Interest on Trust Deeds of record, and any funds shown impounded for future payment of taxes, close of Ascept Mortgage Insurance Premium paid F.H.A. during past 12 months, based on Beneficiary's Statement: taxes, and interest on Bonds (if any), rentals, and premiums on fire and other insurance on building and PERSONAL PROPERTY on premises known as No. I 404 Harstview Cal agree to pay usual buyer's chargés. All parties signing this agreement hereby acknowledge receipt fornia of these institutions. Buyer's Buyer's Signature Signature BUYERS opercorrey DATE Efren T. Magana Maria J. Magana Address: for DATE Address: Zenaida Magana Telephone: Telephone: SELLER'S ESCROW INSTRUCTIONS: The foregoing terms, provisions, conditions /an instructions ind those on the reverse side hereof are hereby approved and accepted in their entirety and concerred in by me withhand you necessary documents called for on my part to cause title to be shown as above, which you are authorized to deliver when you hole (é/ my account sum netz proceeds Pay your escrow charges, usual seller's costs including charges for Title policy called for You authorized pay bonds assessments, taxes, and any liens of record to show title as called for samps he amount of 48.40 Pay balance by check payable to: the undersigned Vega, Seller's in Seller Signature Signature Spring DATE practice DATE Address: Cleavon Govan, Jr. Address Dorothy Govan Telephone: Telephone (PAGE ONE) (OVER)"
}
