{
	"anumber": "A28708181",
	"id": "A28708181_0040",
	"page_index": 40,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28708181_0040/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/22/2023 U.S. Department of Justice OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Relative Expires 4-86 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp APPROVED Fee Stamp A# ING DISTRICT DIRECTOR \"28708181 G-28 or Volag# beladu JUL 21 1987 Section of Law: M.Halland Petition was filed on 201 (b) spouse 203 (a)(1) (priority date) 201 (b) child 203 (a)(2) Personal Interview 201 (b) parent 203 (a)(4) LOS Previously Forwarded 2879 Document Check Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: REMARKS: A. Relationship 1. The alien relative is my: 2 Are you related by adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) BAKSHI, Sheila 2. Address (Number and Street) (Apartment Number) 221 East Bayan Street (Town or City) (State/Country) (ZIP/Postal Code) Ontario, California 91761 3. Place of Birth (Town or City) (State/Country) Lahore, India (now Pakistan) 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 5 17 /15 Female X Widowed Divorced 7. Other Names Used (including maiden name) Shaida 8. Date and Place of Present Marriage (if married) 10/1/40 Lahore, India (now Pakistan) 9. Social Security Number 10. Alien Registration Number (if any) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended None 13. Has your relative ever been in the U.S.? X Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, exchange alien, crewman, stowaway, temporary worker, without inspection, etc.) B-2 Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) (21810) 4 1 1/12/84 Date authorized stay expired, or will expire as shown on Form I-94 or I-95 6/11/87 15. Name and address of present employer (if any) NONE Date this employment began (month/day/year) Certified a true and correct Original seen and returned. INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED A35 art LOS 8/01/85 copy Rec'd Sent Approved Denied Returned Contact Form 711819"
}
