{
  "anumber": "A28766477",
  "id": "A28766477_0060",
  "page_index": 60,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0060/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Air Force and Air Defense The 2,000-troop Sandinista Air Force and Air Defense Force (Fuerza Aerea Sandinista/Defensa Anti- Aerea-FAS/DAA) has been undergoing substantial im- provements since 1979. The Sandinistas began with the remnants of the National Guard's small air force, which included a handful of AT-33A jets, Cessna 337 push- pull aircraft, transport aircraft, trainers, and helicopters. The Sandinistas placed a high priority on developing a more powerful air arm. Early on, they sent personnel to Cuba and Soviet-bloc countries to be trained as pilots and mechanics, and they made plans to expand existing airfields and to build new ones. The Sandinista air force began with the remnants of Somoza's air Because of the long lead time associated with the ac- force, which included a these AT-33A jeis. The Sandinistas quisition of aircraft-i the need for lengthy pilot placed a high priority on L eloping a more powerful air arm. They made plans to expand existing airficids and to build new ones, and, by training and the construction of airfields - the FAS grew 1980, were sending personnel to Soviet-bloc countries to be trained as slowly in its early years. The first fixed-wing aircraft pilots and mechanics. added to the inventory were older and unsophisticated models such as Soviet-made AN-2s. In 1982, they aquired four Italian-made SF-260 trainer/tactical sup- port aircraft from Libya. Two Soviet-made AN-26 medium transports added in 1983 significantly improved the Sandinistas' logistics support capabilities. The Sandinistas' helicopter inventory has grown more rapidly. Some of these helicopters have been ob- tained from Western nations, such as two Alouettes received from France in 1982. The great majority of these craft have been obtained from the Soviets and their allies, however. In 1981, the first two Soviet Mi-8/HIP medium-lift helicopters arrived. The following April, the Soviets formally donated the Mi-8s to the Sandinistas, alleging that they were to be used to help develop the Atlantic Coast region of Nicaragua. In fact, the Mi-8 is This photo shows Cuban commandos deploying from a Soviet-built one of the Soviet Union's front-line combat helicopters Cuban air force AN-26 transport plane during training exercises. In and can be armed with a machinegun and rocket pods. 1983, the Sandinistas acquired two of this type of aircraft, significantly increasing their air transport capabilities. The Sandinistas have received more than a dozen Mi-8s and have used them extensively in military operations. In 1982, the Sandinistas also acquired Polish-built Mi-2/HOPLITE cargo helicopters. In late 1984, the Sandinistas received the first of a new generation of helicopter gunships, the Mi-24/HIND D. This is the Soviets' principal attack helicopter, and it has been used extensively by the Soviets in Afghanistan. One of the most highly sophisticated attack helicopters in the world, it holds the helicopter speed record and can be armed with a multiple-barrel machinegun, guided missiles, rocket pods, and bombs. The HIND's heavy ar- mor, coupled with its high speed, greatly reduces its vulnerability to small arms fire.° Acquisition of the HIND D adds a new dimension to warfare in Central America. Key targets in Honduras, Costa Rica, and El Salvador are all within the reach of this flying \"tank.\" Some five to eight Mi-24s had been delivered to The Mi-8/HIP is one of the Soviets' principal combat helicopters. It Nicaragua by early 1985. can be armed with a machinegun, rocket pods, and antitank missiles. The Mi-8 also serves as a transport helicopter for Sandinista troops For further information on the Mi-24, see John F. Guilmartin, and their equipment. The Sandinistas have received more than a dozen Jr.'s, \"Nicaragua is Armed for Trouble,\" Wall Street Journal, March Mi-8s. 11, 1985, p. 28. 17"
}