{
	"anumber": "A28740267",
	"id": "A28740267_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ORDER TO SHOW CAUSE and NOTICE OF HEARING"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service ORDER TO SHOW CAUSE and NOTICE OF HEARING In Deportation Proceedings under Section 242 of the Immigration and Nationality Act UNITED STATES OF AMERICA: File No. A28 740 267 Marcelino SOLIS-Romero In the Matter of 151 Sears Street Respondent. San Francisco, California 94112 Address (number, street, city, state, and ZIP code) UPON inquiry conducted by the Immigration and Naturalization Service, it is alleged that: 1. You are not a citizen or national of the United States; 2. You are a native of Nicaragua and a citizen of Nicaragua 3. You entered the United States at near San Ysidro, CA on or about January 31, 1984 (date) 4. You were not then inspected by a United States Immigration officer. AND on the basis of the foregoing allegations, it is charged that you are subject to deportation pursuant to the following provision(s) of law: Section 241 (a) (2) of the Immigration and Nationality Act, in that, you entered the United States without inspection by a United States Immigration Officer. WHEREFORE, YOU ARE ORDERED to appear for hearing before an Immigration Judge of the Immigration and Naturalization Service of the United States Department of Justice at 630 Sansome St. Room 404, San Francisco, California 94111 on TO BE SET AT A LATER DATE AND TIMEM, and show cause why you should not be deported from the United States on the charge(s) set forth above. Dated: Phily Water (signature and title of issuing officer) Philip L. Waters (City and State) Deputy District Director San Francisco, California I-618 served and list of free legal services provided. DIEXM 5-1-89 1g Form 1-221 (Rev. 7-1-73)Y (over)"
}
