{
	"anumber": "A28700722",
	"id": "A28700722_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28700722_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, I-181 ( (Rev.3-1-83) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/2/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A 28 700 722 Status as a lawful permanent resident of the United States is accorded: 217 33709300 Name Sant Singh DUA Sex Male Date of Birth (Month/Day/Year) 00-00-14 In Care Of 2 Female 19460 Sherman Way Street City of Birth Country of Birth Address Reseda, CA 91335 Sargodha Pakistan Apt. No. Country of Nationality Country of Last Residence City, State, Zip Pakistan India Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present UNR B-2 Widowed NI Class (whichever most recent) 87 3 4 Divorced 5 Separated Priority Date (Month/Day/Year) Preference fany) Country to Which Chargeable (If any) NA NA NA Section 212 (a) (14) X Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable Ram Prem Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last, NIV New Delhi 08-09-86 Number of Last NIV Classification 113474 of Last NIVB-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act As of at LOS (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE IRO #3 Class of admission (Insert Symbol) REMARKS RECOMMENDED BY: (Immigration Officer) (Date) DATE OF ACTION DD 05-15-87 11 DISTRICT FOR USE BY VISA CONTROL OFFICE Date ANGELES (A Foreign State Preference Category Number buyone Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I. 181 (Rev.3-1-83) N"
}
