{
  "anumber": "A28740267",
  "id": "A28740267_0115",
  "page_index": 115,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0115/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE TO RESPONDENT, P 045 258 112"
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 Louisis NOTICE TO RESPONDENT ANY STATEMENT YOU MAKE MAY BE USED AGAINST YOU IN DEPORTATION PROCEEDINGS THE COPY OF THIS ORDER SERVED UPON YOU IS EVIDENCE OF YOUR ALIEN REGISTRATION WHILE YOU ARE UNDER DEPORTATION PROCEEDINGS. THE LAW RFOUIRES THAT IT BE CARRIED WITH YOU AT ALL'TIMES If you so choose, you may be represented in this proceeding, at no expense to the Government, by an attorney or other individual authorized and qualified to represent persons before the Immigration and Nat- uralization Service. You should bring with you any affidavits or other documents which you desire to have considered in connection with your case. If any document is in a foreign language, you should bring the original and certified translation thereof. If you wish to have the testimony of any witnesses considered, you should arrange to have such witnesses present at the hearing. At your hearing you will be given the opportunity to admit or deny any or all of the allegations in the Order to Show Cause and that you are deportable on the charges set forth therein. You will have an opportunity to present evidence on your own behalf, to examine any evidence presented by the Government, to object, on proper legal grounds, to the receipt of evidence and to cross examine any witnesses presented by the Gov- ernment. Failure to attend the hearing at the time and place designated hereon may result in a determina- tion being made by the Immigration Judge in your absence. You will be advised by the Immigration Judge, before whom you appear, of any retief from deportation, in- cluding the privilege of departing voluntarily, for which you may appear eligible. You will be given a rea- sonable opportunity to make any such application to the Immigration Judge. Failure to attend the hearing at the time and place designated hereon may result in your arrest and deten- tion by the Immigration and Naturalization Service. REQUEST FOR PROMPT HEARING To expedite determination of my case, I request an immediate hearing, and waive any right I may have to more extended notice. (signature of respondent) Before: (signature and title of witnessing officer) (date) CERTIFICATE OF SERVICE MAY 23 1989 This order and notice were served by me on in the following manner: Personal Service by Certified Mail (date) Return Receipt Requested. P 045 258 112 (signature and title of employee or officer) Larence Cammons, Deportation Officer"
}