{
	"anumber": "A28707386",
	"id": "A28707386_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF CHANGE OF TERMS OF TENANCY, Form F"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 Form F Apt. No. 406 NOTICE OF CHANGE OF TERMS OF TENANCY TENANT PEORO HERNANDEZ PREMISES: PLEASE TAKE NOTICE that thirty days after the date of service upon you of a copy of this Notice, the terms of your tenancy are changed in the following respects: (Check applicable provision) The terms of your rental agreement are changed to the terms contained in the attached rental agreement (See Note to Landlord\" below): The rent for the premises is changed to the New Rental Amount, payable in advance on the Rent Due Date of each month (i.e. the 1st, 15th, etc.), and the first New Rental Amount is due on the First New Rent Date, which is a date at least thirty days after the date of ser- vice upon you of a copy of this Notice: New Rental Amount: 254.54 Rent Due Date: 6-1-84 First New Rent Date: 6-1-84 Or (state specific changes): THIRTY DAYS after the date of service upon you of a copy of this Notice, you are legally obligated to comply with each of the foregoing terms, in addition to all the other terms of your prior rental agreement not inconsistent herewith. DATED: 4-28-84 Pater Lan Owner / Manager Form F © 1982 Revised Apartment Association of Greater Los Angeles / 551 S. Oxford Ave. Los Angeles 90020/ (NOTE TO LANDLORD: To change an oral month-to-month agreement to a written month-fo-month agreement, staple com: pleted Apartment Association of Greater Los Angeles FORM 17 hereto and serve upon the Tenant. It is customary for the Tenant to sign FORM 17 but it is NOT necessary that it be signed by the Tenant. It becomes the rental agreement of the TENANT by operation of law, 30 days after the date of service of this notice with completed FORM 17 attached. Be sure to complete the service declaration on the back of this notice, on your copy only.)"
}
