{
	"anumber": "A28707386",
	"id": "A28707386_0050",
	"page_index": 50,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0050/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LABORATORIO DE IDIOMAS, GROLIER, 1042"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 NEW YORK LONDON TOKYO E 616 MEXICO LABORATORIO DE IDIOMAS, GROLIER LABORATORIO DE IDIOMAS, GROLIER DIVISION OF AMERICANA CORPORATION INSCRIPCIÓN S 1042 No 3600 Wilshire Boulevard Los Angeles, California 90005 Fecha 11-2-68 Solicito el privilegio de inscribirme en el LABORATORIO DE IDIOMAS GROLIER, que de ser aceptado, me dará derecho a recibir el siguiente equipo educacional: COMPONENTES EI curso intensivo de inglés del \"Laboratorio de Idiomas Grolier\" comprende: 1. Manuales de instrucciones. 5. Cuadernos de ejercicios: 2. Un magnetófono de cuatro pistas, creado especialmente Grupo 1- Cuaderno de Ejercicios 1-2 para el \"Laboratorio de Idiomas Grolier\". con su 6. Exámenes: dos por cada nivel. audiomicrófono de alta fidelidad. 7. Diccionario inglés-espanol y espanol-ingles. 3. Textos básicos, uno por cada nivel: 8. Cupones validos por 10 años con derecho a 100 con- Grupo 1- Modern American English 1 suitas en inglés para obtener extensas respuestas. Modern American English 2 9. Maletin 4. \"Cassettes\" de cinta magnetofónica, correspondientes a 10., ALTANCIA- CALENDARIO los textos básicos: 11. SUSTRIPCION REVISTA-EPAFICAS Grupo - Niveles 1 y 2 (16 cassettes) 12. NUEVA-ENTICLOPEDIA-TEMATIEA Yo, PEDRO HERNANDEZ me comprometo a hacer a su orden un pago inicial de $ 15.00 y a pagar el SALDO PRINCIPAL en pagos mensuales consecutivos de $ 1306 y también me comprometo a pagar un recargo de servicio y venta a plazos de $ 1.94 $ 15.00 cada mes, hasta cubrir completamente mi cuenta. El pago mensual total es de y el primer pago por correo deberá hacerse el 5 Deer, 68 y cada mes subsiguientes. día mes PRECIO AL CONTADO $ 398.00 Menos el pago inicial de $ 15.00 Recargo por inscripción y entrega 15.00 Mas impuesto de ventas $ 2388 Quedando un SALDO PRINCIPAL de $ 421.88 Total de PRECIO DE VENTA AL CONTADO $ 436.88 Mas recargo de servicio y venta a plazos $ 62.00 SALDO PAGOS A PLAZOS $ 483.88 PRECIO DE VENTA A PLAZO (SALDO A PLAZO + PAGO INICIAL). $ 498.88 de EI título las de propiedad pasa al comprador después de que la cuenta esté totalmente pagada. En caso de falta de pago de cualesquiera mensualidades de la deuda principal cuando ésta deba hacerse, pasan a ser pagaderos immediatemente la totalidad de la sums gastos razonables de abogado y los gastos judiciales. principal y ius intereses, a opción dei tenedor del presente pagaré. En caso de que se inicie un juicio nos comprometemos a pagar los Las publicaciones, productos y servicios que se mencionan antes, se ofrecen a los precios convencionales ya sean en conjunto o por unidades. Esta oferta no está limitada a ningún individuo, grupo o localidad especialmente seleccionados, y ningún artículo mencionado antes 08 gratis. Se entiende que este contrato no será afectado por ningún acuerdo no declarado aquí mismo. AVISO AL COMPRADOR: 1. No firme este contrato antes de leerlo O si alguno de los espacios está en blanco. 2. Usted tiene derecho a una copia de este contrato después de firmarlo. 3. Usted tiene derecho, en cualquier momento, a pagar por adelantado la totalidad de la suma que debe y a obtener, bajo ciertas condiciones, el reem- bolso parcial del recargo por venta a plazos. 4. Este contrato puede ser rescindido si usted notifica a la compañía por correo certificado y registrado con solicitud de acuse de recibo, timbrado en el correo, no después del día hábil siguiente al día de la firma del presente contrato. 5. Este contrato está sujeto a aceptación de la compañía. DIRECCION e INSTRUCCIONES PARA DESPACHAR FIRMADO CONTRATO VENTA A PLAZOS Calle 32312 W. 38TH. St. Ciudad LODANCELES Estado CALIF. Zona Postal 90037 Sr. Pedro Forn andez Número de Teléfono 2324463 Sra. Maria S de Hernandez Dirección para entrega 3234W. 38. ST Recibi pago inicial de $ Instruir a: PEDRO. HERNANDEZ (15:00)cy URREA. G P.M. Representante Esto aedido dana"
}
