{
  "anumber": "A28729371",
  "id": "A28729371_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28729371_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, Form G-28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 NOTICE OF EI OF APPEARANCE AS ATTORNEY REPRESENTATIVE In re: DATE FRANCISCA SANCHEZ ZEPEDA 12/23/87 FILE No. I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): NAME Armando Sanchez Petitioner Applicant Beneficiary ADDRESS (Apt. No.) (Number . Street) (City) (State) (ZIP Code) 7602 San Vicente Ave., Paramount, California 90723 NAME Petitioner Applicant Beneficiary ADDRESS (Ap: No.) (Number & buret) (City) (State) (ZIF Code) Check Applicable Item(s) below: I am on attorney and o member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insula possession, or District of Columbio California and am not under o (Name of Court) court or administrative agency order suspending enjoining, restraining, disbarring, or otherwise restricting me in practicing low. 2. I am on accredited representative of the following nomed religious, charitable, social service, or similar organization esiablished in the United States and which is so recognized by the Board: 3. I am associated with , the attorney of record who previously filed o notice of appearance in this case and my appearance is 6 his request. (If you check this item, also check item 1 or £ whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS P.O. Box 6199 Los Angeles, Ca. 90055 NAME (Type or Prim) TELEPHONE NUMBER Philip J. Karlin 213 623 3007 PURSUANT TO THE PRIVACY ACT OF 1974, : HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OF REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPLARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS (hame of Altumer & Representative) THE ABOVE CONSENT no DISCLOSE 75 is CONNECTION WITH THE FOLLOWING MATTER NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE Armando Sanchez (NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented Kanidley 12/23/87 \" o citizen of the United States & on alien admitted for permanent residence.) Form G-28 UNITED STATES DEPARTMENT OF JUSTICE (Rev. 10-28-702N (OVER) Immigracion and Normalization Service"
}