{
	"anumber": "A28766477",
	"id": "A28766477_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Costa Rica", "Cuba", "United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1984, 1979, 1980, 2023, 1977, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 The Sandinista Military: 1979-1985 revolution. The GRN also enjoyed broad international support, and the United States took the lead in the assistance effort, authorizing $118 million of economic Guerrilla Origins aid and humanitarian assistance during the following 18 months. In July 1979, a broad and popular coalition led by the Sandinista National Liberation Front (Frente Sandinista de Liberacion Nacional-FSLN) overthrew the govern- The Build-up Begins ment of Nicaraguan President Anastasio Somoza. Op- position to the Somoza dictatorship had become Once in power, the Sandinistas quickly set about widespread during the mid-1970s, and the assassination building their armed forces and transforming their rag- in January 1978 of Somoza's leading critic, La Prensa tag guerrilla army into a well-equipped professional editor Pedro Joaquin Chamorro, triggered demonstra- military. The comandantes realized from the outset that tions of popular outrage, including a lengthy general they would need a large, politicized military to pursue strike. The Sandinistas capitalized on this mounting their revolutionary objectives and to maintain themselves resentment of Somoza, and Eden Pastora's (Comandante in power once the bloom of the revolution had worn off Cero) seizure of the National Palace that August cap- and their true political orientation was exposed. In the tured the imagination of the Nicaraguan people. The fall of 1979, they initiated a military build-up without ranks of the FSLN swelled; by late 1978, it had nearly precedent in Central America. In less than 6 years, the 1,000 combatants, and by the following summer, this Sandinistas have developed a military establishment with figure had risen to about 5,000.2 While numerically firepower and mobility unmatched in the region. This smaller than Somoza's 14,000-strong National Guard, at expansion has been made possible only with massive that time the Sandinistas had the support of the assistance from Cuba and the Soviet Union. Indeed, Nicaraguan people and received large amounts of only the militarization of Cuba itself in the 1960s is com- materiel from abroad. In contrast, the National Guard parable to what has occurred in Nicaragua since 1979. was isolated from the people and faced increasing dif- The Sandinistas' plans called for a steady increase in ficulties in obtaining supplies. In June 1979, the the number of men under arms, first through Organization of American States took the unprecedented \"voluntary\" enlistment and later through mandatory con- step of calling for the \"definitive replacement\" of the scription. By early 1985, they had amassed an active Somoza regime. 3 With no hope of external support and duty force of more than 62,000. The Sandinistas' total having lost control of much of the nation's territory, strength, including all regular, reserve, and militia units Somoza fled Nicaragua on July 17. The National Guard and security forces, now exceeds 119,000. disintegrated literally overnight; many Guardsmen, in- cluding most of the higher ranking officers, fled into exile, while thousands of others, mostly enlisted men, Ground Forces were imprisoned by the new government.4 When the Sandinistas marched triumphantly into The Sandinista Popular Army (Ejercito Popular San- Managua on July 19, 1979, there was great hope for dinista-EPS), the full-time, regular army of the FSLN, Nicaragua's future. The leaders of the FSLN had public- has grown to 30,000. The EPS has systematically moved ly pledged themselves to the principles of political pluralism, a mixed economy, and a nonaligned foreign policy. Although dominated by the Sandinistas, the new 'The original junta included Violeta Barrios de Chamorro, the Government of National Reconstruction (GRN) included widow of slain La Prensa editor Pedro Joaquin Chamorro, and Alfonso Robelo. Both resigned in April 1980. Mrs. Chamorro has many others who had participated in the anti-Somoza become a vocal critic of Sandinista policies, particularly censorship of La Prensa. Robelo has become a leader of the opposition Democratic Revolutionary Alliance (ARDE). The first Defense Minister of the new government, Bernardino Larios, was a National Guard colonel who had \"\"Rebels Train to Overthrow Somoza,\" Washington Post, Oc- defected during the revolution. At the end of 1979, he was replaced by tober 15, 1978, p. A1. Humberto Ortega, a member of the FSLN National Directorate. Larios 2\"Nicaragua Junta Assumes Rule in Jubilant Managua,\" was subsequently imprisoned for alleged subversive activities. Even Washington Post, July 21, 1979, p. A1. after his release from jail in March 1984, he was kept under virtual house arrest. In March 1985, he escaped to Costa Rica. 'The United States suspended military assistance to the Somoza regime in 1977. It participated in the OAS mediation effort in the fall 'The top leadership of the FSLN held a secret meeting Septem- of 1978 to resolve the growing crisis in Nicaragua, and in early 1979 ber 21-23, 1979 (barely 2 months after coming to power), to set forth the United States announced the suspension of other assistance pro- plans for consolidating the revolution. The report from this meeting, grams to demonstrate its displeasure with Somoza's intransigence. The formally titled \"Analysis of the Situation and Tasks of the Sandinista United States fully supported the June 1979 OAS resolution calling for Peoples' Revolution\" but commonly referred to as the \"72-Hour Docu- Somoza's replacement. ment,\" candidly revealed the Sandinistas' intentions to build a large The Sandinistas held more than 7,000 political prisoners in 1979, politicized armed force despite their acknowledgement that \"at present most of them former National Guardsmen. See Country Reports on there is no clear indication than an armed counter-revolution by Human Rights Practices for 1979, Department of State, February 1980. Somocista forces beyond our borders is going to take place and jeop- ardize our stability.\" 3"
}
