{
	"anumber": "A28755270",
	"id": "A28755270_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT, Form 1-217 ( Rev.3-30.77)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "Mexico", "United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 DATE PREPARED FILE INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT 9-16-87 A 2e755270 1. NAME 2. SEX MELENDEZ- Rodriguez Luisa Female 3. OTHER NAMESUSED OR KNOWN BY 4. CITIZENSHIP None El Salvador 5. DATE OF BIRTH 6. PLACE OF BIRTH 8-15-10 Ciudad Delgado, El Salvador 7. HEIGHT WEIGHT EYES HAIR COMPLEXION MARKS OR SCARS 59 100 Brn Blk Med None 6. NEAREST LARGE CITY TO PLACE OF BIRTH 9. DISTANCE AND DIRECTION OF PLACE OF BIRTH FROM THIS LARGE CITY San Salvador, El Salvador 3 Miles South 10. IF CITIZENSHIP IS DIFFERENT FROM COUNTRY OF BIRTH, EXPLAIN. IF NATURALIZED IN ANY COUNTRY. SHOW DATE AND PLACE OF NATURALIZATION. CERTIFICATE NUMBER, AND STATE HOW CITIZENSHIP WAS ACQUIRED. N/A 11. NAMES: LOCATIONS AND DATES (YEARS) OF ATTENDANCE 12. NAMES, EXACT LOCATIONS AND DATES (YEARS) OF ATTENDANCE OF FOREIGN SCHOOLS OF FOREIGN CHURCHES. INCLUDE DATE AND NATURE OF ANY RELIGIOUS CEREMONY WHICH MAY HAVE BEEN RECORDED None Sanblea de Dios Ciudad Delgado, El Salvador 13. LAST PERMANENT RESIDENCE IN COUNTRY OF CITIZENSHIP (Show dates of residence) Ciudad Delgado, El Salvador 14. ADDRESS IN COUNTRY OF LAST FOREIGN RESIDENCE (Show dates of residence, and Insigration status there) Same as above 15. PLACE OF ENTRY INTO UNITED STATES DATE-OF ENTRY INTO UNITED STATES EWI 1 M W POE SYS 9-16-87 16. LIST DATE AND PLACE OF ISSUANCE AND NUMBER OF PASSPORT. BIRTH CERTIFICATE. BAPTISMAL CERTIFICATE OR DOCUMENT OF IDENTITY. SPECIFY DATES OF MILITARY SERVICE. COUNTRY AND UNIT. RANK. SERIAL NUMBER. AND PLACES OF INDUCTION AND DISCHARGE. July ? 1987 San Salvador, El Salvador 17. IN POSSESSION OF TRAVEL DOCUMENT OR PASSPORT AT TIME OF ENTRY: YES NO. DESCRIBE DOCUMENT (S) IF SUBJECT DID NOT HAVE TRAVEL DOCUMENT OR PASSPORT AT TIME OF ENTRY. OR DOES NOT HAVE SUCH A DOCUMENT NOW, INDICATE WHETHER EVER OBTAINED ONE: x YES NO. STATE HOW. WHEN. AND WHERE IT WAS OBTAINED: WHAT KIND OF DOCUMENT IT WAS. AND WHAT BECAME OF IT. Subject was issued an El Salvadorian passport in July of 1987 in San Salvador El Salvador. Subject claims that she lost it in Mexico. 18. FATHER'S NAME DATE OF BIRTH PLACE OF BIRTH Pablo Rodriguez Melendez Unknown Sonsonate, El Salvador PRESENT ADDRESS Deceased 19. MOTHER'S MAIDEN NAME DATE OF BIRTH PLACE OF BIRTH Virgenia Valenzuela Aveles Unknown SSonsonate, El Salvador PRESENT ADDRESS Deceased 20. NAME. RELATIONSHIP, AND ADDRESSES OF RELATIVES ABROAD Aminta Guillen (Daughter) Los Angles, California 21. PREVIOUSLY EXCLUDED DEPORTED REQUIRED TO DEPART FROM THE UNITED STATES ON VIA N/A TO (Date) (Port) (Country) 22. INDICATE WHETHER EVER ARRESTED. IN PRISON OR A PUBLIC INSTITUTION IN THE COUNTRY OF WHICH A NATIONAL. SUB. JECT OR CITIZEN: YES NO. IF so, GIVE DATES AND PLACES 2 0650 23. NAME. NATIONALITY AND PRESENT ADDRESS OF SPOUSE. AND DATE AND PLACE OF MARRIAGE Eluservio Deras Maldonado (Deceased) Reyna, Chalatenango, El Salvador 24. NAMES, AGES AND ADDRESSES OF ALL CHILDREN Gonzalo Deras Valenzuela 50 Years San Salvador, El Salvador Maudra Deras Valenzuela 42 Years San Salvador, El Salvador Aminta Guillen 52 Years Los Angles/ Manuel Deras Valenzuela 40 Years Sen 177 25. IF NONCANADIAN DEPORTABLE TO CANADA, GIVE DATE AND PORT OF ARRIVAL IN CANADA. AND NAME OF VESSEL N/A Form I-217 (Rev.3-30.77)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
