{
  "anumber": "A28766477",
  "id": "A28766477_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0072/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Navy The 1,000-troop Sandinista Navy (Marina de Guerra Sandinista-MGS) has similarly undergone both a qualitative and quantitative transformation since 1979. Somoza's \"navy\" consisted of a handful of old patrol boats. The Sandinistas set out to acquire a fleet of more modern vessels. In 1983, they acquired two French Vedette patrol boats and two Soviet ZHUK patrol boats. In 1983-84, North Korea supplied two KIMJIN and two SINHUNG patrol boats. In 1984, Cuba delivered a third ZHUK and two YEVGENYA inshore minesweepers. In November 1984, the Soviet merchant ship Bakuriani delivered four Polish-built K-8 minesweeping boats. Cuban and Soviet Assistance The Sandinista military build-up would have been im- possible without massive assistance from Cuba and the This Soviet-made ZHUK patrol boat is one of more than Soviet Union. Castro provided the Sandinistas shelter a dozen vessels provided to the Sandinista navy by the and training during their struggle against Somoza, and Soviet Union, Cuba, and North Korea. he supplied them with weapons for their final offensive Until recently, the Soviets used surrogates to mask in 1979. The Cuban official who commanded the sup- the extent of their own involvement in the military build- port network based in Costa Rica, Julian Lopez Diaz, up. Cuba was the first to make substantial deliveries of was appointed Cuba's ambassador to Nicaragua as soon Soviet-made arms, and later Algeria and Bulgaria took as the Sandinistas were in power. on this role. Direct Soviet shipment of military- Within a week of the fall of Somoza, Cuba had associated goods occurred by 1981, but not until late placed about 100 military and security personnel in 1984 did a Soviet ship deliver major weapons Nicaragua. By early 1985, the number of Cuban systems-Mi-24s and K-8s-directly to the Sandinistas. military/security advisers in Nicaragua had grown to The details of the agreements that led up to these some 3,000. 10 These Cubans permeate the Ministries of assistance programs remain secret. Nevertheless, Defense and Interior, operating at all levels of the armed documents captured in Grenada in 1983 (and available forces from the General Staff in Managua down to the for review at the U.S. National Archives in Washington, battalion and, in some cases, even company levels. They D.C.) reveal the method employed by the Soviet bloc to are prominent in military training facilities and in areas arm a surrogate. 11 In the case of Grenada, Maurice where technical expertise is required, such as aviation Bishop's regime signed five secret military agreements - and telecommunications. An additional 30 to 40 Soviet three with the U.S.S.R., one with Cuba, and one with and more than 60 East German military/security advisers North Korea. Military equipment began arriving in also operate in Nicaragua. Grenada within a few months of the signing of these These Cuban and Soviet-bloc advisers have strongly documents. Since Soviet military hardware began arriv- affected the organization and tactics of the Sandinista ing in Nicaragua in early 1980, it is likely that the initial military. The units of the Sandinista army and militia secret arms agreements between Nicaragua and Cuba are modeled after their Cuban counterparts; in 1980, the and the Soviet Union were concluded shortly after the Nicaraguans even copied the Cubans' four-digit unit Sandinistas seized power in 1979. (At that time, the San- identification system. Some Nicaraguan military bases dinistas were receiving hundreds of millions of dollars of are modeled after similar facilities in Cuba. economic aid from the United States and other Western sources.) The influx of military aid from the Soviet Union and its allies has risen steadily. In the past 3 years, the number of Soviet-bloc ship deliveries of military equipment has risen from 6 in 1982 to 25 in 1983 to 37 in 1984. The total value of the tanks, helicopters, and other war materiel shipped to Nicaragua '°The Sandinistas' decision to turn to the Cubans was one of was approaching $500 million by early 1985. choice, not necessity. For example, immediately after its July 1979 vic- in converting the Sandinista guerrillas into a regular army. By the end tory, Panama sent military advisers and trainers to Nicaragua to help of 1979, however, the preeminent position of the Cubans was firmly \"See Department of State/Department of Defense publications. established, and the Panamanians returned home. Grenada: A Preliminary Report, December 16, 1983, and Grenada Documents: An Overview and Selection, September 1984. 29"
}