{
	"anumber": "A28707386",
	"id": "A28707386_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28707386_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service Memorandum of Creation of Record of Lawful Permanent Residence, A28 707 386"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A28 707 386 Status as a lawful permanent resident of the United States is accorded: NA Sex Name kbd Male Date of Birth (Month/Day/Year) In Care Of Pedro Jose PORTILLO-HERNANDEZ 2 Female 04/12/15 Street 1519 So. Manhattan Place, #406 City of Birth Country of Birth Address P.O. Box 191112 Santa Ana E1 Salvador Apt. No. Los Angeles, California 90019 Country of Nationality Country of Last Residence City, State, Zip El Salvador E1 Salvador Marital Status 1 Single Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present 3 Widowed 4 Divorced 5 Separated UNR B-2 NI Class (whichever most recent) 68 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) NA NA NA Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3xDX Labor Certification Applicable Luz Pedro Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification San Salvador, E1 Salvador 02/24/67 6048 of Last NIV B-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act As of at LOS (Month) (Dav) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert Symbol) Z66(3) REMARKS RECOMMENDED BY: (Immigration Officer) (Date) DATE OF ACTION DD 07/09/87 sbf DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I. 181 (Rev.3-1-83) N 2. FOR MASTER INDEX REPORT"
}
