{
  "anumber": "A28766477",
  "id": "A28766477_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR ASYLUM IN THE UNITED STATES, Form Approved 6/1/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1984,
        1987,
        1901,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 6/1/2023 Form Approved OMB No. 1115-0086 Immigration and Naturalization Service REQUEST FOR ASYLUM IN THE UNITED STATES INS Office: Los Date: AUG 21 1987 1. Family Name First Middle Name 2. A number (if any or known) Rocha CARlos Alberto MAYORGA 28766-477 All other names used at any time (include maiden name if married) 3. Sex 4. Marital status CARlos A Rocha Male Single Divorced Female Married Widowed I was born: (Month) (Day) (Year) in (Town or City) (State or Province) (Country) NiCARAGUA 04-11-1901 DiRiAMbA CARAZO NiCARAGUA Nationality - at birth At present Other nationalities NiCARAGUAN NiCARAGUAN N/A 5. If stateless, how did you become stateless? N/A 6. Ethnic group 7. Religion 8. Languages spoken SPANISH BAPTiST SPANISH 9. Address in United States (In care of, C/O, if appropriate) 10. Telephone number (Number and street) (Apt. No.) (City or town) (State) (Zip Code) (include area code) 2107. S. NORwood st Los Angeles Ca. 90007 H/A 11. Address abroad prior to coming to the United States (Number and street) (City) (Province) (Country) DiRiAMbA NiCARAGUA 12. My last arrival in the U.S. occurred on: (Mo/Day/Yr) As a Visitor Student Stowaway Crewman 12-13-1983 Other (Specify) At the port of (City/State) Means of arrival (Name of vessel or airline and flight number, etc.) Los ANGELES CA. AEREONICA I was was not inspected Date authorized stay expires (Mo/Day/Yr) JULY - 1984 13. visa 012493 My nonimmigrant number is it was issued by the U.S. Consul on JUN g 1983ct (If none, state \"none\") MANAGUA NICARAGUA (Mo/Day/Yr) at (City, County) 14. Name and location of schools attended From To Type of school Highest grade Title of degree or Mo/Yr Mo/Yr completed certification Escuela PublicA DiRiAMbA 15. What specific skills do you have? 16. Social Security No. (if any) TRUCK DRIVER. 17. Name of husband or wife (wife's maiden name) ANDREA PASTORA SILUA OTHER (MAURA ROCHA) 18. My husband or wife resides with me apart from me (if apart, explain why) 2107.5. NoRwood St A.CA. 90007 Address (Apt. No.) (No. and street) (Town or city) (Province or state) (Country) Form I-589 (OVER) (Rev. 3-1-81) N RECEIVED TRANS IN RET'D TRANS COMPLETED OUT Page 1"
}