{
	"anumber": "A28766477",
	"id": "A28766477_0050",
	"page_index": 50,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0050/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "photograph"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Armor. The Sandinista army has adhered closely to In 1984, the Soviets provided the Nicaraguans with Soviet-Cuban military doctrine in the development of its about 30 PT-76 light tanks. This amphibious tank, armed forces. When the Sandinistas seized power in armed with a 76-millimeter gun, fords rivers easily and July 1979, they inherited the hodgepodge collection of can maneuver in some of the difficult terrain found in armor that had belonged to Somoza's National Guard, parts of Nicaragua. including some obsolete World War II vintage tanks, only three of which were operational. The remainder of The Soviets, through their allies, have also equipped the Sandinista army with more than 200 armored Somoza's armor consisted of 25 antiquated Staghound armored cars. vehicles, mostly BTR-60 and BTR-152 armored person- nel carriers. These vehicles are armed with a machinegun The Sandinistas set about building an armored force and can carry a squad of infantry. The first BTR-60s of a size and firepower without precedent in Central began arriving in mid-1981. The EPS has also received America. Crews and mechanics for tanks and other Soviet-made command vehicles and BRDM-2 am- vehicles were sent to Cuba for training. Facilities to sup- phibious armored reconnaissance vehicles. The San- port the forthcoming arsenal were built. The first Soviet- dinistas have now formed at least one mechanized infan- built T-55 tanks arrived in mid-1981. The T-55, try brigade. weighing 36 metric tous and armed with a 100-millimeter The terrain in certain parts of Nicaragua is well gun, can outgun any tank previously seen in Central suited to armored operations, while in other parts of the America. Formerly the Soviets' main battle tank, it is country, the terrain imposes some constraints. Tanks can still being used by Warsaw Pact armies. The Sandinistas operate easily in the flat plains of the west, which en- used the T-55s to form a new armored battalion sta- compass the principal population and economic centers tioned near Managua. of the nation. On the other hand, the mountains and Over the next 3 years, ships from the Soviet bloc rugged terrain of the northern departments limit off- continued to transport tanks to Nicaragua. By 1982, the road maneuverability. Nevertheless, the EPS has Sandinistas had obtained a sufficient number of T-55s deployed armored units in the north, particularly in such to organize another armored battalion. By the end of missions as escorting convoys and guarding fixed in- 1984, they had acquired a total of more than 110 T-55 stallations. The lowlands of the Atlantic Coast region in- tanks, enough to form five armored battalions of 22 hibit off-road use of the heavy T-55s, but the San- tanks each. dinistas could deploy the amphibious PT-76s in this region. While some observers have argued that the ter- Soviet military doctrine emphasizes the use of massed armor. In terms of size and organization, Sandinista armored units are modeled rain in Central America renders tanks of only marginal after their Cuban counterparts. military value, the Sandinistas-and their Soviet sup- In a February 1985 interview with CBS News, Sandinista Army pliers - do not share this view; indeed, they have con- Chief of Staff Joaquin Cuadra tacitly acknowledged that the EPS had tinued the rapid increase in the size of their tank force, 110 tanks and added that it planned to acquire up to a total of 150. doubling it in 1984 alone. 245 The Soviet-made T-55 tank weighs 36 metric tons and has a 100-millimeter gun. Formerly the Soviet Union's main battle tank, it is far superior to any other tank in Central America. The Sandinistas have more than 110 T-55s. In comparison, Somoza had three operational World War II vintage U.S. tanks. 7"
}
