{
	"anumber": "A28755270",
	"id": "A28755270_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMIGRATION AND NATURALIZATION SERVICE BOND"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1946, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Screened by NARA 4/18/2023 BOND File No. 78 755 / 70 address of obligor: West Ins. Co., GONZA. S & GONZALES, 5042 E. 3rd St Los Angeles, Ca. 90022 if this bond is executed by a surety company the following: Rate of premium: 10 per annum 1(20) Amount of premium 40.00 The name and address of the person who exacuted a written instrument with the surety company requesting It to post the bond is: MARIA AMINTA GUILLEN 1069 LEOVARD IVA LOS ANGELES CA. 90022 B. Name of alien for whom this bond is furnished (If there is more then on alien, 48, arate schedule showing name of each alien, date and country of his/her birth and arrival data, signed and sealed by the obligor and made Not nereof, 16 meaned.) Name: Date and country of birth of alien: LUISA RODRIGUEZ. VALENZUELA 8-15-10 SALVADOR Date, port, and means of arrival in United States: National of alien: NR sys EWI 9-16-87 EL SALUADOR c. In consideration of the facts recited in paragraph or paragraphs herein , umbered TWO (2) and captioned BOND CONDITIONED THE DELIVERY OF AN ALIEN (and in any rider or riders lettered and captioned attached hereto and made part hereof) the obligor above named, by subscribing hereto, hereby declares that he/she is firmly bound unto the United States in the sum of TWO THOUSAND dollars ($ 2,000.00 ) (excect that Insolar as the bond is that the alien shall not become à public charge the obligo. declares himself/herself bound In such amount or successive amounts 03 are prescribed in paragraph (3) herein) as liquidated damages and not as a penalty which sum is to be paid to the United Statea Immediately upon failure to comply with the terms set forth In any such paragraph or rider. The obligor further agrees that any notice to him,har in connection with this bond may b4 accomplished by mail directed to him/her at the above address. If bond is furnished for more than one alien the obligor agrees that any references herein 12 allen in the singular sense shall be construed in the plural sense. The obligor acknowledges receipt of a copy of this executed bond and any attached rider or riders specified above. The burden of establishing compliance with the terms of the bond rests on the obligor if this wond has been executed In consideration of the facts recited in paragraph (1) captioned \"Bond for Maintenance of Status and Departure of Non-Immigrant Allen\" and has been furnished for more than one alien, the amount due for each allen who falls to comply with the terms thereof shall be dollars ($ ), not to exceed the total sum of dollars ($ ). D. Stand and sealed in the presence of POWER FW Date: SEPTEMBER 17. 1987 Name 9006056 Address Address (Witness) By: the after (Witness) Far West Insurance Company (SEAL) (Obligor) Attcunay-in-Fact E. PLEDGE AND POWER OF ATTOPNEY FOR USE AMHERINGTED SYATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States Bonds/Notes described in the following schedule 18 Lasurity for the performance and of the loregoing undertaking In accordance with 8 U.S.C. 15, 31 CFR Part 225, and Treasury Department cular 154 dated October 31, 1969, and no voligor named in this bond do hereby appoint the Attorney General of the United States as my attorney for me and in my name 10 collect or to sell, assign and transfer said United States bond or notes and agree that in case of any default In the performance of any of the consitions herein tc which I have subscribed, my sale attentiey shall have the power to collect said bonds/notes or any part hereof or to sell, assign, and transfer said bonds notes or any per thereof, without notice, at public private sale, free from equity of redemption and without appraisement or valuation, notice and right to redeem being walved, and to apply the proceeds in whole G in r.e. is the antisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best COUPONS FACE INTEREST INTEREST TITLE OF BONDS/NOTES ATTACHED VALUE RATE SERIAL NO. DATES PLEDGE AND POWER OF ATTORNEY FOR USE WHEN CASH IS DEPOSITED AS SECURITY The amount of cash money of the United States, is hereby pledged as security for the per- formance and futrilment of the foregoing undertaking, and 1, the obilgor named in this bond, hareby appoint the Atter ley General of the United States as my attorney for me and In my name to collect or to assign and transfer the said sum of money, and I agree that, In case 01 dei ault in the performance of any of the conditions herein to which I have subscribed, my snld attorney shall have full power to collect said sum of money or any part thereof or to assign and transfer said sum or any part thereof, without notice and to apply said sum or any part thereof to the satisfaction of any damages, demande, or deficiencies arising by reason of such default, as my said attorney may desm best : further empower my said attorney, in the event all the corrittions hyrein to which I have subscrib- ed have been complied with and the bond is cancelsd, to deliver the said sum of money plus any Interest accrued th ireon, to me at my risk and expense by such means as he/she shall select. IN WITNESS WHEREOF, I have hereunto set my hand and seal this day of 19 (SEAL) Before me, within the county of in the State of, (or the District of Columbia). personally appeared the above named and the execution of the foregoing power of attorney. Witness my hand this day ct 19 (Signature) (1946) asset approved and accepted LOS ANGELES CAAIFORNIA SEPT 12. 1987 19 (City) (State) (Sistrict Kustfun Director) 1-362 (Rev. THIS COPY TO BE RETAINED BY PERSON AGQUESTING SURETY COMPANY TO POST BOND WILL RESIDE: SAME AS ABOVE"
}
