{
	"anumber": "A28740267",
	"id": "A28740267_0104",
	"page_index": 104,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0104/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U. S. Department of Justice Immigration and Naturalization Service, A28 740 267(E-24)"
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1992, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 August 2, 1988 U. S. Department of Justice Immigration and Naturalization Service 630 Samsome St San Francisco, Ca. 94111 File: A28 740 267 (E-24) Gentlemen: My grandfather MR. MARCELINO SOLIS ROMERO, applied for asylum and his application has been tentatively denied fact that he failed to established a well founded fear I would like to ask for some consideration to his requ he may really facesa lot of problems if he return to N note that, most of his closed relatives lived here in of us, (his grandchildren) were members of the Sandini Police, and in my case I was a commander of reserve ba a period of 2 years and joined the Armed forces (Sand: 1981, action that I was forced to take because of the retaliation if I failed to do so. At this point, all I can say about the possibilities jeopardy of suffer persecution by the Sandinista Gove all of his young relatives, were members of the Sandin and all of us are deserters of the Communist Armyotha are. I am sure he will be questioned and put thru a I which may jeopardize his health. He is a very old mai unable to go thru some torture procedures. Please COI and allow him to spendhis last days in the U.S.He wi a public charge for the U. S. government. During his he has lived with mysaunt, his daughter and never ha penny from the Government. I declare under penalty of perjury, that the above st but the true to the best of knowledge. FOIA (b)(6) STATE OF CALIFORNIA COUNTY OF SANTA CLARA On this 2ND day of A biden 19 88 before me the undersigned, Notary I personally appeared before ARLIN and proved to b subscribed to this document and Notary Public P execute it. NOTARY PUBLIC- CALIFORNIA SANTA CLARA COUNTY My Commission Expires FEB 14. 1992"
}
