{
	"anumber": "A28743491",
	"id": "A28743491_0057",
	"page_index": 57,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0057/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1930, 2023, 1911, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/23/2023 AFFIDAVIT I, Dr. Harbans Kaur, , after being duly sworn according to Law , hereby depose and say: That I am presently residing at 354-BXIX, Dr Hira Singh Road, Civil Lines, Ludhiana (Punjab) India: That I was born on 22nd December , 1911 in Punjab, India. The t I am aunt of Narinderjit singh Keith and younger sister of S. Jaswent Singh, his father. That Narindarjit Singh Keith was born on August I, 1930 at Lahna Singh Wala, in Punjab, India (Now in Pakistan) That his parents' names are Jaswant Singh and Kaur Baant Kaur. That I am executing this affidavit in lieu of THE KAUR NOTARY PURINA DEPARTMENT Narinderjit Singh Keith's birth certificate which is unavailable and also to stabe that he is the legitimate 2482 VT. son of Jaswant Singh and Kaur BeentKaur (India) y LUDHIANA. That since I am the aunt of Narinderjit Singh Keith and very close to the family, I know the fects very well, That stated facts are true and correct to the best of my knowledge and belief and I also know to make a false affidavit is a criminal offence. Certified Dated that 10. the 6-1987 has been read Harhans Kaur kath over & explained to the deponent Horbuster Deponent who seemed Derrectly to understand Harlians Kauz keth the same at the time making therecf. (DR HARBANS KAUR) Subscribed and sworn to before me this 10th, day of June Year 1987 Notsry Public. KAUR ADVOCI Attested SS Identified Arhysome Notary Public Lndhiana (Pb.) ROS 10/6187 NOTARIAL"
}
