{
	"anumber": "A28740267",
	"id": "A28740267_0078",
	"page_index": 78,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28740267_0078/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/28/2023, A28 740 267(E-24)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1992, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 August 2, 1988 U.S Department of Justice Immigration and Naturalization Service 630 Sansome St San Francisco, Ca. 94111 File: A28 740 (E-24) Gentlemen: As an American Citizen, I would like to ask you to take some considerati on MR. MARCELINO SOLIS ROMERO application for Political Asylum in the U. S. I have known Mr. Solis for 10 years, thru his granddaughter who is the mother of my son. During all these years that I have known Mr. Solis, he has behave like a good citizen, never received a penny or any other kind of help from the Government and has lived with his daughter. I realized that Mr. Solis may not have enough proof and documentation to show his fear of persecution if he ever returned to Nicaragua. But on the other hand, sometimes it is hard for a refugee that flee his country of origin to bring with him documents to attest his claim. When I meet Mr. Solis, he just has arrived in 1976 and stayed in the U.S. for a period of about 3 years and then he left the country, back to Nicaragua. I know for a fact that all of Mr. Solis closest relatives, are former members of the Sandinista Army and deserters of the same body, and because of this simple action, the old man will be in jeopardv to suffer all kind of persecution. When T meet Mr. Solis he was a follower of the Somoza regime and T know these. because T went to Nicaragua. before the Somoza fall. At this point, I would like to offer my whole support on behalf of Mr. Solis while he continuing living in the U.S.- This man, is an old man and will never, never become a public charge for the Government. T know this offer may sound hizarre. but T have the feeling that there must be a section of the refugee Act that will allow an old man who is unable to demostrate his fear of persecution in his country. but if somebodv else can nrovide the sundort he will. he allow to remain in the USA. Under Denaltv of neriurv. T declare that the above statement is the thin Monda trye to the best of mv knowledge. Oscar Morales 877 Tnoerson Ave San Francisco, Ca 94124 STATE OF CALIFORNIA COUNTY OF SANTA CLARA On this 2NS day of Aul 19 58 before me. the undersigned Notarv Public in and for said State. personally appeared before me OSCRIA MORA. OFFICIAL and nroved to be the person whose name subscribed to this document and acknowmedged that MAYORGA NOTARY PUBLIC-CALIFORNIA SANTA CLARA COUNTY My Commission Expires FEB 14, 1992"
}
