{
  "anumber": "A28766477",
  "id": "A28766477_0079",
  "page_index": 79,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0079/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Cuba",
        "United States",
        "Spain",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1979,
        1981,
        2023,
        1983,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Implications Domestic The steady pattern of the Sandinista military build-up The Sandinistas have militarized Nicaraguan society. Up demonstrates that the FSLN has been intent on forming until 1978, Somoza's National Guard normally had some the largest armed forces in Central America ever since it 7,000 men. It never exceeded 14,000, even at the height seized power in 1979. Contrary to Sandinista assertions of the fighting. The Sandinistas now have a total armed that their military build-up has been the result of force-regular army, air force, navy, reserves, militia, \"counterrevolutionary activities\" and \"foreign and security forces-of some 119,000. Nicaragua has a aggression,\" the blueprint for the creation of a powerful higher percentage of its population on active duty than combined arms infantry, armor, and artillery any other nation in the region. Under the guise of na- supported by airpower and naval units- - was drawn at tional mobilization, the Sandinistas have drawn nearly 1 least 2 years before significant armed opposition arose.10 out of every 14 Nicaraguans aged 16 and above, in- The Sandinistas planned the build-up at a time when the cluding women, into their military/security structure. As National Guard had been routed, the revolution had noted above, many of the members were recruited broad popula support, and the international community through coercion, first by FSLN pressure tactics and was highly sup, optive with the United States leading since late 1983 by forced conscription. the efforts to provide economic assistance. While the rise The Sandinistas have used this militarization to of armed opposition forces has led the Sandinistas to tighten their control over the Nicaraguan people. The make some adjustments in their plans, such as the for- military itself is highly politicized; key positions are held mation of special counterinsurgency battalions, it has by members of the FSLN, and recruits are indoctrinated not significantly affected the basic outline of an over- with Marxist ideology. The concept of state security has sized military force laid out in 1979-80. become a cloak to protect the dominance of the FSLN. Why did the Sandinistas choose to develop such a Civil and human rights have been subordinated to the huge military establishment? In Nicaragua, as in Cuba security of the state (read: party), and all those who and other countries which have fallen to Marxist- legitimately challenge Sandinista actions and Leninists guerrillas, the new regime placed as its top policies-including politicians, business and labor priority the formation of a large armed force which leaders, church officials, and journalists - are vilified as could ensure the consolidation of its power. The San- traitors and counterrevolutionaries. The government, the dinistas recognized that the \"honeymoon\" period they initially enjoyed would not last. As FSLN National Directorate member Bayardo Arce said in 1984, the San- dinistas never had had any intention of honoring their commitments to pluralism, a mixed economy, and nonalignment; they had merely espoused these policies in 1979 as a tactical ploy. The Sandinistas realized that, as they proceeded with their secret agenda of fostering a Marxist-Leninist regime and exporting revolution throughout the region, they would encounter growing resistance from the nations of the region and from the Nicaraguan people themselves. The Sandinistas sought to develop a powerful military force which could intimidate their neighbors and suppress domestic opposition, thereby providing them with a secure base for their subversive activities. Nocraguan Ambassador Carlos Tunnermann wrote in a letter to the Washington Post that prior to November 1981, \"there were only a few hundred ex-GN [Somoza's National Guard] soldiers staging sporadic raids on farms along the border. Their principal occupations 6 3 + 3 were cattle-rustling and extortion.\" See \"We Will Never Negotiate With the Contras,\" Washington Post, March 30, 1985, p. 21. 3 veces 2 es igual 6 2 veces 3 es igual 6 \"Joaquim Ibarz, \"El Comandante Bayardo Arce afirma que se va a implantar el marxismo-leninismo y el partido unico\" (\"Comandante 3 X 2 = 6 2 x 3 = 6 Bayardo Arce affirms that they are going to establish Marxism- Leninism and a single party\"), La Vanguardia (Barcelona, Spain), July 31, 1984. For English translation, see Comandante Bayardo Arce's Secret Speech before the Nicaraguan Socialist Party (PSN), Depart- Grade-school arithmetic books use pictures of Soviet-made AK-47 ment of State, March 1985. rifles and hand grenades to teach children to count. 36"
}