{
  "anumber": "A28700722",
  "id": "A28700722_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28700722_0040/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "years": {
      "ms_years_nlp_v1": [
        1908,
        1988,
        1935,
        1914,
        1980,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 8/2/2023 OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Relative DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp A# 25-750-722 G-28 or Volag# APPROVED Section of Law: INS DISTRICT DIRECTOR Petition was filed on 130485 201 (b) spouse (priority date) 85.00 203 (a)(1) EMPL 02/25/87 201 (b) child 203 (a)(2) 203 (a)(4) JAN X7 1988 Personal Interview Previously Forwarded 201 (b) parent Document Check 800290 who Staleside (Griteriab *08:00 203 (a)(5) Field Investigations -485 Simultaneously AM CON REMARKS: 2783 A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) DUA MANJIT SINGH DUA SANT SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 19460 SHERMAN WAY 19460 SHERMANWAY (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) RESEDA CA 91335 RESEDA CA 91335 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) KANPUR U.P. SARGODHA PAKISTAN 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Female 1914 Single 2-8-43 Widowed Divorced Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 5-16-75 NEW DELHA-INDIA 1935 SARGODHA - PAKISTAN 9 Social Security Number 10. Alien R FOIA (b)(6) FOIA (b)(6) al Security Number 10. Alien Registration Number (if any) N.A. A28700722 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended Original seen and returned. N. A. Nutz Certified #12768744 a true and corject Los copy. 6-6-86 N.A. dontact Representative, 1908 13. If you are a U.S. citizen, complete the following: My citizenship was acquired through (check one) Bell55 13. Has your relative ever been in the U.S.? Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, exchange alien, crewman, Give number of certificate, date and place it was issued stowaway, temporary worker. without inspection. etc.) Parents 12768744 USDC 6/6/86 A 21733709300 VISITOR 2-8-87 Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name SiP give number Yes of certificate. No date Let#619885 and place if was issued 217 33709300 2-8-87 If \"Yes\", Date authorized stay expired, or will expire as shown on Form I-94 or I-95 7 SEPT. 1991 15. Name and address of present employer (if any) 14. If you are a lawful permanent resident alien, complete the following. N.A. Date and place of admission for, or adjustment to. lawful permanent Date this employment began (month/day/year) residence SEPT. 30, 1980 SEATTLE WA N.A. INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 06-23-86) Y of"
}