{
	"anumber": "A28766602",
	"id": "A28766602_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766602_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, Form No. 4-343"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1971, 1972, 2023, 1991, 1983, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 1971-86 Form approved. Budget Bureau No. 43-R343. No. AFFIDAVIT OF WITNESS IN THE MATTER OF THE APPLICATION OF Juana BeceRRA File No. AFFIDAVIT Secundino Gonzalez , occupation Retired residing at 10657 El Dorado Avenue, Pacoima, CA 91331 (Number and street) (City or town) (State) (ZIP Code) is being duly sworn, deposes and says that (s)he is not | a citizen of the United States of America; that (s)he has personally known and has been acquainted in the United States with JUANA BECERRA , the applicant above mentioned; his that to her personal knowledge the applicant has resided in the United States as follows: 12030 Sheldon St. #27, Sun Valley, CA from March, 1971 to February, 1972 (City. town. and State) (Month) (Year) (Month) (Year) 10641 San Fernando Rd. #D; Pacoima, CA from March, 1972 to May, 1976 (City. town. and State) (Month) (Year) (Month) (Year) 13061 Eustace, Pacoima, CA from May, 1976 to March, 1983 (City. town. and State) (Month) (Year) (Month) (Year) 10242 Oneida, Pacoima, CA from April, 1983 to Present (City. town. and State) (Month) (Year) (Month) (Year) his that (s) he is able to determine the date of the beginning of her acquaintance with the applicant in the United 1971. She and her daughter Came to my house looking for a place to live, we States from the following fact(s): Ihave known Mrs. Juana Becerra since August, talked and found out we have the same faith. Since then we keep in touch and attend the same church. that (s)ne has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is (Years) 0 (Montas) Securidino Gonzeley (Signature of witness) Subscribed and sworn to before me by the above-named witness at this 17 day of JUNE OFFICIAL SEA Form 1-488 the 19 87 ALEX A MEDINA (Signature of attastor) UNITED STATES DEPARTMENT OF NOTARY PUBLIC - CALIFORNIA Immigration and Naturalization Sex (Rev. 10-1-78)N LOS ANGELES COUNTY NOTARY (Title of attester) public My comm. expires MAY 31, 1991 GPO 1 1985 o - 495-263"
}
