{
  "anumber": "A28749561",
  "id": "A28749561_0107",
  "page_index": 107,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0107/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 4/27/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 As the vehicle turned west on Otay Mesa Rd. Agent Robert J. Fagan notified Agents that the vehicle was a white Toyota Sedan with three people visible. When the vehicle passed Heritage Rd. Agent Chancy Arnold and I attempted to catch-up to the vehicle and initiate a vehicle stop to check subjects immigration status. Due to subjects high rate of speed and the amount of traffic on Otay Mesa Rd. we were unable to catch-up with the vehicle until 555 W. San Ysidro Blvd. at the Southview Terrace Apts, where subject ( FOIA (b)(6) FOIA (b) (6) ) who was driving the vehicle exited along with the two passengers Magana-Torres, Efrain (EWI) and FOIA (b) (6) and attempted to hide in the ap artments but were apprehended with the assistance of the Border Patrol Helicopter, After all three occupan ts were apprehended a registration check of the vehicle Ca. plate 2CKJ081 shown that the vehicle was stolen on 3-13-87. As I was inspecting the vehicle the manager of the apartments came out and told me that the person who was in possesion of the vehicle lived in apartment #83. The occupants of apartment #83 denied all knowledge of the vehicle and subject driving it. The apartment appeared to be used in the smuggling of aliens. Upon arrival at Brown Field Station both sub ject FOIA (b) (6) and the FOIA (b)(6) FOIA (b)( (6) FOIA (b)(6) passenges were read their rights. was not interiviewed as he was under t he influence of a controled substance. FOIA (b)(6) stated that she got into the car with FOIA (b)(6) at his residence W. 555 San Ysidro Blvd. Apt. #83 and drove to Tijuana Mexico where they injected Heroin. While driving the streets they met Magana-Torres, Efrain'a Mexican National and offered to drive him surrepticously into the U.S. for and unknown amount of money. An interivew with Magana confirmed. the same story. vehicle and FOIA (b) (6) San Diego Police Offi Larry Gordon took custody of Lopez for possesion of a stolen was released by Officer Gordon on her own recognizance. Magana-Torres, Efrain was VRd to Mexico MIRAC, WANTS AND WARRANTS ARE NEGATIVE."
}