{
	"anumber": "A28793184",
	"id": "A28793184_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28793184_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Permanent Residence"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Immigration and Naturalization Service (INS) Application for Permanent Residence Instructions Read the instructions carefully. If you do not follow the instructions, we may have to return your application, which may delay final action. You will be required to appear before an Immigration Officer to answer questions about this application. You must bring your temporary entry permit (Form I-94, Arrival Departure Record) and your passport to your interview. 1. Who can apply? If you are the husband, wife, parent, or minor unmarried child of a U.S. citizen, a visa is immediately available to you You are eligible to apply for lawful permanent residence if when your U.S. citizen relative's petition, Form I-130, for you are in the U.S. and you: you is approved. A. have an immigrant visa number immediately available to For all other applicants, the availability of visa numbers is you (see 3 below - \"When will a visa become based on priority dates, which are determined by the filing available?\") or of immigrant visa applications or labor certifications. When the priority date is reached for your approved petition, a B. entered with a fiance(e) visa and have married within visa number is immediately available to you. For a monthly ninety days, or update of the dates for which visa numbers are available, C. have been granted asylum by the INS or an immigration you may call (202) 663-1514 judge one year or more ago, or 4. What documents do you need? D. are a member of a class of \"special immigrants\", which includes certain immigrants returning from a temporary A. 1) For each document needed, give INS the original and visit abroad, certain ministers of religion, and certain one copy. Originals will be returned to you. former employees of the United States abroad, or E. have resided continuously in the United States since 2) If you do not wish to give INS an original document, before June 30, 1948, or you may give INS a copy. The copy must be certified by: F. are filing a motion before an immigration judge, or a) an INS or U.S. consular officer, or G. are a former foreign government official, or a member of the immediate family of that official. b) an attorney admitted to practice law in the United States, or 2. Who may not apply? c) an INS accredited representative You are not eligible for lawful permanent residence if you entered the United States and you: (INS still may require originals). A. were not inspected and admitted or paroled by a United 3) Documents in a foreign language must be accom- States Immigration Officer, or panied by a complete English translation. The B. continued in or accepted unauthorized employment, on translator must certify that the translation is accurate or after January 1, 1977, unless you are the spouse, and that he or she is competent to translate. parent, or child of a United States citizen, or B. You must also give INS the following documents: C. are an exchange visitor subject to the two-year foreign 1) Your birth certificate. residence requirement, or 2) If you are between 14 and 79 years of age, Form D. were in transit through the United States without a visa, G-325A (Biographic Information). or 3) a) If you are employed, a letter from your present E. were admitted as a crewman of either a vessel or an employer showing that you have employment of a aircraft. permanent nature. b) If you are not employed in a permanent job, a Form NOTE: If you are included under 2 above but have lived I-134 (Affidavit of Support) from a responsible per- here continuously since before June 30, 1948, you may still son in the United States or other evidence to show apply. that you are not likely to become a public charge. 3. When will a visa become available? 4) If your husband or wife is filing an application for per- manent residence with yours, he or she also must give If you are applying for permanent residence as the relative INS your marriage certificate and proof for both of you of a U.S. citizen or lawful permanent resident, or as an that all prior marriages have been legally ended. immigrant employee, an immigrant visa petition (I-130 or 5) If your child is filing an application for permanent I-140) must have been filed (or must be filed with your ap- residence with yours, he or she also must give INS plication). In addition, an immigrant visa number must be your marriage certificate and proof that all prior mar- immediately available to you. riages for you and your husband or wife have been Form I-485 (Rev. 06-23-86) Y For sale by the Superintendent of Documents, U.S. Government Printing Office Washington, D.C. 20402"
}
