{
  "anumber": "A28749561",
  "id": "A28749561_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28749561_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IMMIGRATION BOND, A28 749 561"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 U.S. GOVERNMENT PRINTING OFFICE 493-631 U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE IMMIGRATION BOND File No. A28 749 561 A. Name and address of obligor: Far West Ins. % GONZALES & GONZALES, 5042 E. 3rd St. Los ANgeles, Ca. 90022 If this bond is executed by a surety company the following: Rate of premium: 10% per annum 2% 200- Amount of premium Maria Magana, 14340 Palm We, Baldwin surety company requesting it to 91706 post is: . The name and address of the person who executed a written Instrument with the the bond B. Name of alien for whom this bond is furnished: (If there is more than one alien, separate schedule showing name of each alien, date and country of his/her birth and arrival data, signed and sealed by the obligor and made part hereof, is attached.) Name Efren Magana Torres Date 7-25-15 and country of birth of alien: Maxico Date, port, and means of arrival United States: Nationality of alien: 3-23-87 NR Sys EWT Mexico C. In consideration of the facts recited in paragraph or paragraphs herein numbered TWO (2) and captioned BOND CONDITIONED FOR THE DELIVERY OF AN ALIEN (and in any rider or riders lettered and captioned attached hereto and made part hereof) the obligar above named, by subscribing hereto, hereby declares that he/she 1s firmly bound unto the United States in the sum of Twothousand dollars ($ 2000- (except that insofar as the bond is that the alien shall not become à public charge the obligor declares himself/herself bound in such amount or successive amounts as are prescribed in paragraph (3) herein) as liquidated damages and not as a penalty, which sum is to be paid to the United States Immediately upon failure to comply with the terms set forth in any such paragraph or rider. The obligor further agrees that any notice to him/her in connection with this bond may be accomplished by mail directed to him/her at the above address. If bond is furnished for more than one alien, the obligor adreas thatany references herein to allen In the singular sense shall be construed in the plural sense. The obligor acknowledges receipt of a copy of this executed\\bond and any attached rider or riders specified above. The burden of establishing compliance with the terms of the bond rests on the obligor. If this bond has been executed In consideration of the facts recited in paragraph (1) captioned \"Bond for Maintenance of Status and Departure of Non-immigrant Allen' and has been furnished for more than one alien, the amount due for each alien who falls to comply with the terms thereof shall be dollars ($. ), not to exceed the total sum of dollars ($ D. Signed and sealed in the presence of Name POWER FW 9003923 Date: march 27, 198# Name Address (Witness) Address (Witness) Far West Insurance Company By (SEAL) (Obligor) Attorney E. PLEDGE AND POWER OF ATTORNEY FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States Bonds/Notes described in the following schedule are hereby pledged as security for the performance and fulfillment of the foregoing undertaking in accordance with 6 U.S.C. 15, 31 CFR Part 225, and Treasury Department Circular 154 (Revised), dated October 31, 1969, and 1 the obligor named in this bond do hereby appoint the Attorney General of the United States as my attorney for me and in my name to collect or to sell, assign and transfer said United States bond or notes and I agree that in case of any default in the performance or any of the conditions herein to which I have subscribed, my said attorney shall have the power to collect said bonds/notes or any part hereof or to sell, assign, and transfer said bonds/notes or any part thereof, without notice, at public or private sale, free from equity of redemption and without appraisement or valuation, notice and right to redeem being waived, and to apply the proceeds In whole or In part to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best. COUPONS FACE INTEREST INTEREST TITLE OF BONDS/NOTES ATTACHED VALUE RATE SERIAL NO. DATES PLEDGE AND POWER OF ATTORNEY FOR USE WHEN CASH IS DEPOSITED AS SECURITY The amount of ($ ), cash money of the United States, is hereby pledged as security for the per- formance and fulfillment of the foregoing undertaking, and I, the obligor named In this bond, hereby appoint the Attorney General of the United States as my attorney for me and In my name to collect or to assign and transfer the said sum of money, and I agree that, In case of default in the performance of any of the conditions herein to which I have subscribed, my said attorney shall have full power to collect said sum of money or any part thereof or to assign and transfer said sum or any part thereof, without notice and to apply said sum or any part thereof to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best. I further empower my said attorney, In the event all the conditions herein to which I have subscrib- ed have been complied with and the bond is canceled, to deliver the said sum of money plus any Interest accrued thereon, to me at my risk and expense y such means as he/she shall select. IN WITNESS WHEREOF, I have hereunto set my hand and seal this day of 19 (SEAL) Before me, within the county of in the State of (or the District of Columbia), personally appeared the above named and acknowledged the execution of the foregoing power of attorney. Witness my hand this day of ,19 (Sig nature (Title) F. Bond approved and accepted (City) (State) 1-352 (Rev. 6-1-84)N WILL RESIDE: Same as alove prothe (District Director) 19"
}