{
  "anumber": "A28766477",
  "id": "A28766477_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 also have emphasized the formation of reserve and militia forces; currently, these units total some 79,000 men, of which over 27,000 are on active duty at any one time. Dozens of new military bases have been con- structed throughout Nicaragua, and the Sandinistas now have some 40 major garrisons and numerous smaller posts throughout the nation. Infantry. The EPS has formed 10 regular infantry battalions. A special airborne battalion was inaugurated in 1982. The following year, special counterinsurgency battalions (Batallon de Lucha Irregular-BLI) - were trained and equipped to engage anti-Sandinista forces. Units along Nicaragua's frontiers were organized as a special border guard force (Tropas Guarda Fronteras-TGF). The bulk of the Sandinistas' infantry forces consists of the roughly 160 reserve and militia bat- talions. These infantry units are equipped primarily with Soviet-bloc arms, such as the AK-47 assault rifle. Sandinista troops passing in review. The militarization of Nicaraguan society has led to the building of armed forces nearly half The Interior Ministry, which controls the Sandinista the size of those of Mexico, a country with more than 25 times the Police (Policia Sandinista- - PS) and the General Direc- population of Nicaragua. The Sandinistas now have an active duty torate of State Security (Direccion General de Seguridad force of 62,000 and total military/security forces of 119,000. del Estado - DGSE), the Sandinista secret police, has toward developing a combined arms capability, augment- direct command of its own brigade of 2,000 highly ing its conventional infantry forces with mechanized in- trained infantry troops (Tropas Pablo Ubeda). fantry, armored, and artillery brigades. The Sandinistas 06/00 04-00- < Puerto Cabezas Rosita Jalapa EL Ocotal SALVADOR RHI Somoto CARIBBEAN Esteli SEA Jinotega Somotillo Matagalpa Chinandega Corinto Leon LAGO DE MANAGUA Puerto Sandino MANAGUA Juigalpa PACIFIC OCEAN Masaya Bluefields Bluff Granada Diriamba LAGO DE NICARAGUA Rivas San Juan del Sur COSTA RICA NAUTICAL MILES 4"
}