{
	"anumber": "A28766477",
	"id": "A28766477_0083",
	"page_index": 83,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0083/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "photograph"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 SAN ANTONIO DE LOS BANOS AIRFIELD, CUBA a SOVIET NAVAL RECONNAISSANCE AIRCRAFT Soviet reconnaissance aircraft operate out of Cuba to fly missions along the Atlantic Coast of the United States. Nicaragua's Punta Huete runway is long enough to accommodate this type of aircraft, giving the Soviets a potential facility for reconnaissance flights along the Pacific Coast of the United States. United States in Central America, they hope to gain (1) Severance of Nicaraguan military and security greater freedom of action elsewhere. ties to Cuba and the Soviet bloc; The presence in Central America of a nation tied closely to the Soviet Union poses concrete military prob- (2) Reduction of Nicaragua's military strength to lems for the United States. Nicaragua has the potential levels that would restore military equilibrium in the area; for becoming a center for Soviet military and intelligence (3) An end to Nicaraguan support for guerrilla activities, as has Cuba. As noted above, the Soviets have groups in neighboring countries; and, already supplied the Sandinistas with four communica- (4) Fulfillment of original Sandinista promises to tions intercept facilities. When completed, the runway at support democratic pluralism and to respect human and Punta Huete will be able to accommodate any Soviet civil rights. military aircraft. Soviet reconnaissance planes flying out of Punta Huete would be able to fly missions along the U.S. Pacific Coast, just as they now reconnoiter the U.S. Atlantic Coast from Cuba. Soviet ships, including Only when Nicaragua frees itself of its military ties surface warships, submarines, and spy ships, could use to Communist states, reduces the size of its military to Nicaragua's Pacific ports, such as Corinto, just as they levels commensurate with its legitimate defense needs, now use Cuban ports when operating in the Caribbean. ceases to subvert its neighbors, and allows genuine The very potential for the Soviet military use of democracy and national reconciliation for its people can Nicaragua complicates U.S. defense planning, for in a peace prosper in the region. These same objectives are crisis situation the United States would be compelled to reflected in the 21 principles adopted in September 1983 divert resources to counter such possibilities. by the participants in the Contadora process, including Nicaragua. The United States has consistently made its Postscript position clear in frequent meetings with the Nicaraguan Government, and it has worked for the achievement of To promote lasting peace, economic development, and these objectives both directly in its bilateral discussions democracy in Central America, the United States policy with Nicaragua and by supporting the regional peace toward Nicaragua has four objectives: process. 40 U.S. GOVERNMENT PRINTING OFFICE : 1985 0 - 481-131"
}
