{
	"anumber": "A28755270",
	"id": "A28755270_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE-IMMIGRATION BOND CANCELLED, Form 1-391 (Rev.3(4-70)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 MIGRATION AND NATURALIZATION SERVICE Number A28 755 270 Date NOTICE-IMMIGRATION BOND CANCELLED 6-6-88 SUBJECT: o FAR WEST INSURANCE COMPANY IMMIGRATION BOND ID c/o GONZALES & GONZALES Receipt Number 9006056 L I 412 Co mercial st Date SEPTEMBER 17, 1987 LOS ANGELES, CA 900 12 Amount G $2,000.00 Alien's Name O RODRIGUEZ-VALENZUELA R LUISA The conditions of the above-described immigration bond have been fulfilled as to the above-named alien and you are no longer liable under such bond for this alien. The nature of the security accepted on the bond is checked below. If the security was in the form of U.S. Bonds or Notes or cash please comply with the pertinent instructions for the return of the security. SURETY BOND. UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY. The United Staces Bonds or Noces accepted on the above-described immigration bond, and a check for any undistributed inter- est paid thereon, will be made available for return to you when the office shown below is informed of your preference for its delivery. Accordingly, would you please check the appropriate items below, sign, and return this form. IT WILL NOT BE NEC- ESSARY FOR YOU TO APPEAR AT THIS OFFICE AT THIS TIME. YOU MAY MAIL THIS FORM TO THE BELOW ADDRESS. I prefer to receive my securities at the office shown below on a regular business day between the hours of 9 a.m. and 4 p.m. I understand that these securities will not be available in that office until after ten days from the date on which I mail this form. I understand also that it is necessary for me to surrender my \"Receipt of Immigration Officer-United States Bonds or Notes, or Cash, Accepted as Security on Immigration Bond\" (Form I-300 or Form I-305) before my securities may be released. It would be more convenient for me to receive my securities at the Immigration and Naturalization Service office located at: (City or Town. State) (Zip Code) (Street Address) I prefer to receive my securities by express (collect). and hereby authorize delivery in that manner. [ understand that it is necessary for me to surrender my \"Receipt of Immigration Officer-United States Bonds or Notes, or Cash. Accepted as Security on Immigration Bond\" (Form I-300 or Form I-305) before my securities may be released and accordingly this receipt is enclosed herewith. My address shown above is incorrect. The address to which the express company should deliver my securities is: (City or Town. State) (Zip Code) (Street Address) Date Signature of Obligor UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY, REDEEMED. The United Scares Bonds or Notes accepted on the above-described immigration bond were redeemed at macurity, or upon call, and converted 9 cash. Arrangement will be made for the return to you of the cash, pins any undistributed interest paid thereon. when the office shown below receives your \"Receipt of Immigration Officer-United Scates Bonds or Notes, or Cash, Accepted as Security on Immigration Bond\" (Form I-300 or Form I-305). Accordingly, please mail (Certified or Registered Mail is suggested) the above-mentioned receipt or bring it to that office on 3 regular business day between the hours of 9:00A.M. and 4:00P.M. Your security will be returned by a check which will be mailed to you as SOOO as possible after your receipt arrives. This notice will serve as your temporary receipt pending delivery of your check. Arrangement will be made for the return to you of the cash accepted on the above-described immigration bond, when the office CASH ACCEPTED AS SECURITY. below receives your \"Receipt of Immigration Officer-United Scaces Bonds or Notes, or Cash, Accepted as Security on Immigrac Bond\" (Form I-300 or Form I-305). Accordingly, please mail (Certified or Registered Mail is suggested) the above-mention will be receipt or bring is to that office on a regular business day between the hours of 9:00A.M. and 4:00P.M. Your security returned by 1 check which will be mailed to you as soon 35 possible after your receipt arrives. This notice will serve 15 your temporary receipt pending delivery of your check IMMOGRATION AND NATURALIZATION SERVICE Signature 300 N. LOS ANGELS ST., LOS ANGELS, CA 90012 Title DISTRICT DIRECTOR sam, Form I-391 (Rav.3-14-77).N"
}
