{
  "anumber": "A28766477",
  "id": "A28766477_0067",
  "page_index": 67,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766477_0067/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 BLUEFIELDS AIRFIELD NEW RUNWAY PAVED SEGMENT OLD RUNWAY Bluefields MANAGUA A new runway at Bluefields, more than one-third already paved. Soviet air warfare doctrine calls for aircraft to operate in a \"controlled air environment,\" that is to say, the aircraft are controlled by command elements on the ground which monitor their actions via radar. In 1983, the first Soviet-made Early Warning/Ground Control- Intercept (EW/GCI) facility in Nicaragua was assembled near Masaya. During 1984, additional radar sites were established at Toro Blanco and Esteli. Early in 1985, a fourth radar system was emplaced at San Juan del Sur. A temporary site at El Bluff has provided coverage of the Atlantic Coast as well. A coastal surveillance radar was emplaced at El Polvon in late 1984. The Sandinistas now have radar coverage over most of Nicaragua and can monitor aircraft movements deep into Honduras, El Salvador, and Costa Rica as well. There is no other comparable radar system anywhere in the region. The early warning capability of the radar net also is associated with the Sandinista air defense forces. As early as 1980, the Sandinistas began acquiring ZPU-4, ZU-23, and M-1939 antiaircraft guns and SA-7 surface- to-air missiles. The S-60, a 57-millimeter cannon with fire control radar, was added in 1984. Nearly 200 pieces of antiaircraft artillery and over 300 SA-7 missile Soviet-built radars give the Sandinistas a radar capability without equal in Central America. This system now covers most of Nicaragua and launchers now ring major installations. can monitor aircraft movements deep into neighboring countries. .24"
}