{
	"anumber": "A28766478",
	"id": "A28766478_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766478_0027/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Statistical Data, Form I-643 ( (10-31-81)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by Human Services OMB No. 1115-0104 Statistical Data Approval Expires 10/83 Immigration and Naturalization Service PLEASE PRINT OR TYPE - SEE INSTRUCTIONS ON REVERSE SIDE 1 Name SILVADE ROCHA, Andrea Pastois First (Given) Middle Date 4/14/89 A- 128766478 Last (Family) Alien Registration Number Country of Birth NICARAGUA Country of Citizenship Stateless 570-97-8975 Social Security Number Native Language Spanish Date of Birth 11-30-08 Month/Day/Year Current Address 238 Number and Street S. Reno St. #2, las City Angeles, State CA 90057 ZIP (213) 738-7485 Apartment No. Telephone Number My three (3) most recent cities of residence in the United States have been (list most recent first): 2 CITY OR TOWN STATE FROM TO month/year month/year las Angeles CA 12/85 PRESENT There are 6 members of my household, 2 of whom are employed. They are (please use another sheet if needed): Number Number 3 NAME RELATIONSHIP SEX DATE OF COUNTRY ALIEN CURRENTLY ATTENDING TO ME M/F BIRTH OF BIRTH NUMBER EMPLOYED? SCHOOL? mo/da/yr yes no yes no (SELF) (SELF) F ROCHA Carlos Spouse M 4.11.02 NICARAGUA A28766477 ROCHA Roger Son M 3-29-32 NICARAGUA FOIA (b)(6) ROCHA Nubia F 1-1-42 NICARAGUA Unk FOIA (b)(6) My employment since entering the United States has been (list most recent first): LOCATION DATES WAGE CHECK ONE: COMPANY NAME CITY, STATE FROM TO JOB TITLE PER PART FULL mo/yr mo/yr HOUR TIME TIME NONE N/A My major occupation or profession before coming to the U.S. was: My education before coming to the United States was (check all that apply): 5 Grades 1-8 Technical school Some university Graduate studies Some high school Technical school certificate University diploma Professional training High school diploma Graduate degree My knowledge of English was acquired by (check all that apply): Training in the U.S. Training in another country Training in refugee camp Use in the U.S. Use in another country Other (please explain): none I have had the following training or education in the U.S. (check all that apply): My English ability is (check one): TYPE OF SCHOOL COURSE OF STUDY CHECK IF CHECK IF STILL ATTENDING COMPLETED 7 None High school A few words College None Fair Technical/Vocational Good Other (specify): Since in the United States, I have received the following public assistance in my own name: 8 FROM TO month/year month/year Cash assistance (welfare) Food stamps SSI (gold check) Medical assistance 1988 Present Other (specify): Form I-643 (10-31-81)"
}
