{
	"anumber": "A28767853",
	"id": "A28767853_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28767853_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, Form 1-48"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Form approved. Budget Bureau No. 43-R343. No. AFFIDAVIT OF WITNESS IN THE MATTER OF THE APPLICATION OF FELICITAS FERNANDEZ File No. AFFIDAVIT REYNAL DO FLORES : A 8 595 300 CEMENTERY EMPLOYEE , occupation residing at 449 NORTH RECORD AVE. LOS ANGELES, CA. 90063 (Number and street) (City or town) (State) (ZIP Code) being duly sworn, deposes and says that (s)he is not is not a citizen of the United States of America; that (s) )he has personally known and has been acquainted in the United States with FELICITAS FERNANDEZ , the applicant above mentioned; that to his her personal knowledge the applicant has resided in the United States as follows: L'OS ANGELES, CAL IFORNIA from 1968 (City, town. and State) to PRESENT (Month) (Year) (Month) (Year) (City. town. and State) from to (Month) (Year) (Month) (Year) (City, town. and State) from to (Month) (Year) (Month) (Year) (City. town, and State) from to (Month) (Year) (Month) (Year) that (s)he is able to determine the date of the beginning of his her acquaintance with the applicant in the United States from the following (act(s): SHE WAS OUR NEIGHBOR AND LATER THE SITTER TO MY SON WHO IS NOW 22 YEARS OLD. ; that (s) he has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is -0- -0- (Years) (Months) OFFICIAL SEAL MARY E HORTA NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY My comm. expires NOV 16, 1987 REYNALDO FLORES (Signature of witness) Subscribed and sworn to before me by the above-named witness at LOS ANGELES, CALIFORNIA this 26 day of JUNE 19 87 Form 1-488 male E Hita UNITED STATES DEPARTMENT OF JUSTICE (Signature of attestor) Immigration and Naturalization Service"
}
