{
  "anumber": "A28766478",
  "id": "A28766478_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28766478_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 INSTRUCTIONS TO THE APPLICANT-PLEASE TYPE OR PRINT PLAINLY This form is to be completed in full by persons aged 16 and over. Younger persons should complete Blocks 1 and 2 only. The information requested on this form is to be used by the Department of Health and Human Services for statistical pur- poses only. The form will not be retained by the Immigration and Naturalization Service. BLOCK 1 Enter your name, the date on which you are completing this form, and your alien registration number on the first line. On the second line, enter your country of birth, your country of citizenship, and your social security number. On the third line, indicate your native language and your date of birth. Enter your current address and telephone number on the fourth line. BLOCK 2 Fill in your three (3) most recent cities and states of residence in the U.S. in order, starting with your current place of residence. If you have not lived in three (3) different cities since you entered the U.S., write \"none\" on as many lines as appropriate. BLOCK 3 Show the total number of people living in your household and the number of them currently employed. Fill in the first line for yourself, then list any other persons who live in your household. If more than five (5) persons live with you, please attach a separate page listing the others and giving the information requested. BLOCK 4 Enter the information about all jobs you have held since coming to the U.S., starting with your current or most recent job. Under \"job title,\" write the term that best describes the work you do, such as \"machine operator,\" \"nurse,\" or \"chemist.\" If you have not worked at all since coming to the U.S., write \"none.\" At the bottom of the block, enter your major occu- pation before coming to the U.S. If you did not work before coming to the U.S., enter \"none.\" BLOCK 5 Check the block or blocks that best describe your education before coming to the U.S. Also, please check the block or blocks that best describe how and where you have learned English. BLOCK 6 If you have had any training or education in the U.S., check the block or blocks that best describe your training and enter your major course of study. If you have had no training in the U.S., enter \"none.\" BLOCK 7 Check the block that best describes your ability to use English. BLOCK 8 Check as many types of public assistance as you have received in your own name, as the principal applicant. Indicate the month and year the assistance started and stopped. If you are still receiving assistance, write \"present\" in the block headed \"TO-month/year.\" TO THE IMMIGRATION AND NATURALIZATION SERVICE After checking this form to be sure it has been properly completed, forward it directly to the address below. (If you are mailing a small number of forms, they may be folded so the address shows through a # 20 window envelope.) Data Analysis Unit Office of Refugee Resettlement DEPARTMENT OF HEALTH & HUMAN SERVICES Room 1229 - Switzer Building 330 C Street, S.W. Washington, D.C. 20201"
}