{
	"anumber": "A28755270",
	"id": "A28755270_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28755270_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FEDERAL BUREAU OF INVESTIGATION, UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 YES NO INSTRUCTIONS PALM PRINTS TAKEN? 1. UNLESS OTHERWISE PROVIDED BY REGULATION IN YOUR STATE, FINGERPRINTS ARE TO BE SUBMITTED DIRECTLY TO FBI IDENTIFICATION DIVISION. FORWARD IMMEDI- YES NO ATELY FOR MOST EFFECTIVE SERVICE. PHOTO AVAILABLE? 2. FINGERPRINTS SHOULD BE SUBMITTED BY ARRESTING AGENCY ONLY (MULTIPLE PRINTS ON SAME CHARGE SHOULD NOT BE SUBMITTED BY OTHER AGENCIES SUCH AS JAILS, RECEIVING AGENCIES ETC.) REQUESTS COPIES OF FBI IDENTIFICATION RECORD IF ARREST FINGERPRINTS SENT FBI PREVIOUSLY AND FBI NO. UNKNOWN, FOR ALL OTHER INTERESTED AGENCIES IN BLOCK BELOW. GIVE COMPLETE MAILING FURNISH ARREST NO. ADDRESS INCLUDING ZIP CODE. DATE 3. TYPE OR PRINT ALL INFORMATION 4. NOTE AMPUTATIONS IN PROPER FINGER BLOCKS. STATUTE CITATION (SEE INSTRUCTIONS NO. 9) CIT 5. LIST FINAL DISPOSITION IN BLOCK ON FRONT SIDE. IF NOT NOW AVAILABLE SUBMIT 1. 8 use 1251 LATER ON FBI FORM R-84 FOR COMPLETION OF RECORD. IF FINAL DISPOSITION NOT AVAILABLE SHOW PRE-TRIAL OR ARRESTING AGENCY DISPOSITION e.g., RELEASED NO FORMAL CHARGE. BAIL, TURNED OVER TO. IN THE ARREST DISPOSITION BLOCK 2. PROVIDED ON THIS SIDE. 6. MAKE CERTAIN ALL IMPRESSIONS ARE LEGIBLE, FULLY ROLLED AND CLASSIFIABLE 3. 7. CAUTION - CHECK BOX ON FRONT IF CAUTION STATEMENT INDICATED. BASIS FOR CAUTION (ICO) MUST GIVE REASON FOR CAUTION, e.g., ARMED AND DANGEROUS, ARREST DISPOSITION (SEE INSTRUCTION NO. 5) ADN SUICIDAL, ETC. WA/OSC 8. MISCELLANEOUS NUMBER (MNU) . SHOULD INCLUDE SUCH NUMBERS AS MILITARY 9/16/07 SERVICE, PASSPORT AND/OR VETERANS ADMINISTRATION (IDENTIFY TYPE OF NUM. BER.) 9. PROVIDE STATUTE CITATION, IDENTIFYING SPECIFIC STATUTE (example . PL for PENAL EMPLOYER: IF U.S. GOVERNMENT INDICATE SPECIFIC AGENCY LAW) AND CRIMINAL CODE CITATION INCLUDING ANY SUB-SECTIONS. IF MILITARY LIST BRANCH OF SERVICE AND SERIAL NO. 10. ALL INFORMATION REQUESTED IS ESSENTIAL 11. PRIVACY ACT OF 1974 (P.L. 93-579) REQUIRES THAT FEDERAL, STATE, OR LOCAL AGENCIES INFORM INDIVIDUALS WHOSE SOCIAL SECURITY NUMBER IS REQUESTED WHETHER SUCH DISCLOSURE IS MANDATORY OR VOLUNTARY, BASIS OF AUTHORITY OCCUPATION FOR SUCH SOLICITATION AND USES WHICH WILL BE MADE OF IT. Domestic REPLY DESIRED? YES NO RESIDENCE OF PERSON FINGERPRINTED civdad Delgado (REPLY WILL BE SENT IN ALL CASES IF SUBJECT FOUND TO BE WANTED) IF COLLECT WIRE OR COLLECT TELEPHONE REPLY DESIRED El Salvador INDICATE HERE: (WIRE SENT ON ALL UNKNOWN DECEASED) WIRE REPLY TELEPHONE REPLY TELEPHONE NO. AND AREA CODE SCARS, MARKS, TATTOOS, AND AMPUTATIONS SMT SEND COPY TO: NAME ORI NUMBER AND ADDRESS None BASIS FOR CAUTION ICO DATE OF OFFENSE DOO SKIN TONE SKN 9-16-87 Med. MISC. NO MNU ADDITIONAL INFORMATION LEAVE BLANK FD-249 (REV. 12-29-82) U.S. G.P.O. 1986-496-936"
}
