{
	"anumber": "A28700722",
	"id": "A28700722_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28700722_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support, Form I-1344 ( (Rev. 12-1-84) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1980, 2023, 1943]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/2/2023 0-28-700-722 OMB No. 1115-0062 Expires 12/86 U. S. Department of Justice Immigration and Naturalization Service Affidavit of Support (ANSWER ALL ITEMS: FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) MANJIT SINGH DUA 19460 SHERMAN WAY I, residing at (Name) (Street and Number) RESEDA CA 91335 U.S.A. (City) (State) (ZIP Code if in U.S.) (Country) BEING DULY SWORN DEPOSE AND SAY: FEB. 8, 1943 KANPUR 1. I was born on INDIA at (Date) (City) (Country) If you are not a native born United States citizen, answer the following as appropriate: a. If a United States citizen through naturalization, give certificate of naturalization number 12768744 b. If a United States citizen through parent(s) or marriage, give citizenship certificate number C. If United States citizenship was derived by some other method, attach a statement of explanation. d. If a lawfully admitted permanent resident of the United States, give \"A\" number 2. That I am 44 years of age and have resided in the United States since (date) SEPTEMBER, 1. 1980 3. That this affidavit is executed in behalf of the following person: Name Sex Age SANT SINGH DUA M 73 YRS. Citizen of--(Country) Marital Status Relationship to Deponent INDIA MARRIED FATHER Presently resides at--(Street and Number) (City) (State) (Country) 19460 SHERMAN WAY, RESEDA CA U.S.A. Name of spouse and children accompanying or following to join person: NONE Spouse Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age 4. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become a public charge in the United States. 5. That I am willing and able to receive, maintain and support the person(s) named in item 3. That I am ready and willing to deposit a bond, if necessary, to guarantee that such person(s) will not become a public charge during his or her stay in the United States, or to guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior to the expiration of his or her authorized stay in the United States. 6. That Funderstand this affidavit will be binding upon me for a period of three (3) years after entry of the person(s) named in item 3 and that the information and documentation provided by me may be made available to the Secretary of Health and Human Services and the Secretary of Agriculture, who may make it available to a public assistance agency. ASSY. PLANNER 7 That I am employed as, or engaged in the business of with DOUGLAS AIRCRAFTCO. (Type of Business) (Name of concern) 3855 LAKEWOOD BLVD., LONG BEACH CA 90846 at (Street and Number) (City) (State) (Zip Code) Fderive an annual income of (if self-employed, I have attached a copy of my last income tax return or report of commercial rating concern which I certify to he true and correct to the best of m knowledge and belief. See instruction for nature of evidence of net worth to be submitted.) $ 30,500 I have on deposit in savings banks in the United States $ 18,000 I have other personal property, the reasonable value of which is $ 20,000 Form 1-134 (Rev. 12-1-84) Y OVER"
}
