{
  "anumber": "A28743491",
  "id": "A28743491_0079",
  "page_index": 79,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28743491_0079/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, 181 (Rev.3-1-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/23/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A 28 743 491 Status as a lawful permanent resident of the United States is accorded: 943 4374 NA Sex 1 Male Date of Birth (Month/Day/Year) Name Jaswant SINGH In Care Of 2 3115 Fish Canyon Female 04-17-97 Street City of Birth Country of Birth Duarte, CA 91010 Address Mullan Pakistan Apt. No. Country of Nationality Country of Last Residence City, State, Zip India India Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) Widowed 4 Divorced 5 Separated UNR B-2 79 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) NA NA NA Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Thakur Labor Certification Applicable Bhagwan Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification New Delhi 08-01-79 001006 of Last NIV B-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session XSec. 245 of the I & N Act Sec. 214 (d) of the I & N Act As of 08 15 88 at LOS (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE IRO 3 Class of admission (Insert Symbol) REMARKS APPROVED INS DISTRICT DIRECTOR RECOMMENDED BY: (Immigration Officer) (Date) Graning IE DATE OF ACTION AUG 15 1988 DD 2810 04-08-88 lik FOR USE BY VISA CONTROL OFFICE DISTRICT Ramage Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I- 181 n.3-1-83) N 1. FILE COPY"
}