{
	"anumber": "A28813252",
	"id": "A28813252_0061",
	"page_index": 61,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28813252_0061/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF REGISTRY OF MARRIAGE, 474"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 CERTIFICATE OF REGISTRY OF MARRIAGE 2474 PERSONAL DATA LICENSE TO MARRY. CERTIFICATION OF MARRIAGE A NAME OF GROOM MIDDLE NAME lic LAST NAME 2 BIRTH .... GEORGE CARL SODERLUND 6/13/26 5 3 AGE SIGNATURE 4 NUMBER OF THIS MARRIAGE TIMPLACE 5a DATE LAST MARRIAGE ENDED 53 LAST MARRIAGE INDED ST 48 YEARS 1 - California GROOM 17a CITY CR TOWN ONTY 7s RESIDENCE OF GROOM STREET ADDRESS PERSONAL 1958 Monon St. Los Angeles Los Angeles DATA 9a PRESENT OR LAST OCCUPATION 8a KIND OF INDUSTRY OR BUSINESS HIGHEST SCHOOL GRADE COMPLETED Boat Captain Sport fishing 13 O NAME OF FATHER OF GROOM 110e BIRTHPLACE OF FATHER 11a MAIDEN NAME OF MOTHER OF GROCM BIRTHPLACE OF MOTHER Carl Soderlund Illinois Meta Zepf Delaware 124 NAME OF BRIDE-FIRST NAME 1.2g MIDDLE NAME 12c LAST NAME 13 DATE OF BIRTH EVA ROSARIO CEVALLOS 9/30/36 14 AGE 15 NUMBER OF THIS MARRIAGE 17 BIRTHPLACE 16a 0 116a ENDED BY 37 2 4/27/71 Divorce Honduras, C.A. EARS BRIDE 18. RESIDENCE OF BRIDE STREET ADDRESS 18a CITY OR TOWN BC COUNTY PERSONAL Los Angeles DATA 6407 Maryland Dr. Los Angeles 19a PRESENT OR LAST OCCUPATION 1194 KIND OF INDUSTRY OR BUSINESS 20 HIGHEST SCHOOL GRADE COMPLETED|2! MAICEN NAME OF BRIDE Nursing care Private 14 Cavallos 122a BIRTHPLACE OF FATHER 23a MAIDEN NAME OF MOTHER OF BRIDE WOTHER Antonio Zuniga Honduras, C. Victorina Cevallos Honduras, C.A. AFFIDAVIT THAT to LEGAL OBJECTION TO THE MARRIACE NOR TO THE ISSUANCE OF LICENSE TO AUTHORIZE THE 5 KNOWN to AND HEARS APPLY LICENSE MISRO TIME SECURITY COUNTY 22a NAME OF FATHER OF BRIDS 23g NE THE SHIDE AND BROOM NAMED IN time CERTIFICATE EACH FOR HIMSELF STATE THAT THE FORESOING INFORMATION is CORRECT TO THE BEST OF O.R SONGEDGE AND BRUEF OF BRIDE 244 BRICE AND GROOM SIGNATURE End Korevio 124a GROOM SIGNATURE Carl Soliliand Heavy AUTHORIZATION AND LICENSE is HEREBY GIVEN to ANY PERSON CITY AUTHORIZED BY THE LAWS OF THE STATE OF CALIFORNIA to PER SITHIN THE STATE of ALIFORNIA TO SOLEMNIZE THE MARRIAGE OF THE ABOVE NAMED PERSONS RECURED CONSENTS FOR THE ISSUANCE OF ans LICENSE 5t SUBSCRIBED AND SWORN 258 DATE LICENSE ISSUED 25c LICENSE NUMBER 250 COUNTY CLERK 10 BEFORE MF ON TO MARRY 9/18/74 1339 ROBERT L. HAMM 9/18/74 25 EXPIRATION DATE 125 COUNTY OF ISSUE OF LICENSE 12/17/74 Ventura 1s : SIGNATURE OF WITNESS 120a ADDRESS OF WITNESS STREET ADDRESS 126 MINE South Mater Namine Rise 4519w HOLLY DHX. ARIZ WITNESSES 2/4 SIGNATURE WITNESS 27e ADDRESS OF WONESS STREET ADDRESS ADDRESS OF WITNESS City TOWN 190 STATE 23 HERLEY CERTIFY THAT THE ABOVE NAMED PRIDE AND GROOM WERE SMIC MARANGE AC ANCE WITH THE LISS OF THE STATE or CALORIA CERTIFICATION OF PERSON Sep 21 76 29a SIGNA PERSON TERR NG CEREMONY AND Junge OCIAL TITLE PERFORMING BURTHENSON CEREMONY Venture ADDRESS AT 501 PLL, VENTURA CA 10 DAIF ACCEPTED FOR REGISTRATION COUNTY RECORD Vept 24 1974"
}
