{
	"anumber": "A28813252",
	"id": "A28813252_0060",
	"page_index": 60,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28813252_0060/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACIÓN DE ACTA DE NACIMIENTO, 001"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1936, 1955]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 REPUBLICA DE HONDUR TRIBUNAL NACIONAL DE ELECCIONES REGISTRO NACIONAL DE LAS PERSONAS DIVISION DE: REGISTRO CIVIL RNP CERTIFICACION DE ACTA DE NACIMIENTO El Infrascrito Registrador Civil Municipal CERTIFICA que en el Archivo de Nacimientos que se tiene en esta oficina; se encuentra el acta de nacimiento número: o 8 0 1 55 05 05 5 ubicada en el folio 348 del Tomo 302 Número de Identidad del Año 1955 y que pertenece a. a.) CEVALLOS b.- ZUNIGA Primer apellido Segundo apellido c.-) EVA ROSARIO SEXO F X M Nombre y cuya información sobresaliente es la siguente: 1.-) Lugar, fecha y orden de nacimiento s.-) DISTRITO CENTRAL b.-) FRANCISCO MORAZAN c.-) HONDURAS Municipio Departamento Pais ch.-) TREINTA d ) SEPTIEMBRE e) 1936 f.-) Die Mes Año Orden en Parto Múltiple 2.-) Apellidos, nombre y nacionalidad del padre: a.) ZUNIGA b.-) Primer apellido Segundo apellido c.-) ANTONIO HONDURENA ch.-) Nombre Nacionalidad 3.) Apellidos, nombre y nacionalidad de la madre: a.) CEVALLOS b.-) Primer apellido Segundo apellido c.-) VICTORIA HONDURENA ch.-) Nombre Nacionalidad 4.-) Notas marginales autorizadas: REPOSICON DE PARTIDA DE NACIMIENTO, JUZGADO SEGUNDO DE LETRAS DE LO CIVIL, FRANCISCO MORAZAN, VEINTISIETE DE OCTUBRE DE MIL NOVECIENTOS CINCUENTA Y CINCO- Extendida en DISTRITO CENTRAL FRANCISCO MORAZAN Municipio Departamento TRECE MAYO a los: días del mes de de mil novecientos OCHENTA Y SEIS utily that I have compared this copy CHARTIZZA OFICINA DE LAS original, and that it is a true and complete A DASTELLA Data Note Esto certificación se PHILIP J. KARLIN, Attorney at law District Central 015 So. Flower St., Los Angeles, 8955 extenderá gratuitamente Firma: Set del BIRTH Municipal to Practice in the State of California sólo para solicitar tarjeto Group Honeures FORMA 02-02-03 de Identidad"
}
