{
  "anumber": "A28813252",
  "id": "A28813252_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28813252_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, A28 813 252"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A28 813 252 Status as a lawful permanent resident of the United States is accorded: Sex 1 Male Date of Birth (Month/Day/Year) Name In Care Of Maria Victoria CEVALLOS-Rodriguez 2 Female 10-22-12 Street 957 Leonard Place City of Birth Country of Birth Address Los Angeles, CA 90022 Yoro, Yoro Honduras Apt. No. Country of Nationality Country of Last Residence City, State, Zip Honduras Honduras Marital Status 1 XSingle 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) 3 Widowed 4 Divorced 5 Separated UNR B-2 82 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) NA NA NA Section 212 (a) (14) 342 Not Mother's First Name Father's First Name 1 Applicable-Submitted Labor Certification Applicable Maria Maxima Antonio Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification Tegucigalpa 10-28-82 059658 of Last NIV B2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session X Sec. 245 of the I& N Act Sec. 214 (d) of the I & N Act 9 As of 13 88 of LOS (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert Symhol) IRO $3 Admitted until 3/14/81 REMARKS RECOMMENDED BY: (Immigration Officer) (Date) APPROVED I.N.S DISTRICT DIRECTOR Chimp f3 Review 9-13-88 DATE OF ACTION SEP 13 1988 DD 6-18-88 c1 Recommended PB Reindon DISTRICT FOR USE BY VISA CONTROL OFFICE LOS 2882 Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I. 181 (Rev.3-1-83) N 1. FILE COPY"
}