{
	"anumber": "A28952345",
	"id": "A28952345_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28952345_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, 1115-0054"
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 ree Stamp DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp FEE PAID No. A# 28 952 345 G-28 or Volag# EB IMMIGRATION & NATURALIZATION SERVICE LOS ANGELES, CA. DATE 04 1988 VERIFIED Section of Law: 201 (b) spouse 03 (a)(1) Petition was filed on (priority date) 201 (b) child 203 (a)(2) SEP 26 1988 Personal Interview Previously Forwarded Ben. 'A'' File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) L05/X15 mppnd Pet Field Investigations I-485 Simultaneously Recommended by: 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: LOS | 2759 REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) CHUSSAN ALTA (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) - BIBI AISHA 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 1320Q ANDY St, CERRITOS CA090701 13209 ANDY st (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/ /Postal Code) CERRITOS CAL 90701 CERRITOS, CAL 90701 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or RAWALPINDI-PAKISTAN City) (State/Country) 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 01-18-39 Female Widowed Divorced 5-31-11 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) N.A NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 12-28-85 RAWALINDI PARKSTAN N.A. 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) NONE N.A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended LINDA 26.85 nd returned. Certified a true and correct copy caternot# 9566291 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Contact Representative, Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued VISITOR 9-9-87 9566291-09-28-73 Los ANGELES Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents CAL 3161 9/1/15700 Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued MAR 08,88 15. Name and address of present employer (if any) N.A. Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N.A. and class of admission: 16. Has your relative ever been under immigration proceedings? N.A Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? No INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED GAC Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N FEB 04"
}
