{
  "anumber": "A28974891",
  "id": "A28974891_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28974891_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, 1115-0054"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO N WRITE IN THIS BLOCK - FOR EXAMINING OFFIC NLY Case ID# Action Stamp Fee Stamp A# 28974891 APPROVED G-28 or Volag # I.N.S DISTRICT DIRECTOR Section of Law: 201 (b) spouse NOV 28 1988 Petition was filed on 3-2888 203 (a)(1) (priority date) 201 (b) child 203 (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Cottle Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Recommended by Field Investigations I-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: LOS 2766 REMARKS: A. Relationship 1. The alien relative is my: and 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife x Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) SAUND GURMEET KAUR BHOGAL BIR SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 18227ELK WOOD ST 18227E2K WOOD ST (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) State/Country) (ZIP/Postal Code) RESEDA CA 91335 RESEDA CA 91335 3. Place of Birth (Town or City) State/Country) 3. Place of Birth (Town or City) (State/Country) PHARWALA RUNJAB INDIA LYALLPUR PAKISTAN 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 5.13.37 Female Widowed Divorced 3.51903 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) BHOGAL 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 2912FEB1956 PHARWALA INDIA 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended SAWARN SINCH SAUND and returned. Certified a true and correct copy. WATZ SAR H. 1.12.3037 13. If you are a U.S. citizen, complete the followin 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Contact Representative, USINS Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued (VISIOR NO. 10111335 MARCH 41h 77 LOSANCELES Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents City FOIA (b)(6) 244 68360700 Jun 26-1987 Have you obtained a cer uncale or ⑉ your Dateauthorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No \"Yes,\" give number of certificate, date and place it was issued 25th Dee 1987 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/R and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes Deportation Rescission States citizen or lawful permanent resident? No Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec' Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}