{
	"anumber": "A29089715",
	"id": "A29089715_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print asut0220 FOR INS USE ONLY Returned Part 1. Information about you. Receipt Family ROMERO Given Name MARIA Middle Name Initial T. U.S. Mailing Address Care of The North Robinson Ave, Newburgh, NY. Apt. 12550 Resubmitted Street Number and Name 214 RENWICK St # 1 City County NEWBURGH ORANGE State ZIP NEW YORK Code 12550 Reloc Sent Date of Birth Country (month/day/year) 09-01-07 of Birth HONDURAS Social A Security # 063-76-4330 # 29089715 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview C. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. no arc A0282 07-27-89 N.Y.C. 3-24-97 Citizenship 9 00 noFf over 75 Honduran Name Ort CaherPregistration card (if different than in Part 1) so WW PH 31. Rx, 10/2/98 Other names used since you became a permanent resident (including maiden name) OF I Sex of Male Height Marital Status: Single Divorced 5'4\" with CIN speak Female Married Widowed ENG. At. ALL Can you speak read and write English ? No Yes. Action Absences from the U.S.es Have you been absent from the U.S. since becoming a permanent resident? No Yes Denigo If you answered \"Yes\" complete the following Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. 11/19/27 Did absence last we Date left U.S. Date returned 6 months or more? Destination Reason for trip 01/30/96 2/28/96 Yes No Handuras vacation 07/01/96 08/10/96 Yes No Honduras Vacation To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev 07/17/91)N Continued on back."
}
