{
  "anumber": "A29030253",
  "id": "A29030253_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29030253_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 922/2023 Immigrati- US Tmmi and Naturalization Service ion & Naturalization Service 68 Court Street Buffalo, NY 14202 NAME OF BENEFICIARY NAME AND ADDRESS OF APPLICANT/PETITIONER CHHIBBER, Krishna Swaraj K. Datta CHHIBBER, Satparkashraj 67 Brightwoods Lane Apt. 67 Rochester, New York 14623 103-910 DATE 3/25/88 FILE NO. A35- FORM NO. I-130 PLEASE COMPLY WITH THE BELOW CHECKED X INSTRUCTIONS. 1. The above application/petition and its supporting documents are attached. 3. 2. The above application/petition and its supporting documents have been forwarded to your attorney or representative. Please complete the blocks on your enclosed application/petition which are checked in red. 4. Please follow the Instructions on your enclosed application/petition which are checked 5. Furnish the required fee of $ in red. 6. Furnish the birth or baptismal certificate of XX Yourself in the original 7. Furnish the marriage certificate of (see below) Your parents in the original. 8. Furnish proof of death or legal termination of marriage of (see below) 9. A competent foreign document to translate must and be that accompanied the by a translation in English. The translator must certify that he/she is translation is accurate. 10. vehicle Furnish on the which date you and traveled. port of each of your entries into the United States and the name of the ship, plane, or other 11. certification Except for aliens from with occupations listed under Schedule A. 20 Code of Federal to this Service. Further the Secretary of Labor must be obtained before your petition application Regulations, Part 656.10, a local office of the state employment information service and Department agencies. of Labor forms and instructions or may be may obtained be resubmitted from the 12. You funds have or other indicated means that of maintaining you do not intend yourself to in seek this employment. country. You must furnish evidence that you have sufficient 13. retouched, Furnish two and (2) not color mounted. photographs. These photos must have a white background. photos must shown in 3/4 frontal Dimension of the facial image should be about 1 inch from be glossy, un- photographer who takes the pictures. if known) on the back of each photograph. You should or show pen, these print instructions name (and to alien the registration receipt view number, of right side of face with right ear visible. Using soft pencil felt chin to top of hair or head, 15. 14. Your You may now apply for adjustment of status, on the attached forms, for yourself and the below listed and will proof be completed of status documents in the near future. have been checked and are attached. Your application/petition is being persons. processed 16. You are granted additional time until present evidence in rebuttal to the proposed visa petition revocation to submit or denial. a brief in support of your appeal, or to 17. If the above requested documents are not available then you not affadavits. be These affadavits must containn certain information may and submit are not submitted by immediate relatives. The affadavits you have may affadavits acceptable. Please note the attached instruction sheet concerning submitted and other acceptable documents. FORM 1-72 (REV 4-1-83) PLEASE RETURN THIS LETTER AND ALL ATTACHMENTS WITH YOUR RESPONSE"
}