{
	"anumber": "A29089715",
	"id": "A29089715_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACIÓN, Nº 244614"
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1979, 1908, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 CERTIFICACION PRIMERA CLASE CINCUENTA CENTAVOS 1976-1979 No 244614 1 W1 infraserite Secretario Municipal y encargado del registre civil 2 CERTIFICA: Que a folie 23 del libre de naeimientos cerrespendien- te a les alles de 1907 a 1908 se encuentra la tartida denacimiente 3 ue textualmente dice: MARIA TRANCITO ROMERO. 4 on Lauterique a las doce del dia lunes des de \"eatienbre de mil - 5 novecientes siete ante mi Isidre P. Eómez Seeretarie Municipal y an 6 to de les testigos den Gerbacio @ Nuñez y Rosa M Peres, mayeres de GENERAL edad, solteres. labradores hendureñes y de este demitilie. envarecie Julian Homere de cuarenta y eince años de edad, cade, labrador hen- dureñe natural de Caridad y de este vecindarie ; dando cuenta de oue ADUANAS el dia Deminge primere del presente y en su casa de can on acie - una niña a ouien se le use per menbre Maria Transite Remero es - 12 CENTRA hija legitima del declarante y Maria Santos Alvarado de treinta y since añes de edad, easada cesturera hendureta native de este cueble \"on abueles paternes legitimes de la recien nacida Bartelo Honere 15 Petrona \"aldenado y maternos tanbien legitimos Fueerie Alvera- de difunta y Bruna Gale cesturera Todos hondureños nat turales are THOU la Villa de Caridad, Loi le escrito al cenvareciente y meontran- 19 dele conforme con su manifestación no firma ear no saber. Rosa M Peres.- Gerbacio G Sónez.-Solle y firma Isidro P &Sues eeretarie 20 21 Municipal. - *s conferme con su original - \"xtendida la presente in lauterique a 31 de Julio de 1976. 22 23 Maximine Muñez y Jusee rie Meal. 24 25 Davin Aigere Gomez alcali Moal."
}
