{
  "anumber": "A29089715",
  "id": "A29089715_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRANSLATION CERTIFICATION"
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1908,
        1989,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 TRANSLATION CERTIFICATION The undersigned clerk in charge of the OFFICE OF THE REGISTRAR OF VITAL STATISTICS CERTIFIES: That at folio 23 of records of births for the years 1907 and 1908 it is recorded as follows: MARIA TRANCITO ROMERO In Lauterique at 12 o'clock on Monday, September 2, 1907 before me Isidre P. Gomez, Municipal Clerk and before the witnesses Gerbacio G. Nunez and Rosa M. Peres, adults, single, laborers, Hondurans and domiciled in this community appeared Julian Romero, 45 years of age native of Caridad and residing in this community who declared that on Sunday past (September 1, 1907) there was born in his house a female child who was given the name of Maria Trancito Romero, legitimate daughter of the declarant and Maria Santos Alvarado, 35 years of age, seamstress, Honduran, a native of this community. The paternal grandparents are: Bartolo Romero and Potrena Maldeonado and maternal grandparents are Eucevio Alvarado, deceased, and Bruna Galo, seamstresss, Honduran, of Villa de Caridad. The foregoing document was read to the parties finding it to conform with their declaration. Rosa M. Peres did not sign, does not read or write. signed by Gerbacio G. Gomez- sealed and signed by Isidro P. Gomes, Clerk. A true copy of the original. Issued in Lauterique on July 31, 1976. Signed Maximino Nunez and Nunez and Rigoberto Gomez Moreno, deputy clerk I the undersigned, an attorney in this state affirm that I am familiar with and have knowledge of both English and Spanish languages and that the foregoing is a true and complete English translation of the original in Spanish. april 18, 1989 Vincent Sunni Vincent Geraci"
}