{
  "anumber": "A29030253",
  "id": "A29030253_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29030253_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Marriage, Schedule D"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023,
        1946
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 922/2023 schedule D Certificate: of Marriage: (court of the Registrar of Marriage-cum-Tehsildar, Khanna, District Ludhiana (Punjab-India) FORM OF EXTRACT FROM HINDU MARRIAGE ACT (See rule 10). 1. Name of Applicant: Mehta sat Parkash chhibber 2. Date on which application 1989. for registration was made: 3. Date of Marriage: 6.7.1946. 4. place of Marriage: Gujrat (Pakistan) Particulars of particulars O: Bridegroom: the Bride: 1. Name: Mehta Sat Parkash Krishna chhibber. chhibber 2. Father's Name: Mehta Jamiat Rai Mehta Jaswant Rai chhibber datta. 3 Usual place purani sarai, Gujrat (Pakistan) of residence: Khanna, Dist. Ludhiana 4. Full address: Purani sarai, Purani Sarai, Khanna, Dist Ludhiana Khanna, Dist. Ludhiana. (Punjab-India) (Punjab-India) 5. Age at the time of marriage: 39 yrs. 26 yrs. 6. Civil condition at the time of marriage un-married un-married. whether un-married widow, di vorcee. Registered at Sr.No. 88 Dt. 20 3-1989 at Khanna, District Ludhiana (Punjab-Indi a) John Khanna Register Dated: 20/3/89 Registrar Marriages, Khanna. Certified that the above which contains entries from Sr.No.1 to 4 regarding the marriage and Sr.No.1 to 6 regarding the bride and bridegroom is true extract of all-entries in the Hindu Marriage Act Register Dated: 20/3/89 Khanna Registru Regi strar Marriages/ Khanna. orginal document shows no Certified indication a of true having copy, been altered or tampered with returned to subject this date Information officer BUF/ROC 730.17"
}