{
	"anumber": "A29030253",
	"id": "A29030253_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29030253_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "HIV Antibody Test Requisition, 01A31844"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 922/2023 American Red Cross Blood Services RECORD I.D. NO. SPECIMEN I.D. NO. Rochester Region 50 Prince Street Rochester, NY 14607 c DIA31844 HIV Antibody Test Requisition PATIENT CODE SEX AGE MSPRC 71789-Im M 82 COUNTY OF RESIDENCE ZIP CODE DATE MO. DAY YR. moneoe 14622 COLLECTED 17 89 RACE/ WHITE HISPANIC Add the RECORD I.D. NO. from ETHNIC BLACK OTHER the previous report when submitting a follow-up specimen HISTORY I. Acute HIV infection II. Asymptomatic III. Persistent generalized lymphadenopathy ONLY IV. Other HIV disease A. Constitutional D. Secondary Cancer B. Neurologic E. Other condition with impaired immunity C. Secondary infection RISK FACTORS ORIGINATING FACILITY A. Homosexual E. Blood Product Recipient B. Bisexual F. No Identified Risk NYS Counseling Correction Site Center C. IV Drug User G. Other (specify) Private Office TB Clinic D. Hemophiliac Hospital Blood CHILD OR SEXUAL PARTNER OF: STD Clinic Center Person with risk factor listed above: Family Planning Other (specify) A B C D E F G Clinic Known AIDS patient Methadone Clinic Patient with HIV-related symptoms PHYSICIAN CERTIFICATION The patient has been given information concerning the limitations of the test, the possible negative consequences of having thetestconducted,knows of thespecialcounselingservices available and has given written consent. Physician Signature Required PHYSICIAN'S NAME Jen Jones LICENSE NUMBER AleSSANDRO Beaton, NY079886 STREET ADDRESS 1327 Cliffons the CITY STATE ZIP CODE Roch NY 14621 LABORATORY TEST RESULTS POSITIVE EQUIVOCAL NEGATIVE ELISA Western Blot Other DATE MO. DAY YR. DATE MO DAY YR. only RECEIVED 18 88 REPORTED 7-19-89 REQUISITION WILL BE RETURNED IF INCOMPLETE. DOH-49.2 - (4/87)"
}
