{
  "anumber": "A29089715",
  "id": "A29089715_0069",
  "page_index": 69,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0069/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet, A29 089 715"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet or :-485 (245) Atty Vencent Meraci File No. A29089715 CHECK OME SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) IR-O SECTION PRIORIT DATE COUNTRY OF CHARGESCIONT PREFERENCE 203 (a) C CONPREFERENCE 203 (a) (3) DOCUMENTS NEEDED MEDICAL s INTERVIEW DISTRIBUTE (If Checked) (25 Checked) Date Mailed 1200 DATE 7/27/89 Delay Notice XXXXXXXXXXXXXXX B/L MEDICAL I-181 is State RFC INTERVIEW G-325A Shee? 01 over 2 Photos RESCHEDULED Support MEDICAL 1-508 INTERVIEW nayrs. 1-88 Other Consulted (Location CATEGORY Aogal Prepare 1-486 with date 45 days beyond date G-325A sent. Type I-151, caitting entry date, place and lamination. Insert I-151 in file with 243 packet (1-357; G-153). CATEGORY Booo Propare I-486, omitting date and insert in file. Type I-151, enitting. entry date, place and lamination. Insert in filo with 245 packet (I-357; G-153) OFFICER'S Instructions: DISTRIBUTE (If Checked) : 1-181 so State DEOS. 1-181 to Consulate AT 1-151 to 501. Serv. This form my be overprinted or stamped to above instructions, items requested items received, or other pertinent data which may oscilitate processing. 5/9/89 D.R. G?O $33.00 Keep this shout on to of all material la file until barrial declaim la ands ? I-468 (Rev. 11-1-TO)"
}