{
  "anumber": "A29089715",
  "id": "A29089715_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, FY 89"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DL Screened by NARA, 6/7/2023 FY 89 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place NYC File No. A29 089 715 Status as a lawful permanent resident of the United States is accorded: 134 6546.7701 Sex 1 Name Male Date of Birth (Month/Day/Year) In Care Of 2 Female 9/1/07 Street Maria T. ROMERO City of Birth Country of Birth Address 308 North Plank Rd. San Pedro Sula Honduras Apt. No. Newburgh, N.Y. 12550 Country of Nationality Country of Last Residence City, State, Zip Honduras Honduras Marital Status 1 XSingle 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) 3 Widowed 4 Divorced 5 Separated UNR B-2 88 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) NA IR-0 NA Section 212 (a) (14) XXNot Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable Julian NA Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification Tegucigalpa, Honduras 9/9/88 117206 of Last NIV B-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act As filt of (Month) 27, 89 (Year) at NYC PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert Symhol) IR-0 REMARKS RECOMMENDED BY: (Immigration Officer) (Date) APPROVED M. Vollor 7/27/89 INS INSTRUCT DATE OF ACTION JUL 27 1989 DD M. Yalo Recommend DISTRICT FOR USE BY VISA CONTROL OFFICE NYC I 0668 Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on 5/10/89 CC: Page 3 ADIT and Statistical report copy sent on 7/27/89 Form I- 181 (Rev.3-1-83) N 1. FILE COPY"
}