{
  "anumber": "A29089715",
  "id": "A29089715_0057",
  "page_index": 57,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29089715_0057/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICACION, 1267899"
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1991,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 PRIMERA CLASE UN LEMPIRA 1988-1991 No 1267899 1 CERTIFICAION 2 E1 Infrascrito Registrador Civil Municipal CERTIFICA que en el Archivo de 3 NACIMIENTOS que se tiene en este oficina se encuentra el Acta NO 0501-42- 4 00352, ubicada en el folio 265, del tomo 78, del año 1942 y que literal- 5 mente Dice: JUANA ALVARADO ROMERO.- En San Pedro Sula, a les dos y media 6 de la tarde del dia viernes seis de marzo de mil navecientos cuarenta y 7 dos. Ante mí Guillermo López Rodezno, Secretario del Conseje del Distri- 8 to Departamental y Encargado del Registro Civil, y Ante les testigos Elba n ERAL Rodriguez B. y J, 1frede Cate, mayores de edad, Hondureños y de este de- 10 micilio, , Compareció el Sener: SECUNDINO ALVARADO, mayor de edad, soltere, The CONTRALOR HONDURAS SalvadereMa y de este vecindarie, Dando cuenta: que el sábado veinte y 12 ocho del mes próximo pasada, a les diez p.m. en Mapala de este distrito, HACIENDA DE CREDIT neció una niña quién llevará por nombre If JUANA N .- Es hija natural re- conocida del compareciente y de la señora: TRANSITO ROMERO, mayer de edad, 15 soltera, Hendureña, y de este vecindario.- Son Abuelos Paternos: RUPERTO CENTRAE ALVARADO Y CIPRIANA BONILLA y Maternos: JULIAN ROMERO Y SANTOS ALVARADO.- Lei lo escrite al compereciente, lo ratific6 y no firmá por ignorar. Anataciones Marginales Ninguna. 19 Extendida en le cluded de S an Pedro Suls, Certés, e los treinta y un dise 20 del mes de eners de mil novecientos ochenta y nueve. 21 JOSE NAPOLEON JIMENEZ Cortes 48, C.A REGISTRADOR CIVIL MUNICIPAL 23 24 25 the"
}