{
  "anumber": "A29131378",
  "id": "A29131378_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29131378_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CUARENTA CENTAVOS, Nº 0661872, T.R. 0677498"
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        2023,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 No 0661872 DE EL SECURITY a TE DE CUEATI, CUARENTA CENTAVOS T.R. 0677498 LA INFRASCRITO JEFE DEL DEPARTAMENTO DE CEDULA DE IDENTIDAD PERSONAL, 2 CERTIFICA: el Registro de Cédula de Identidad Personal, que li teralmente dice: CEDULA DE IDENTIDAD PERSONAL No. 1-3-019586 & Nombre y Apellido: GLADIS SALVADORA REALES FUNES, Fecha de Nacimien- 5 to: 6 de agosto de 1947, Lugar de Nacimiento: Mejicanos, S.S.-Sal- 6 vadoreña por: Nacimiento, Nombre del padre: Alberto Reales, Nombre an 70 Madre: Marís Julia Funes vda. de reales, Estado Civil: Soltera 8 Nombre y Apellido del Conyuge: Residencia: la.C.Ote.#3, Profesión 9 u Oficio: Cosmetóloga, Pervicio Militar: Grado Militar: Sabe Leer 10 y Escríbir: Si, Sabe Firmar: Si, (Firma) Gladis S.Reales F.-Estatu 11 ra: 1.55 (EnCms.) Peso: 56 (En Kgs.) Color de la Piel: MORENA, Co - 12 lor de los Ojos: CAFES, Color del Pelo: Castaño, Señales Especiales 13 , Hay adjunta una Fotografia, Impresiones Digitales Impresas, 14 Hay un sello que se lee así: ALCALDIA MUNICIPAL DE MEJICANOS, CEDU- 15 LA IDENTIDAD PERSONAL, San Salvador, ER Salvador C.A. -Municipão de 16 Mejicanos, Departamento de San Salvador, Fecha: 20 de agosto de 1971 17 Firma Alcalde: F. Valdes P. Firma del Empleado \"ncargado de extender Cédulas: G. Herrera M. 18 19 ES CONFORME CON SU ORIGINAL CON EL CUAL SE CONFRONTO: Y para 20 los efectos legales, se expide la presente en la Alcaldía Municipal 21 Mejicanos, a veintiocho días del mes de septiembre de mil novecien- 22 tos setenta y tres Enmendado Sen les, ORIGINAL, Vale. 23 24 Guadalupe Herrera Martinez, 25 gh/ Jefe Secc. Cédula Ident.Pers."
}