{
	"anumber": "A29152365",
	"id": "A29152365_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29152365_0010/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Permanent Residence, I-485 ( (Rev. 06-23-86) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/12/2023 U.S. Department of Justice OMB # 1115-0053 Immigration and Naturalization Service (INS) Application for Permanent Residence DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp A# G-28 or Volag# Section of Law Eligibility Under Sec. 245 Sec. 209(b), INA Approved Visa Petition Sec. 214(d), INA Dependent of Principal Alien Sec. 13, Act of 9/11/57 Special Immigrant Sec. 245, INA Other Sec. 249, INA Country Chargeable Preference A. Reason for this application I am applying for lawful permanent residence for the following reason: (check the box that applies) 1. An immigrant visa number is immediately. available to me because A visa petition has already been approved for me (approval notice is attached) 13040J 10 A visa petition is being filed with this application CITIL \" OJ.UU 2. I days (approval marriage attached) entered as the fiance(e) of a U.S. citizen and married within 90 notice and certificate are 02/10/00 3. I am an asylee eligible for adjustment 00.31 4. Other: B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? MENENDEZ LUCILA DEL TRANSITO 06-22-88 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 3148 LETICIA DR. LOS ANGELES, CALIFORNIA (Town or City) (State/Country) (ZIP/Postal Code) 13. What means of travel did you use? (Plane, car, etc.) HACIENDA HTS. CALIFORNIA U.S.A. 91745 TACA AIRLINES 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? IZALCO SONSONATE, EL SALVADOR Yes No 4. Date of Birth 5. Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) Male Married Single (Visitor, student, exchange alien, crewman, temporary worker, 08-07-13 without inspection, etc.) Female Widowed Divorced VISITOR 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure NONE NONE Record (Form I-94). 9. Country of Citizenship MENENDEZ, LUCILA EL SALVADOR 17. Arrival/Departure Record (I-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? Yes No 8 8 9 6 6 014953 (If Yes, give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date (Mo/Day/Yr) SAN SALVADOR, EL SALVADOR 05-15-86 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) NONE NONE NONE EMPLOYMENT AUTHORIZED 21. Has your husband/wife ever been married before? Yes No DATE 9-44-88 LOS If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) NONE NONE PLUP NONE AC SIGNATURE A= 29-152-365 IE DO valid 09 MAR 1989 INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-485 (Rev. 06-23-86) Y Rop"
}
