{
  "anumber": "A29253711",
  "id": "A29253711_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29253711_0026/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT, A 2953 711"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "Canada",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. GOVERNMENT Screened PRINTED By NARA 6/2028-622/60428 DATE PREPARED INFORMATION FOR TRAVEL DOCUMENT OR PASSPORT FILE 09-30-88 A 2953 711 1. NAME 2. SEX RODRIGUEZ-San Herminia FEMALE 3. OTHER NAMES USED OR KNOWN BY 4. CITIZENSHIP NONE HONDURAS 5. DATE OF BIRTH 6. PLACE OF BIRTH 07-04-12 SAN LUCAS HONDURAS 7. HEIGHT WEIGHT EYES HAIR COMPLEXION MARKS OR SCARS 58\" 150 BRN GREY LIGHT tip of right little finger is amputated. 8. NEAREST LARGE CITY TO PLACE OF BIRTH 9. DISTANCE AND DIRECTION OF PLACE OF BIRTH FROM THIS LARGE CITY WITHIN 10 MILES TO THE EAST. SAN PEDRO SOLA, HONDURAS 10. IF CITIZENSHIP IS DIFFERENT FROM COUNTRY OF BIRTH, EXPLAIN. IF NATURALIZED IN ANY COUNTRY, SHOW DATE AND PLACE OF NATURALIZATION, CERTIFICATE NUMBER, AND STATE HOW CITIZENSHIP WAS ACQUIRED. N/A 11. NAMES: LOCATIONS AND DATES (YEARS) OF ATTENDANCE 12. NAMES, EXACT LOCATIONS AND DATES (YEARS) OF ATTENDANCE OF FOREIGN SCHOOLS OF FOREIGN CHURCHES. INCLUDE DATE AND NATURE OF ANY RELIGIOUS CEREMONY WHICH MAY HAVE BEEN RECORDED. LA CATEDERAL CATOLICA, NEVER ATTENDED SAN PEDRO SOLA, HONDURAS, ATTENDED ALL OF HER LIFE. 13. LAST PERMANENT RESIDENCE IN COUNTRY OF CITIZENSHIP (Show dates of residence) BARRIO SANTANITA 1011, AVENIDA, CASA #1090, HONDURAS 14. ADDRESS IN COUNTRY OF LAST FOREIGN RESIDENCE (Show dates of residence, and Insigration status there) N/A 15. PLACE OF ENTRY INTO UNITED STATES DATE OF ENTRY INTO UNITED STATES 5 MILES WEST OF THE SAN YSIDRO PORT OF ENTRY 09-30-88 16. LIST DATE AND PLACE OF ISSUANCE AND NUMBER OF PASSPORT. BIRTH CERTIFICATE. BAPTISMAL CERTIFICATE OR DOCUMENT OF IDENTITY. SPECIFY DATES OF MILITARY SERVICE, COUNTRY AND UNIT, RANK, SERIAL NUMBER, AND PLACES OF INDUCTION AND DISCHARGE. CLAIMS NONE 17. IN POSSESSION OF TRAVEL DOCUMENT OR PASSPORT AT TIME OF ENTRY: YES NO. DESCRIBE DOCUMENT (S) IF SUBJECT DID NOT HAVE TRAVEL DOCUMENT OR PASSPORT AT TIME OF ENTRY, OR DOES NOT HAVE SUCH A DOCUMENT NOW. INDICATE WHETHER EVER OBTAINED ONE: YES X NO. STATE HOW. WHEN. AND WHERE IT WAS OBTAINED: WHAT KIND OF DOCUMENT IT WAS, AND WHAT BECAME OF IT. 18. FATHER'S NAME DATE OF BIRTH PLACE OF BIRTH CORNELIO RODRIGUEZ UNKNOWN UNKNOWN PRESENT ADDRESS DECEASED 19. MOTHER'S MAIDEN NAME DATE OF BIRTH PLACE OF BIRTH CELESTINA SANCHEZ UNKNOWN UNKNOWN PRESENT ADDRESS DECEASED 20. NAME. RELATIONSHIP, AND ADDRESSES OF RELATIVES ABROAD FOIA (b)(6) GRANDAUGHTER 21. PREVIOUSLY EXCLUDED DEPORTED REQUIRED TO DEPART FROM THE UNITED STATES ON VIA CLAIMS NONE TO (Date) (Port) (Country) 22. INDICATE WHETHER EVER ARRESTED. IN PRISON OR A PUBLIC INSTITUTION IN THE COUNTRY OF WHICH A NATIONAL. SUB. JECT OR CITIZEN: YES NO. IF so, GIVE DATES AND PLACES 23. NAME. NATIONALITY AND PRESENT ADDRESS OF SPOUSE. AND DATE AND PLACE OF MARRIAGE WIDOWED 24. NAMES, AGES AND ADDRESSES OF ALL CHILDREN NONE 25. IF NONCANADIAN DEPORTABLE TO CANADA, GIVE DATE AND PORT OF ARRIVAL IN CANADA, AND NAME OF VESSEL MA Form I-217 (Rev.3-30.77)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}