{
	"anumber": "A29253711",
	"id": "A29253711_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29253711_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PORTATION CASE CHECK SHEET, 29.253711"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1999, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 PORTATION CASE CHECK SHEET 29253711 Film: to ALIEN: Rodriguez-SAndley REPRESENATTE: ATTORNEY OR ADDRESS: Hermonic Care- Came ACTIONS TO 3E COMPLETED pieced Initials ACTIONS TO 3E COMPLETED placed Initials (Date) (Date) :-24 Stamped 232(5) CASES :-5 Nausa of Revocation I-79 H-125 Docket Control Tage and Penalty Nouse to Detain I-210 Voluntary Departure Notice I-239 and Deport :-103 Warrant of Deportacion ARRANGING TRAYSPORTATION Warning at Sirements I-238 Notice to :-229 Limit 242(e) Transportation Line 1-117 Inforation-Travel Record of I-380 --TITA Document Application Billable Expense Demand for Surrender i-141 Medical I-340 Under Send Yours or Dep's Destination I-294 Notice to Surrender and Prasity for Reverse I-166 for Deportation i-323 Breach Bond 1-391 Cancellation OCT 29 1999 AS. G-391 Detail of Dec Off. T.J. Request Country Record at Person is i-141 I-218 Designated by Alien Property Transferred T.S. (can Request i-164 Document Envelope Country of Nationality Passport Yourd . OL 242.0(8) DETAINED CASES CLOSING ACTIONS Yours of Detention :-336 :-137 Yours of Deportation or Release Conditions G-139 Statistical Punch Card I-200 Warrant for Arross at Aliea G-174 Required Departure Verified Lookout Notice :-103 Order to Detain or Release Alim G-143 Worksheet Los on 1-11-90 S-189 Property Receipt Disposition Yourself . FEI I-94 to do R-84 to FBI G-190 Property Envelope Disposition Notice - RCMP G-189 prepared i-3 Statement of Detained Alien Departacion Exprise 3111ed G-143 to R.O. 3aggage is Personal Effects Notice to Decention and i-74 Stamped and I-161/1-104 closed I-134 Deportation Expenses I-35 Forwarded File closed \"Cased\" Tape Placed on FUE Honduras :- Yours of Detainer To Rec. Acm. Ro i-ist 1933 File Stamped \"Statistics\" i-134 Closed CODED DOCKET CLEARED Disposition information furnishes = following: OCT 2'9 1990 Alien (is)(is age) detained and is ready for deportation to at the expense of Alien's condition is: Able Mental CINS Physically Incap. idams at 55 Co. . Government) Date Deportation Officer Remarks: Ferm :-173 (3sv. United Stares Department of Justics. immigration and Naturalization Service"
}
