{
  "anumber": "A29253711",
  "id": "A29253711_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29253711_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER TO SHOW CAUSE, NOTICE OF HEARING, AND WARRANT FOR ARREST OF ALIEN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service No. ORDER TO SHOW CAUSE, NOTICE OF HEARING, AND WARRANT FOR ARREST OF ALIEN In Deportation Proceedings under Section 242 of the Immigration and Nationality Act UNITED STATES OF AMERICA: File No. A29 253 711 In the Matter of RODRIGUEZ-Sanchez, Herminia Respondent. U.S. \"Immigration and Naturalization Service, San Diego, California Address (number, street, city, state, and ZIP code) UPON inquiry conducted by the Immigration and Naturalization Service, it is alleged that: 1. You are not a citizen or national of the United States; 2. You are a native of Honduras and a citizen of Honduras ; 3. You entered the United States near San Ysidro, California on or about September 30, 1988; (date) 4. You were not then inspected by an Immigration Officer. AND on the basis of the foregoing allegations, it is charged that you are subject to deportation pursuant to the following provision(s) of law: Section 241 (a)(2) of the Immigration and Nationality Act, in that, you entered the United States without inspection. WHEREFORE, YOU ARE ORDERED to appear for hearing before an Immigration Judge of the Immigration and Naturalization Service of the United States Department of Justice at date, time, and place to be set by the Immigration Court on at m, and show cause why you should not be deported from the United States on the charge(s) set forth above. WARRANT FOR ARREST OF ALIEN By virtue of the authority vested in me by the immigration laws of the United States and the regulations issued pursuant thereto, I have commanded that you be taken into custody for. proceedings thereafter in accordance with the applicable provisions of the immigration laws and regulations, and this order shall serve as a warrant to any Immigration Officer to take you into custody. The conditions for your detention or release are set on the reverse hereof Dated: October 1, 1988 8AM 3900r 83135NV 10 3013 SOT you (signature and title of issuing officer) Assistant Chief Patrol Agent day 301330 San Diego, California (City and State) 02:2 Wd 22 any 68 30 Form 1.221S (Rev. 8 1.77) Y (over)"
}