{
	"anumber": "A29338098",
	"id": "A29338098_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338098_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, FORM G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 1902, 1995]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['n/a']"
			},
			"nationality": {
				"nationality_llm_v1": "haitian"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "INSTRUCTIONS: USE TYPEWRITER. BE SURE ALL COPIES ARE LEGIBLE. Failure answer fully all questions delays action. Do Not Remove Carbons: If typewriter is letters with ball-point pen. U.S. GPO: 1988-213-342 For sale by the Superintendent of Documents, U.S. Government Printing Office, Washington, D.C. 20402 (Per 100) U.S. Department of Justice FORM G-325A OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE NUMBER REMY ROZAIRE FEMALE 03/23/1902 HAiTiAN 29-338-098 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE N/A HAiT /CAMP-PERRIN (If any) N/A FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER ReMy JOSEPH MOTHER (Maiden name) JosePH MAZEDOINE HAITI (Deceased) N/A HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY\\ OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE NoNe N/A N/A N/A N/A N/A FORMER HUSBANDS OR WIVES(if none, so state) N/A N/A N/A N/A N/A FAMILY NAME (For wife, give maiden nome) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR ARCACHON 34 1 18 Port-AU-PRING CARREfOUR HALTI MARCH 79 PRESENT TIME MAY 84 1995 N.W 111 street MIAMI FLORIDA U.S.A 05/21 84 APRIL 89 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR ARCACTON 34#18 Port-an-PRivil CARREFOUR HAITI MARCH 79 MAY 84 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR PRESENT TIME N/A N/A N/A Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT OTHER (SPECIFY): ROZAIRe REMY 04/28/89 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes (N/A) NONE NONE NONe (N/A) PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) REMY ROZAIRE NONe 429338098 MIA T.C I-485 JUN N 2 3 1989 Form G-325 A (Rev. 10-1-82) (1) Ident."
}
