{
	"anumber": "A29338098",
	"id": "A29338098_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338098_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Extract of register of Certificates of Birth of the City of Camp Ferrin at National Records of the Republic."
		},
		"years": {
			"ms_years_nlp_v1": [1979, 1982, 2023, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 TRANSLATION LIBERTY EQUALITY - FRATERNITY. (stamp) REPUBLIC OF halti, SEAL PAPER, \"20 Cmes\" . (stamp) REPUBLIC OF HAITI. VV No. 48363 (stamp) National Records. Extract of register of Certificates of Brith of the City of Capp Perrin at National Records of the Republic. On June 20, 1945, before me, Christian Raton, Official of Civil State of Camp Perrin that suscribe, appear Gervens Piard, with residence at Camp Perrin and declare a child, of sex male, whom was born on April 28, of current (1945), legitimate son of the declarant and Rozaire Remy; whom was called PIERRE ONEL PIARD. Witness: Abraham Bazile and Chozuis Plezius. Readed this document was signed: (signature) C. Raton. Receipt No. 5794 P. Port-au-Prince on 2/13/1979. Approved: Henack Trouillot, General Director (illegible signature) (stamp) Director of National Records of Republic of Haiti. ON MARGE: (4 stamps) REPUBLIC OF HAITI, OFFICIAL STAMP. YEAR - 1945 PAGE - 38 NUMBER - 46-9339 Certificate of Brith of: Pierre Onel Piard. I HEREBY CERTIFY that I am competent in translating from English to French and from French to English and that the above translation is true and correct to the best of my ability per attached document. mistler Goughtey MIRTHA GONZALEZ Sworn to and subscribed before me 130 feed A 1982 this Notary day of of Florida at Large Public State NOTARY My commission PUBLIC MISSION expires STATE EXPIRES OF FLORIDA SEPT AL LANGE BONDED IHRU GENERAL INS UNDERWRITERS 151984"
}
