{
	"anumber": "A29372184",
	"id": "A29372184_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372184_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, A29372184"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE DATE: 04/19/90 HERNENCE JOSAPHAT GUERRIER FILE: A29372184 850 NE 180TH STREET MIAMI, FL 33162 PLEASE COME TO THIS OFFICE 7880 Biscay Blv Room 490 Miami, FL. 33138 ON: 07/27/90 AT: 9:00 AM regarding your application for adjustment of status. Failure to respond to this request may result in denial of your application BE ON TIME. A late arrival can cause you a long delay or postponement of the interview EMERGENCY If you must cancel this appointment because of an emergency please indicate below the nature of the emergency and attach evidence of the emergency Sign and date this form and return it to this office immediately. BRING WITH YOU This letter an interpreter if you do not speak English: all documents listed below (any document in a foreign language must be accompanied by a certified English translation) Documents submitted must be originals or certified copies that bear the seal of the issuing authority Provide an addi - tional photocopy of any original document you wish returned YOUR PASSPORT, birth certificate & original entry document (I-94). PROOF OF SUPPORT You and/or any employed family members must present from each employer a letter on official stationery that indicates the position, whether the position is temporary or permanent, current salary, and date of initial employment IF YOU HAVE AT ANY TIME BEEN ARRESTED in any country of the world you must submit the following for EACH arrest arresting officer's report; indictment (if applicable) and a document showing the disposition of the case. IF YOU ARE THE BENIFICIARY OF AN APPROVED VISA PETITION: Bring copies of all documents submitted with that petition."
}
