{
  "anumber": "A29362184",
  "id": "A29362184_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29362184_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY, 1267"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1903,
        1905,
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI Excerpt from the Registry of births of the Community of Aquin filed at the Natio- YEAR : 1905 nal Record Office of the Republic. PAGE : 84 TodayMonday November 13, 1905, 102nd year of Independence at 8:30 A.M. before us Louis Moricette Fils Municipal Officer of Aquin , the Undersigned NUMBER : 1267 Have appeared Tiboris Simon an Adult Property owner a resident of Habitation Gle- nnain located in the 4th rural section of the same community, he presented a male child whom he declared to be his legitimate son born of his wife Rosalise Simon on July 2,1903 at 5:00 A.M. in his domicile. To which child he gave the name of Thomas The certificate was drawn up in front of Meralis Simon and of Alexan- Birth Certificate dre Prophete both adults property owner residents of the 4th rural section of of THOMAS the aforementioned community. SIMON. After reading the present Certificate we signed it with the Father and not the witnesses not being able Lu. Port-au-Prince, December 6 1985 Certified True Copy. Translated from Frech on July 31, 1989 at Pompano Beach, Broward County Florida. I hereby certify that this is a correct translation of the attached document and that I am competent to translate from French into English into French. Ronald Flavien. Sworn to and suscribed before me this 31st day of July 198( Broward County, Florida Notary Public state of Florida"
}