{
  "anumber": "A29362184",
  "id": "A29362184_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29362184_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI, Screeneded by NARA, 7/28/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1992,
        1925,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI. Excerpt from the registry of births of the City of Port-au-Prince, South Section. During the year Nineteen fourty-four, 141st year of Independence and on Saturday October 21st at noon, Before us Faine L. Duplessis Louverture municipal officer of Port-au- Birth certificate Prince South Section, the undersigned have appeared Mrs Adam Cemeus Saint-Louis of HOSANNA born Marie Ponceise Blanchard, farmer resident of Leogane, she presented to us a October 5, 1925. female child she named Hosanna which child she declared to be her legitimate dau- ghter born in her house on October 5, 1925, she declared being legitimatly married and presented the marriage Certificate.- The certificate was drawn up in front of Toussaint C. Louverture and of Vincent Thomas , , property owners residents of the same city both witnesses cho sen and brought by the declarant; After reading the present Certificate we signed it with the witnesses and not the declarant. Translated from French on July 31, 1989 at Pompano Beach, Broward County Florida. I hereby certify that this is a correct translation of the attached document and that I am competent to translate from French into English and from Enflish into French. Rouald flaviel Sworn to and suscribed before me this 31st day of July 1989 in Pompano Beach, Broward County Florida. Notary Public NOTARY BONDED THRU GENERAL INS. UND. COMMISSION EXP. NOV. 9.1992"
}