{
	"anumber": "A29338098",
	"id": "A29338098_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338098_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [8151, 1990, 1999, 2023, 8989]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp APPROVED A# INS DISTINITY DIRECTOR G-28 or Volag JAN 05 1990 Section of Law: Petition was filed on 03-28-89 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) Recommended Mary 1611 Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) MIA Field Investigations I-485 Simultaneously 203 a)(5) 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) PIARD PeTeR Mooneil REMY ROZAIRE N/A 2. Address (Number and Street) (Apartment Number) Address (Number and Street) (Apartment Number) 1795 N.W instreet, MIAMI FLa 33167 1795 N.W 111 street (House) (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) MIAMI FLa. 33167 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Lacivette CAMP-PERRIN (HAiti) Lacivete CAMP-PeRRiN (HAiTi) 4. Date of Birth 5 Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 4/28/45 Female Widowed Divorced 3/23/02 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) (none) SAME none N/A SAME one 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) none N/A 9. Social Security number 10. Alien Registration Number Of any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) N/A none 11. Names or Prior Musbanas wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended EveLyNE ChevaLieR 8/15/88 JEAVEUS PIARD NOT MARRIED 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Natz. Cert./I-551 seen Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization ret'd by IFR unit He or she last arrived as a (visitor) student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 800-00178931 B-2 7/20/84 No 4022200 12/19/88 Miami, Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Parents 800 90199931 11/19/8151 1/19/25 07-20-84 Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No H/A 01-19-85 If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) as it is above none N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/A NONE and class of admission: 16. Has your relative ever been under immigration proceedings? N/A Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? Yes No INITIAL RECEIPT 1999 RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned 4/19/8989 Form I-130 (Rev. 02-28-87) N no 10/05/90"
}
