{
	"anumber": "A29338682",
	"id": "A29338682_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338682_0032/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/4/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 7880 BISCAYNE BLVD MIAMI FL 80000 YOU ARE REQUESTED TO APPEAR AS SHOWN USTED DEPE DE PRESENTARSE PARA UNA BELOW FOR AN INTERVIEW WITH REGARD TO ENTREVISTA, COMO INDICA ABAJO, EN THE APPLICATION SUBMITTED TO THIS REFERENCIA A LA APLICACION ENTREGADA SERVICE. YOU MUST BRING THIS LETTER A ESTE SERVICIO. DEBE DE TRAER ESTA WITH YOU. CARTA CON USTED. SIDRAC LAZARRE A-NUM: 29338682 1351 NW 173 TERR DATE: 12/31/89 MIAMI FL 33169 PLEASE APPEAR AT(DIRECION): 7880 BISCAYNE BLVD ROOM: 290 MIAMI FL 80000 SEAT: 040 N(FECHA) 01/22/90 T(HORA) : 02:00 PM OFFCR: IR DO NOT APPEAR FOR YOUR INTERVIEW MORE PRESENTESE SOLAMENTE QUINCE MINUTOS THAN FIFTEEN (15) MINUTES BEFORE YOUR ANTES DE LA HORA SENALADA PARA SU SCHEDULED APPOINTMENT TIME. YOU MAY ENTREVISTA. PUEDE TRAER A SU ABOGADO BRING YOUR ATTORNEY OR AUTHORIZED U OTRA PERSONA AUTORIZADA QUE LO REPRESENTATIVE WITH YOU, BUT PLEASE DO REPRESENTE. POR FAVOR DE NO TRAER NOT BRING ANY FRIENDS OR RELATIVES WITH AMIGOS 0 FAMILIARES CON USTED QUE NO YOU WHO DO NOT HAVE AN APPOINTMENT HAYAN SIDO CITADOS PARA UNA ENTREVISTA LETTER OF THEIR OWN. EN ESE DIA. YOU MUST BRING WITH YOU YOUR I-94 DEBE DE TRAER CON USTED SU I-94, ARRIVAL-DEPARTURE RECORD, YOUR PASSPORT REGISTRO DE LLEGADA Y PARTIDA, SU AND'YOUR BIRTH OR BAPTISMAL CERTIFICATE PASAPORTE Y SU CERTIFICADO DE IF YOU HAVE THEM. PLEASE FILL OUT ANY NACIMIENTO 0 BAUTISMO, SI LO TIENE. FORMS ENCLOSED WITH THIS NOTICE, AND POR FAVOR DE LLENAR CUALQUIER FORMA BRING THE COMPLETED FORMS TO YOUR ADJUNTA A ESTA CARTA Y TRAERLA INTERVIEW. COMPLETA EL DIA DE LA ENTREVISTA. ALL ITEMS BELOW MARKED WITH AN X MUST BE OBTAINED BY YOU, COMPLETED, AND BROUGHT TO THE INTERVIEW WITH YOU. FD-258 G-325A I-643 I-131 I-485 I-693 X I-94 0 PHOTOS X OTHER: SEE ATTACHED ANY OFFICIAL DOCUMENTS MUST BE LOS DOCUMENTOS OFICIALES DEBEN DE SER ORIGINALS. YOU SHOULD ALSO BRING A ORIGINALES. TAMBIEN DEBE DE TRAER UNA PHOTOCOPY OF THOSE DOCUMENTS. ANY COPIA FOTOSTATICA DE ESDS DOCUMENTOS. FOREIGN LANGUAGE DOCUMENTS MUST BE CUALQUIER DOCUMENTO EN OTRO IDIOMA ACCOMPANIED BY AN ENGLISH TRANSLATION. EXTRANJERO DEBE DE ESTAR ACOMPANADO POR UNA TRADUCCION AL INGLES. IF YOU MUST CANCEL YOUR APPOINTMENT, SI USTED TIENE QUE CANCELAR SU CITA, YOU MUST INDICATE THE REASON YOU ARE TIENE QUE INDICAR LA RAZON POR LA CUAL UNABLE TO APPEAR BELOW, SIGN AND DATE USTED NO PUEDE COMPARECER EN EL THIS FORM, AND RETURN IT NO LATER THAN ESPACIO INDICADO ABAJO, FIRME Y PONGA FIVE (5) DAYS BEFORE YOUR SCHEDULED LA FECHA EN ESTA FORMA Y DEVUELVALA APPOINTMENT. CINCO DIAS ANTES DE LA FECHA DE SU FAILURE TO APPEAR FOR YOUR ENTREVISTA. FL NO COMPARECER A SU APPOINTMENT WITHOUT REASON MAY RESULT CITA SIN UNA EXPLICACION, SU IN THE DENIAL OF YOUR APPLICATION. APLICACION PUDIERA SER NAGADA. REASON FOR CANCELLATION: SIGNATURE: DATE:"
}
