{
	"anumber": "A29372184",
	"id": "A29372184_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372184_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Excerpt of the Registers of Birth Certificates of the Commune of Mole Saint Nicolas, 72527-G"
		},
		"years": {
			"ms_years_nlp_v1": [1977, 1931, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 72527 Officially stamped paper : Republic of Haiti, 0,20c RR NO. 81278 of a Gourde. - 1 rubber stamp (Right of page) : National Archives of the Republic of Haiti- 1 rubber stamp over official stamp s Illegible LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI Excerpt of the Registers of Birth Certificates of the Commune of Mole Saint Nicolas deposited at the Bureau of National Archives of the Repu- blic.- Today, 3rd day of the month of May, 1931, the 128th year of the Independen- ce, at eight o'clock in the morning. Before us, the undersigned, Arnauld Robert Roche, Officer of Civil Status of the Commune of Mole Saint Nico- las, Department of the North-West, Jurisdiction of Port-de-Paix : Appeared the citizen Lerochel Cleophat, a farmer by profession, 31 years of age, residing and domiciled at Cotes-de-Fer, 1st Rural Section of this Com- mune He presented to us a female child, whom he declared was born at his home, on February 15, 1931, at eight o'clock in the evening, of his natural works with the citizen Hermancia Josaphat, a farmer by profession, 28 years of age, residing and domiciled here, who was also present and attested to said declaration To which child the declarant gave the names of : JULIANIE LEROCHEL This writ was thus made out in the presence of the citizens Deroslin Jeune, and Lamarre Faugue, both of legal age, farmers, residing and domiciled here. After reading, the declarant and the witnesses stated that they did not know how to sign SIGNED : A. ROCHE. - Compared - Conformed copy - The Officer of Civil Status RECEIPT NO. 72527-G Port-au-Prince, August 30, 1977 CONFORMED COPY COMPARED Signed : Henock Trouillot Stamp : Illegible GENERAL DIRECTOR /2"
}
