{
  "anumber": "A29338682",
  "id": "A29338682_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338682_0023/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1989,
        1982,
        1983,
        1977
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. GPO 1987-757-737 For sale by the Superintendent of Documents. U.S. Government Printing Office Screened by NARA, 814)202802 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# 23338682 APPROVED G-28 or Volag # Section of Law: JAN 22 1990 201 (b) spouse 203 (a)(1) Petition was filed on (priority date) 201 (b) child 203 (a)(2) 201 (b) parent 203 (a)(4) Ender Personal Interview CHIEDEEL Previously Forwarded Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously LINIA 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) Joseph LAdy JeANNE LAZARRE, SidRae Em, 2. Address (Number and 1351 NW Street) 173 Tex (Apartment Number) 2. Address (Number and Street) Ter (Apartment Number) 1351NW 173 (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) MiA F/A 33169 miAmi FIA 33169 3. Place of Birth (Town of City) (State/Country) 3. Place of Birth (Town or City) State/Country) Port-da-Paix CHAiTi 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 10-20-41 Female Widowed Divorced 9-3-1907 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) LAdy LAZARRE N/A 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) a Social Security number 10 Alien Registration Number (if 9. number Social N/A Security 10. Alien Registration Number (if any) FOIA (b)(6) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives N/A A29338682 12. Date(s) Marriage(s) Ended Joseph FRANCilloN Junio 1982 N/A 13. If you are a 13. Has your relative ever been in the U.S.? My citizenship was Naturalization in U.S. the U.S. citizen, acquired Art of complete through the (check following: one) Yes No Birth 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued VisitoR July Parents 18, 1977 MIA, Fl Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? 89 428-43295600 Dec.19/1983 If \"Yes,\" number of date and it was issued Yes give No certificate, place ah Date authorized stay expired, or will expire as shown on Form I-94 or I-95 15. Name and address of present employer (if any) N/A Date this employment bégan (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/A and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes No Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED JUN 2 8 1989 Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N 1/22/90"
}