{
  "anumber": "A29362184",
  "id": "A29362184_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29362184_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Natural Parent of USC"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 NATURAL PARENT or USC IR-0 (1-130 s 1-485) and I-485 THE FOLLOWING DOCUMENTATION MUST BE PRESENTED WITH YOUR FORMS I-130 (1) Your passport and entry document (1-94) (2) Your birth certificate (original or certified copy) and certified English translation (11 needed). If unavailable, your passport a ca.: act in place of your birth certificate. (3) Proof of your support. II you are employed, present current letter from your employer on official stationary s indicating your position, salary, and whether your position is permanent or temporary. If you are unemployed, you may present s job offer letter stating the position offered, the salary to be paid, and whether the job is permanent or temporary OR you may present the attached Affidavit of Support from someone who supports you. The Affidavit aust be properly executed and have the required financial evidence attached. (4) Current medical report (11 one is NOT attached, please see forms attached to this letter). (s) petitioner's birth certificate showing your name (original or certified copy) and a certified English translation (18 needed) If your current name differs from the name shown on your son's/daughter's birth certificate, provide a name change document(s) (original or certified copy) and a certified English translation (11 needed). (6) If you are the petitioner's father, provide proof (original or certified copy) of having married the petitioner's natural mother prior to the petitioner reaching age 18 OR provide proof of having legitimated the petitioner under the laws of her/his domicile and a certified English translation (11 needed). Also proof of termination of ALL your/natural mother's prior marriages (original (s) or certified copy(ies)) and certified English translations TIE needed). (7) Two color photos. These photos must be on a white background. They must be a 3/4 frontal portrait with the right ear exposed. Hats, earrings, and glasses are NOT permitted. The photographic image must be SHARP and the size from the top of the head to the chin must not be larger than 1 1/8 inch, not smaller than 7/8 inch. (8) You must bring proof of the Petitioner's U.S. Citizenship -Certificate of Citizenship/Naturalization, birth certificate or valid U.S. passport (9) Other: Bring a completed C-325A form and fingerprint chart. NOTE: Failure to present your application (s) with ALL the required documentation may result in the rejection of your application (s). Remember that all documents MUST be in original or certified copy form. II you wish that the document be returned to you after the interview, please ALSO provide a copy of the original or certified copy. Any document In s foreign Tanguage must be accompanied by a certified English translation. The translator must certify he is competent to translate and that the translation is accurate."
}