{
	"anumber": "A29372184",
	"id": "A29372184_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372184_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Permanent Residence, I-485 ( (REV. 2-27-87)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice OMB # 1115-0053 Immigration and Naturalization Service (INS) Application for Permanent Residence DO NOT WRITE IN THIS BLOCK Case ID# Action APPROVED Stamp A# 29-372-184 LN.S DISTRICT DIRECTOR G-28 or Volag# New Fee Eligibility Stamp DISTRICT RECEIVED Under 1990 1617 CASHIER Sec APR OFFICE 245 1554791 JUL27 1990 Section of Law Sec. 209(b). INA by: Approved Visa Petition Sec. 214(d), INA Dependent d'LPrincipal See. 13, Act of 9/11/57 Special Immigrant Other celled Sec. 245, INA Sec. 249, INA Country Chargeable Preference A. Reason for this application the I am applying for lawful permanent residence for the following reason: (check the box that applies) PER COMPUTER An immigrant visa number is immediately available to me because Comp is 1. FCO A visa petition has already been approved for me (approval notice is attached) down A visa petition is being filed with this application APR 17 1990 2. I entered as the flance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are attached) PR 3. I am an asylee eligible for adjustment 4. Other: B. Information about you 6 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? GUERRIER HERNENCRA Josk 3/25/88/ 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 850 N.E 180 ST MiAMi FloriDA (Town or City) (State/Country) (ZIP/Postal Code) 13 What means of travel did you use? (Plane, car, etc MIAMI FloRiDA 33162 PlANe 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? / HAiti ) Mohes St NiCHO Yes No 4. Date of Birth 5. Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) (Visitor, student, exchange alien, crewman, temporary worker Male Married Single 10-16-07 without inspection, etc.) Female Widowed Divorced VisitoR B-2 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as It appears on your Arrival/Departure Record (Form I-94). 9. Country of Citizenship HAifi 17. Arrival/Departure Record (I-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? No 42903381700 005342 Yes (If Yes give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date (Mo/Day/Yr) 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) 21. Has your husband/wife ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) N/A To fings printy she is our 79 years old INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned FORM I-485 (REV. 2-27-87)N 7/27/90 72790"
}
