{
  "anumber": "A29338098",
  "id": "A29338098_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29338098_0032/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Birth Certificate"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1902
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 A RUBBER STAMP OVER MMM NO. 7224 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI BIRTH CERTIFICATE Officially stamped In the year one thousand nine hundred and eighty-four, paper 181st. year of Independence and the Wednesday January twenty-five, at ten o'clock in the morning. 20 cents of a gourde. We EMERAN CINEAS, Officer of the Civil State of the Section South of Port-Au-Prince, undersigned, certified have transcript in our Register at this destines the Birth Certificate of Dispositive from Judgement thus conceive: By this motive ROZAIRE REMY the Tribunal, after examine at the conclusions of Minister born Public, said and declare under the Reserve of Laws of those the March 23, 1902 who have interest and quality which ROZAIRE REMY, of sex feminine is born at Lacivette third section Rurale of the at Lacivette Commune of Camp-Perrin, the March Twenty-Third one thousand 3rd Section Rural of nine hundred and two of natural faith of MR. JOSEPH REMY the Commune of and the Lady MAZEDOINE JOSEPH, both deceases; said the CAMP-PERRIN Depositive of this Judgement taking place of Birth Certificate at Rozaire Remy; To prescribe the Transaction of said deposited in Register keeping special in double at this effect by the Officer of the Civil State of the Section South of Port-Au-Prince. Giving to us. THEOPHILE JEAN FRANCOIS, Doyen in Public Audience of nineteen January, one thousand nine hundred eight-four in presence of MR. ULRICK ROSARION, substitute of Commissioner of Government of this result with the assistance of Clerk ASCENCIO JUMELLE. It is prescribe etc In testimony whereof etc ILLEGIBLE SIGNATURE EMERAN CINEAS OFFICER OF THE CIVIL STATE Rubber Stamp at the Bottom This is a true, correct and compared copy of the original, which was returned. M.Dalama 12/25/83 Date Immigration"
}