{
  "anumber": "A29899363",
  "id": "A29899363_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Homeland Security U.S. Citizenship and Immigration Services, N-336, Request for a Hearing on a Decisions Under Section 336 of the Act"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 OMB No. 1615-0050, Exp. 7-31-05 U.S. Department of Homeland Security N-336, Request for a Hearing on a Decision U.S. Citizenship and Immigration Services in Naturalization Proceedings Under Section 336 of the Act INSTRUCTIONS 1. Filing. You must file your request for a hearing within 4. Brief. You do not need to submit a brief in 30 calendar days after service of the decision (33 days if support of your request, but you may submit one. your decision was mailed) with the local office of the U.S. You may submit a simple written statement Citizenship and Immigration Services (USCIS) that made instead of a brief. You may also submit evidence. the unfavorable decision. (The USCIS is comprised of You must send your request and accompanying offices of former Immigration and Naturalization Service.) fee and documentation to the USCIS office which The date of service is normally the date of the decision. made the unfavorable decision. If you need more Submit an original request only. Additional copies are not than 30 days, you must, within the initial 30 day required. period, explain why in a separate letter attached to this form. The USCIS may grant more time for 2. Fee. You must pay $605 to file this form. This form is good cause. to be used to appeal an unfavorable decision for an individual applicant. The fee will not be refunded, 5. Paperwork Reduction Act Notice. A regardless of the action taken in your case. Do not mail person is not required to respond to a collection cash. All checks or money orders, whether United States of information unless it displays a currently valid or foreign, must be payable in U.S. currency at a financial OMB control number. This collection of institution in the United States. When a check is drawn on information is estimated to average 10 minutes the account of a person other than yourself, write your per response, including the time for reviewing name on the face of the check. If the check is not honored, instructions, searching existing data sources, USCIS will charge you $30.00. gathering and maintaining the data needed, and completing and reviewing the collection of Pay by check or money order in the exact amount. Make information. Send comments regarding this the check or money order payable to U.S. Department of burden estimate or any other aspect of this Homeland Security; unless; collection of information, including suggestions for reducing this burden, to: U.S. Citizenship and If you live in Guam and are filing this form there, Immigration Services, HQRFS, 425 I Street make the check or money order payable to \"Treasurer, N.W., Room 4034, Washington, DC 20529; Guam.\" OMB No. 1615-0050. Do not mail your completed application to this address. If you live in the U.S. Virgin Islands and are filing this form there, make the check or money order payable to the \"Commissioner of Finance of the Virgin Islands.\" When preparing your check or money order, spell out U.S. Department of Homeland Security. Do not use the initials \"USDHS\" or \"DHS.\" 3. Attorney or Representative. You may, if you wish, be represented, at no expense to the government, by an attorney or other duly authorized representative. If so, that person must submit a Notice of Appearance (Form G-28) with the request for a hearing. Form G-28 can be obtained by calling 1-800-375-5283 or from the USCIS internet website at www.uscis.gov. Form N-336 Instructions (Rev. 05/05/04)N (Prior versions may be used until 09/03/04)"
}