{
	"anumber": "A29899363",
	"id": "A29899363_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Processing Information. ( (Continued)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 Part 3. Processing Information. (Continued) Please answer the following questions. ( If your answer is \"Yes\" on any one of these questions, explain on a separate piece of paper. Answering \"Yes\" does not necessarily mean that you are not entitled to register for permanent residence or adjust status). 1. Have you ever, in or outside the U. S.: a. knowingly committed any crime of moral turpitude or a drug-related offense for which you have not been arrested? b. been arrested, cited, charged, indicted, fined, or imprisoned for breaking or violating any law or ordinance, excluding traffic violations? C. been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? d. exercised diplomatic immunity to avoid prosecution for a criminal offense in the S.? Yes No 2. Have you received public assistance in the U.S. from any source, including the U.S. government or any state, county, city, or municipality (other than emergency medical treatment) or are you likely to receive public assistance in the future? Yes No 3. Have you ever: a. within the past 10 years been a prostitute or procured anyone for prostitution, or intend to engage in such activities in the future? b. engaged in any unlawful commercialized vice, including, but not limited to, illegal gambling? C. knowingly encouraged, induced, assisted, abetted or aided any alien to try to enter the U.S. illegally? d. illicitly trafficked in any controlled substance, or knowingly assisted, abetted or colluded in the illicit trafficking of any controlled substance? Yes No 4. Have you ever engaged in, conspired to engage in, or do you intend to engage in, or have you ever solicited membership or funds for, or have you through any means ever assisted or provided any type of material support to, any person or organization that has ever engaged or conspired to engage, in sabotage, kidnapping, political assassination, hijacking, or any other form of terrorist activity? Yes No 5. Do you intend to engage in the U.S. in: a. espionage? b. any activity a purpose of which is opposition to, or the control or overthrow of, the Government of the United States, by force, violence or other unlawful means? C. any activity to violate or evade any law prohibiting the export from the United States of goods, technology or sensitive Yes No information? 6. Have you ever been a member of, or in any way affiliated with, the Communist Party or any other totalitarian party? Yes No 7. Did you, during the period March 23, 1933 to May 8, 1945, in association with either the Nazi Government of Germany or any organization or government associated or allied with the Nazi Government of Germany, ever order, incite, assist or otherwise participate in the persecution of any person because of race, religion, national origin or political opinion? Yes No 8. Have you ever engaged in genocide, or otherwise ordered, incited, assisted or otherwise participated in the killing of any person because of race, religion, nationality, ethnic origin, or political opinion? Yes No 9. Have you ever been deported from the U.S., or removed from the U.S. at government expense, excluded within the past year, or are you now in exclusion or deportation proceedings? Yes No 10. Are you under a final order of civil penalty for violating section 274C of the Immigration Act for use of fraudulent documents, or have you, by fraud or willful misrepresentation of a material fact, ever sought to procure, or procured, a visa, other Yes No documentation, entry into the U.S., or any other immigration benefit? 11. Have you ever left the U.S. to avoid being drafted into the U.S. Armed Forces? Yes No 12. Have you ever been a J nonimmigrant exchange visitor who was subject to the 2 year foreign residence requirement and not Yes No yet complied with that requirement or obtained a waiver? 13. Are you now withholding custody of a U.S. Citizen child outside the U.S. from a person granted custody of the child? Yes No 14. Do you plan to practice polygamy in the U.S.? Yes No Form I-485 (Rev. 09-09-92)N Continued on back"
}
