{
	"anumber": "A29899363",
	"id": "A29899363_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RE-EXAM interview date:"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2008]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 S. Department of Homeland Security 8101 N. Stemmons Freeway Dallas, Texas 75247 DEPARTMENT U.S. Citizenship HOMELAND and Immigration SECURITY Services Lastenia Figuero Lanza File Number: A 029899363 FOIA (b)(6) Date: 3/27/2008 cc: Please come to the office shown below at the time and place indicated in connection with an official matter. OFFICE LOCATION 3010 N STEMMONS FRWY Dallas, Texas 75247 DATE AND 5/22/2008@J:15pmDO NOT STAND IN LINE PRESENT THIS NOTICE TO THE GUARD. HOUR Waiting room capacity is limited. Please do not arrive any earlier than 30 minutes Before your scheduled appointment time. The proceeding will take about 2 hours. ASK FOR RE-EXAM-400 REASON FOR APPOINTMENT This is your RE-EXAM interview date: BRING WITH This letter; alien registration card; Any evidence of Selective Service Registration; Your passport YOU and/or any other documents you used in connection with any entries into the United States; Those items noted below which are applicable to you: If applying for Naturalization AS THE SPOUSE of a United States Citizen; Your marriage certificate; Proof of death or divorce for each prior marriage of yourself or spouse; Your spouse's birth or naturalization certificate or certificate of citizenship. If applying for NATURALIZATION as a member of the United States Armed Forces; IT IS IMPORTANT THAT YOU KEEP THIS APPOINTMENT AND BRING THIS LETTER WITH YOU. If you are unable to do so, state your reason, sign below and return this letter to 8101 N STEMMONS FWY, DALLAS, TEXAS 75356 I am unable to keep the appointment because: Very truly yours, SIGNATURE DATE: Tracy arango COMPLETE Field Office Director APPROVED FOR FILING Form G-56 Initials: 3 (Rev. 5-1-83) Y Date: 4708 FCO/Unit 8A2485"
}
