{
  "anumber": "A29899363",
  "id": "A29899363_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificación, 1307727"
    },
    "years": {
      "ms_years_nlp_v1": [
        1938,
        2023,
        1967,
        1940,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 MEMO ONLY PRIMERA CLASE CINCUENTA CENTAVOS 1964-1967 No 1307727 1 2 El Infrascrito Secretario Municipal y encargado del Registro civil 3 del Municipio de Güinope Dpto. El Paraíso Certifica que al folio 4 No 16 Tomo 21 del Libro de Registro de Nacimientos de los años de GENERAL DE SECURITY 1938 a 1940 se encuentra la partida que a la letra dice: No 47.- - MONDURAS 6 h.n. CRUZ ARACELE LANZA. -En Güinope a los doce días del mes de a - 7 yo de mil novecientos treinta y ocho.-Ante mi Agustin Rivera Secre- BE ADUANAS 8 tario Municipal y ante los testigos don Felix Izaguirre P y Cipria- no Moncada R, solteros labradores compareció doña María Marcos Fi- Deceiron Gueroa V. de Lanza de Oficios comunes mayores de edad, hondureños 10 11 y de este vecindario, dando cuenta la compareciente de que el Mar- CENTRAL 12 tes tres del corriente mes, a las diez a.m. en su propia casa de 13 habitacion que tiene en este centre, nació una niña a quien pucie- 14 ron por nombre QRUZ ARACELI LANZA. -Es hija natural de Lastenia 15 Lanza Figueroa de oficios costurera, mayor de edad, natural y de es- 16 te domicilio. -Abuelos Maternos legítimos de la recien nacida la De- 17 ponente y don Salvador Lanza ya difunto.-Leida ratificó lo escrito 18 la denunciante y no firmó por no saber.- Felix Izaguirre. -Cipriano 19 Moncada R. Sello Agustin Rivera Secrerio.- Es conforme al original. 20 Estendida en Guinope a los nueve días del mes de Mayo de mil nove- 21 cientos sesenta y siete.- 122 23 24 I Family"
}