{
	"anumber": "A29899363",
	"id": "A29899363_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 Attachment(s) to Form N-335 Applicant: Lastenia Figueroa Lanza Application for Naturalization, Form N-400 Alien Number: A029899363 Application ID: SSC*001396456 Your application is hereby denied in accordance with the Title 8 Code of Federal Regulations Section(s) listed below: Reason: Unable to read, Speak, or Write English CFR8 Reference: Part 312 Educational Requirements for Naturalization Section 312.1 Literacy Requirements (a) General. Except as otherwise provided in paragraph (b) of this section, no person shall be naturalized as a citizen of the United States upon her or her own application unless that person can demonstrate an understanding of the English language, including ability to read, write, and speak words in ordinary usage in the English language. (b) Exceptions. The following persons need not demonstrate an ability to read, write, and speak words in ordinary usage in the English language: (1) A person who, on the date of filing of his or her application for naturalization, is over 50 years of age and has been living in the United States for periods totaling at least 20 years subsequent to a lawful admission for permanent residence; (2) A person who, on the date of filing his or her application for naturalization, is over 55 years of age and has been living in the United States for period totaling at least 15 years subsequent to a lawful admission for permanent residence; or (3) The requirements of paragraph (a) of this section shall not apply to any person who is unable, because of a medically determinable physical or mental impairment or combination of impairments which has lasted or is expected to last at least 12 months, to demonstrate an understanding of the English language as noted in paragraph (a) of this section. The loss of any cognitive abilities based on the direct effects of the illegal use of drugs will not be considered in determining whether a person is unable to demonstrate an understanding of the English language. For purposes of this paragraph, the term ?medically determinable? means an impairment that results from anatomical, physiological, or psychological abnormalities which can be shown by medically acceptable clinical and laboratory diagnostic techniques to have resulted in functioning so impaired as to render an individual unable to demonstrate an understanding of the English language as required by this section, or that renders the individual unable to fulfill the requirements for English proficiency, even with reasonable modifications to the methods of determining English proficiency as outlined in paragraph (c) of this section. (Revised 3/19/97; 62 FR 12915) (Corrected 4/2/97; 62 FR 15751) Furthermore, Section 312.5(b) states: If an applicant who receives notice of a second scheduled examination date fails to appear without good cause for that second examination without prior notification to the Service, the applicant will be deemed to have failed this second examination. Explanation: At your first interview you did not meet the requirements under 8 CFR section 312. At that interview you were given a date for your reexamination and failed to appear on that date for the examination. Your application for naturalization is hereby denied for failure to meet the requirements specified under section 312 and for failure to appear for an interview. Reason: Failure to Appear for an Interview CFR8 Reference: Part 335 Examination on Application for Naturalization Section 335.6 Failure to Appear for Examination"
}
