{
  "anumber": "A29899363",
  "id": "A29899363_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 Lastenia Lauze, FOIA (b)(6) U.S. POSTAGE PAID FOIA (b)(6) EXPRESS JUL 21. 07 UNITED STATES AMOUNT POSTAL SERVICE MAIL 0000 $16.25 00020670-04 UNITED STATES POSTAL SERVICE R www.usps.com Label 127R, February 2006 EXPRESS Mailing Label Label 11-B, March 2004 EB 602477046 US MAIL UNITED STATES POSTAL SERVICE Post Office To Addressee DELIVERY (POSTAL USE ONLY) Delivery Attempt Time Employee Signature Natur AM ORIGIN (POSTAL SERVICE USE ONLY) Mo. Day PM PO ZIP Code Day of De ivery Time $7625 Postage Delivery Attempt Employee Signature AM 76012 Next 2nd 2nd Del Day Mo. Day PM scheduled Date of Delivery Return Receipt Fee Delivery Date Time Employee Signature AM Date Accepted Month 728 $ Mo. PM Mo. 7-2707 Day Scheduled Time of Delivery COD Fee Insurance Fee CUSTOMER USE ONLY US CIS PAYMENT BY ACCOUNT WAIVER OF SIGNATURE (Domestic Mail Only) Time Accepted Noon 3 PM $ $ Express Mail Corporate Acct. No. Additional merchandise insurance is void if 3:15 VM AM customer requests waiver of signature. Military Total Postage Flat Rate or Weight 2nd Day 3rd Day 1695 wish delivery to be made without obtaining signature of addressee or addressee's agent (if delivery employee Federal Agency Acct. No. or judges that article can be left in secure location). and Postal Service Acct. No. authorize that delivery employee's signature constitutes Int'l Alpha Country Code Acceptance Emp. Initials valid proof of delivery. P.O. Box lbs. 3 ozs. wa NO DELIVERY Weekend Holiday Mailor Signature FROM: (PLEASE PRINT) PHONE 817 504 - 8010 TO: (PLEASE PRINT) PHONE Lastenia Lanza Naturalization Mesqui7 USCIS TSC FOIA (b)(6) P.O. Box 851204 Mesouite TX75185-1204 ZIP+4(U.S.ADDRESSES ONLY. DO NOT USE FOR FOREIGN POSTAL CODES.) FOR PICKUP OR TRACKING 75185 1204"
}