{
	"anumber": "A29899363",
	"id": "A29899363_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29899363_0033/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 3. Processing Information., Form I-485 ( (Rev. 09-09-92) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 Part 3. Processing Information. A. City/Town/Village of birth Paraiso-Handuess.cc Current occupation Your mother's first name GUINOPE/E/ NONE maria Your father's first name Salvador Give your name exactly how it appears on your Arrival /Departure Record (Form I-94) Lastenia Lanza figueroa Place of last entry into the U.S. (City/State) In what status did you last enter? (Visitor, Student, exchange Miami . Florida alien, crewman, temporary worker, without inspection, etc.) Were you inspected by a U.S. Immigration Officer? Yes No Visitor Nonimmigrant Visa Number Consulate where Visa was issued Date Visa was Issued 112877 Sex: Tequelgalpa Male Female Marital Status: Married Single Divorced Widowed (month/day/year) 07-11-88 Have you ever before applied for permanent resident status in the U.S? No Yes (give date and place of filing and final disposition): B. List your present husband/wife, all of your sons and daughters (if you have none, write \"none\". If additional space is needed, use separate paper). Family Gans Given Middle Date of Birth Name Lanza Name Aracely Initial (month/day/year) 05-03-38 Country of birth Relationship A Passport Applying with you? HonduRas CA Daughter FOIA (b)(6) Yes No Family Given Middle Date of Birth Name Name Initial (month/day/year) Country of birth A Relationship Applying with you? # Yes No Family Given Middle Date of Birth Name Name Initial (month/day/year) Country of birth A Relationship Applying with you? # Yes No Family Given Middle Date of Birth Name Name Initial (month/day/year) Country of birth A Relationship Applying with you? # Yes No Family Given Middle Date of Birth Name Name Initial (month/day/year) A Country of birth Relationship Applying with you? # Yes No C. List your present and past membership in or affiliation with every political organization, association, fund, foundation, party, club, society, or similar group in the United States or in any other place since your 16th birthday. Include any foreign military service in this part. If none, write \"none\". Include the name of organization, location, dates of membership from and to, and the nature of the organization. If additional space is needed, use separate paper. Non e Form I-485 (Rev. 09-09-92) N Continued On Next Page"
}
