{
	"anumber": "A30219729",
	"id": "A30219729_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTAMENTO DE ESTADO SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO EXTRANJERO, Form FS-516"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 ish) 2-68 Form Approved DEPARTAMENTO DE ESTADO Budget Bureau No. 47-R0150 SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este cuestionario debe llenarse por DUPLICADO a máquina 0, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las preguntas pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sírvase contestar en hojas aparte, por duplicado, indicando los mismos números de las preguntas del cuestionario a las que correspondan las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5.00. Estos derechos deben abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda nacional, 0 mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa U ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de. su enjuiciamiento, deportación, o ambos. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) IABRADO DEL ADVAREZ SOLEDAD 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name)) SOLEDAD IABRADO ALVARADO 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet (if Roman letters not used) N.P. 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Dia (Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Prov. o 25 ALIENDE Dpto.) Octubre 1907 CHIH (Province) País (Country) MEXICO 7. Nacionalidad 8. Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado (Male) Separado (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) MEXICANA (Single (never married)) 1 Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) HOGAR Calle Cromo No. 262 Nte, Cd. Juarez, Chih. Mexico 12. Motivo del viaje a los EE.UU. (Purpose in going to the United States) 13. Nombre completo y domicilio del cónyuge (consignar el apellido de soltera de la esposa) radicar. JOSE [Name and. address of wife/husband (give maiden name of wife) ] ALVAREZ CARRILLO CROMO 262 NTE. CD. JUAREZ 14. Nombres y domicilios de los hijos menores de 21 años (Names and addresses of children under 21 years of age) 15. La(s) persona(s) nombrada(s) en los números 13 y 14 me (no me) acom- pañará(n) a los Estados Unidos 0 se (no se) reunirá(n) conmigo posterior- mente en dicho país [Person(s) named in 13 and 14 (will) (will not) accompany or follow me n.Po to the United States] Tache lo que no corresponda (Cross out words that do not apply) 16. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanentemente, 17. Puerto de entrada indíquelo) PERMANENTEMENTE (Intended port of entry) [Length of intended stay (if permanently, so state) ] 18. Domicilio que tendrá en los Estados Unidos 153 RADFORD ST. EL PASO, TEXAS. Zappol EL PASO TEXAS. 19. ¿Tiene Ud. pasaje hasta su destino final? (Final address in the United States) (Do you have a ticket to final destination?) SI 20. Nombre, parentesco y domicilio de la persona con quien se reunirá en los Estados Unidos. Jose Ma. Alvarez Carrillo, 21. Nombre y domicilio de su fiador (si no es la misma persona u orga- [Person you intend to join (Give name address and relationship, if nización indicada en el numero 20.) any) mi ésposo [Name and address of sponsoring person or organization (if different from 20) ] 153 Radford St. E1 Paso, Texas. misma 22. Filiación personal: (Personal description) 23. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Height) (Color of hair) Cafe 1. m (ft.) 45 cm. (in.) ninguna b) Color de los ojos d) Tez (Complexion) (Color of eyes) Cafes morena 24. A esta solicitud se anexan los siguientes documentos: (The following documents are submitted in support of this application) Certificado de nacimiento Certificado de defunción (Birth certificate) Comprobante de medios económicos propios (Death certificate) Certificado(s) médico(s) (Evidence of own assets) Certificado(s) de policía Certificado de divorcio (Medical record(s) ) (Police certificate(s) Declaración jurada de manutención (Divorce decree) Fotografías Certificado de matrimonio (Affidavit of support) Hoja de servicio militar (Photographs) (Marriage certificate) Oferta de empleo (Military record) Otros (describanse) (Offer of employment) [Other (describe) ] ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
