{
  "anumber": "A30219729",
  "id": "A30219729_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, 1424418"
    },
    "years": {
      "ms_years_nlp_v1": [
        1907
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CO. Cert. 142418 TGE 54-09 Rec. de. Núm. (alleder Cantidad $ 30.80 Reducción según Oficio Núm. ACTA No. 142418 ESTADO DE CHIHUAHUA side serida by RECAUDACION DL RENTAS En nombre de la República Mexicana y como Juez del Registro Civil de este lugar hago saber a los que la presente vieren y certifico: le V, ALLENDE, CHIH. 60 NACIMIENTOS evoto o Que en el libro Núm. de la Sección de del Registro Civil que es a ini cargo, a fojas 116 la se encuentra un acta del tenor literal siguiente: horte 268 SOLEDAD LABRADO se Al margen ACTA NUMERO Nacimiento del del Huella digital del pulgar derecho de! niño. AL CENTRO: ESTADO DE CHIHUAHUA A Child CI A DE NACIMIENTO En la Villa de llende, Distrito Jimenz Registro Municipio de Allende, Chihuahua 10 diez a las Horas del día 4 custro de noviembre el de mil novecientos siete 1907 ante mí, Guadalupe Galván como del CIN el ciuda Juez del Registro Civil, comparece ca dano Eulogio Labrado de Nacionalidad PRESSOR demayor de edad años, de estado Civil casado febro vecino de Hda. de Corralejo con domicilio en elmismo lu r la y presenta una niña a quien puso por nombre SOLEDAD LABRADO bey hijo legítima del Eulogio Labrado lb DEL y de la Sra. María de Jesus Alvarado de 25 veinticinco de Octubre próximo que pasado nació a las 10 diez horas del día 65 del año que enHda. de Corrale manifiesta que es el Art. Matrimonio del PADRE MADRE registration Nombre El Compareciente Jesus María Alvarado ACTIS Edad la los Ocupación pogo Nacionalidad de limer PARA Domicilio sin ABUELOS PATERNOS Acter Nombre Eulogio Labrado Beninga López pressure Domicilio del nomero ABUELOS MATERNOS la Nombre Martín Alvarado Dolores Navarrete el espide Domicilio Apite que TESTIGOS el en Nombre Moreno José Agustín Moya Edad mayor de edad III yor de ed d Ocupación empleado emple do Domicilio esta vecind d esta vecindad Leída la presente Acta, fué ratificada por los intervinientes, firmando OS que supieron hacerlo Doy fe. G. G.lván.- Cruz Moreno.- - Jose Agusti - ES COPIA QUE CONCUERDA FIELMENTE EN TODAS SUS P RTES CON EL ORIGINAL RESPECTIVO LA QUE SE EXPIDE A SOLICITUD DE PARTE INTERES D EN VAT ALLENDE? CHIH. ? A LOS VEITNINUE IMP DEL COB DEL EDO VE DIAS DEL MES DE NOVEMBREADD MIL NOVECIEN os SETENTA Y- TRES. #7 Juez del Regi tro Civil REGISTI VIL I.G.E. 463-4751 VALLE DE AV LOS RIOS"
}