{
  "anumber": "A30255695",
  "id": "A30255695_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ANtrag auf Erteilung eines Einwanderungsvonis und Auslandermanmeldungen, Form FS-510 ( (Ged)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (Ge 2-68 DEPARTMENT OF STATE ANTRAG AUF ERTEILUNG EINES EINWANDERUNGSVISUMS UND AUSLANDERANMELDUNG ANW IG: Dieses Formblatt ist in ZWEI EXEMPLAREN auszufertigen, und zwar in Maschinenschrift oder in deutlicher Druckschrift. SÄMT E Fragen, soweit sie zutreffen, müssen beantwortet werden. Fragen, die nicht zutreffend sind, müssen entsprechend bezeichnet werden. Sollte für die Beantwortung einer Frage auf dem Formblatt nicht genügend Platz sein, so kann die Beantwortung mit Angabe der entsprechenden Bezugsziffer auf einem besonderen Blatt in zweifacher Ausfertigung vorgenommen werden. Die Zusatzblätter sind den Antragsformularen beizu- heften. Das Formblatt ist NICHT ZU UNTERZEICHNEN bevor der Konsularbeamte die Weisung dazu erteilt hat. Die Antragsgebühr für das Einwanderungsvisum beträgt $5.00. Diese Gebühr ist bei der Vorladung zum Konsulat in US Dollar, in einheimischer Währung zum Gegenwert oder mittels eines von einer Bank ausgestellten Schecks zu entrichten. WARNUNG: Falsche Angaben oder die Verheimlichung wesentlicher Tatsachen können für den Betreffenden die unwiderrufliche Ausschliessung aus den Vereinigten Staaten zur Folge baben. Sollte sich trotz genehmigter Einreise später ergeben, dass diese an Hand von falschen Angaben erwirkt wurde, so kann eine strafrechtliche Verfolgung oder Ausweisung, oder beides, erfolgen. 1. Familienname (Family name) Rufname (First name) Weitere Vornamen (Middle name) MOTACKA WLADYSKANA NIGHT 24TREFFEND 2. Andere Namen, die vom Antragsteller benutzt wurden oder unter denen er bekannt ist (bei verheirateten Fraven der Madchenname) (Other names used or by which known (If married woman, give maiden name)) SEB. DABROWSKA div GRIGALSKI 3. Volle Namensangabe in der Schrift des Herkunftslandes (wenn anders als lateinische Schrift) (Full name in native alphabet (If Roman letters not used)) NICHT ZHTPEFFEND 4. Geburtsdatum (Date of birth) 5. Alter (Age) 6. Geburtsort (Place of birth) Tag Monat Jahr Stadt Kreis Land (Day) (Month) (Year) (City (Province) (Country) 29 4 1906 67 or town) BRODNICA , POLEN 7. Staatsangehörigkeit (Nationality) 8. Geschlecht (Sex) HEIMATLOSE AUSLANDER Männlich (Male) Weiblich (Female) 9. Zivilstand (Marital status) Ledig (nie verbeiratet) Verheiratet Verwitw. Geschieden Getrennt (single (never married)) (Married) (Widowed) (Divorced) lebend Einschliesslich meiner jetzigen Ehe, war ich 2 (Separated) mal verheiratet. (Including my present marriage, I have been married times.) 10. Beruf ober Beschäftigung (Occupation) 11. Gegenwärtige Anschrift (Present address) HALISFRA4 Housewife STUVESTRASLE 25 ESSEN-WEST 12. Zweck der Reise in die Vereinigten Staaten 13. Name und Anschrift des Ehepartners (Purpose in going to the United States) join children (bei Ebefrauen auch der Madchenname) NICHT (Name and address of wife/husband 24 DEN KINDERN (Give maiden name of wife)) 24TPEFFENDS 14. Namen und Anschriften von Kindern unter 21 Jahren 15. Die in Spalte 13 und 14 aufgeführten Personen werden mich (Names and addresses of children under 21 years of age) (nicht) begleiten oder mir (nicht) in die U.S.A. folgen. (Bitte nichtzutreffendes streichen) NieHT 24TREFFEND None (Person (s) named in 13 and 14 (will) (will not) accom- pany or follow me to the United States. (Cross out words that do not apply.)) Nient 24TREFFEN) 16. Dauer des beabsichtigten Aufenthaltes-went unbegrenzt, bitte 17. Voraussichtlicher Einreiseort angeben. (Intended port of entry) (Length of intended stay (if permanently, so state)) LINBEGREN2T indefinitely DETROIT 18. Ständige Anschrift in den U.S.A. 19. Haben Sie eine Fahrkarte zum Bestimmungsort? (Do you have (Final address in the United States) WOOD LIVONIA Mi a ticket to final destination?) 34244 DR. 48154 NOCH NICHT 20. Name und Anschrift und Verwandschaftsgrad (fails zutreffend) 21. Name und Anschrift der für Sie bürgenden Person oder Or- der Person, zu der Sie in die U.S.A. reisen (Person you intend ganisation wenn anders als in Spalte 20 MR.AND MRS. SOLUS 34244 WOOD Dr. LIVONIA to join (Give name, address and relationship, if any)) (Name and address of sponsoring person or organization (if different from 20)) TOCHTER UND 22. Personalbeschreibung (Personal description) 23. Unveränderliche körperliche Merkmale (Marks of identification) grey (a) Haarfarbe (c), Grösse (Height) (Color of hair) m. (ft.) 55 cm. (in.) grey GRA4 None KEINE (b) Augenfarbe SRAY (d) Hautfarbe WEISL (Color of eyes) (Complexion) cau 24. Folgende Unterlagen werden diesem Antrag beigefügt: (The following documents are submitted in support of this application:) Geburtsurkunde Sterbeurkunde Vermögensnachweis Gesundheitszeugnis (Birth Certificate) (Death certificate) (Evidence of own assets) (Medical record (s) Poliz. Führungszeugnis Scheidungsurteil Bürgschaftsurkunde Lichtbilder (Police certificate (s) ) (Divorce decree) (Affidavit of support) (Photographs) Heiratsurkunde Militärdienstzeugnis Stellungsangebot Andere (Marriage certificate) (Military record) (Offer of employment) (Other (describe) DIESES FORMULAR IST GRATIS BEI KONSULATEN DER VEREINIGTEN STAATEN VON AMERIKA ERHÄLTLICH"
}