{
  "anumber": "A30219822",
  "id": "A30219822_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219822_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, 4-39-R0368"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED. IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-RO368 PATE FILED 00 PM FEE STAMP APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE 300 PASOD E BRIDGE ELP-50-74-1876 OF AN ALIEN SUBOFFICE ÉL PASO, TEXAS In connection with immigrant visa application(s) of my 4/3/74 SH relative(s) listed in item 15 Mexico American Consul at be furnished a verification of my lawful admission into the United (City and Country abroad) States for permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME is (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: PADILLA Olivas, Jose Alfonso A30 219 822 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) Barcelona Dr. 333, Paso, Texas 79905 4. PERMANENT ADDRESS IN THE U.S. (Number and Street) (City) (State) (Zip Code) same 5. MY DATE OF BIRTH IS (Month) (Day) (Year) 6. MY PLACE OF BIRTH WAS (City) (Country) 7. I AM NOW A CITIZEN OF (Country) 8 18 11 Velardena,Durango,Mexico Mexico e MY FATHER'S NAME 9. MY MOTHER'S FULL MAIDEN NAME: Octaviano Padilla Austrebertha Olivas DATA RELATING TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE OR MY ADJUSTMENT OF STATUS TO PERMANENT RESIDENT 10. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE OR ADJUSTMENT OF STATUS TO PERMANENT RESIDENT: 11. MY U.S. PORT OF ARRIVAL WAS (Last) (First) (Middle) PADILLA Olivas, Jose Alfonso Paso, Texas 12. MY DATE OF ARRIVAL OR ADJUSTMENT WAS (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS (Show Name of Vessel or Airline and Flight No., etc.) 2/13/74 on foot 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: Antonia Padilla de Moss/Bunker 5658 St. E Paso, Texas 14. I first obtained an immigrant visa at a United States consular office abroad on (date) (location). At that time, I was was not married. 2/74 Cd.Juarez,Chih.Mexico 15. Including my present marriage I have been married 1 times. The name of my present spouse is: Reynalda Villalobos to whom I was married on 4/23/38 at Santa Barbara, Mexico My present spouse is (Check One) (date) (location) a U. S. Citizen La permanent resident neither of these. If married more than one time, list names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: 16. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH FOIA (b)(6) FOIA (b)(6) RELATIONSHIP ADDRESS FOIA (b)(6) FOIA (b)(6) FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 17. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby informed that the applicant named x Jase Cyenso Padilla Olives above was was not lawfully admitted for permanent residence. His \"A\" file shows date of first admission for permanent residence as 2-13-74 , symbol IR-5 issuing post and date of issuance of IV. Cd. Juarez, Mexico 2-12-74 marital status at time of first admission - Single, Married; Divorced; Widowed. File does does not establish relationship between applicant herein and visa applicant. Verification made from Form I-151 personally presented by applicant showing lawful permanent residence of: El Paso, Texas Date: Verifier: Ht Roberto Torres INS OFFICE: 4-24-74 FORM 1.550 (REV. 2.1.73)N X1 Paso, Texas"
}