{
	"anumber": "A30219729",
	"id": "A30219729_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [7913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE 29 FORM APPROVED. GRATION AND NATURALIZATION SERVICE OMB NO. 43.RO368 DATE FILED APPLICATION FOR VERIFICATION OF CT y PM FEE STAMP LAWFUL PERMANENT RESIDENCE Al-50-74-19-29 300 FEE PAID No. OF AN ALIEN Immigration and Naturalization Service In connection with immigrant visa application(s) of my El Paso, Texas OIC relative(s) listed in item 15 below, I request that the American Consul at CD? JUAREZ CHIH, Date 10/10/73 Verified by miz be furnished a verification of my lawful admission into the United (City and Country abroad) States for permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: CARRILLO JOSE MARIA ALVAREZ A10-533-9671 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) Radford I53 El Paso Texas 4. PERMANENT ADDRESS IN THE U.S. (Number and Street) (City) (State) (Zip Code) 5. MY DATE OF BIRTH IS: (Month) (Day) (Year) 6. MY PLACE OF BIRTH WAS: (City) (Country) 7. I AM NOW A CITIZEN OF: (Country) March I9 I900 Camargo Chih. Mexico 8. MY FATHER'S NAME: 9. MY MOTHER'S FULL MAIDEN NAME: Anastacio Alvarez Damiana Carrillo DATA RELATING TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE OR MY ADJUSTMENT OF STATUS TO PERMANENT RESIDENT 10. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE OR ADJUSTMENT OF STATUS TO PERMANENT RESIDENT: 11. MY U.S. PORT OF ARRIVAL WAS: (Last) (First) (Middle) CARRILLO JOSE MARIA ALVAREZ El Paso,Texas 12. MY DATE OF ARRIVAL OR ADJUSTMENT WAS: (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS: (Show Name of Vessel or Airline and Flight No., etc.) 08 I5 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: ALBERTO ACOSTA 14. I first obtained an immigrant visa at a United States consular office abroad on (date) (location). At that time, I was was not married. 08-I5-55-c.Juarez. 15. Including my present marriage I have been married times. The name of my present spouse is: to whom I was married on at My present spouse is (Check One) (date) (location) a U. S. Citizen a permanent resident neither of these. If married more than one time, list names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: 16. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH SOLEDAD LABRADO de ALVAREZ Valle Allende Chih. Nov. 4-I907 RELATIONSHIP ADDRESS Wife Calle Cromo 262 Nte. C. Juarez, Chih. FULL NAME DATE AND PLACE OF BIRTH CONSULATE OF THE UNITED STATES RELATIONSHIP ADDRESS OF AMERICA FULL NAME DATE AND PLACE OF BIRTH NOV 7913 RELATIONSHIP ADDRESS CIUDAD JUAREZ, MEXICO NOT TO BE FILLED OUT BY APPLICANT The Secretary of State is hereby informed that the applicant named Arezan FULL SIGNATURE OF APPLICANT COMMUNED Careerly above was was not lawfully admitted for permanent residence. His \"A\" file shows date of first admission for permanent residence as 7-27-55 symbol 0-1 issuing post and date of issuance of IV. Cd. Juarez, Mexico 7-26-55 marital status at time of first admission - Single; Married; Divorced; Widowed. File does does not establish relationship between applicant herein and visa applicant. Verification made from Form I-151 personally presented by applicant showing lawful permanent residence. of INS OFFICE: El Paso, Texas (Mrso) E. Mo McCluskey& section Date: 11-6-73 Verifier: Paso, Tesage FORM 1.550 (REV. 2.1.73) N Price"
}
