{
	"anumber": "A30219729",
	"id": "A30219729_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT--WITNESS, Form I-263W ( (3-27-67)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1967]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNIDED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT-- WITNESS Office: El Paso, Texas File No: A10 533 968 Statement by: Soledad Labrado de Alvarez In the case of: Soledad Labrado de Alvarez At: Santa Fe Bridge Suboffice Date: November 2, 1967 Before: Raymond E. Reaves, Immigrant Inspector (Name and Title) In the Spanish language. Interpreter Raymond E. Reaves used. I am an officer of the United States Immigration and Naturalization Service authorized by law to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. I desire to take your sworn statement regarding your right to enter the United States under the laws of this country. Q. Any statement you make must be given freely and voluntarily. Are you willing to answer my questions at this time? A. Yes. Q. Do you swear that all the statements you are about to make will be the truth, the whole truth and nothing but the truth, so help you God? A. Yes. Q. Do you read and understand the Spanish language? A. Yes. Q. What is your true and correct name ? A. Soledad Labrado de Alvarez. Q. When and where were you born and of what country are you a citizen? A. I was born October 25, 1907 in Parral, Chihuahua, Mexico and I am a citizen of Mexico. Q. What is your father's name and where was he born? A. Eleugio Labrado and he was born in Parral, Chihuahua. Q. Was your father a citizen of Mexico all of his life? A. Yes but he lives in El Paso now. Form I-263W (3-27-67)"
}
