{
	"anumber": "A30219822",
	"id": "A30219822_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219822_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1968, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "A30 ELP IV 219822 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HAS NOT loca -151 THERE BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) JOSE (Middle Name) & NS FILE NUMBER, IF PADILLA_OLIVAS, ALFONSO KNOWN A30 219 822 ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION 0. S. INDICATION IN PARO CITY LIVES, INC. NOT APPLICABLE 750 ED 150% (Name of vessel or flight no. of arrival) FEB 13 1974 INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT ROMITTED IR- 5 2 212(e) 212(h) CC 0 ATTACHED 212(g) 212(i) COUNT aft RY OF LAST X NOT REQUIRED MO.-DAY-YR. COUNTRY OF BIRTH OCCUPATION MARITAL STATUS SEX NA TIONALITY OF BIRTH RESIDENCE 08-18-11 MEXICO EMPLOYEE MEXICO W D SEP M MEXICAN F FINAL ADDRESS STREET ADDRESS CITY, STATE. AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 5658 BUNKER ST. FT BLISS TEX 79906 429 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CONSULATE CLASSIFICATION SYMBOL AMERICAN IR-5 FOREIGN STATE/DEPENDENTAREA ARMSTRONG AT for MIDAD JUAREZ HIHUAHUA. MEXICO 140ml MEXICO 005 IMMIGRANT VISA NO. NOT APPLICABLE SAM G. ISSUED ON (Day) (Month) (Year) of the United States of America. 12 FEBRUARY 74 CONSUL THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) Padilla 11 JUN 74 PASSPORT NO. 303 TACHED OR OTHER TRAVEL DOCUMENTS (Describe). NOT APPLICABLE VICE ISSUED TO JOSE ALFONSO PADILLA OLIVAS UNITED OF AMERICA BY MEXICAN GENERAL CONSULATE EL PASO TEX ON Tariff Item No. 21 26 JAN 74 Fee Paid $20 EXPIRES Local Cy Equiv I-186 LIFTED AND DESTROYED ONE TRIP ONLY FORM FS-511 # U. S. GOVERNMENT PRINTING OFFICE 1968 318-498 1 68"
}
