{
  "anumber": "A30255695",
  "id": "A30255695_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0044/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA MEDICAL EXAMINATION OF VISA APPLICANTS, FORM FS-398"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PLACE Dr. med. A. Sauer DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA Frankfurt/Main MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION Bockenheimer Landstr. 43 Sept. 26. 1973 Tel. 721467 CITY COUNTRY At the request of the American Consul at Frankfurt/Main Germany NAME AGE SEX I certify that on the above date I examined Motacka, Wladyslawa 67 f I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancioid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma. inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, B, or C - diagnosis, and pertinent details*): class C : Plates upper and lower gum 08064 Qualified Chest X-ray report from Dr. Negative Approved Laboratory Blood serological report from Dr. Other special report(s) (when needed) MEDICAL DR from Dr. SIGNATURE OF MEDICAL TECHNICAL ADV flu SAUER E DATE OF FINAL REPORT FAA 26. SEP. 1973 FRANCIS oncinue on reverse side if necessary. FORM FS-398 7-71 04557-390-1"
}