{
  "anumber": "A30219729",
  "id": "A30219729_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Resident Alien Card Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1967,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Q. What type of passport does your father have at the present time? A. Residence. Q. Has your father ever become a citizen of the United States by naturalization? A. No. Q. What is your mother's name and where was she born? A. Maria de Jesus Alvarado and she was born in Parral also. Q. Has your mother been a citizen of Mexico all of her life? A. Yes. Q. I now refer to resident alien identification card, A10 533 968, issued to Soledad Labrado de Alvarez indicating she immigrated to the United States, July 27, 1955. To whom does this resident alien card belong? A. It is mine. Q. Did you present this resident alien card yesterday, November 1, 1967 and apply for admission to the United States here at El Paso, Texas? A. Yes. Q. Was your resident alien card taken up by an inspector of this Service who issued you a form SW 426? A. Yes. Q. Were you a llowed to enter the United States yesterday when your card was taken up after the inspector gave you this slip of paper? A. Yes. I am coming from Juarez now. Q. When you returned from El Paso yesterday to pick up your resident alien card, it was not returned to you, was it? A. No. Q. Did you return to Juarez, Mexico yesterday, after your resident alien card was not returned to you? A. Yes. Q. You have stated you are coming from Juarez, Mexico at the present time. Are you coming for the purpose of reclaiming your resident alien card and entering the United States? A. Yes to pick up my card. Q. Where do you live at the present t ime? A. Calle Cromo #211 Nte. in Juarez. -20"
}