{
  "anumber": "A30219822",
  "id": "A30219822_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219822_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR WAIVER OF PASSPORT AND/OR VISA"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved UNITED STATES DEPARTMENT OF JUSTICE OMB No. 43-R0355 IMMIGRATION AND,NATURAL SERVICE FEE STAMP ARPLICATION $ 500 FEE PAID No. 1 BOA 80-181-4 Immigration and Naturalization Service FOR WAIVER OF PASSPORT El Paso, Texas OIC Date 7-17-80 Verified by Emily AND/OR VISA FILE NO. (See Instructions on Reverse) 430 219 8221 GIP 1 MYNNAME 15: (Last) (First) (Middle) 2 MY PADILLA UNITED STATES ADDRESS - OLIVAS IS (Apt. No.) VOSE (Number and Street) ALfonso (City) (State) (ZIP Code) 1137 So. NEW HAMPSHIRE L.A, CALIF 90006 3. MY PERMANENT ADDRESS ABROAD IS: 4. THE COUNTRY OF WHICH I AM A CITIZEN, SUBJECT OR NATIONAL IS : MEXICO 5. PLACE OF BIRTH: DATE OF BIRTH VELARDENA Doo MEX 08-18-11 6. DATE OF ARRIVAL: PORT OF ARRIVAL FEB 13,1994 El PASO Tx 7. MANNER OF ARRIVAL: (Name of Vessel, Airline etc.) 8. PLACE VISA PREVIOUSLY ISSUED: DATE: CLASSIFICATION: VALID TO: CD JUAREZ , CHIH IR-5 PERM RES 9. PLACE PASSPORT ISSUED: DATE: VALID TO: 10. THE REASON I AM NOT IN POSSESSION OF PASSPORT VISA IS AS FOLLOWS: (CONTINUE ON REVERSE, IF NECESSARY) ME 10 ROBARON DATE OF THIS APPLICATION I CERTIFY THAT THE ABOVE IS TRUE AND CORRECT. 7-16-80 CITY AND STATE El PASO, Tx Padiela (SIGNATURE OF APPLICANT) SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. f Reeves Yarold El Paso, Ix 7/16/80 (Signature) (Address) (Date) MEX P.P. SEEN w/ AdmiNioN strop ( 2-13-74) IR- APPLICANT NOT TO WRITE BELOW THIS LINE Application approved. Waiver granted Application disapproved. by authority of A.P.P P. Reyes Under Section 2110 (INS) DATE OF ACTION Under Section 2120 d) (4) by authority of (INS) DO OR with concurrence of OIC OFFICE (State Department) ADMITTED AS UNTIL (NONIMMIGRANT CLASS) Form I-193 (Rev. 1-25-80)N"
}