{
  "anumber": "A30255695",
  "id": "A30255695_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "National Archives at Kansas City, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "39. Haben Sie iemals um Befreiung V. Ausbildung und Wehrdienst in den Streitkräften a ereinigten Staaten nachgesy ber haben Sie die Vereinigten Staaten verlassen bzw. sich ausserhalb des Landes aufgehalten, um sich der pflicht zu entziehen oder ihr auszuweichen (Wenn ja, bitte nabere Angahen.) (Have you ever NICHI ZUTRETTERS applied for relief from training and service in the United States armed forces or departed from or remained ide the United States to avoid or evade military service? (If answer is Yes, explain.)) Ja Nein 40. Beabsichtigen Sie, von Kanada, Mexiko oder einer den Vereinigten Staaten benachbarten Insel aus innerhalb von zwei Jahren nach Ihrer dortigen Ankunft in die Vereinigten Staaten einzureisen? (Wenn ja, so nennen Sie bitte die Verkehrsgesellschaft, mit der Sie im betreffenden Land angekommen sind oder dorthin zu reisen beabsichtigen.) (Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island.)) Ja Nein 41. Die Einwanderungsgesetze der Vereinigten Staaten verlangen von jedem Antragsteller auf ein Visum die Angabe, ob er zu den Personen- gruppen gehört, denen die Einreise in die Vereinigten Staaten nicht gestattet werden kann. Diese Personengruppen, die keine Einreise- genehmigung erlangen können, werden nachstehend beschrieben. Sie sollten die folgenden Absätze sorgfältig lesen; Ihre Kenntnisnahme des Inhalts und die Antworten, die Sie auf die folgenden Fragen geben, werden dem Konsulatsbeamten helfen, die Entscheidung über die Genehmigung Ihres Visums zu treffen. (United States laws governing the issuance of visas require each applicant to state whether or not he is a member of any class of individuals excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understanding of their content and the answers you give to the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa.) AUSLÄNDER, DIE DEN FOLGENDEN PERSONENGRUPPEN ANGEHÖREN, KONNEN KEIN EINWANDERUNGSVISUM ERHALTEN, ES SEI DENN, ES BESTEHT EINE GESETZLICHE AUSNAHMEREGELUNG: (EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA:) (a) Ausländer, die geistig zurückgeblieben sind, unter einer Geisteskrankheit leiden oder einen oder mehrere Anfälle von Geistesstörung erlitten haben; Ausländer, die psychopathisch oder sexuell abartig veranlagt sind, sowie Rauschgiftsüchtige und chronische Alkoholiker, oder Personen, die an einer gefährlichen, übertragbaren Krankheit leiden Ausländer, die ein körperliches Gebrechen, Leiden oder eine Körperbehinderung haben, die ihre Arbeitsfähigkeit beeinträchtigt; Ausländer, die Empfänger der öffentlichen Armenfürsorge, berufs- mässige Bettler oder Landstreicher sind; Ausländer, die wegen eines Verbrechens verurteilt wurden, welches gegen das sittliche Empfinden der Offentlichkeit verstösst, oder die zugeben, eine Handlung begangen zu haben, welche die grundsätzlichen Handlungselemente eines solchen Verbrechens aufweist, oder die zu insgesamt mindestens fünf Jahren Haft aufgrund von zwei oder mehr Verbrechen verurteilt worden waren; Ausländer, die Vielweiberei betreiben, deren Anhänger und Befürworter sind; Ausländer, die Prostitution betreiben oder betrieben haben, die von der Prostitution jemals finanziellen Gewinn erzielt haben, die Personen zum Zwecke der Prostitution angeworben oder in andere Länder gebracht haben, oder welche in die Vereinigten Staaten einreisen möchten, um dort der Prostitution oder anderen gewerblichen Unsittlichkeiten nachzugehen, oder um dort eine unzüchtige Handlung zu begehen Ausländer, die in die Vereinigten Staaten einreisen möchten, um dort gelernte oder ungelernte Arbeit zu verrichten, ohne eine Genehmigung des Arbeitsministeriums zu haben, und Ausländer, die voraussichtlich der öffentlichen Wohlfahrt der Vereinigten Staaten zur Last fallen werden. ( a ) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity; aliens afflicted with psychopathic personality, sexual deviation, a mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn a living; aliens who are paupers, professional beggars, or vagrants; aliens convicted of a crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to confinement for at least five years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in, benefitted financially from, procured or imported per- sons for the purpose of prostitution, or who seek entry to the United States to engage in prostitution or other commercialized vice, or any immoral sexual act; aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor; and aliens likely to become a public charge in the United States.) Trifft einer der vorgenannten Punkte auf Sie zu? Ja Nein (Wenn ja, bitte nähere Angaben.) (Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain.)) (b) Ausländer, die innerhalb eines Jahres nach ihrer Ausweisung aus den Vereinigten Staaten um Wiedereinreise nachsuchen, oder die festgenommen und aus den Vereinigten Staaten deportiert worden waren, oder anstelle einer Deportation auf Kosten der Regierung die Vereinigten Staaten zwangsweise verlassen haben oder die als bedürftiger oder feindlicher Ausländer veranlasst worden sind, aus den Vereinigten Staaten auszureisen; Ausländer, die versucht haben durch Betrug oder vorsätzliche falsche Angaben ein Visum oder andere Dokumentation zu erhalten; Ausländer, die die amerikanische Staatsbürgerschaft nicht erwerben können, oder welche während eines Krieges oder allgemeinen Ausnahmezustandes die Vereinigten Staaten verlassen und sich ausserhalb des Landes aufgehalten haben, um der amerikanischen Wehrpflicht zu entgehen; Ausländer, die auf grund der Ubertretung oder einer Planung der Ubertretung von bestimm- ten Gesetzen oder Regelungen bezüglich narkotischer Drogen oder Marihuana verurteilt worden waren, oder die illegale Händler von narkotischen Drogen oder Marihuana sind oder je gewesen sind; Ausländer, die von einem ausländischen, an die Vereinigten Staaten grenzenden Gebiet oder einer benachbarten Insel, innerhalb von zwei Jahren nach ihrer Ankunft in einem dieser Gebiete, als Passagier einer nicht zugelassenen Verkehrsgesellschaft, um Einreise in die Vereinigten Staaten nachsuchen; Ausländer, die keine Sprache oder Mundart lesen oder verstehen können; Ausländer, die wissentlich und gegen Entgelt einem anderen Ausländer geholfen oder diesen ermutigt haben, in die Vereinigten Staaten auf ungesetzlichem Wege einzureisen, oder dieses zu versuchen; Ausländer, die frühere Aus- tauschbesucher waren und noch nicht die erforderlichen zwei Jahre nach der Ausreise ausserhalb der Vereinigten Staaten zugebracht haben. (b) Aliens who seek re-entry within one year of their exclusion from the United States, or who have been arrested and deported from the United States, or removed at Government expense in lieu of deportation, or removed as an alien in distress or as an alien enemy; aliens who procure or attempt to procure a visa or other documentation by fraud or willful misrepresentation; aliens who are not eligible to acquire United States citizenship, or who have departed from or remained outside the United States to avoid United States military service in time of war or national emergency; aliens who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or marihuana, or who are known or believed to be, or to have been, an illicit trafficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within two years of their arrival therein on a non-signatory carrier; aliens who are unable to read and understand some language or dialect; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter the United States in violation of law; and aliens who are former exchange visitors who have not fulfilled the two-year foreign residence requirement.) Trifft einer der vorgenannten Punkte auf Sie zu? Ja Nein (Wenn ja, bitte nähere Angaben.) (Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain.)) (c) Ausländer, die Anarchisten sind oder jemals solche waren, oder jemals Mitglieder einer kommunistischen oder anderen totalitären Partei, einschliesslich deren unter- oder beigeordneten Organisationen waren; Ausländer, die mündlich, schriftlich, durch gedrucktes Material oder durch Mitgliedschaft in einer Organisation folgendes befürwortet oder gelehrt haben: (1) Opposition gegen konstitutio- nelle Regierung, (2) gewaltsamen Umsturz einer Regierung, (3) Körperverletzung oder Tötung von Regierungsbeamten aufgrund ihrer amtlichen Tätigkeit, (4) gesetzwidrige Besitzzerstörung, (5) Sabotage oder (6) die Doktrinen des Weltkommunismus oder die Errich- tung einer totalitären Diktatur in den Vereinigten Staaten; und Ausländer, die in die Vereinigten Staaten einreisen wollen, um dort zersetzende oder gesetzwidrige, auf Umsturz abgezielte Handlungen vorzunehmen."
}