{
  "anumber": "A30255695",
  "id": "A30255695_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Abandonment by Alien of Status as Lawful Permanent Resident"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States",
        "Poland"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE To DET. ABANDONMENT BY ALIEN OF STATUS AS LAWFUL PERMANENT RESIDENT 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER MOTACKA WLADSLAWA A 30 255 695 2. LAST PERMANENT ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) Route # 1, Box 91, Gobles Michigan 49055 3. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP April 29, 1906 Poland stateless 4. DATE OF DEPARTURE FROM UNITED STATES NAME OF VESSEL, AIRLINE, OR OTHER MEANS PORT OF DEPARTURE FROM U.S. OF DEPARTURE 5. INTENDED PERMANENT ADDRESS ABROAD 43 Essen, Germany 6. I VOLUNTARILY AM ABANDONING HAVE ABANDONED MY STATUS AS LAWFUL PERMANENT RESIDENT OF THE U.S. BECAUSE: See below) 7. DATE OF ABANDONMENT OF STATUS AS LAWFUL PERMANENT RESIDENT OF THE U.S. 8. SELECTIVE 10A. SELECTIVE SERVICE BOARD NUMBER AND LOCATION (City, Town and State) SERVICE STATUS n/a 9. MY DEPARTURE OR PRESENCE OUTSIDE THE U.S. IS IS NOT FOR THE PURPOSE OF AVOIDING OR EVADING SERVICE IN THE ARMED FORCES OF THE UNITED STATES. 10. DOCUMENTS SURRENDERED. (Describe) Reenter Permit 11. SIGNATURE OF ALIEN DATE PLACE see below FOR GOVERNMENT USE ONLY REMARKS OF IMMIGRATION OR COUNSULAR OFFICER: re-entry permit of Wladslawa Motacka was sent to this office by mail with the attached statement from the City of Essen, Germany and declaration of the subject. Subject did not appear to complete I-407 and the form is being used to transmit the re-entry permit to INS/Frankfurt for further disposition. SURJECT TURNED IN REGUMY PERMIT £ 0584239 CITY OR BREEN WITH THE DESCARATION Tinor TO sire THE WOULD NOT RETURN 70 THE U.S. ANA WORLD REMAIN IN GERMANY fele SIGNATURE OF IMMIGRATION OFF COUNSULAR OFFICER TITLE DATE PLACE Paul C. Bofinger 7-10-75 Duesseldorf American Consul TO: DISTRICT DIRECTOR FOR FILE DATE (CITY) (STATE) FORM 1-407 (Rev. 4-1-73) N GPO 943-828"
}