{
  "anumber": "A30219729",
  "id": "A30219729_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219729_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Questionnaire for Immigrants, -4-"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Q. Where are all of your clothes, personal belongings and furniture? A. In Juarez. 8. Where are all of the clothes and personal belongings of your husband? A. In Juarez because that is where we live. Q. Do you or your husband own any other property anywhere in Mexico? A. Yes we have a small farm. Q. Where is the small farm located? A. Near Samalayuca. Q. HOW large is your farm? A. Sixty hectarias. Q. Do you or your husband own any other property in Mexico? A. No. Q. Do you or your husband own any property in any part of the United States? A. No. We want to sell our property and move to the United States. Q. Do you or your husband have a house, room, or apartment rented anywhere in the United States at the present time ? A. No. Q. Do you or your husband have an established permanent residence anywhere in the United States at the present time? A. No because when my husband goes away to work he always returns to Juarez to live with me. Q. When your husband has made these trips to work in places outside of El Paso, have you gone with him? A. No I stay at home. Q. Are all of your children grown and married? A. We have an adopted son whom we raised and lives at Sunland Park, New Mexico. He is an American citizen. Q. Was he born in the United States? A. Yes. Q. When did you and your husband adopt him? A. When he was one year old. We actually didn't adopt him. He belonged to a friend of mine so we took him. His mother died and we raised him. We didn't have any papers for him. S -4-"
}