{
  "anumber": "A30219822",
  "id": "A30219822_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30219822_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, NARA-0123"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/27/2023 INSTRUCTIONS READ INSTRUCTIONS CAREFULLY. FEE WILL NOT BE REFUNDED. Application should be executed and SIGNED in duplicate and submitted to the office of the Immigration and Naturalization Service having jurisdiction over the applicant's permanent address in the United States. All the information called for in the application must be furnished legibly. If the application is not submitted to the proper office of the Service, or if information called for in the application is omitted or is illegible, or if the application is submitted without the applicant's signature or the required fee, the appli- cation will not be considered as having been properly filed, and will be returned to the applicant. FEE-- A fee of three dollars ($3.00) must be paid for filing this application. It cannot be refunded regardless of the action taken on the application. DO NOT MAIL CASH. ALL FEES MUST BE SUBMITTED IN THE EXACT AMOUNT. Payment by check or money order must be drawn on a bank or other institution located in the United States and be payable in United States currency. If applicant resides in the Virgin Islands, check or money order must be payable to the \"Commissioner of Finance of the Virgin Islands.\" If applicant re- sides in Guam, check or money order must be payable to the \"Treasurer, Guam.\" All other applicants must make the check or money order payable to the \"Immigration and Natural- ization Service\". When check is drawn on an account of a person other than the applicant, the name of the applicant must be entered on the face of the check. If payment is made by the type of international money order that cannot be mailed, the money order must be drawn on the postmaster of the city in the United States to which the application will be mailed, and that city, the money order number, and the date must be shown clearly on the top margin of the application form. IMPORTANT: If this form is being filed on behalf of an immigrant visa applicant who is the parent, spouse, or unmarried child under 21 years of age of a resident alien it will be advantageous to attach documentary evidence of the relationship as indicated below. ONLY original or mechanically reproduced copies of birth, marriage, adoption, etc. certificates should be furnished. (The ORIGINAL of any such document must be presented to the consular officer at the time of visa application). When such evidence is attached, the filing date of this Form with the Immigration and Naturali- zation Service may be used as the priority date of the visa applicant. A description of the documents to be attached follows: (a) If visa applicant is PARENT of resident alien, copy of resident alien's birth certificate and copy of parents' marriage certificate (b) If visa applicant is STEPPARENT of resident alien, copy of resident alien's birth certifi- cate and copy of certificate of marriage of stepparent to parent (c) If visa applicant is ADOPTIVE PARENT of resident alien, copy of resident alien's birth certificate and copy of adoption decree (d) If visa applicant is SPOUSE of resident alien, copy of marriage certificate (e) If visa applicant is UNMARRIED CHILD UNDER 21 YEARS OF AGE of resident alien, copy of child's birth certificate and copy of parents' marriage certificate (f) If visa applicant is ADOPTED CHILD of resident alien, copy of child's birth certificate and copy of adoption decree Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false document in the submission of this application. Also, a false representation may result in denial of this application and or any other application you may make for any benefit under the immigration laws of the United States. Any state- ment submitted with this application is considered part of the application."
}