{
	"anumber": "A30255695",
	"id": "A30255695_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Personal Information Form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1954, 1955, 1940, 1964, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "25. Persönliches Vermögen (Personal financial resources) (c) Grundbesitz (Wert) KEIN (a) Bargeld (Cash) KEIN (Real estate (value) (b) Bankguthaben KEIN (d) Anderes KEIN NLR RENTE (Bank deposits) (Other (describe)) 26. Name und Anschrift des Vaters (talis verstorben, bitte das Todesjahr angeben) (Father's name and address (if deceased, so state giving year of death)) BLEXIZAI SEST. 1940 con ANDREAS DOABROWS 4, 27.1 Madchenname und Anschrift der Mutter (falls verstorben, bitte das Todesjahr angeben) (Mother's maiden name and address (if deceased, so state giving year of death)) BLEK12A SEST. 1941 Marianne 28. Name und Anschrift des nächsten Angehörigen im Heimatland falls beide Elternteile verstorben sind. (Name and address of next of kin in home country (if neither parent is living)) NiGHT 24TREFFEND 29. Geben Sie alle Wohnsitze an, WO Sie seit Vollendung des sechzehnten Lebensjahres länger als sechs Monate gelebt haben (List all places of residence for six months or more since your sixteenth birthday) Stadt Kreis Land von bis Beruf ober Beschäftigung (City or Town) (Province) (Country) (Dates (from to)) (Calling or occupation) HUNDTLOSEN 1946 - 1950 HAUSERAM A4S4STDORF DILD 1950 1954 HAUSFRAY WITTEN DTLD 1954 1955 HAUSFRAY ESSEN-W PILD 1955 1 HEWTE HOUSFRAG 30. Geben Sie alle Organisationen an, denen Sie seit Vollendung des sechzehnten Lebensjahres angehört haben, oder mit denen sie Ver- bindung gehabt haben - einschliesslich beruflicher, gesellschaftlicher ober politischer Organisationen oder Vereine. (List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political Organizations)) Name und Anschrift von bis Art der Mitgliedschaft und Funktion, wenn (Name and address) (Dates (from to)) zutreffend (Type of membership and office held, if any) NIGHT 24TREFFEND None 31. Geben Sie alle Sprachen an, einschliesslich der Muttersprache, die Sie sprechen, lesen und schreiben können (List all languages, including your own, that you can speak, read and write) Sprache (Language) Sprechen (Speak) Lesen (Read) Schreiben (Write) DELISSCH + & + Gefman P6Kisch t 32. Angabe aller Daten über frühere Aufenthalte in den Vereinigten Staaten (Geben Sie die Art des benutzten Visums an, bzw. den innegehabten Status). (Wenn nicht zutreffend, bitte angeben.) (Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state)) 24 BESHCH MARZ SB-2 Visa 33. Waren Sie je in Behandlung in einem Krankenhaus, einer Heilanstalt oder anderswo wegen geistiger Störungen, Rauschgiftsucht oder Alkoholismus? (Wenn ja, bitte nähere Angaben.) (Have you ever been treated in a hos- Ja Nein pital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain)) [Yes] [No] 34. Sind Sie je festgenommen, verurteilt oder in einem Gefängnis inhaftiert worden, oder in ein Armenhaus oder eine andere karitative Anstalt eingewiesen worden? (Wenn ja, bitte nähere Angaben.) (Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain.)) Ja Nein 35. Sind Sie jemals begnadigt, rehabilitiert ober amnestiert worden? (Wenn ja, bitte nähere Angaben.) (Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain.)) Ja Nein 36. Haben Sie jemals ein Visum für die Vereinigten Staaten beantragt? (Wenn ja, geben Sie bitte an, wo und wann, ob ein Besucher- oder Einwanderungs-Visum, und ob das Visum ausgestellt oder verweigert wurde.) (Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you ap- plied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused.)) Ja Nein BESUCHER Visum AUSGESTELLT, DESSELDORF 1964 37. Wurde Ihnen während der letzten zwölf Monate die Einreise in die Vereinigten Staaten verweiger:? (Wenn ja, bitte nähere Angaben.) (Have you been refused admission to the United States during the last 12 months? nswer is Yes, explain.)) Ja Nein 38. Haben Sie sich je, gemäss den amerikanischen Gesetzen über allgemeine Wehrpflicht, bei einem Musterungs- ausschus strieren lassen? (Wenn ja, bitte nähere Angaben) (Have you ever registered with a draft board under U States Selective \"Service laws? (If answer is Yes, explain.)) Ja Nein"
}
