{
	"anumber": "A30255695",
	"id": "A30255695_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30255695_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form 2 19473; Alien Naturalization and Consular Act of 1950."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "(c) Aliens who are, or at any time have been, anarchists, or members of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who advocate or teach, or who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (1) opposition to organized government, (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official char- acter, (4) the unlawful destruction of property, (5) sabotage, or (6) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States; and aliens who seek to enter the United States to engage in prejudicial activities or unlaw- ful activities of a subversive nature.) Trifft einer der vorgenannten Punkte auf Sie zu? Ja Nein Wenn Ja, bitte nahere Angahen.) (Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain.)) 42. Wurde Ihnen beim Ausfüllen dieses Antrags geholfen? (Wenn ja, geben Sie den Namen und die Anschrift des Betreffenden, der diese Hilfe leistete, an, unter Angabe seiner Beziehung zu Ihnen, ob Verwandter, Bekannter, Reisenburoangestellter, Rechtsanwalt, oder anderer.) (Were you assisted in completing this application? (If answer is Yes, give name and address of person assisting you, indicating whether relative, friend, travel agent, attorney or other.)) Namen (Name) Anschrift (Address) Art der Beziebung (Relationship) F, HOPPE BEKANNIER BITTE DIE FOLGENDEN SPALTEN NICHT AUSFULLEN Der Konsularbeamte wird Ihnen behilflich sein, die Punkte 43 und 44 zu beantworten [DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44] 43. Der Ausschluss von der Erteilung eines Visums oder der Zulassung unter Abschnitt in Punkt 41 trifft auf mich aus folgenden Gründen nicht zu: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 41 for the fol- lowing reasons:) 44. Ich erkläre, Anspruch zu haben auf: (I claim to be a:) Vorzugskategorie innerhalb der zahlenmässigen Begrenzung für (Land oder dazugehoriges Gebiet). ( preference immigrant subject to the numerical limitation for (foreign state or dependent area).) Besonderer Einwanderer, der unter die zahlenmässige Begrenzung für die westliche Hemisphäre fällt. (Special immigrant subject to Western Hemisphere numerical limitation.) Besonderer Einwanderer, der nicht unter die zahlenmässige Begrenzung fällt. (Special immigrant not subject to limitation.) Unmittelbarer Verwandter eines Bürgers der Vereinigten Staaten. (Immediate relative of a United States citizen.) Mein Anspruch gründet sich auf die folgenden Tatsachen: (My claim is based on the following facts:) IR-5 pet app. June 1973 by INS Detroit Ich habe zur Kenntnis genommen, dass ich mein Visum am Orte, wo ich in die Vereinigten Staaten einzureisen beabsichtige, dem Beamten der amerikanischen Einwanderungsbehörde aushändigen muss, and dass der Besitz eines Visums an sich mir nicht das Recht auf Zulassung in die Vereinigten Staaten gibt, falls es sich dann herausstellen sollte, dass ich die von den Einwanderungsgestetzen vorgeschriebenen Voraussetzungen für die Zulassung nicht erfülle. [I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.] Ich bin mir bewusst, dass jede von mir bei dieser Antragstellung willentlich und wissentlich gemache falsche oder irreführende Angabe oder vorsätzliche Verheimlichung eines wesentlichen Tatbestandes meine unwiderrufliche Ausschliessung aus den Vereinigten Staaten nach sich ziehen kann und, falls ich bereits in die Vereinigten Staaten zugelassen worden bin, mich der Strafverfolgung oder Deportation, oder beiden, aussetzen würde. [I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.] Ich, unterzeichneter Antragsteller auf ein amerikanisches Einwanderungsvisum, schwöre hiermit erklare hiermit an Eidesstatt dass sämtliche in diesem Antrag enthaltenen. Angaben, einschliesslich der Antworten ZU den Punkten 33 bis 42 von mir gemacht wurden, und dass diese wahrheitsgemass und vollstandig sind, nach bestem Wissem und Gewissen. Ich schwöre erkläre en Eidesstatt weiterhin, dass, falls mir die Einreise in die Vereinigten Staaten gewährt wird, ich keine Handlungen begehen werde, die dem öffentlichen Interesse entgegenwirken oder das Wohlergeben oder die innere and aussere Sicherheit der Vereinigten Staaten gefabrden würden, oder eine Tatigkeit aufnehmen werde, die nach den amerikanischen Gesetzen über Spionage, Sabotage und Ausfrubr untersagt ist oder zersetzend auf die staatliche Sicherheit einwirkt oder zum Ziel bat, unter Anwendung con gewaltsamen und anderen verfassungswidrigen Mitteln sich gegen die Regierung der Vereinig- ten Staaten aufzulehnen, die Regierung an sich zu reissen, oder sie zu stürzen; oder als Mitglied, mittelbarer Angehöriger oder Mitwirker an den Handlungen einer Organisation teilzunehmen, die nach Paragraph 7 des Gesetzes über die Bekämpfung von staatsfeindlichen Umtrieben (Subversive Activities Control of 1950) der Registrierung untersteht.Die Bedeutung der vorstebenden Erklärungen ist mir völlig klar, nach- dem ich bei Ungewissbeit jeweils die nötige Belebrung verlangt und erbaltenbabe. [I, the undersigned applicant for a United States immigration visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answers to parts 33 to 42 inclusive, and are true and complete to the best of my knowl- edge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be preju- dicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overtbrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me.] Malgolie lazia Matarka i.m. Unterschrift des Antragstellers [Signature of Applicant] Vor mir unterzeichnet und beeidigt am 19 in scribed and sworn to before this 26th me day of Sept. Frankfurt ] TARIFF ITEM 20 FEE PAID U 5.00 Konsul der 7ereinigten Staaten/ von Amerika [Consular Officer'] LOCAL CY EQUIV."
}
