{
	"anumber": "A30383803",
	"id": "A30383803_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30383803_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "El Pbro. Saturnino Cárvarrugas, Párroco de esta Iglesia de San Diego de Alejandría, de la Arquidiócesis de Guadalajara, Jalisco, México"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1970, 2023, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/24/2023 El Pbro. Saturnino varrubias, Parroco de este Iglesia de San Diego de Alejadría, de la Auquidiócesis de Guadalajara, Jalisco, Mexico, en de bida forma CERTIFICA: Que en el Libro de Bautismos número veintiocho de hijos Legítimos de este Ar- chivo Parroquial, en la pagina Ciento veinticuatro, vuelta, se encuentra un acta del tenor siguiente: IF En la Iglseis Parroquial de San Diego de Alejandría, a los veintiseis dias del mes de abril de mil novecientos, el Pbro. Miguel Ruiz Barba, Ministro de esta parroquia bautizó solem- nemente, poniendo S anto Oleo y Sagrada Crisma a una niña na- cida en S an Ramon, de esta feligresía, el dia veintidos de este mes a las dos de la tarde. a la que puse por nombre MA.-- JESUS. Es Hija Legítima de J. Concepción Trujillo e Lucía Lopez. Abuelos Paternos: Agustín Trujillo y Eligia Ponce; A- buelos maternos Ramon López y Nicolasa Mendoza. Padrinos: Oc- taviano Valadez y RamonaLópez a quienes advertí su obligación espiritual. Para constancia firman conmigo. Ma. DE SAN DIEGO m Dionisio/ Miguel Ruiz Barba (Rúbricas). (Rúbrica) ARZOBISPADO SECURITY Notas marginales: Ma. Jesús. Nacida en S an Ramon el dia 22 de GUADALAJARA es te mes. Y para los fines que convengan a la interesada, se expide- el presente en San Diego de Alejandría, Ja. m a los 17 dias- del mes de agosto de 1970. El Parroco. this Fature boraunlus Pbro. Saturning Covarrubies Hnos. ## 30.00 El Ciudadano Pedro Espinosa Ramirez, Juez Menor de esta lo- Art. 102-XIX calidad, que subscribe y que actúa como Notario úblico por del Archeel. Receptoría de conformidad on la bey del Notariado en vigor. MERIDA CERTIF IC A:- Que con esta fecha me traslade a la Notaría Parroquial de es- ta poblacion y mostrado que me fue por^el Encargado el Libro de Bautismos de hijos legítimos, numero veintiocho, encontré- que an la pagina numero Ciento veinticuatro vuental S e en- DE ALE/ANDRIA encuentra asentada una acta sin numero en la que se asienta- el Bautismos de MA. JESUS que ració en el poblado de San Ra- mon de este municipio el dia veintidos de abril de 1900 mil- novecientos, a las 2 dos de la tarde: y bautizada el dia 26 - veintiseis del mismo des y año. Hija legítima de J. Concepción Trujillo y de Lucía Lopez; siendo sus abuelos paternos, Agus- tín Trujillo y Eligia Ponce: y Maternos Ramon López y N.cola- sa Mendoza. Lawy"
}
