{
  "anumber": "A30383803",
  "id": "A30383803_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30383803_0012/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "hombre"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ACTA, 15564"
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1958
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 No 15564 POSTER ECUTION BE SECURITY In nombre de la República Mexicana g como Oficial del Registro Civil de este lugar, cer- tifico ser cierta que en el libro2 dos del Registro Civil quees a mi cargo, a la foja 10 V.- se en- cuentra asentada un acta del tenor siguiente: A C T A Guanajuato General RENTAS DEFUNCION DE: No. 110.. RIQS. NAVA ALBERTO... En purisima de Bustos, to a las 14 horas del día 23 geintitrés del mes de Agosto del año de 1958 ante mí Apolonio Galan Ramirez, Juez del Estado Civil de este lugar, compareció Ame Alejandro Cruz y exhibió un certificado médico, en el que se hace constar el fallecimiento de ALBERTO RIOS con los Tesorería General del Estado de Guanajuato siguientes datos: General Estado Guanajuato GENERALES DEL FINADO Lugar de Nacimiento: San Bernardo Edad: 68 anos Nacionalidad: lexicana Ocupación: gricultor Domicilio: Morelos # 58 Estado Civil: casado con Maria Trujillo Padres: Romulo itos y Genoveva hava 800 Enfermedad: Insuficiencia Hépatica Día y hora del fallecimiento: 1.2 horas del dia de ayer Lugar del Fallecimiento: este. lugar. Lugar de inhumación: este. luger. Médico que certifica: Pascual Aceves B. Domicilio del Médico: X GENERALES DEL DECLARANTE Edad: 37 anos Ocupación: agricultor Estado Civil: casado Domicilio: este Jugar WASHING TESTIGOS VATOR RECIDO Nombres: Julio Perez Teodoro Lopez Edad: 58 anos 39 anos Ocupación: comerciante jornatero Domicilio: este lugar este lugar X Parentesco: Leída la presente acta, la ratificaron y firmaron los que supieron. Doy, fe A polonio Lopes irmados Genera MARGINALES: Es copia Pielmente tomada original Genera Purisima de Bustos, agosto 7 de 1970 General Genera Offetal del registro ivil. Genera General Genera General Juan adilla galdana. Genera Genera Tesorería General Tesoreria Genera General Guanajuaza Tespreria Genera"
}