{
  "anumber": "A30383803",
  "id": "A30383803_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30383803_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Department of State, FS-510, FS-497, FS-497"
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 DEPARTMENT OF STATE $464M. Estimado(a) señor(a)( (ita): Maria Trujillo Vda. de RIOS Esta oficina ha recibido su notificación en la cual nos informa que ya tiene todos los documentos requeridos en relación a su solicitud para una visa de inmigrante. Es necesario que usted se someta a ciertos exámenes médicos. La hoja adjunta contie- ne las instrucciones completas para dichos exámenes. 1970 Se le ha asignado una cita para que se presente en esta oficina el día Todos los miembros de su familia que inmigrarán con usted, con excepción de los menores de 14 años de edad deberán presentarse con usted en la fecha indicada arriba. Si usted NO PUEDE ACUDIR A ESTA CITA, favor de notificarlo inmediatamente a esta oficina. Tome nota de la \"Solicitud de Visa de Inmigrante y Registro de Extranjero\" (Forma FS-510) adjunta. Usted se dará cuenta que gran parte de ella es en forma de pregunta y respuesta. Llene esta forma totalmente, usando máquina de escribir o con letra de molde, pero no la firme por ahora (usted tendrá que prestar juramento o afirmar lo declarado en esta solicitud ante un oficial consular). Cada inciso numerado debe ser contestado o de otra ma- nera completado. Si alguna parte no es pertinente a su caso, escriba \"No es aplicable\". No use guiones, ni rayas, ni las letras \"n. a.\" u otra abreviatura para llenar dichas partes. La for- ma debe llenarse en duplicado para cada miembro de su familia que desea hacer su solici- tud para una visa de inmigrante. Se le recuerda que debe traer consigo todos los documentos pertinentes a su caso. Su solicitud no será aceptada si no presenta su documentación completa. Como una infor- mación de utilidad, los documentos generalmente requeridos son los siguientes: Pasaporte Hoja de Servicio Militar Formas FS-510 (2 para cada (Si aplica en su caso) persona) Acta de Nacimiento Fotografías (3 para cada persona) Certificado de Matrimonio Certificado(s) de Policía Declaración (carta) de Sosteni- (Si aplica en su caso) miento u Oferta de Trabajo Documentos presentados con (a menos que tenga pruebas de anterioridad para llenar los Forma FS-497 sus recursos propios) requisitos de la Sección 212(a)(14) Traducciones: Todos los documentos que no están en el idioma oficial del país en donde se ha registrado la solicitud de visa, o en Inglés, deben acompañarse de traducciones certifi- cadas al Inglés. Las traducciones deben presentarse en duplicado y debidamente certificadas por una autoridad o persona competente y legalmente reconocida para ello. Las cartas de sostenimiento y las ofertas de trabajo (prueba de empleo previamente arreglado) deben ser de fecha reciente; las cartas de sostenimiento deben tener menos de 12 meses de expedidas en el momento de ser presentadas al oficial consular y las ofertas de tra- bajo, menos de seis meses."
}