{
  "anumber": "A30537468",
  "id": "A30537468_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESCROW INSTRUCTIONS, FORM 14"
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2012
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "THESE INST CTIONS CANCEL AND SUPERSEL PREVIOUS INSTRUCTIONS DATED DECEMBER 19, 1969 ESCROW INSTRUCTIONS Buy MEMORANDUM ONLY er 8959 BUYER and SELLER Paid outside of Escrow $ BUYER Cash through Escrow 5,000.00 Encumbrances of Record To FROST ESCROW CO. January 12th 19.70 New Encumbrances 25,000.00 I will hand you $5,000.00 - $1,000.00 of which is to be deposited in this escrow through the broker. Total Consideration $ 30,000.00 I will also hand you before the time limit hereinafter named any instruments, including notes secured by encumbrances I create, and additional funds required from me to enable you to comply with these instructions, all of which you are authorized and instructed to deliver provided on or before instruments have been filed of record entitling you to procure for me assurance of title in the form of a California Land Title Association Standard Coverage Policy Form of title insurance with liability of issuing company limited to $30,000.00 on the following described property: Lot 26 of Tract No. 10528, in the city of South Gate, county of Los Angeles, state of California, as per map recorded in Book 158 Page 21 of Maps, in the office of the county recorder of said county. Showing title vested in Carmen Suarez, married woman Free of encumbrances except: Second Installment Taxes for the fiscal year 19 69 19 70 including personal property taxes which may be assessed against the former owners of said property, if any, and any and all taxes and assessments which may become record liens subsequent to date of these instructions, and covenants, conditions, restrictions, reservations, rights and rights of way and easements, now of record, if any, and Trust Deed securing note for $ 25,000.00 to be executed and delivered through escrow, dated during escrow in favor of Roy H. Fernando and Margaret A. Fernando, husband and wife at with interest from tenants any place designated by holder date at the rate of 8% payable principal and interest in installments of $200.00 or more on the same day of each month, beginning 30 escrow and continuing until said principal and interest has been paid. Adjust interest on this note' to the close of escrow. Trust Deed is to recéte: - This Trust Deed is given and accepted upon the expressed condition that in the event said premises shall be sold or transferred by said trustor, or a contract of sale be executed by her, beneficiary reserves the right to approve or disapprove the subsequent buyers credit. The following adjustments ONLY are required in this escrow-Pro-rate to the close of Taxes, on t the basis of the 1969-70 tax bill premium on existing fire insurance policy covering property known as 8945, 89451/2012 8947 and 89473 Santa Fe Avenue, South Gate, Calif. provided the policy is accept- able to the buyer, and rents in accordance with rental statement to be furnished by the sellers and approved by the buyer prior to the close of escrow. Should the buyer place new insurance then charge the herein buyer and otherwise DAY the agree deed and premium as billed provided for recording purchase price trust deed, your for Notary Fee on documents I acknowl- edge, for mortgage clause on insurance, for drawing any instruments required of me to complete this escrow and half of your escrow fee as charged. EACH OF THE UNDERSIGNED STATES THAT HE HAS READ THESE INSTRUCTIONS INCLUDING THE PRINTED PROVISIONS ON THE BACK WHICH CONSTITUTE A PART OF THESE INSTRUCTIONS AND AGREE TO SAID INSTRUCTIONS. Address: 10.53 West 89th Street, Los Angeles, California Carmen Suarez Phone: 751-1237 SIGN OVER TOO SELLER To FROST ESCROW CO. The foregoing terms, provisions, conditions and/or instructions (including those on the back hereof) are hereby approved and accepted in their entirety and concurred in by me, I will hand you all instruments to enable you to comply, including deed conveying the property described, executed by Roy H. Fernando and Margaret A. Fernando, husband and wife which you are authorized to deliver upon payment to you for my account, within the time limit as provided herein, the sum of 000 00 together with any adjustments which may be due me as provided herein, and any note or notes in favor of Seller if called for in Buyer's instructions. Pay at the close of this escrow and charge the seller the following: Any adjustments chargeable to me hereunder. Affix and cancel $33.00 Documentary Stamps on the deed to file. Pay brokers commission in accordance with separate instructions in this escrow. Instruct the Title Company to begin search of title at once and I agree to pay their charges on demand and all other charges and expenses in- curred regardless of the consumation of this escrow. Unless otherwise provided herein I am to be charged with the cost of the title policy, and charges made for sending in mortgage statements and/or demands, cost of drawing all documents required of me to complete this escrow and notary fees thereon and cost of recording any instruments recorded in my favor and cost of transfer of fire insurance policy and one-half of your escrow fee. All disbursements to be made by check of Frost Escrow Co. Address: 10419 Cleota, Whittier, Calif. Roy H. Fernando Phone: 699-3402 FORM 14 Margaret A. Fernando SIGN OVER TOO"
}