{
  "anumber": "A30546927",
  "id": "A30546927_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30546927_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 5/5/2023, N/A"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 R06d6 lo actuado autorizando al Sr. Ernesto para que la ci- ba... Protesto 10 necesarios= H. Nogales, Sonora, Febrero 11 de 1972 -ANGELA MACIAS HURTADO.. Firmadoos AUTO: Heróica Negales, Sonora, febrero caterce de milmnoyecientos setenta dosi Convel anterior escrito de cuenta se tiene a rAngela Nácías Hur ta- por presentada ensbus (propies derec OS, solicitando en vía de Juris dicción Voluntaria se le reciba informacion t estimonial conforme el inte- irrogatorio inserto al escrito que se acuerda. Con appyy los artículos 801 836, 837.00 838 y d emás relativoa del Código Procedimientos Civiles, se - sadmite, 188 solicitud. Regístrese el expediente. Dése intervención al c esfAgente del Ministerio Público addscrito.. Como se pide, recíbase la in-- formación testámonial solicitada, 1 dia quince del actual a las once obos horash Se tiene, como a bogado patrono alid Ernesto Coronado.- Notiff-- siguese Losarcordo el Co Licenciado Germán Lopez Romano, Juez de Ira. Ins abridancias del IreRamo Civiler Downfor Firmas illegables. Firmado PROTESTA -En at ciudad de Nogales, Sonora, siendo las diez horas con treinta minutos del die equince de febrero de mil novecientos setenta y dos. fue presente day señora Angela Nácias Hurtado acompañada de los testigos -los senores Miguel Padilla y Gregorio Rodriguez. así como el C.Agente del ForioMini sterio Público adscritos- Enseguida se procedió a protestar en forma stone&Legal allos testigos, hactendoles saber las penas con que la Ley castiga el ga so testimonio yerbien enterados dijeron que protestan conducir se con soa iverdad (en todo be oue se les pregunte en esta diligencia Leído que les fueelo expuesto, los comparecientes 10 ratificaron firmaron por ante el -offeduez JobSecretario que dá fé.- Fimas ilegibles., Firmado DecoAdel señor Miguel Padilla:- - Enseguida se esepará convenientemente a los b ordtest igos, dejándose ante la presencia judicial al fseñor Miguel Padilla, por haber protestado en forma legab, por sus generales dijo: llamar- SAIDAY como quedós escrito, mexicane, mayor de edad, c asado, ocupación vende-- Y ojador, originario de Tequila, Jaliscos con domicilio, en Calle Buenos Aires =@00%No. 6361, bde ésta ciudad:- Enseguida procedió a contestar el interrogatorio siguiente Smaneras-sanda sigla conoce desde hace mucho tiem- 00800.0 audal2k= Quessi loisabe Synlegconsta.- ala 3 Que sí lo sabe, por - conocerla desde hace tiempo. a Que si 10 sabe y le consta por ha- sherlos conocidov- all la: 5.-Que si, 10 sabe. 6.0 Que sí; 10 sabe y le - sb constanta la 7.00 Quet sido sabe yo le consta la 8.- Quesi lo sabe y"
}