{
  "anumber": "A30537468",
  "id": "A30537468_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE, 043-RO570"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2020
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TED STATES DEPARTMENT OF JUSTICE Form approved Immigration and Naturalization Service OMB No. 043-RO570 Fee Stamp atro APPLICATION FOR VERIFICATION OF INFORMATION FROM IMMIGRATION AND NATURALIZATION SERVICE RECORDS TYPE OR PRINT THE NAME AND MAILING ADDRESS OF THE PERSON TO WHOM FOR Co NUE OF THE INFORMATION OR COPIES OF RECORD SHOULD BE RETURNED IN THE BOX BELOW: Gor'I PERSON CONSENTING NAME AND ADDRESS NAME Social Security Admin. 4111\" Gage leve STREET ADDRESS 419 South Hill Street CITY, STATE Los Angeles, CA, 90013 fill wife ZIP CODE D- SANCHEZ SIGNATURE OF PERSON CONSENTING 1. CHECK TYPE OF VERIFICATION REQUESTED: 2. STATE PURPOSE FOR WHICH DESIRED 3. NUMBER OF COPIES DESIRED, IF ANY: AGE OR DATE OF BIRTH cofy of Buta NATURALIZATION OR CITIZENSHIP 4. IF INFORMATION IS FOR GENEALOGICAL INFORMATION SOCIAL SECURITY BENEFITS, SHOW SOCIAL OTHER (CERTIFICATE OF BIRTH DATA, ETC.) S.S Benefits UNKNY DATA FOR IDENTIFICATION OF THE RECORD TO BE VERIFIED 5. FAMILY NAME GIVEN NAME MIDDLE NAME 6. ALIEN REGISTRATION NUMBER DERAT RAUL A30537468 7. OTHER NAMES USED, IF ANY 8. NAME USED AT TIME OF ENTRY INTO UNITED STATES RAUL DERAT 2020 9. PLACE OF BIRTH 10. DATE OF BIRTH 11. PORT ABROAD FROM WHICH LEFT FOR UNITED STATES CHINUAHUA Mexico 7-21-11 SAN 12. PORT OF ENTRY INTO UNITED STATES 13. DATE OF ENTRY 15-17-7014 14. NAME OF VESSEL OR OTHER MEANS OF ENTRY Bus GIVE THE FOLLOWING INFORMATION FOR VERIFICATION OF NATURALIZATION 15. NAME ON INATURALIZATION CERTIFICATE 16. CERTIFICATE NUMBER 17. NATURALIZATION DATE 18. ADDRESS AT TIME OF NATURALIZATION 19. NAME AND LOCATION OF NATURALIZATION COURT 20. SIGNATURE OF APPLICANT DO NOT COMPLETE THIS BLOCK - x RESERVED FOR GOVERNMENT USE ONLY THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE REFLECT THE FOLLOWING: INATURALIZATION INFORMATION AS SHOWN ABOVE at San ON IS CORRECT. yoidrola on AT Dat It, 1970 DATE: 8/26/76 LAWFUL ADMISSION FOR PERMANENT RESIDENCE NATURALIZATION IN (COURT) ON (DATE) AT (LOCATION) DATE OF BIRTH ARRIVAL RECORD DATED SHOWED SUBJECT'S AGE AT TIME TO BE UNABLE TO IDENTIFY ANY RECORD COPIES ATTACHED AS REQUESTED B/C SIGNATURE TITLE they a Amplegate l section Approved By: DATE PRIVACY ACT IDENTITY ESTABLISHED IN PERSON IDENTIFICATION DOCUMENTS (WHEN REQUIRED) G-652 Affidavit ATTACHED OTHER (List) FORM G-641 (Rev. 4-1-76) N"
}