{
	"anumber": "A30537468",
	"id": "A30537468_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TRIMONIO - SEGUINDO: Como causa de divorcio señaló la actora:, APR 24 1957"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "trimonio.- SEGUNDO:- Como causa de divorcio señaló la actora: la separación del hogar conyugal por más de un año, sin que la otra parte haya promovido el divorcio, causal prevista en la Fracción XVII del Artículo 30. de la citada Ley del Divorcio, y para pro- barla, ofreció la prueba confesional, señalada en los Artículos 277, fracción I, y 288 del Código de Procedimientos Civiles, ha- biéndose calificado como legales las preguntas contenidas en el pliego de posiciones respectivo, que se refieren a la causal in- vocada, al tenor de las cuales se declara confeso al demandado, con fundamento en el Artículo 304, fracción I del mismo Código, y como esa confesión tácita de los hechos controvertidos produce presunción legal, y por consiguiente prueba plena de conformidad con los Artículos 371 y 389 del referido Código, debe decirse que la actora probó su acción cumpliendo así lo ordenado por el Ar- tículo 264 del Ordenamiento acabado de citar.- TERCERO:- Habién- dose manifestado en la demanda que no hay hijos del matrimonio, ni existen bienes comunes de la sociedad conyugal, nada debe re- solverse en esta sentencia sobre esos particulares Por lo expuesto y con apoyo además en los Artículos 1, 2, 10, 43 44 y 45 de la Ley del Divorcio invocada, se falla: PRIMERO:- Se declara disuelto, con todas sus consecuencias lega- les, el matrimonio contraído por RAFAEL VELEZ con CARMEN SUAREZ el dia once de Diciembre de mil novecientos treinta y nueve, en la Ciudad y Estado de New York, Estados Unidos de Norte-América, quedando ambas partes en aptitud legal de contraer nuevas nupcias. SEGUNDO:- Registrese la presente resolución, publiquese, dese a los interesados las copias certificadas que soliciten, y en su O- portunidad, archivense los autos. Asi definitivamente juzgando lo sentenció y firma el C. Licencia- do Carlos Martinez Alvidrez, Juez Segundo de lo Civil del Distri- to Bravos, por ante el C. Secretario con quien actúa y da fé:- C. Martinez A. - Carlos Lozoya A.- Rúbricas\" EN CUMPLIMIENTO DE LO MANDADO EN EL SEGUNDO PUNTO RESOLUTIVO, SE EXPI- DE ESTA COPIA FIEL Y EXACTA DE SU ORIGINAL, EN ESTA FOJA UTIL, PARA LA SEÑORA CARMEN R. VELEZ, Y DEBIDAMENTE COTEJADA, SE AUTORIZA EN FORMA, EN CIUDAD JUAREZ, CHIHUAHUA, MEXICO, A LOS ONCE DIAS DEL MES DE ABRIL DE MIL NOVECIENTOS CINCUENTA Y SIETE. --- DOY FE SEECHOM E-1 Secretario: LIMITED a CARLOS LOZOYA ALARCON.- Vo. Bo. El Juez Segundo de lo Civil: LIC. CARLOS MARTINEZ ALVIDREZ.-"
}
