{
	"anumber": "A30537468",
	"id": "A30537468_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Adjustment of Status"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1970, 1969, 1918, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Block I. - Information About Alien Beneficiary (Continued) 20. Address in the United States where alien will reside (City) (State) 1053 WEST 89th STREET LOS ANGELES CALIFORNIA 21. Address at which alien® is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code, if in U.S.) 1053 W. 89th ST. - LOS ANGELES, CALIFORNIA 22. If alien is in the United States, give the following: a. Alien last arrived in the U.S. on (Month) (Day) (Year) b. Alien last arrived in U.S. as (Visitor, student, exchange alien, crewman, stowaway, etc.) NOV. 11,1969 VISITOR c. Show date alien's stay expired or will expire as shown on his Form I-94 or I-95; FEBRUARY 15,1976 d. Name and address of present employer Date alien began this employment ros 23. Check the appropriate box below and furnish the information required for the box checked: Alien will apply for a visa abroad at the American Consulate in TIJUANA B.C., MEXICO (City in foreign country) (Foreign country) Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Block II. - Information About Petitioner 24. My name is (Last) (First) (Middle) 25. If you are a married woman, give your maiden name DERAT CARMEN CARMEN SUAREZ-Benet 26. I reside in \"the United States at (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) 1053 WEST 89th STREET LOS ANGELES, CALIFORNIA 90044 27. Address abroad (if any) (Number and street) (City or town) (Province) (Country) N.A. 28. I was born: (Month) (Day) (Year) In: (City or town) (State or Province) (Country) SEPTEMBER 18, 1918 PANAMA PANAMA 29. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized number of naturalization certificate and date and place of naturalization: CARMEN RUBINA VELEZ.\" 4766036; on May 11, 1949, NEW YORK, N. Y. (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate and date and place of issuance: Original seen and returned (b) If not, submit evidence of citizenship in accordance with Instruction correct copy, b. Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. 766036 30, If you are a lawful permanent resident alien of the United States, give the Representative, USINS a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A C. Have you ever lost status as a lawful permanent resident alien? If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) OFFICIAL SEAL Block III. - Oath or Affirmation of Petitioner I swear (affirm) that know the contents of this petition signed by me and that the statements herein are true and correct. NOT Signature of petitioner (See Instruction No. 5) barmen PRINCIPAL OFFICE IN Subscribed and sworn to (affirmed) beforeme thisABEE MEHA 27th day of January A.D. 19 40 (SEAL) My commission expires yeabel at angele Cal My commission expires feb. 23, 1970 (Signature of officer administering oath) (Title) Block IV. - Signature of Person Preparing Form, if Other Than Petitioner declare that this document was prepared by me at the request of the petitioner and is based on all information of W i have any knowledge. .gnature) (Address) (Date)"
}
