{
	"anumber": "A30546927",
	"id": "A30546927_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30546927_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "1972 ANO DE JUAREZ, 1972 ANO DE JUAREZ"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1972, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 UNIDOS \"1972 AÑO DE JUAREZ\" GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SONORA EL C. RENE ESQUER, OFICIAL PRIMERO DE LA SECRETARIA DE GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SONORA, CERTIFICA : Que en el Libro de copias de actas de Matrimonio- de la Oficina del Registro Civil de Nogal es, Sonora, correspondiente-. al año de 1944 mil novecientos cuarenta y cuatro, que existe en el Archivo General de este Gobierno se encuentra inscrita una acta cuyo - tenor literal es el siguiente: \"AL MARGEN: - GENERALES DEL CONTRAYENTE: Nacionalidad mexicana Origi nario de Chihuahua, Chihuahua.- Edad 33 años. Estado civil soltero. Ocupación chofer.- Domiciliado en Buenos Aires 208. - Hijo de Padre: Mariano Velazquez, finado. - Madre: Porfiria Garcia, finada.- GENERALES DE LA CONTRAYENTE: Nacionalidad mexicana. Originaria de Cananea, Sono- ra. - Edad 35 años. Estado civil soltera. - Ocupación su hogar. Domici-- liada en Buenos Aires 208. - Hija de Padre: Jose Macias, finado. - Madre* Francisca Hurtado.- finada.- AL CENTRO: Oficina del Registro Civil en- Nogales, Sonora, México.. - Acta No. 231. - Matrimonio del señor ANDRES VELAZQUEZ y la Señora ANGELA MACIAS. - En la Ciudad de Nogales, Sonora, a las diez horas del dia cuatro del mes de agosto del año de mil nove- cientos cuarenta y cuatro, ante mi J. M. Liñeiro, Oficial del Registro- Civil, comparecieron con objeto de celebrar su matrimonio el señor Andres Velazquez y la señora Angela Macias, quienes ratificaron sus ge- nerales dadas en su solicitud de fecha de hoy, y las cuales se insertan al margen de este instrumento. - Expresada por los contrayentes su espon tanea voluntad de unirse en matrimonio; comprobada por las declaraciones de los testigos la legal aptitud de aquellos para formalizar este con-- trato civil; no habiendose interpuesto ningun impedimento, en nombre -- de la Ley y de la Sociedad declaro perfecta y legitima la unión matrimo nial de los contrayentes. - Actuaron como testigos por parte del contra- yente los señores Manuel Ortega y Manuel Chavez, el primero de veinti-- cuatro años de edad, de estado civil soltero de ocupación jornalero, -- y domiciliado en Ferrocarril 75 y el segundo de veinticinco años de edad de estado civil casado de ocupación jornalero, y domiciliado en Buenos - Aires 15, y de la contrayente los Señores Manuel Ortega y Manuel Chavez, el primero de 24 años de edad, de estado civil soltero de ocupación jornalero, y domiciliado en Ferrocarril 75 y el segundo de 25 años de edad, de estado civil casado de ocupación jornalero, y domiciliado en Buenos Aires 15. - En testimonio del acto celebrado e formuló la presen- te acta que firmaron los que supreron hacerlo.. Doy fé.- EL OFICIAL DEL REGISTRO CIVIL, Jose M/Y Lineiro pirma.- CONTRAYENTE , Andres Velasquez, Firma. - CONTRAYENTE, Angela Macias Firma.. Testigos, Manuel Ortega y Manuel Chavez, Firmas loss Y a solicitud de part interesada, se expide la presente copia en la - Ciudad de Hermosillo, Sonoma, los veinte dias del mes de julio de -- mil riovecientos setenta dos invoice aafs/"
}
