{
  "anumber": "A30506045",
  "id": "A30506045_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30506045_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, TGE-54-15"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/8/2023 - TGE-54-15 Cert. Núm Rec. de Cd Camargo, Chih, , Cantidad $ 41.60 The Reducción según Oficio Núm. ACTA No. 918 DEL REGISTRY OVER ESTADO DE CHIHUAHUA DRE En nombre de la República Mexicana y como Juez del Registro Civil de este lugar, hago CAMARGSABER a los que la presente vieren y certifico: Que en el libro Núm. 74 de la Sección de Matrimonios del Registro Civil que es a mi cargo, a fojas 74-75-Fte se encuentra una acta del tenor lite- ral siguiente: Al margen ACT A NUMERO 54 Matrimonio del señor ROBERTO RIVERA y señor ita LUZ ROSALES.. - Huellas digitales. Pulgar Derecho del Contrayente. De la Contrayente. Al centro Estado de Chihuahua. ACT A DE M ATR I MONIO.- ECamargo, Municipio de 1 mi smo siendo las 16 horas del día 14 de Septiembre de mil novecientos trein- ta y ocho comparecieron ante mi, Jose F Valles, Juez del Regis- tro Civil en esta Oficina. para contraer matrimonio el Sr. ROBERTO RIVERA y la Sr ita LUZ ROSALES , de acuerdo con la solicitud y documentos que presentaron con fecha de hoy los cuales contienen los siguientes datos. DEL CONTRAYENTE. DE LA CONTRAYENTE. Edad 24 años 17 años Ocupación Empleado Federal, - Labores del hogar.- Domicilio Hidalgo # 504 R. Hernandez # 2.- Estado Civil soltero Célibe. Origen Cd Camargo ,Chih., Cd. Juarez, Chih., Nacionalidad mexicana.- mexicana. PADRES DEL CONTRAYENTE Nombres Bernardo Rivera Sofia Rubio.- - Ocupación finados. Origen Domicilio Nacionalidad PADRES DE LA CONTRAYENTE Nombres Miguel Rosales Maria Basurto.- Ocupación viven. Origen Domicilio Nacionalidad TESTIGOS DE ESTE ACTO (los primeros del contrayente y los segundos de la contrayente) Nombres Gilberto Lopez Francisco Martinez. Edad Mayor de edad, - Mayor de edad Estado Civil soltero casado Ocupacion Obrero textil Empleado.publico.- Domicilio conocido conocido.- Parentesco no no Nombres Teodoro saenz.- - Edmundo \"endoza Ramirez. - Edad Mayores de edad - Estado Civil soltero soltero. - Ocupación Empleado Público EmpleadoPublico.- Domicilio conocido conocido Parentesco no no Se dió lectura a la solicitud matrimonial presentada en que consta la declaración de los pretendientes de ser su voluntad unirse en matrimonio y que éste lo celebran bajo el régimen de y (A la vuelta)"
}