{
	"anumber": "A30546927",
	"id": "A30546927_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30546927_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, 102, S. Main St., #7, Los Angeles, CA 90012"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 AFFIDAVIT OF SUPPORT STATE OF CALIFORNIA SS COUNTY OF LOS ANGELES EDUARDO OZETA, of 1406 N. Avenue 56th. Los Angeles, California 90042 being first duly sworn deposes and says: I am a citizen of the United States by birth. I am married to Amalla Ozeta, who resides with me. My dependents consist of my wife, one child, my mother in Law and one sister in Law. I am employed by Occidental College, of 1600 Campus Road, Los Angeles, California 90041 I have been employed by this college nearly 3 years, and my yearly salary averages $5,017.00 I possess real property consisting of the house and lot where I reside at the above indicated address. The present market value of this property Is $20,000.00 I possess personaL property consisting of 2 automobiles, house- hold furniture. Now, my mother in Law and dependent Mrs Angela Macias de Velazquez, a citizen of Mexico and a resident of Nogales, Sonora, Mexico, 1s desirous of entering the United States as a permanent resident and I am ready to receive her. Therefore, I respectfully request the Hon. American Consul to grant her the necessary Visa. In the event that my request 1s granted, I hereby promise that I shall be responsible for her support and welfare so that she shall never become a burden to this country. Ednord Beta Eduardo Ozeta. Subscribed and sworn to before me this 29th. day of March 1972 cuture Palloing EAL OF OFFICIAL SEAL EUREKA ARTURO PALLAIS, JR. NOTARY PUBLIC-CALIFORNIA LOS ANGELES COUNTY My Commission Expires Nov. 26, 1975 102. S. Main St. #7 Los Angeles, CA. 90012 I, Amalla Ozeta, hereby approve the above Affidavit of Support executed by my husband Eduardo Ozeta. Amalin Ozeta Amalla Ozeta."
}
