{
	"anumber": "A30537468",
	"id": "A30537468_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS, Form approved OMB No. 43-R0040"
		},
		"years": {
			"ms_years_nlp_v1": [1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS Form approved Servicio de Inmigración y Naturalización OMB No. 43-R0040 SOLICITUP POR UN EXTRANJERO CON RESIDENCIA LEGAL PERMANENTE PARA OBTENER UNA TARJETA DE REGISTRO DE EXTRANJEROS (Tenga la bondad de leer las instrucciones adjuntas) NOTA: Si usted necesita su tarjeta urgentemente, deberá presentar personalmente esta solicitud y sus correspondientes anexos debidamente llenados en la Oficina del Servicio de Inmigración. Si hace la solicitud en persona, traiga consigo tres fotografías que se ajusten a las especificaciones indicadas en la siguiente hoja de este formulario. ESCRIBA A MAQUINA o CON UN BOLIGRAFO EN LETRAS DE MOLDE 1. NOMBRE APELLIDO (Letras mayúsculas) NOMBRE SEGUNDO NOMBRE TIMBRE Derat, Rau Soto 22 JAN 1981 2. DIREC- (NUMERO Y CALLE) (Apt. No.) CION POSTAL EN LOS ESTADOS 3000 miramar St # not UNIDOS (CIUDAD) (ESTADO) (NUMERO ZIP) 265368478 Los Angeles,Ca 90057 3. NUMERO DE REGISTRO DE EXTRANJERO A305374 4. NOMBRE QUE USO CUANDO SE INSCRIBIO COMO EXTRANJERO, (SI ES EL MISMO QUE TIENE AHORA, FOCRUBA \"SAME\".) same 5. FECHA DE NACIMIENTO (Mes/dia/ano) 6. Pato 7. NUMERO DE TELEFONO 8-21-1911 PARRAL CHIA, Menco -none- 8. ADMITIDO A LOS ESTADOS UNIDOS EN: (CIUDAD (ADO) y. 20 DE TRANSPORTE (Nombre del barco, o linea aérea y número de vuelo, etc.) SAN Ysidro Conformia walking 10. DESTINO EN LOS EE.UU. CUANDO FUE ADMITIDO 11. CREO QUE MI FICHA SE ENCUENTRA EN LA OFICINA DE INMIGRACION Los Angelas EN (Ciudad y Estado) 10-17-1970 12. FECHAS DURANTE LAS QUE PERMANECIO AUSENTE DE LOS EE.UU. POR 1 AÑO o MAS, DESDE QUE FUE ADMITIDO LEGALMENTE COMO RESIDENTE PERMANENTE 13. NECESITO UNA NUEVA TARJETA DEBIDO A QUE: (A) Mi documento de registro de extranjero se ha extraviado o ha sido destruido bajo las siguientes circunstancias. (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) Has been stolen (B) Mi tarjeta actual está dañada. (Adjunte su antigua tarjeta). (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) (C) Mi nombre ha cambiado. (Adjunte el decreto del tribunal o el certificado de matrimonio y la antigua tarjeta). (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) (D) Debo estar registrado y se me deben tomar las huellas digitales una vez cumplidos los 14 años. (Adjunte su antigua tarjeta). (La Oficina de Inmigración puede tomarle las huellas digitales o usted puede pedir que se las tome un agente en la comisari'a de policia o en la oficina de un alguacil. Usted y el agente deben firmar y fechar la tarjeta, una vez que se hayan tomado las huellas digitales. Usted TIENE QUE utilizar la tarjeta para huellas digitales, Formulario FD-258 que nuestra oficina le facilitará). (NO SE REQUIERE PAGO) (E) Soy un extranjero que viaja constantemente a los Estados Unidos y se dispone a tomar residencia permanente en los EE. UU. (Adjunte su antigua tarjeta) (NO SE REQUIERE PAGO) (F) Recibi una tarjeta incorrecta. (Adjunte su antigua tarjeta) (NO SE REQUIERE PAGO) (G) Nunca he recibido una tarjeta. (NO SE REQUIERE PAGO) (H) Otra (Explique) (NO SE REQUIERE PAGO) ACTION BLOCK (Para uso del funcionario consular o de inmigración). This applicant was interviewed by me under oath on (Date) at (City). REMARKS: Fecha y firma del solicitante 1/22/80 (Signature and Title) Serial Number of new I-151, if any Fecha y firma de la persona que llena el Formulario en caso de no GRANTED DENIED MAILED DELIVERED tratarse del solicitante mismo. DATE DD MICHAel of ACTION 12-06-51 H LAndon TR Fingerprint card forwarded to the FBI to comply with Section 262 b (Initials and Date) DISTRICT Los Risra Call-In Letter Sent (Date) I-189 to Production Facility (Date) Signature of Immigration Officer RBDARNES Form I-90 (Spanish) RECEIVED TRANS. IN RET'D. TRANS. OUT COM LETED (Rev. 5-31-78)N sh"
}
