{
  "anumber": "A30546927",
  "id": "A30546927_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30546927_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "1972 ANO DE JUAREZ, GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SONORA"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 UNIDOS ALLERGIES \"1972 ANO DE JUAREZ\" GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SONORA EL C. RENE ESQUER, OFICIAL PRIMERO DE LA SECRETARIA DE GOBIERNO DEL - ESTADO LIBRE Y SOBERANO DE SONORA, CERTIFICA - Que en el Libro de copias de actas de DEFUNCION, de la Oficina del Registro Civil de Nogales, Sonora, correspondiente- al año de 1933 mil vecientos treinta y tres, que existe en el Archivo General de este Gobierno se encuentra inscrita una acta cuyo- tenor literal es el siguiente: \"AL MARGEN: - Acta Número 85. Nombre. JESUS PALMA. -Boleta No.80. Fosa No Clase Cuarta. - Panteón Nacional. - AL CENTRO: - Acta Número 85 ochenta y cinco En la Ciudad de Nogales, Sonora, México, a las 11 once horas del día 12 doce de marzo de 1933 mil novecientos treinta -- y tres, ante mi el Ciudadano Francisco G. Batriz, Juez del Estado ci-- vil de este lugar, compareció el señor Pedro M. Camarena, mexicano de- 49 cuarenta y nueve años, Agente=de Inhumaciones, originario de Guay mas, Sonora, con residencia en la Calle Pierson 29 veintinueve, y me - presentó un certificado Médico, suscrito por el Sr. Dr. Fernando E. -- Priego, por el cual consta que a las diez horas del día de ayer, falle ció en el Hospital del Socorro, a consecuencia de anecrisma de la aorta ,-el señor JESUS PALMA, Sexo masculino, de 33 treinta y tres, casado - Minero, originario de Empalme, Sonora, Se le dió sepultura en fosa de cuarta clase del Panteón Nacional. - Fueron testigos de este acto los - señores Cruz Gonzalez y Eduardo Sandoval, mexicanos, mayor es de edad,- - y de esta vecindad. - Leída la presente acta al compareciente y testigos fueron de conformidad y firmaron por ante mi.- Doy fé.-Franco. G. Ba- triz.. - Pedro M. Camarena. -Eduardo Sandoval. - E. Gonzalez.Rúbrica. Es- copia fiel que certifico. Fco. G. Batriz, Firma\". Y a solicitud de parte interesada, se expide la presente copia en la - Ciudad de Hermosillo, Sonora a los veinte dias del mes de julio de - BEL mil novecientos setenta ESTAD ADDS UNIDOS STUDENT afs/"
}