{
  "anumber": "A30537468",
  "id": "A30537468_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CARLOS LoZoya Alarcon, Secretary of the Second Civil Court in and for the District of Bravos, State of Chihuahua, Republic of Mexico,, Docket 751-957."
    },
    "years": {
      "ms_years_nlp_v1": [
        1957,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "I, CARLOS LOZOYA ALARCON, SECRETARY OF THE SECOND CIVIL COURT IN AND FOR THE DISTRICT OF BRAVOS, STATE OF CHIHUAHUA, REPUBLIC OF MEXICO, HEREBY CERTIFY:- That in a divorce action instituted by CARMEN R. VELEZ, against RAFAEL VELEZ, a final decree was entered, to-wit: JUDGMEN T:- \"City of Juarez, Chihuahua, April 11, 1957.- THIS CAUSE instituted by Lupercio Garza Ramos, in behalf of Carmen R. Velez, against Rafael Velez, (Docket 751-957), came on to be heard this day, and, WHEREAS:-FIRST:-That on Feb- ruary 26, 1957, a complaint for divorce was filed by Lupercio Garza Ramos, who appeared bringing in behalf of Carmen R. Velez a divorce action against her Husband, Rafael Velez, alleging as ground: Residence apart for over twelve years, and further stating: That the parties hereto were married in the City of New York, State of New York, on December 11, 1939; that there are no children the issue of said marriage, nor any community property belonging to the parties; and that the complainant expressly submits herself to the jurisdiction of this Court.. Plaintiff concluded praying that a final decree be granted to her from the defendant.- SECOND:- Upon entering of the action, a notice was ordered to be served on the defendant, Rafael Velez, through publication of a. Summons on the official news- paper of the State, commanding the defendant's appearance in an action brought against him by the above named plaintiff; and it appearing that said defendant had been regularly served with Summons, and having failed to answer plaintiff's complaint, and the time for answering having expired, and the default of the defendant having been duly entered according to Law; Whereupon the complaint was taken as having been answered in a negative sense and the suit entered into a proof term. During such term, the confessional proof was submitted to this Court by the complainant. The proof term having expired, the parties were summoned for hearing of allegations, and thereaf- ter for the final decree, which is granted today, this cause being regularly matured at rules WHEREA S:- FIRST:- This Court has assumed jurisdiction over the Wife, and became duly qualified and competent to rule on this cause, according with provisions of Article 23 of the Divorce Law; in compliance with provisions of Article 29 of the same Law, a testimonial evidence was introduced on the part of the plaintiff so as to prove the bonds of matrimony existing between said husband and wife. - SECOND:- The ground alleged by the complainant, to be the cause for this divorce is: Residence apart for over twelve years, provided for in Article 3rd., Sec. XVII of the said Divorce Law, and to prove it, the confessional proof was introduced as evidence on the part of the plaintiff, this Court being satisfied with such testimony, taken by depos- itions in accordance with the requirements of Articles 277, Sec. I, 288, 304, Sec. I, 371, 389 and 264 of the Code of Civil Procedure of the State. - THIRD:- It appearing to the Court that there are no children the issue of said marriage, nor any com- munity property belonging to the parties, nothing is adjudged in this judgment in that regard All matters of fact as well as of Law were submitted to the Court, and the Court having read the pleadings, heard the evidence and argument of counsel, finds as follows, to-wit:-- FIRST:- IT IS ADJUDGED, ORDERED AND DECREED that the plaintiff"
}