{
	"anumber": "A30537468",
	"id": "A30537468_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTAMENTO DE ESTADO, CITUDAD DE INMIGRANTE Y REGISTRO DE EXTRANJERO, Form Approved 2-68"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (Spanish) Form Approved 2-68 DEPARTAMENTO DE ESTADO Budget Bureau No. 47-R0150 ICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTI ONES: Este cuestionario debe llenarse por DUPLICADO'a máquina 0, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las p as pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sírvase contestar en hojas aparte, por duplicado, indicando los mismos números de las preguntas del cuestionario a las que correspondan las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5.00. Estos derechos deben abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda nacional, 0 mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de su enjuiciamiento, deportación, o ambos. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) DERAT Raul Soto 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name) Ninguno 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet (if Roman letters not used) Inaplicable 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Dia (Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Prov. o Dpto.) (Province) País (Country) 21 11 59 Parral, Chih. Méx. 7. Nacionalidad 8 Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) Mexicana (Single (never married)) Incluyendo mi matrimonio actual, me he casado 1 veces. (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) Emple ado 12. Motivo del viaje a los EE.UU. employee Calle Diaz Mirón #1848, Tijuana, B. Cfa., Méx., 13. Nombre completo domicilio del cónyuge (consignar el apellido de soltera de la esposa) (Purpose in going to the United States) [Name and address of wife/husband (give maiden name of wife) ] 90280 Reunirme con mi Esposa, Trabajar Carmen R. Velez 8947-1/2 Santa Fé, S. Gate, Calif. 14. Nombres y domicilios de los hijos menores de 21 años 15. La(s) persona(s) nombrada(s) en los números 13 y 14 me (no me) acom- (Names and addresses of children under 21 years of age) pañará(n) a los Estados Unidos 0 se (no se) reunirá(n) conmigo posterior- mente en dicho país [Person(s) named in 13 and 14 (will) (will not) accompany or follow me to the United States] Tache lo que no corresponda (Cross out words that do not apply) 16. Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanentemente, 17. Puerto de entrada indíquelo) (Intended port of entry) [Length of intended stay (if permanently, so state) ] Permanentemente San Ysidro, Calif., 18. Domicilio que tendrá en los Estados Unidos 19. ¿Tiene Ud. pasaje hasta su destino final? (Final address in the United States) (Do you have a ticket to final destination?) 8947-1/2 Santa Fe, South Gate, Calif.9028 inaplicable 20. Nombre, parentesco y domicilio de la persona con quien se reunirá en los 21. Nombre y domicilio de su fiador (si no es la misma persona U orga- Estados Unidos. nización indicada en el número 20.) [Person you intend to join (Give name, address and relationship, if [Name and address of sponsoring person or organization (if different any) ] from 20)] Carmen Derat: (Esposa) 8947-1/2 Santa Fe South Gate, Calif., 90280 Misma. 22. Filiación personal: (Personal description) 23. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Height) (Color of hair) castaño 5 m (ft.) 8 cm. (in.) Ningunas. b) Color de los OJOS d) Tez (Color of eyes) Verde's 24. A esta solicitud se /anexan los siguientes documentos: green (Complexion) blanco fais more (The following documents are submitted in support of this application) Certificado de nacimiento Certificado de defunción Comprobante de medios económicos propios Certificado(s) médico(s) (Birth certificate) (Death certificate) (Evidence of own assets) (Medical record(s) ) Certificado(s) de policía Certificado de divorcio Declaración jurada de manutención Fotografías (Police certificate(s) (Divorce decree) (Affidavit of support) (Photographs) Certificado de matrimonio Hoja de servicio militar Oferta de empleo Otros (describanse) (Marriage certificate) (Military record) (Offer of employment) [Other (describe) Pasaporte Provisional, prueba de la Ciudadania de la Esposa. ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
