{
  "anumber": "A30506045",
  "id": "A30506045_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30506045_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, FORM APO-3056"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1473,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 5/8/2023 UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43.RO368 DATE FILED FEE STAMP APPLICATION FOR VERIFICATION OF 941420 LAWFUL PERMANENT RESIDENCE OF AN ALIEN motiles In connection with immigrant visa application(s) of my relative(s) listed in item 15 below, : request that the American Consul at CLUDAD JUARES CHIHUAHUA be furnished a verification of my lawful admission into the United (City and Country abroad) States for permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to preve if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. King 1. (Last, RIVERA- In CAPS) Rx RODERTO MY NAME IS (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: BELERA A30-506- 045 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 506 PROSPERITYS,E, ALBUQUERBUE N.MEX 8.7102 4. PERMANENT ADDRESS IN THE U S. (Number and Street) (City) (State) (Zip Code) 506 PROSPERITY SIE, ALBUGUERQUE N.MEY 87102 5. MY DATE OF BIRTH IS: (Month) (Day) (Year) 6. MY PLACE OF BIRTH WAS: (City) (Country) 7. I AM NOW A CITIZEN OF: (Country) 4 27 14 CAMARED CHIH, MEX. No-CMEXICO) 8. MY FATHER'S NAME: 9. MY MOTHER'S FULL MAIDEN NAME: BERNARDO RIVERH PARCIA (DECEASED) SOFIA Rubio DE RIVERA (DECEASED) DATA RELATING TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE OR MY ADJUSTMENT OF STATUS TO PERMANENT RESIDENT 10. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE OR ADJUSTMENT OF STATUS TO PERMANENT RESIDENT: 11. MY U.S. PORT OF ARRIVAL WAS: RIVERA- (Frist) Rub/o (Middle) Bub RODERTO REVERSE EL phso TEXAS 12. MY DATE OF ARRIVAL OR ADJUSTMENT WAS: (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS: (Show Name of Vessel or Airline and Flight No., etc.) MARCH 7-1473 BUS 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: CARLER PACKING Co, BRORDWAY S.E. P.O.Box ALBORLERGUE 14. I first obtained an immigrant visa at a United States consular office abroad on (date) (location). At that time, I was was not married. 03-02-73 JUARIES MEX, 15. Including my present marriage I have been married / times. The name of my present spouse is: ROSALES RIVERA to whom I was married on SEPJ15-38 at CLUDAD CANAREO MEXICU My present spouse is (Check One) (date) (location) a U. S. Citizen a permanent resident neither of these. If married more than one time, list names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: 16. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE FOIA (b)(6) FULL NAME DATE AND PLACE OF BIRTH FOIA (b)(6) FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 17. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby informed that the applicant named Patest Girlsa R above was was not lawfully admitted for permanent residence. His \"A\" file shows date of first admission for permanent residence as 3-2-73 symbol SA-1 issuing post and date of issuance of IV. Cd. Juarez, Mexico 3-2-73 , marital status at time of first admission - Single; Married; Divorced; Widowed. File does does not establish relationship between applicant herein and visa applicant. Verification made from Form I-151 personally presented by applicant showing lawful permanent residence of: INS OFFICE: El Paso, Texas 3-13-74 Verifier: A Roberto Torres Date: FORM 1.550 (REV. 2-1-73)N Supervisor, RA&I Section El Paso. Texas"
}