{
  "anumber": "A30506045",
  "id": "A30506045_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30506045_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE CHIHUAHUA, Nº 19072"
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1914,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/8/2023 Cert. Núm TGE 54-09 Rec. de Cd Camargo, Chih. , Cantidad $ 20.80 Reducción según Oficio Núm ACTA No. 19072 DEL REGISTRO ESTADO DE CHIHUAHUA side condicio En nombre de la República Mexicana y como Juez del Registro Civil de este lugar hago be le are CHIN, saber a los que la presente vieren y certifico: under o CAMARGO. Que en el libro Núm. 50 Nacimientos de la Sección de del Registro Civil que es a ini cargo, a fojas 138 Vuelta. - lb se encuentra un si acta del tenor literal siguiente: officia horid se Al margen ACTA NUMERO 86 Nacimiento del niño ROBERTO RUBIO del Huella digital del pulgar derecho de! niño. AL CENTRO: ESTADO DE CHIHUAHUA, A CTA Chil DE NACIMIENTO- En Cd.Camargo, Chih., nonero Registro Municipio de 1 mismo nombre a las 10.00 Horas del día 27 de Mayo el de mil novecientos catorce como del CIN ante mí, Ignacio Delgado.. - Juez del Registro Civil, comparece la señora 150 documento Sofia Rubio de Nacionalidad mexicana. - fecha PRESSORD de 26 años, de estado Civil soltera. - vecino de este lugar con domicilio en Plaza Juarez # 31 y presenta un niño of a quien puso por nombre ROBERTO RUBIO Ley hijo Natural del la DEL y de la Sra. compareciente de que nació a las 51/2 horas del día lo 165 27 de Abril de 1914. - del COMPLETED del año que en Cd Camargo, Chihy manifiesta que es el ler. lugar.- Art. Matrimonio PADRE MADRE Nombre Sofia Rubio.- - la ACTIS Edad 26 años - los Ocupación Labores del hogar.- Nacionalidad mexicana. - de liner PARA Domicilio Plaza Juárez # 31.- sin ABUELOS PATERNOS Apla Nombre presente Domicilio del ABUELOS MATERNOS la espide Nombre el Domicilio Adda que TESTIGOS el en Nombre Angel Rodriguez Florencio Chavira.- Edad Mayores de edad.. - Ocupación Empleados Publicos. - Domicilio conocido conocido,- Leída la presente Acta, fué ratificada por los intervinientes, firmando os que supieron hacerlo Doy fe. I.Delgado. -A. Rodriguez. Chavira, Por sentencia de fecha 2 de Enero de 1961 del Juzgado de Prime ra Instancia, se ordenó rectificación de ésta Acta, diciendo - que el interesado es ROBERTO RIVERA RUBIO, hijo natural del se for Bernardo Rivera Garcia y de la Sra, Sofia Rubio Medrano, _ES COPIA FTELMENTE SACADA DE SU ORIGINAL LA QUE DEBIDAMEN TE COTEJADA SE EXPIDE A SOLICITUD DE PARTE INTERESADA EN CIUDAD CAMARGO EST ADO DE CHIHUAHUA A LOS DOS DIAS DEL MES DE JULIO DE MIL NOVECIENTOS SETENTA Y UNO . El Juez del Registro Civil CAMARGO, CHIL. Ing. Luis Jaramillo Martinez. -"
}