{
	"anumber": "A30537468",
	"id": "A30537468_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Escrow Agreement,, 8941."
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "You will as h agent assign any fire insurance of either party handed you for use in this escrow. The assurance of title and fire nce policies, if any, may be delivered to the holder of the first encumbrance, or to the holder of the senior encumbrance d in this escrow, if any. Time is of the essence of this agreement, however, in the event that the conditions of this escrow have not been complied with at the time provided herein, you are instructed nevertheless to complete the same at any time thereafter as soon as the conditions (except as to time) have been complied with unless I shall have made written demand upon you for the return of money and/or instruments deposited by me. No notice or demand of change of instructions shall be of any effect in this escrow or recognized by your company unless given in writing by all parties affected thereby, except that in the event conflicting written demands are, or may be made or notices served upon your company growing out of or relating to this escrow, the parties hereto expressly agree, and consent that your company shall have the absolute right, at your election, to do either or both of the following: Withhold and stop all further proceedings in and performance of this escrow and of all instructions herein, or file a suit in interpleader and obtain an order from the Court requiring them to interplead and litigate in such court their several claims and rights amongst themselves. In the event of any suit being brought arising out of this escrow in which you are named or required to defend or institute as inter- pleader, the principals to this escrow jointly and severally agree to pay you all costs, expenses and reasonable attorney's fees which you may expend or incur, the amount thereof to be a fixed lien on any money or property of the parties hereto in your possession and a judgment therefore to be rendered by the court in such suit or action. We agree to save you harmless as escrow holder here- under from all loss and expense, including reasonable attorney's fees and court costs, sustained by reason of any action which may in any way arise out of this escrow notwithstanding anything in these instructions to the contrary, and in such event you shall not be liable for interest or damage. Each grantor herein agrees to pay, outside of this escrow and before delinquency, all taxes on his or former owner's. personal property not conveyed through this escrow, which appear as a lien upon the real property conveyed, and you are not to be con- cerned with same. You are not to be held liable for the sufficiency or correctness as to form, manner of execution, or validity of any instrument deposited in this escrow, nor as to identify, authority, or rights of any person executing the same, nor for failure to comply with any of the provisions of any agreement, contract, or other instrument filed herein or referred to herein, or payments that may be- come delinquent on encumbrances during escrow or insurance policies that may expire during escrow, and your duties hereunder shall be limited to the safekeeping of such money, instruments, or other documents received by you as escrow holder, and for the disposition of same in accordance with the written instructions accepted by you in this escrow, and you shall have no liability whatsoever, excepting in the event of willful neglect or gross misconduct on your part. Unless otherwise provided in these instructions, all adjustments are to be made on the basis of a 30 day month and any reference herein to the \"date of close of escrow\" is to be considered as the date of recording of the deed. Your company is authorized to destroy or otherwise dispose of any and all documents, papers, instructions, correspondence and other material pertaining to this escrow at the expiration of five years from the date of these instructions, regardless of the date of any subsequent amendments hereto, additional or supplemental instructions or date of close of escrow without liability and without further notice to us. You are authorized and directed to deposit any and all funds placed in this escrow by any party hereto with any State or National Bank in a '''Trustee'' account in the name of your company pending the completion of this escrow. In the event it may be necessary or proper, to comply with the conditions and instructions of this escrow, you are authorized to deposit or cause to be deposited, during the pendency of this escrow, any funds or documents with any institution qualified as sub-escrow agent under regulations of the Escrow Act to be used in accordance with instructions in this escrow upon recordation of the instruments required to be recorded to complete this escrow; said funds and documents shall be deemed to have been re- ceived by your company prior to recording even though the funds or documents are in the possession of such sub-escrow agent. Recordation is authorized of any instruments delivered through this escrow if necessary or proper in the issuance of the policies. of title insurance required. All disbursements to be made by check of Frost Escrow Co. Buyer and seller each acknowledge receipt of a copy of these instructions. ADDITIONAL INSTRUCTIONS Seller will furnish a report from a licensed termite operator covering termites, dry-rot and fungus affecting the buildings located at 8945, 89451, 8947 and 89471 Santa Fe Avenue, South Gate, Calif. in accessible areas. If such report discloses infestation, seller is to eliminate such infestation and repair damage at their expense. Buyers will approve the report prior to the close of escrow and as escrow agent you are not to be responsible for the validity and adequacy of said report. Seller authorizes payment for making the inspection report if a bill is presented in this escrow. Roy H. Fernando Carmen Suarez Margaret A. Fernando"
}
