{
	"anumber": "A30537468",
	"id": "A30537468_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0038/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, WOLCOTTS FORM 304"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States", "Panama"]
		},
		"years": {
			"ms_years_nlp_v1": [1933, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "AFFIDAVIT OF SUPPORT State of California County of Los Angeles } SS Mrs. Carmen M. Suarez I, , residing at 89471 Santa Fee Ave., South Gate, Calif,XXX 90280 BEING FIRST DULY SWORN, DEPOSE AND SAY That I am a citizen of United States of American born at e In Panama . That I am 45 years of age and have resided in the United States since 1933 I have been a citizen since 1940. THAT it is my intention and desire to have the following person(s) at present residing at KXXX Lista de correos, Tijuana B. C. come to the United States: TRAUTZ Country Relationship Name Sex Age of Birth to deponent Raul Derat Male. 58 Mexico. Husband. Seamstress THAT I am employed or engaged in the business of with Messerman Sports Wear at 2922 S. Main St., Los Angeles, and derive a net annual Income of $ 3,098.00. THAT I have deposits in Banks in this country $ 1,200.00. THAT own at I Real Estate 894712 Santa Fee Ave. valued at $ 25,000.00+ with mortgages or other encumbrances amounting $ 20,000.00 . THAT I have other personal property with a reasonable value of $ 2,500.00 with encumbrances amounting $ Clear. . THAT I have Life Insurance in the sum of $ 5,000.00 with cash surrender value of $ 1,500.00. . THAT the following persons are dependents upon me for support None. THAT I am willing and able to receive, maintain and support the prospective immigrants listed above. That I am ready and willing WOLCOTTS FORM 304"
}
