{
	"anumber": "A30537468",
	"id": "A30537468_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificado de Nacimiento, 55"
		},
		"years": {
			"ms_years_nlp_v1": [1970, 1911]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Forma 55 I.G.E. Cert. Núm de Sta. Barbara, Chin. Cantidad $ 20.80 Reducción según Oficio Núm ACTA No. 593880 En nombre de la República Mexicana y como Juez del Registro Civil de este lugar, hago saber a los que la presente vieren y certifico: NACIMIENTOS Que en el Libro Núm 45 de la Sección de 84 del Registro Civil que es a mi cargo, a fojas se encuentra un acta dei tenor literal siguiente: Al Margen.- Acta de nacimiento- del niño RAUL DERAT SOTO.- - Un Sello que a 1a letra dice: Poder Ejecutivo del Estado.- - Chibuahua, Villa Chib Escudo Nacional al Centro Número 399.- - En la de Santa Bárbara, Distrito Hidalgo, a las 11:00 -- bre de 1911 mil novecientos once, ante mi: Marcial once de la mañana del dia 16 dieciséis de Diciem-- Cavazos uez del Estado Civil, compareció el- ciudadano Sidronio Derat, natural de Parral y ve-- -- cino de este lugar, de 37 treinta y siete años, casado, comerciante. Y present6 un niño vivo naci- - do el dia 21 veintiuno de Agosto prôximo pasado, a quien pone por nombre RAUL DERAT SOTO, hijo le-- gitimo del compareciente y de su esposa señora Ciris Soto, de 24 veinticuatro años , casada y ve- cina de este lugar. El niño es nieto por linea pa- terna de los finados Francisco Derat y Josefa Ampa rán; y por la materna del ciudadano Ildefonso Soto y Francisca Soto que viven. Fueron testigos de es- to acto los ciudadanos Marciano Barragán y Cristo- bal Guzman, mayores de edad, Empleados, solteros y vecinos de este lugar. Leida esta acta, firmaron - Doy fe. M. Cavazos.- S. Derat:- M. Barragan. C. Guzman. RUBRICAS ES COPIA FIEL Y CORRECTA SACADA DE SU ORI GINAL LA QUE SE EXPIDE A SOLICITUD DE PARTE INTERE SADA SE AUTORIZA Y FIRMA EN SANTA BARBARA, CHIH., A LOS 27 DIAS DEL MES DE FEBRERO DE 1970. EL JUEZ DEL REGISTRO CIVIL DEL EDUCATION REGISTRA Rail Vieugas RAUL VILLEGAS I. STA. CMS. BARBARA."
}
