{
  "anumber": "A30537468",
  "id": "A30537468_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30537468_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1970,
        1968
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "D-630 V 537468 UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS HAS NOT Form I-151 issued LOS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) I & NS FILE NUMBER, IF DERAT Raul Soto KNOWN ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN/THE UNITED SEC. 212(a) (14) STATES VIA SYS/65 LABOR CERTIFICATION IMM. & NATZ. SERVICE NOT APPLICABLE SAN YSIDRO, CAL. 62 ADMITTED 165 OCT17 1970 (Name of vessel or flight no. of arrival) feet 2 STATUTORILY EXEMPT INELIGIBILITY FOR VISA WAIVED UNDER SECTION I-130 attached CLASS TO IR-1 ATTACHED 212(e) 59 212(g) 212(i) NOT REQUIRED MO.-DAY-YR COUNTRY OF BIRTH 382 OCCUPATION OF BIRTH 890 COUNTRY OFLAST 8-21-11 Mexico 882 MARITAL STATUS SEX RESIDENCE NATIONALITY M W SEP XX Employee Mexico s D Mexican FINAL ADDRESS STREET ADDRESS IN THE UNITED CITY,STATE,AND ZIP CODE, IF AVAILABLE STATES 8947 1/2 Santa Fe So. Gate, Cal. 90280 041 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. 170CJ 1970 U.S P.H.S. Passed APPROVED 157 E&t This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION Consulate General CLASSIFICATION SYMBOL AMERICAN IR-1 Tijuana, B. Cfa., Mexico FOREIGN STATE/OTHER AREA LIMITATION AT Mexico 000 IMMIGRANT VISA NO. HERBERT B. MOLLER John Demolar 1112-A ISSUED ON (Day) VICE CONSUL OF THE (Month) (Year) UNITED STATES OF AMERICA of the United States of America. OCT 1 1970 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF IS (Day) (Month) (Year) 1 4 FEB 1971 PASSPORT NO. meg 16729 OR OTHER TRAVEL DOCUMENTS (Describe) ISSREDUL DeratSoto TO PHOT ATTACHED Prov. ppt. issued BY at Mexicali, B.C. FUREION SERVICE Tariff Item No. 21 ON SINNET STATES OF AMERICA March 11, 1970 Fee Paid EXPIRES Local Cy Equiv. March 10, 1971 FORM 1-68 FS-511 * U. S. GOVERNMENT PRINTING OFFICE: 1968 O - 325 - 454"
}