{
  "anumber": "A30546927",
  "id": "A30546927_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30546927_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 5/5/2023, NARA"
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 RUBEN IGONZALEZ LOPEZ, ACTUARIO ENOFUNC. IONES: S :DEbSECRET OR LIOBBOR - MINISTERI ADE LEY DEL JUZGADOED PRIMERA INSTANCIAO DEbra CIVILIDE ESTEDISTRIPTO JUDICIAL DE-NOGALES, SONORA, ATROMA RITICOF IsCoAce Mostorsi estoe Customer el expediente numero 256-728 #relativocal judcio-JsV. Infor Testimonial, promovide por Angela (Macian Hurtado, entreootras robrani as siguientes constancia?nt adipastal about - DE PRIMERA INSTANCIA DELP RAMDS Poinots ern t C. 98 ANGELA MACIAS HURTADO, mexicana, mayor de edad, e asoda,8 coupadaden los I is quehaceres del hogar, con domicilio en Buenos Aires No. 358, de esta - ciudad, autorizanco Ernesto R. Coronado para que oliga toda clase Actificationes y use de la s facultades que 16 concedem a basiar tículos 71, 72 y 174 del Codigo de Procedimientos Civiles, ante aisted con todo respeto exponger our necesito acreditor aiertos hechos que. se rela-- ciohair con mi nacionalidad by estado civil, port wo que en vía ide juris- hea diccion Voluntaria, vengo a promoveer estas dil igéncies pare ele fecto K de que el dia® Jorhara que se sofiale portise respeta biketuduzgado se reci- et testimonio de los testigos que presentaré personalmente, los que Lob ser examinados de acuerdogon el siguientle inte rrogator in:-Pre- MO? vias sus generales protesta de Ley dird be Si ime cono- cen personalment sabe que nacion la celudad de Cananea [Sonora aoo saben sque nacifient o Scurrio el dia 3 de junio de 1910. 4. sel Si saben gue soy nija legftima de Pos asenores Wosé Mácia stsy branci sca Is Hurtado de Macias, (Finados) $1 saben que I'm is padres füeron mexi- canos \"por nacimientoo 63251 saven que siempre the tconserbado miximacio- aof nalidad meicana. que nombre complete tes TANGELA MACIAS PHORTADO.- goissi saben quet siempresse me ha reconocido bconoel nonbre d ANGELA PMACPASSHURTADOS4 dessi aben reque todos missactos oy document os --abaev tenth que retricar 10 Xhe hechol.com el nombreode ANGELA MACIAS BOTTA HURTADO. - 2 Pórulo Ta interiormented expuesto y fundados en ibs 836,-837bu838sdel CódigoEd eoProce- admientos e. Jues, Intentament espido:- PRIEER OF Señalar 10q dia glhbraspara quelse reciba informacion testimonia lsque efresco . -sn SEGUNDO Dardia Intervencion cue por. dereboo led cobpetesále 60 Agente - of V del Ministerio Público adecrito TERGERO: Una- vehique reciba la in- V adsa formacion de merito ae me expide copia certificada) por triplicado de"
}