{
  "anumber": "A30506045",
  "id": "A30506045_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30506045_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ON FOR VERIFICATION OF UL PERMANENT RESIDENCE OF AN ALIEN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1970,
        1943
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED AIRTRA,ENST2023 JUSTICE FORM APPROVED IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 ON FOR VERIFICATION OF RETSTAMP OF AN ALIEN TakCONSULLATE OF THE UNITED STATES by 300 FEE PAID No. 71-150-7 UL PERMANENT RESIDENCE Immigration and Naturalization Service Albuquerque, New Mexico Date 5-5-71 Verified by, MeJalas OF AMERICA IMMIGRATION AND NATURALIZATION SERVICE, I request that MAY the 14 American 1971 Consul at Ciudad TUAREZ CHiH MEX be furni shed a verification of my lawful admission MEXICO into the United States for permanent residence to be used in connection with the per- son(s) listed CINDAD eHHABEZ, 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: RIVERA de CHAIRES Lwz MARIA A FOIA (b)(6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 5. FATHER'S NAME: 4105 PRINCE SE. ALBUQUERQUE, N.MEX. Nov. 9, 1943 RobERTo RIVERA -RUBIO 6. MY PLACE OF BIRTH WAS: (City) (Country) CHIHUAHHA CH.H. 7. MOTHER'S MAIDEN NAME: MA. de. Lahuz ROSALESTE RIVERA 8. I AM NOW A CITIZEN OF: (Country) MEXICO INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. PORT OF ARRIVAL: RIVERAde CHAIREL Luz MARIA EL PASO, TEXAS 11. DATE OF ARRIVAL: (Month) (Day) (Year) 12. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No., etc.) DEC 18, 1970 AFOOT 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM IWAS DESTINED: 14. AT THE TIME OF LAST LAWFUL ADMISSION TO THE U.S. I ENTERED WITH: ACCOMPANYING AN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD NONE HUSBAND A PERMIT TO REENTER OTHER (EXPLAIN) AND I HAVE NOT BEEN ABSENT FROM THE UNITED STATES SINCE. 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME RobERTo RIVERA BURTA DATE AND PLACE OF BIRTH APRIL 27, 1914 RELATIONSHIP FATHER ADDRESS CALLE COSTA Rica 1239 Cd JUDRELY CHiH, MEX. FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that the subject named above was was not tawfully admitted for permanent residence as shown. Legrencia Rose thaing El Paso, Texas 12/18/70 Insert symbol for entries after 6/30/24. SA-1 Visa (issued 12/17/20 INS Office: El Paso, Texas (Mrs. E. M. McCluskey, Super visor M Sue Clus Date: Verifier Records Administration and 5/13/71 Information Section FORM 1-550 (REV. 6-1-69)"
}