{
	"anumber": "A30506045",
	"id": "A30506045_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30506045_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN, 1-213 ( (Rev. 4-1-70) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/8/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31-.34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion RIVERA-Rubio, Roberto M grey br dark Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation Mexico None A19 824 595 64\" 134 labor United States Address (Residence) (Number) (Street) (City) (State) Scars or Marks 4108 Prince S.E., XXXMX Albuq., New iv exico left thumb missing Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Single Married B-2; at ELP; at 3-29-71; afoot; at 10 AM Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence Method of Location/Apprehension Calle Costa Rica 1329 Nte., Cd. Juarez, Chih., Mexico XFXXX Other Inv. efforts Birthdate Date of Action Location Code (At/Near) Date & Hour 4-27-1914 5-5-71 ABQ ABQ 5-5-71; 9 am City, Province (State) and Country of Birth AR Form: (Type & No.) Lifted By Cd. Camargo, Chih., Mexico I-186 Not Lifted Stevens & Richardson, Inv. Visa Issued At Social Security Account Name Status at Entry Status When Found - I-186 at ELP 1064529 Roberto Rivera R. ECC B-2 Industry Data Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. I-186 on 9-13-61 585-74-4208 To: DD/ELP 1 month Immigration Record Criminal Record Claims none claims none Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of Minor Children Lux ROSALES; Mexico; SUBJECT'S address in Mexico 4 Mexico Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known Bernardo; Mexico ; deceased Sofia; Mexico; deceased Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 [Yes No Not Listed Listed, Code SEMIB Name and Address of (Last) (Current) U.S. Employer PO Box From: To: Karler Meat Packing Company, 1005, 87103, Albuq., N. M. 4-1-71 present Narrative (Outline particulars under which alien located/apprehended. Include details, not shown above, re time, place, manner of last entry, and elements which establish administrative and/or criminal violation. Indicate means and route of travel to interior.) SUBJECT was brought to ABQ Office by an official of Karler Ment Packing Company, to be interviewed by a SVC officer to determing his (alien's) status. SUBJECT was in possession of SW-434 reflecting adm. as B-2 at ELp on 3-29-71 to 4-8-71 & I-186. Mexico ill SUBJECT desires to effedt vol. dep. at no expense to the GOV Required Departure Verified at ElP on 7/9/71 I-94 to CO R-84 to FBI G-189 Prepar+d el sed Mastercard File ci i 7c F/P; I-210 GMS - Inv (If space insufficient, show \"continued\" and continue on reverse, from bottom up): (Signature and Title) DISTRIBUTION Received (subject and documents) (report of interview) from - A19 824 595 Officer: GMS 1 - ABQ 50.10 5-5-71 19 at 9 AM ( ). M. 1 - OIC/ELP W/7-186 att. Disposition I-210 letter to 6-5-71, Docket Cant. ELP (Receiving Officer) this G. M. Stevens, AOIC Form 1-213 (Rev. 4-1-70) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}
