{
	"anumber": "A30784652",
	"id": "A30784652_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0019/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA MEDICAL EXAMINATION OF VISA APPLICANTS, FS-398"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "PLACE DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA American Embassy MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION APR 22 1974 CITY COUNTRY At the request of the American Consul at Paris France NAME AGE SEX I certify that on the above date I examined VIOLIN, Wilhelmine 66 F I examined specifically for evidence of any of the following conditions: IR-1 CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancioid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma. inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, B, or C - diagnosis, and pertinent details*): XXXX 70 mm April 22, 1974: NEGATIVE (left pleuro-pericardiac adhesion - Chest X-ray report 14 X 17 no change with film of March 12, 1973. Handcarried: 4 Large films dated from March 12, 1973 to April 22, 1974 F. Gross, M. D. Times Physician, and Medical Adviser from Dr. U. S. Embassy, Paris, France NEGATIVE Blood serological report from Approved Laboratory Other special report(s) (when needed) SIGNATURE OF MEDICAL William TECHNICAL ADVISOR J. F. Gross, M. D. from TITLE Physician, and Mostical DATE OF FINAL REPORT of U. S. Embassy, Paris, France April 23, 1974 FORM Continue on reverse side if necessary. FS-398 7-71"
}
