{
	"anumber": "A30784652",
	"id": "A30784652_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Le procès de Bauer"
		},
		"years": {
			"ms_years_nlp_v1": [1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "@ and Attender at contraire, que 13 dame SCRWALB néo BAUER Mustific de do son Apoux par renval dume procédure penns labollo 11 entretient une concubs no and donicile conjugal 7 DOBE. Instruct N° 27th, I9 Chambs THIS sttendu que dation les art. The et 49 du cade Civil auto stulement onion subving, to this mais ED dos manquements Pravos aux devoirs que comporte Is ancore 1'm a conjugely corrillant 20 a un tel point que $208. pout a attendre retatiturement d'une communité con DD 8.19 nature de celui - ot. our attendit out12 schot No'faire droit à sa demonde, avec toutez GOD consequences légules, hotement is gards do Ivenfant minour et une pepsion elimentaire manamollo que zalbunar entime devoir atro Rizle as 1a some so trente milla Tranco CES MOTIFS et morés débata on chambre du conseil - Statuant subligmement on namere civicil at en probler resport. Déboute 10 ziour SCHWALE de Bon action principale ut Intenfit droit dehands reconvention 0710 do 216pound 10 alvorco THE epoux SCWALE BAURS all Sibfit de 11/Spouse at nox torte et griefs duy maria ave toutes de's consequences. de droit. que de non conciliation ut a rize 10 formo est at 25 REVRIER 19 quatto commoned a produire Bos effets à partir du as idelena contain uni and Heat sur Lot transcription du dispositif du présen t Jul suffened Bivil de la ville de SERVID 15 VIENNE NOVEMERK Autriche 1936 on et to our coux des a dts OABABLANCA I de célébré le stirts nier domicilo des Spoux an margos was hit que monition on born faito I° (on margo de 2'acte de - et on marga de Itaôto de naissance de o chacun 02 époux conformentat 4'10101 the Date Ordonne to #iquitation de la comminuté 16gale do bie avant exists entre les époux. automia 200 - pour proceder Me *MOEVAN notaire à Conablance soud la surveillance de M. 16 Juge rapporteur qui dressei rapport on:00 de difficultes. *** Dit gutan call Qu juge rapportour du du notaire counts 11 sera pourve a tour reimlacement per are nance la President de 00 Tribunal renduo our simple requets. - Conf. adone Wilhoeluine BAUER la garde de 1'enfor mineur Robert'st off que 10 Tire pourru le garder quinze jours pendant lob gradds vacances, a charge d'aller le prondre at rumener au dominile do-1 more. 002 serious"
}
