{
	"anumber": "A30784652",
	"id": "A30784652_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "féminin"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEMANDE DE VISA D'IMMIGRANT ET D'APPELLATION À TITRE D'ÉTRANGER, Form Approved Budget Bureau No. 4-0150"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1908]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "French) Form Approved Budget Bureau No. 47-R0150 DEPARTEMENT D'ETAT DEMANDE DE VISA D'IMMIGRANT ET D'INSCRIPTION A TITRE D'ETRANGER INSTRUCTIONS: La présente formule doit être remplie en DOUBLE EXEMPLAIRE, à la machine à écrire ou à la main, en employant des caractères d'imprimerie bien lisibles. Il est indispensable que vous répondiez à toutes les questions s'appliquant à votre cas. Si une question ne s'applique pas à votre cas, faites-en mention. Si nécessaire, vous pouvez utiliser des feuilles supplé- mentaires, en double exemplaire, sur lesquelles devront être reportés les numéros correspondants de la formule. Ces feuilles devront être jointes à la formule. PRIERE DE NE PAS SIGNER la présente formule avant d'y être invité par le consul. Un droit de 5 dollars sera perçu lors du dépôt de la présente demande de visa d'immigration. Ce droit devra être payé en dollars des Etats-Unis, ou en un montant équivalent en monnaie du pays, ou par chèque bancaire au moment où l'intéressé se présentera devant le consul. AVERTISSEMENT: Toute fausse déclaration ou toute dissimulation d'un fait essentiel pourra entraîner votre exclusion des Etats-Unis à titre permanent. Même si vous étiez admis aux Etats-Unis, le fait d'y être entré frauduleusement pourrait donner lieu à des poursuites judiciaires et ou à votre expulsion du territoire. 1. Nom de famille (Family name) Premier prénom (First name) Second prénom (Middle name) VIOLIN WILHELMINE 2. Tous autres noms que j'ai employés ou sous lesquels j'ai été connu(e) (la femme mariée doit indiquer son nom de jeune fille) [Other names used or by which known (if married woman, give maiden name)] NEE BAVER DIVORCEE SCHWALB 3. Nom et prénoms en caractères de l'alphabet d'origine, si ces caractères ne sont pas ceux de l'alphabet romain [Full name in native alphabet (if Roman letters not used)] NE SIAPPLI QUE PA S 4. Date de naissance (Date of birth) 5. Age (Age) Jour (Day) 11 (Month) Mois AVRIL Annee (Year) 66 saws 1908 6. Lieu de naissance (Place of birth) Ville Departement ou Province Pays (City or town) VIENNE (Province) (Country) AUTRICHE 7. Nationalite (Nationality) 8. Sexe (Sex) French FRANGAISE Masculin Féminin (Male) (Female) 9. Situation de famille (Marital Status) Célibataire (N'ayant jamais contracté mariage) Marie(e) Veuf(ve) Divorcé(e) [Single (never married)| Y compris mon présent mariage, j'ai été marie(e) 2 fois. (Married) (Widowed) (Divorced) Séparé(e) de corps et de biens (Separated) (Including my present marriage, I have been married times). 10. Métier ou profession (Occupation) 65ANS 11. Adresse actuelle (Present address) Housewife PARIS 75007 12. But dans lequel je me rends aux Etats-Unis (Purpose in going to the United States) POUR Y VIKRE To live with husband 13. Nom, prénoms et adresse de votre conjoint (indiquer le nom de jeune fille de la femme) [Name and address of wife/husband (give maiden name of wife)] KARL VIOLIN 1545 PARKER AVENUE TRACY CALIFORNIE9532 14. Noms, prénoms et adresses des enfents Ages de moins de 21 ans (Names and 15. La personne ou les personnes indiquees aux rubriques 13 et 14 m'accompa- addresses of children under 21 years of age) gnent (ne m'accompagnent pas) ou me rejoindront (ne me rejoindront pas) NE 5 APPIQUE PA S aux Etats-Unis. (Person(s) named in 13 and 14 (will) (will not) accompany or follow me to the United States Rayer les mentions inutiles (Cross out words that do not apply) 16. Durée du sejour (Indiquez si vous avez l'intention de vous fixer aux Etats. 17. J'ai l'intention d'entrer aux Etats-Unis par le port de: (Intended port of Unis à titre permanent) [Length of intended stay (If permanently, so state)] A TITRE PERMANENT entry) SAN FRANCISCO 18. Adresse définitive aux Etats-Unis (Final address in the United States) 19. Etes-vous en possession d'un billet vous permettant de vous rendre à votre 1545 PARKER AVENUE adresse définitive? (Do you have a ticket to final destination?) TRACY CALIFORNIE 95376 OU1 YES 20. J'ai l'intention de me rendre auprès de la personne suivante (Indiquez nom, 21. Nom et adresse de la personne ou de l'organisation qui se porte garante pour adresse et degré de parente, s'il y a lieu) [Person you intend to join (Give vous (si elle n'est pas la même que celle indiquée à la rubrique 20) [Name and name, address and relationship, if any)] address of sponsoring person or organization (if different from 20)] PARKER KARI VIOLIN 22. Signalement (Personal description) Grey Brown Fair a) Cheveux (Color, of hair) b) Yeux (Color of eyes) c) Taille (Height) m. (ft.) cm. (in.) d) Teint (Complexion) GRIS MARRON NORMAL 23. Signes particuliers (Marks of identification) none RIEN 24. Les documents suivants sont joints à l'appui de cette demande: (The following documents are submitted in support of this application) Acte de naissance Preuve établissant l'existence de vos ressources personnelles (Birth certificate) (Evidence of own assets) Extrait(s) du casier judiciaire Garantie de soutien Police certificate(s) (Affidavit of support) Acte de mariage Offre d'emploi (Marriage certificate) (Offer of employment) Acte de décès Pièces médicales (Death certificate) Medical record(s) Jugement de divorce Photographies (Divorce decree) (Photographs) Etat des services militaires Divers (en donner la description) (Military record) [Other (describe)] Cette formule peut être obtenue GRATUITEMENT dans les services consulaires des Etats-Unis d'Amérique"
}
