{
	"anumber": "A30784652",
	"id": "A30784652_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (French), Form FS-510 ( (French)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "France", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1937]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (French) (Page 2] 25. Ressources personnelles (Personal financial resources) Austanet's resources a) Espèces (Cash) c) Immeubles (Valeur) [Real Estate (value)} b) Dépôts bancaires (Bank deposits) d) Divers (en donner la description) [Other (describe)] 26. Nom et adresse du père (s'il est décédé, mentionnez-le et indiquez l'année du décès) [Father's name and address (If deceased, so state giving year of death)] LEOPOLD BAUER DECEDE 1937 27. Nom de jeune fille et adresse de la mère (Si elle est décédée, mentionnez-le et indiquez l'année du décès) [Mother's maiden name and address (If deceased, so state giving year of death)] PICK HEDWIG DECEDEE1933 28. Nom et adresse du plus proche parent, dans le pays d'origine (si les père et mère sont décédés) [Name and address of next of kin in home country (If neither ROBERT parent is living) SCHWALB (fits) HAVENUE CHARLES do ORGE GAULLE AVIGNY sur 29. Enumérez tous les lieux où vous avez réside pendant au moins six mois depuis l'âge de 16 ans (List all places of residence for. 6 months or more since your sixteenth birthday) Ville Département (ou Province) Pays Dates (du-au) Métier ou profession (City or town) (Province) (Country) [Dates (from-to) (Calling or occupation) VIENNE AUTRICHE NAISSANCE PARIS FRANCE CASABLANCA MAROC COUTURIERE PARIS FRANCE 9M411447 MAINLENAN CONTURIERE Dressmaker 30. Enumérez toutes les organisations (professionnelles, sociales et politiques) dont vous êtes ou avez été membre ou auxquelles vous êtes ou avez été affilie(e) depuis l'àge de 16 ans [List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Nom et adresse Dates (du-au) Précisez la nature de votre participation et, le cas échéant, de la (Name and address) [Dates (from-to) fonction exercée par vous (Type of membership and office held, if any) NE S'APPLIQUE PA S 31. Enumérez toutes les langues, y compris la vôtre, que vous pouvez parler, lire et écrire (List all languages, including your own, that you can speak, read and write) GERMAN Langue FRENCH Que je parle Que je lis Que j'écris (Language) (Speak) (Read) (Write) ALLEMAND FRANCAIS oui our our ANGLAISE PEU UN PEU MAL 32. Précisez les périodes de votre résidence antérieure ou de vos séjours aux Etats-Unis (Indiquez la catégorie du visa obtenu, ou à quel titre vous avez été admis) (Si vous n'avez jamais été aux Etats-Unis, indiquez-le) [Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state)] SEN'Y ETAI6 JAMAIS 33. Avcz-vous jamais été en traitement dans un hôpital, une institution ou autre établissement specialisé pour des troubles mentaux, Oui Non pour vous être adonné à une drogue ou pour alcoolisme? (Dans l'affirmative, donnez des explications) (Yes) (No) [Have you even been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain)] 34. Avez-vous jamais été arrêté, condamné ou incarcéré, ou avez-vous jamais été admis dans un asile d'indigents ou autre institution Oui Non de charité? (Dans l'affirmative, donnez des explications) (Yes) (No) [Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain)] 35. Avez-vous jamais bénéficié de mesures de grâce, d'amnistie, d'un décret de réhabilitation, de toute autre mesure de clémence ou de Oui Non tout acte analogue? (Dans l'affirmative, donnez des explications) (Yes) (No) [Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain)] 36. Avez-vous jamais sollicité un visa d'entrée aux Etats-Unis? (Dans l'affirmative, indiquez où et quand, si vous avez fait une demande Oui Non de visa de non-immigrant ou d'immigrant et si le visa vous a été accordé ou refusé) (Yes) (No) [Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused)] 37. Vous êtes-vous vu refuser l'entrée aux Etats-Unis au cours des douze derniers mois? (Dans l'affirmative, donnez des explications) Oui Non [Have you been refused admission to the United States during the last twelve months? (If answer is Yes, explain)] (Yes) (No) 38. Vous êtes-vous jamais fait inscrire à un bureau de recrutement selon les lois des Etats-Unis sur le service militaire obligatoire par Oui Non selection? (Dans l'affirmative, donnez des explications) (Yes) (No) [Have you ever registered with a draft board under United States Selective Service laws? (If answer is Yes, explain)] 39. Avez-vous jamais fait une demande afin d'être exempté de l'instruction et du service militaires dans les forces armées des Etats-Unis, Oui Non ou avez-vous quitté les Etats-Unis ou vous en êtes-vous tenu éloigné, pour éviter de satisfaire à vos obligations militaires ou pour (Yes) (No) vous y soustraire? (Dans l'affirmative, donnez des explications) [Have you ever applied for relief from training and service in the United States armed forces or departed from or remained outside the United States to avoid or evade military service? (If answer is Yes, explain)] 40. Avez-vous l'intention d'entrer aux Etats-Unis en venant du Canada, du Mexique ou d'une ile voisine des Etats-Unis avant l'expira- Oui Non tion d'un délai de deux ans consécutif à votre arrivee au Canada, au Mexique ou dans l'ile en question? (Dans l'affirmative, indiquez (Yes) (No) le nom de la compagnie de transports par laquelle vous êtes entré(e) ou avez l'intention d'entrer au Canada, au Mexique ou dans cette fle) Do nd to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after ada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which ou or intend to enter Canada Mexico or such island)]"
}
