{
  "anumber": "A30784652",
  "id": "A30784652_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "France",
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1971,
        1974,
        1906,
        2000,
        1964,
        1961,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "AFFIDAVIT OF SUPPORT. I, Karl VIOLIN, residing at 1545 Parker Avenue (P.O.Box 53), Tracy, California 95376 being duly sworn depose and say: I was born on January 12, 1906 at Vienna, Austria. I am a United States citizen by naturalization; certificati can number 5923113. That I am 68 years of age and have resided in the United States since 1939. That this affidavit is executed on behalf of my wife, Wilhelmina , nee Bauer, 65 years of age, a native of Austria, who is residing at 31, rue St. Guillaume, 75007 Paris, France. That I was a self-employed physician until the year 1961; that thereafter, I was employed by the State of California, Department of Corrections, as a physician. That I retired after 101/2000 years of service in August 1971. That my monthly income is as follows: 513.62 ( Public Employees' Retirement System, State of California) 230.50 ( Social Security benefits). That I have a checking account at the Tracy, California Branch of the Bank of America which was opened on October 30, 1964. An average balance of over 1000.00 has been maintained. That I have accounts at two Savings Institutions, both passbook and certificate accounts, with a total balance of more than $ 16,000.00. That there are no persons dependent upon me for support. That my obligations consist of monthly payments of $ 100.00 to my former wife by order of the Superior Court of California for the County of Alameda at Oakland. A decree of divorce became final on June 14, 1966. That I am willing and able to maintain and support my wife who is applying for an Immigration Visa, and that I wish to assure the Immigration and Naturalization Service that she will not become a public charge in the United States. Pleus, France 22. april 1974"
}