{
	"anumber": "A30784652",
	"id": "A30784652_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A30784652_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (French), FORM FS-510 ( (French)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (French) [Page 4) 42. Vous a-t-on aidé à remplir la présente demande? (Dans l'affirmative, donnez le nom et l'adresse de la personne qui vous a aidé, en Oui Non indiquant s'il s'agit d'un parent, d'un ami, d'un représentant d'agence de voyages, d'un homme de loi ou de toute autre personne) (Yes) (No) [Were you assisted in completing this application? (If answer is Yes, give name and address of person assisting you indicating whether relative, friend, travel agent, attorney, or other)] Non Adresse Qualité (Name) (Address) (Relationship) N'ECRIVEZ RIEN AU-DESSOUS DE LA LIGNE DOUBLE Le consul vous aidera à répondre aux rubriques 43 et 44 (DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44) 43. J'estime ne pas être frappé d'inadmissibilité à recevoir un visa ni frappé d'exclusion selon l'alinéa de la rubrique 41, pour les raisons suivantes: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 41 for the following reasons:) Sect 212(a)(14) I'm the benef. of a pet. app'd under Sect 201(b) Amembassy, Paris, Franc April 9,1974. 44. J'estime être (I claim to be a) un immigrant appartenant à la priorité soumis à la limitation numérique établie pour (indiquer le pays étranger ou le territoire qui en dépend) [ preference immigrant subject to the numerical limitation for (foreign state or dependent area) un immigrant special soumis a la limitation numérique établie pour l'hémisphère occidental (Special immigrant subject to Western Hemisphere numerical limitation) un immigrant special non soumis à la limitation numérique (Special immigrant not subject to limitation) proche parent d'un citoyen des Etats-Unis (Immediate relative of a United States citizen) Ma demande est fondée sur les faits suivants: (My claim is based on the following facts:) Je n'ignore pas que je dois remettre mon visa à un Agent du Service de l'Immigration lors de mon entrée aux Etats-Unis et que la possession d'un visa ne me confère pas le droit d'entrée aux Etats-Unis s'il est constaté, à ce moment-là, que je ne remplis pas les conditions requises par les lo.s d'immigration. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) Je n'ignore pas que toute déclaration fausse ou de nature à induire en erreur, ou que toute dissimulation d'un fait essentiel faite intentionnellement par moi dans la présente demande peut entraîner mon exclusion permanente des Etats-Unis et, au cas où j'y aurais été admis, peut donner lieu à des poursuites judiciaires et ou à mon expulsion. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) Je, soussigné, sollicitant un visa d'immigrant pour les Etats-Unis, déclare sous la foi du serment (ou affirme solennellement) que toutes les déclarations figurant dans la présente demande, y compris les réponses se référant aux rubriques 33 à 42 inclusivement, ont été faites par moi et sont, autant que je sache, exactes et complètes. Je déclare en outre, sous la foi du serment (ou affirme solennelle- ment) que, si je suis admis aux Etats-Unis, je ne m'y livrerai pas à des activités qui pourraient porter préjudice à l'intérêt public, ou compromettre le bien-être public, la sûreté ou la sécurité des Etats-Unis: à des activités interdites par la loi des Etats-Unis concernant l'espionnage, le sabotage, les troubles publics, ou à d'autres activités subversives qui pourraient compromettre la sécurité nationale; à n'importe quelle autre activité dont le but cons sterait à s'opposer au Gouvernement des Etats-Unis, à le contrôler ou à le renverser par la force, la violence ou tout autre moyen inconstitutionnel; ou n'adhérerai pas, ne m'affilierai pas et ne participerai pas aux acti- vités de toute organisation enregistrée ou requise de se faire enregistrer selon les dispositions de l'Article 7 de la Loi de 1950 sur le contrôle des activités subversives. Je comprends toutes les déclarations ci-dessus, ayant sollicité et obtenu une explication sur chaque point qui ne me paraissait pas clair. [I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that allstatements which appear in this applica- tion have been made by me, including the answer to parts 33 through 42 inclusive, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United States, will not engage in activities which would be prejudicial to the public States interest, or endanger the welfare, safety, or security of the United States: in activities which would be prohibited by the laws of the United relating to espionage, sabotage, public disorder, or in other activities subversive to the national security: in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregcing statements, having asked for and obtained an explanation on every point which was not clear to me.) Cd. Wehclunc Violin (Signature du demandeur) (Signature of Applicant) Signé et attesté sous la foi du serment, par devant moi, le 22 April 174 à Paris, France. (Subscribed and sworn to before me this day of 19 at Consul des Etats-Unis d'Amerique (Consular Officer) (FF NO. 20 PA $5.00 AL UIV."
}
