{
	"anumber": "A31236818",
	"id": "A31236818_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A31236818_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificado de Matrimonio"
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by. NARA, 5/10/2023 173349 it nombre dela República ive México 11 como Jurz del Estado Civil de este lugar, hago saber a los quela presente vieren It certifico ser cierto que en el Libro No. 1 del Registro Civil que es a mi rargo, a la haja No. 37 v.se encuentra asentada 1111 acta del tenor siguiente: JALISCO. Al margen:-Número 50,-Nicolas Ramirez y Ma. del Carmen Agredano.- 19 Matrimonio.-Dentro:-En Yahualica a 18 dieciocho de mayo de 1933 mil novecientos treinta y tres, a las 16 dieciseis horas traslada EJECUTIVO DEL do a la casa número 9 de la calle Francisco G. Gallo ante el C. En SERVICE caragado del Registro Civil due subscribe compareció el C. Nicolas Ramirez, soltero labrador de 21 veintiun años de edad originario - ALISCO y vecino del rancho \"La Tetilla' de este Municipio hijo legítimo - TESORERIA GENERAL de Juan Ramirez y María Gutferrez que viven y la señorita Ma. del- DEL Carmen Agredano, celibe de 18 dieciocho años de edad, originaria- ESTADO y vecina del rancho \"Casas Viejas\" de esta compresión, hija legí- tima de Pedro Agredano que vive y Catalina Agredano finada; todos mexicanos. Los interesados compare eron para realizar su matrimo nio, probaron con testigos su aptitud y libortad para enlazarse,- other como consta en el acta de su presentación de fecha 29 veintinueve de abril; declararon los contraventes entregarse reci procramente- SECURITO por esposos y no habiendose denunciado impedimento alguno hecha - la publicación de las proclamas y dado su consentimiento el padre de la pretendida el Encargado del Registro Civil los declaró uni- dos en perfecto y le stimo matrimonio a nonbre de la Sociedad. - DEPARTMENTO Testigos: Policarpo y José Pérez y Jose Salazar casados y vecinos. CHACRENDA Se dio lectura y conformes firmo el que supo. HAGIENDA ES COPIA QUE COTEJADA Y CORREG DA CONCUERDA FIELMENTE CON SU ORIGI- NAL DE DONDE SE COMPULSO Yahualica de Gonzalez Gallo, Jalisco a 31 de marzo de 1969. cial del Registro Civil. VALOR $ 10.00 MOLINA MARTINEZ. marting"
}
