{
  "anumber": "A31236818",
  "id": "A31236818_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A31236818_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Spanish), FS-510"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1969,
        2023,
        1926,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 Form FS-510 (Spanish) Página 2 21. En apoyo de mi solicitud, y como parte de ella, presento los documentos siguientes: (I am submitting the following personal documents in support of and as part of my application) certificado de nacimiento (Birth certificate) hoja de servicio militar (Military record) oferta de trabajo (Promise of employment) certificado(s) de policía (Police certificate(s)) prueba de propio sostenimiento o de recursos historial medico (Medical record(s)) (Evidence of support or own resources) Otros (describanos) (Other (describe)) 22. Nombre y dirección actual de mi esposa/marido/(dese el nombre de soltera de la esposa): (Name and present residence of my wife/husband is) (Give maiden name of wife) Maria del Garmen Agredano- Moctezuma 498- Tepatitlán, Jali sco, Mexico 23. Nombres y direcciones de hijos de menos de 21 años de edad (The names and addresses of my children under 21 years of age are) FOIA (b)(6) 24. Nombres de los miembros de mi familia que emigran conmigo (The names of members of my family who are immigrating with me are) Ninguno 25. Nombre y dirección de mi padre (si ha fallecido, indíquese) (The name and address of my father is) (If deceased, so state, giving date) Juan Ramirez Gutiérrez ( Finado) 26. Nombre de soltera y dirección de mi madre (si ha fallecido, indíquese) (The maiden name and address of my mother is) (If deceased, so state, giving date) Maria Gutierrez- ( Finada) 27. El nombre y dirección de mi pariente más cercano en mi país es: (The name and address of my next of kin in my home country is) FOIA (b)(6) 28. Desde que cumpli 16 años he residido por seis meses o mas en los lugares siguientes: (Since my sixteenth birthday my places of residence for 6 months or more have been) Ciudad Provincia País Fechas (de-a) Profesión u oficio (City or town) (Province) (Country) (Dates) (From-To) (Calling or occupation) Moio. Yahualica, Jal. Mexi CO 1926-1957 Agri cultor Mpio. Tepatitlán, Jal. Mexico 1957-1969 16 il it Estados unidos de Norteamerica 1- 1946- Oct. 46 29. Desde que cumplí 16 años he sido o soy miembro o afiliado de las siguientes sociedades políticas, profesionales u organizaciones sociales: (Since my sixteenth birth- day I am or have been a member or affiliate of the following political, professional, vocational or social organizations) Nombre y dirección Fechas (de-a) Clase de miembro y cargo ejercido, de haberlo tenido (Name and address) (Dates) (From-To) (Type of membership and office held, if any) De ninguna Mone 30. Hablo, leo y escribo los idiomas siguientes: (I speak, read, write the following languages) (Include your native language) Idioma (Language) Hablo (Speak) Leo (Read) Escribo (Write) Español Español Español Espanol 31. Anteriormente he estado en los Estados Unidos en los períodos siguientes (Indíquese el año, clase de visa o condicion) (Si nunca ha estado, indíquelo): (I have previously been in the United States during the following periods) (Give year and type of visa or status) (If never, so state) -1946 a Oct. 1946- ilegal. California"
}