{
	"anumber": "A31236818",
	"id": "A31236818_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A31236818_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (Spanish), Screeneded by NARA, 5/10/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Form FS-510 (Spanish) Página 3 32. Las de inmigracion de los Estados Unidos requieren que todos los presuntos inmigrantes contesten las siguientes preguntas. Este requisito no implica que se que usted se encuentra dentro delas categonias descritas en el cuestionario. Sus respuestas ayudarán al funcionario consular a establecer su elegibilidad pa er una visa. Si no le es posible contestar a cualquiera de estas preguntas, sirvase explicar por completo su incapacidad para hacerlo en una hoja aparte que erá adjuntar a este formulario. Sirvase tener presente que cualquiera que sea la naturaleza de sus respuestas a estas preguntas no se considerará, nece- que usted es inelegible para obtener una visa. Por ejemplo, si usted ha sido arrestado o convicto de una falta leve y el funcionario consular puede comprobar que se trata solamente de un delito de menor cuantía, el haber sido usted arrestado o convicto no influye, necesariamente, para declararlo inelegible para obtener una visa. Sirvase dar la respuesta correcta a las siguientes preguntas poniendo un circulo alrededor de \"Si\" O \"No.\" (1) (a) ¿Ha sido usted arrestado, acusado o convicto de un crimen u otro delito? (Have you ever been arrested for, charged with, indicted for, Yes No or convicted of, a crime or other offense?) Sí (No (b) ¿Ha sido usted recluído en una prisión O cárcel civil? (Have you ever been confined in a civilian prison or jail?) Si No (c) ¿Ha sido usted recluído en una prision O carcel militar? (Have you ever been confined in a military prison or jail?) Sf No (d) ¿Se ha dedicado usted a la venta, compra o tráfico ilícitos de drogas narcóticas? (Have you ever been engaged in illicit buying, selling or handling of narcotic drugs?) Sí No (e) ¿Se le ha otorgado a usted perdón o amnistia, decreto lereh. litación u otro acto de clemencia O accion semejante? (En caso afirmativo sirvase explicarlo) (Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar Si No action? (If so, explain)) (2) (a) ¿Ha sido usted recluido en un asilo de mendigos (casa de caridad o institución de beneficencia)? (Have you ever been placed in an alms- house (poor house or charitable institution)?) Si No (b) ¿Es usted indigente; mendigo de profesion O vago? (Are you a pauper, professional beggar or vagrant?) Sí No (c) ¿Padece usted de un defecto físico, enfermedad O invalidez que pueda afectar su capacidad para ganarse la vida? (Are you now afflicted with a physical defect, disease or disability which may affect your ability to earn a living?) Sí No (d) ¿Le será posible a usted atender a su sostenimiento en los Estados Unidos? (Will you be able to support yourself financially in the United States?) Si No (3) (a) ¿Ha tenido usted uno O más ataques de demencia? (Have you ever had one or more attacks of insanity?) Sí No. (b) ¿Está o estuvo usted afectado de personalidad psicopatica, epilepsia, defecto mental, paroxismos, desmayos, convulsiones, o neurastenia? 6 desvircian sexual (Are you now or have you ever been afflicted with psychopathic personality, epilepsy, mental defect, fits, fainting spells, convulsions or Si (No a nervous breakdown? or sexual deviation (c) ¿Es O ha sido usted adicto al uso de narcóticos O drogas O es o ha sido usted alcoholico crónico? (Are you now or have you ever been a narcotic or drug addict or chronic alcoholic?) Sf No (d) ¿Ha recibido usted tratamiento en un hospital, institución o en otro lugar por padecer de demencia O enajenación mental O por ser adicto a drogas y narcóticos O por alcoholismo? (Have you ever been treated in a hospital, institution or elsewhere for insanity or other mental Si No disorder or for drug or narcotic addiction or alcoholism?) (e) ¿Ha padecido usted de lo siguiente? (Have you ever had any of the following:) (A) Tuberculosis en alguna de sus formas (Tuberculosis in any form?) Sí No (B) Lepra (Leprosy?) Sí No (C) Cualquiera otra enfermedad contagiosa (Any other dangerous contagious disease?) Sí No (4) (a) ¿Es usted polígamo? ¿Practica usted la poligamia O aboga usted por la práctica de la poligamia? (Are you a polygamist, do you practice polygamy, or do you advocate the practice of polygamy?) Sí No (b) ¿Es o ha sido usted prostituta, conseguidor se sostiene usted totalmente O en parte con producto de la prostitución? (Are you or have you ever been a prostitute, procurer, or supported wholly or in part from the proceeds of prostitution?) Sí No (c) ¿Va usted a los Estados Unidos para dedicarse a actos sexuales inmorales, a la prostitucion u otro vicio ilegal comercializado? (Are you going to the United States to engage in an immoral sexual act, in prostitution, or other unlawful commercialized vice?) Si No (5) (a) ¿Ha solicitado usted antes una visa para entrar a los Estados Unidos de inmigrante O de no inmigrante (Si la respuesta es afirmativa sirvase indicar el lugar y la fecha en que la solicitó, y si le fue expedida la visa.) (Have you previously applied for a visa to enter the United States either as an immigrant or as a nonimmigrant?) (If answer is yes, state where and when, whether you applied for a Sí No nonimmigrant or an immigrant visa and whether the visa was issued.) (b) ¿Se le ha negado a usted la entrada a los Estados Unidos durante los últimcs doce meses (si la respuesta es \"Si,\" sirvase presentar pruebas de que Procurador General le ha permitido solicitar de nuevo su entrada a los Estados Unidos). (Have you been refused ad- mission to the United States during the last twelve months?) (If the answer is yes submit evidence that the Attorney General has Si No consented to your reapplying for admission into the United States) (c) ¿Ha sido usted (Have you ever been) (A) ¿Arrestado y deportado de los Estados Unidos? (arrested and deported from the United States?) Si No (B) ¿Expulsado voluntariamente de los Estados Unidos por cuenta de este Gobierno como persona que ha caído en la desgracia? (volun- tarily removed from the United States at United States government expense as a person who fell into distress?) Sí No (C) ¿Expulsado de los Estados Unidos como extranjero enemigo? (removed from the United States as an alien enemy?) Si No (D) ¿Expulsado de los Estados Unidos a costs del Gobierno en vez de deportacion? (removed from the United States at Government Sí (No expense in lieu of deportation?) (Si la respuesta a cualquiera de las preguntas que anteceden es \"Si,\" sirvase presentar pruebas de que el Procurador General le ha dado permiso para solicitar nuevamente su entrada a los Estados Unidos) (If the answer to any of the above questions is yes, submit evidence that the Attorney General has consented to your reapplying for admission into the United States.) (6) (a) ¿Ha tratado usted de obtener una visa u otros documentos fraudulentamente O falseando intencionalmente los hechos para entrar a los Estados Unidos? (Have you ever attempted to obtain by fraud or willful misrepresentation a visa or other documentation to enter the Sí No United States?) (b) ¿Ha obtenido usted una visa u otros documentos fraudulentamente O falscando intencionalmente los hechos para entrar a los Estados Unidos? (Have you ever obtained by fraud or willful misrepresentation a visa or other documentation to enter the United States?) Si No (7) (a) ¿Se ha inscrito usted en una junta de reclutamiento, de conformidad con la Ley de Servicio Militar Obligatorio de los Estados Unidos? (Si la respuesta es \"Si,\" indique la fecha, lugar y el tipo de clasificación) (Have you ever registered with a draft board under the selec- Si No tive service laws of the United States?) (If answer is yes, give date, place and classification) (b) ¿Ha solicitado usted alguna vez ser exento del entrenamiento y servicio en las fuerzas armadas de los Estados Unidos? (Si la respuesta es \"Si,\" suministre información detallada) (Have you ever applied for relief from training and service in the Armed Forces of the Si No United States?) (If answer is yes, furnish details) (c) ¿Ha salido usted de los Estados Unidos o ha permanecido fuera de ellos para evitar o evadir el servicio militar en tiempo de guerra o de emergencia nacional? (Have you ever departed from or remained outside of the United States to avoid or evade military service Si (No in time of war or national emergency?) (8) ¿Puede usted, si es mayor de 16 años, leer y comprender algún idioma O dialecto? (Can you, if you are over sixteen, read and understand some language or dialect?) Si No (9) ¿Ha ayudado usted, en beneficio propic, a otro extranjero para entrar o tratar de entrar a los Estados Unidos en infraccion a las leyes de los Estados Unidos? (Have you for gain ever assisted another alien to enter the United States or try to enter the United States in violation of SI No the laws of the United States?)"
}
