{
	"anumber": "A31392644",
	"id": "A31392644_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A31392644_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEPARTMENT OF STATE PRELIMINARY QUESTIONNAIRE TO DETERMINE IMMIGRANT STATUS, Form 4-156-3"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1968, 1969, 1906, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 DEPARTMENT OF STATE Form Approved FOREIGN SERVICE OF THE UNITED STATES OF AMERICA Budget Bureau No. 47-R156-3 PRELIMINARY QUESTIONNAIRE TO DETERMINE IMMIGRANT STATUS To DO NOT WRITE IN THIS SPACE THE UNITED STATES CONSUL AT Ct Instructions for Sent INSTRUCTIONS If a careful reading of Form DSL-852 indicates that you should file this form, please complete it and return it to this office. This form should be typed or printed in legible block letters. When this form is returned to you, please retain it as it must be attached to any future correspondence addressed to this office concerning your desire to immigrate to the United States. 1. NAME (Last name) (First name) (Middle names) MUNJAL PARVATI DEVI 2. OTHER NAMES, ALIASES (If married woman, give maiden name and surnames of any previous spouses) 3. HOME ADDRESS AND TELEPHONE NUMBER (House number, street, city, state or province, and country) 188-R Model Town Sonepat (Haryana) 4. PLACE OF BIRTH (City, state or province, country) 5. DATE OF BIRTH (Month, Day, Year) Multan March 10, 1906 6. MARITAL STATUS Single Married Widowed Divorced 6a. NAME OF SPOUSE (if presently married) (Maiden or family name) (First name) (Middle names) 7. SPOUSE'S BIRTHPLACE (City, state or province, 8. SPOUSE'S BIRTHDATE (Month 9. WILL SPOUSE IMMIGRATE WITH and country) Day, Year) YOU ? Yes No 10. IS YOUR SPOUSE A UNITED STATES CITIZEN ? 11. IS YOUR SPOUSE A LEGALLY ADMITTED PERMANENT RESIDENT OF THE UNITED STATES? Yes No Yes No 12. WAS YOUR OR YOUR SPOUSE'S FATHER OR MOTHER 13. IS YOUR OR YOUR SPOUSE'S FATHER OR MOTHER A BORN OR NATURALIZED IN THE U.S.? PERMANENT RESIDENT OF THE UNITED STATES Yes No Yes No 14. DO YOU OR YOUR SPOUSE HAVE A BROTHER OR 15. DO YOU AND/OR YOUR SPOUSE HAVE A SON OR SISTER WHO IS A UNITED STATES CITIZEN? DAUGHTER WHO WAS BORN OR NATURALIZED IN THE U.S.? My only the son 4. DR. A P & K. MUNJAL Yes x No is an immige Yes come u. S. chisen in Age yrs No will 16. DO YOU AND/OR YOUR SPOUSE HAVE A SON OR DAUGHTER WHO IS A PERMANENT RESIDENT OF THE UNITED STATES ? Yes No 16a. IF YOU OR YOUR SPOUSE ARE NOW, OR HAVE BEEN, IN THE UNITED STATES, STATE : WHERE WAS VISA OBTAINED WHEN WAS VISA GRANTED (Month, Year) APPLICANT NEW DELHI 22 July 1966 4 revalidated SPOUSE on 27 May 1968. CHECK TYPE OF VISA USED FOR SUCH ENTRY : Immigrant Government or international organization official or employee Exchange Visitor Other nonimmigrant Specify B-2 16b. IF YOU OR YOUR SPOUSE PREVIOUSLY LIVED IN THE UNITED STATES, STATE : DATE ADMITTED DATE DEPARTED REASON FOR DISCONTINUING RESIDENCE August 13, 1968 oct 24, 1969 Expiration of VISA date 17. PLEASE DESCRIBE THE TYPE OF UNIVERSITY OR COLLEGE DEGREE YOU POSSESS, IF ANY, OR YOUR HIGHEST LEVEL OF ACADEMIC OR VOCATIONAL TRAINING middle School FORM (Over) FS-497 2 - 66"
}
