{
	"anumber": "A34090385",
	"id": "A34090385_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34090385_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Jamaica", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1972, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "new IV 4090385 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HAS NOT BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) I & NS FILE NUMBER, IF SMITH VASHTINE AGATHA KNOWN ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE SEC. 212(a) (14) UNITED STATES VIA LABOR CERTIFICATION BO PA 224 NOT APPLICABLE IMPORTATION (Name of vessel or flight no. of arrival) INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT 6554-1 212(e) 212(h) 8 ATTACHED 2 212(g) 212(i) NOT REQUIRED MO.-DAY-YR. COUNTRY OF BIRTH OCCUPATION S1 COUNTRY OF LAST 514 MARITAL STATUS SEX NATIONALITY OF BIRTH RESIDENCE 8/30/06 Jamaica Dressmaker Jamaica M S W XX D SEP Jamaican FINAL ADDRESS STREET ADDRESS CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED 284 Howland Avenue STATES Englewood, New Jersey 0763229/ ACTION OF S.I.O. ACTION ON APPEAL U. S. P. H. S. This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of 37 the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN Embassy SA-1 FOREIGN STATE/OTHER AREA LIMITATION AT Kingston Western Hemisphere 005 Reiger/ Dain IMMIGRANT VISA NO. 578 Margaret L. Guise ISSUED ON (Day) (Month) (Year) Vice Consul of the United States of America. 18th February 1972 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 17th June, 1972 PASSPORT NO. 471981 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED PHOTOGRAPHY ATTACHED TO Vashtine Agatha Smith FOREIGN SERVICE BY Passport Office - Kingston Tariff Item No. 2STATES OF AMERICA ON October 5, 1971 Fee Paid $20 EXPIRES Local Cy Equiv. October 4, 1976 FORM * U. S. Government Printing Office: 1971-416-150 12-68 FS-511"
}
