{
  "anumber": "A34038282",
  "id": "A34038282_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, NARA 41092235"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS 1. WHERE TO SUBMIT THIS APPLICATION. If you are in the United States, TAKE this application IN PERSON to the Immigration and Naturalization Service office having jurisdiction over your place of residence. If you are outside the United States, TAKE this application IN PERSON to the United States Consulate or Immigration and Naturalization Service office having jurisdiction over the place where you are now residing. NOTE: YOU MUST FILE THIS APPLICATION IN PERSON. DO NOT MAIL IN. 2. PHOTOGRAPHS - Submit two color photographs of yourself taken within 30 days of the date of this application. These photos must have a white background, photos must be glossy, un-retouched, and not mounted; dimension of the facial image should be about 1 inch from chin to top of hair; subject should be shown in 3/4 frontal view showing right side of face with right ear visible; using pencil or felt pen, lightly print name(and Alien Registration Receipt Number, if known) on the back of each photograph. Failure to comply with the above instructions will delay the processing of your appli- cation. 3. FEE - If you checked (A) or (B) of item 18, a fee of fifteen dollars ($15) must be paid for filing this application. Otherwise, no fee is required. THE FEE CANNOT BE REFUNDED REGARDLESS OF THE ACTION TAKEN ON THE APPLICATION. ALL FEES MUST BE SUBMITTED IN THE EXACT AMOUNT. Payment by check or money order must be drawn on a bank or other institution-located in the United States and be payable in United States currency. If applicant resides in Guam, check or money order must be payable to the \"Treasurer, Guam.\" If applicant resides in the Virgin Islands, check or money order must be payable to the \"Commissioner of Finance of the Virgin Islands.\" All other applicants must make the check or money order payable to the \"Immigration and Naturalization Service.\" If the check is drawn on an a'c count of a person other than the applicant, the name of the applicant must be entered on the face of the check. If the application is submitted outside the United States, remittance may be made by bank international money order or foreign draft drawn on a financial institution in the United States and payable to the Immigration and Naturalization Service\" in United States currency. Personal checks are accepted subject to collectibility. An uncollectible check will render the application and any document issued pursuant thereto invalid. A charge of $5.00 will be imposed if a check in payment of a fee is not honored by the bank on which it is drawn. 4. AUTHORITY - 8 U.S.C. 1302 and 1304. Routine uses for disclosure under the Privacy Act of 1974 have been published in the Federal Register and are available on request. The information will be used by the Service to determine eligibility for an alien registration receipt card. Failure to provide all of the information requested will result in the denial of this application. 5. PENALTIES -SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT OR USING ANY FALSE DOCUMENT IN THE SUBMISSION OF THIS APPLICATION. U.S. GOVERNMENT PRINTING OFFICE : 1980 0 - 324-177"
}