{
  "anumber": "A34038282",
  "id": "A34038282_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551, FORM I-90"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U. S. DEPARTMENT OF JUSTICE Form Approved Immigration and Naturalization Service OMB No. 43-R0040 (SEE INSTRUCTIONS ON REVERSE) $15.00 Fee Stamp FEE PAID No. 81-98 APPLICATION BY A LAWFUL PERMANENT RESIDENT FOR Immigration and Naturalization Service Allouquerque, New Mexico AN ALIEN REGISTRATION RECEIPT CARD, FORM I-551 (TYPE OR PRINT IN BLOCK LETTERS WITH BALLPOINT PEN) Date 8/17/81 Verified by IM 1. Family Name (Capital Letters) First Middle Alien Registration Number Sanches 3. Mailing address in U. c/o (Number & Street) (City) Quintons (State) Juna gig A- 34 038.282 (ZIP Code) Rt 3 Bay 63 4. Name used when I became a permanent resident: (If same as present, write Same Bloonfield n me 5. Country of citizenship 84413 same MEXICO 6. Date of Birth (Mo./Day/Yr.) 7. Place of birth (City or town) (Province or State) (Country) 8. My phone number is (Include Area Code) 9. Originally 6-24-13 admitted to U.S. at (City and State) Dyegum 10. Date Durangs of snone admission as Permanent Resident or adjusted to status as Permanent Resident 9-8-72 SYS (Mo/Day/Yr) 9-8-72 11. Destination in U.S. at time of original admission 12. My file is at the INS office in (City and State) 13. List the dates of all absences from? the U. S. of 1 year or longer, since admission for permanent Los angeles Calef Degine residence Baja Cefif mexico now 14. City of residence when 1 applied for an immigrant visa or adjustment to permanent residence status Thyana Bya Cale's G-360 SENT TO LOS 15. Consulate where my visa was Issued (or INS office (where I was adjusted to permanent residence $tatus) DATE AUG 27 1981 16. Mother's First Name Living Deceased 17. Father's First Name Living Deceased Celvis Clingas Domingo 18. I NEED A CARD BECAUSE: (A) My alien registration receipt card was lost, destroyed, or mutilated. (Attach remainder of card) (FEE REQUIRED, SEE INS FRUCTION 3.) Explain how card was lost, destroyed, or mutilated. (B) My name has been changed. (Attach the decree of the court or the marriage certificate and old card.) (FEE REQUIRED, INSTRUCTION 3) (C) I am required to be registered and fingerprinted after my 14th birthday. (Attach old Card.) (You MUST use ingerprint card Form FD-258 which you can get from any United States Consular or Immigration and Naturalization Service office.) (D) I am an alien commuter taking up actual permanent residence in the U. S. (Attach old card.) PRYVERT (E) I received an incorrect card. (Attach old card.) (F) I never received my card. (G) OTHER (Explain) the Imagiation has asked me to get a new cold my card is Worn out dd meed a new one 19. Signature and date of person preparing the form if other than applicant 20. Signature of applicant and date 8-17-81 XMaTilda Romero 8-18-81 Quintance Sauchey Juana DO NOT WRITE BELOW THIS LINE, ACTION BLOCK (For use by Immigration or Consular officer) This applicant was interviewed by me under oath on (City) (Date) at REMARKS: old end at 2/19/82 X Quinitava Sandey guan (Signature and Title) GRANTED DENIED APPROVED INS Fingerprint card forwarded to the FBI to comply with Section 262 b DATE OF ACTION FEB 19 1982 (Initials and Date) DD I-89 to Immigration Card Facility (Date) DISTRICT a. H. gingni (Signature of Immigration Officer) RECEIVED TRANS. IN RET'D TRANS. OUT COMPLETED FORM I-90 (Rev. 4-4-807 PASO, TEXAS AUG 2 8 1981 FEB 19 1982"
}