{
  "anumber": "A34038282",
  "id": "A34038282_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO DE DURANGO Registro Civil, Nº 222365"
    },
    "years": {
      "ms_years_nlp_v1": [
        1859,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTMENT No 222365 ESTADO DE DURANGO Registro Civil Gobernador Constitucional del Estada, E Secretario General de Gabierno, Present ING. ALEJANDRO PAEZ URQUIDI. LIC. S ERGIO GUERRERO MIER. En nombre de la Republica de México Y como guez del Estado Civil de este lugar hago saber a los que la presente vieren Y certifico ser cierto que en el libro No. I UNO. del Registro Civil que es a me cargo a foja S. 43 Vt a. y 44 Fte. se encuentra asentada un acta del tenor siguiente: AL MARGEN IZQUIER DO:- Acta No. 70 setenta Matrimonio del C. JUAN QUINTANA Y la Srita] BALTAZAR DIAZ.- AL-. CENTRO:- En San José de la DCA Municipalidad de Villa Tepehuanes, Dgo. a las 10 diez- horas del día 12 doce del mes de Junio de 1934 mil novecientos treinta y cuatro, ante mi Antonio Gamboa C. Juez del Registro Civilde este lugar, comparecieron con el objeto de celebrar su matrimonio el C. Juan Quintana y la Sra. Baltazar Diaz. El primero dijo: se I natural y vecino del Rancho de los Cerritos, Dgo. de 21 veintiun años de edad, sonte rd natural y havitación en el expresado Rancho de los Cerritos hijo legítimo del C. Domingo Quintana natural y vecino del Rancho de los Cerritos mayor de edad viudo I de la finada C leof'as Sanchez. La Srita. Baltazar Diaz dijo: Ser natural y vecina del expresas do Rancho de los Cerritos célibe, con habitación en el expresado Rancho hija del C. Sele donio Diaz y Francisca Herrera natural y vecinos del Rancho de los Cerritos mayores de edad, casados, ambos contrayentes man festaron que verificcada su presentación matrimo nial el dia 24 veinticuatro del mes de Mayo próximo pasado que hechas las publicasiones de ella por el terimonio legal sin que se haya intespuesto impedimento alguno piden al preente Juez autorice su consertada unión en virut de haber ce llenado todos low requisi- tos que previene la Ley. se di6 lectura a la parte donducente de la de 23 veintitres de- julio de 1859 mil ophocientos cincuenta y nueve y a los artículos 182 cinento ochenta y dos al 205 docientos cinco, del Codigo Civil Vigente. Inerrogado los contrayentes en cumplimiento de 10 que dispne el artículo 121 cineto veintiuno del citado Cfidigo si es su voluntad unirse on matrimonio tomandose y entregandose mutuamente por marido y mujer y habiendo constado ambos en sentido afirmativo yo el C. Juez del Registro Civil de este lugar hice la siguiente declaración EN NOMBRE DE LA SOCIEDAD DECLARO UNIDOS EN PERFECTO- LEGITIMO E INDESOLUBLE MATRIMONICA AL C. JUAN QUINTANA Y A LA SRITA. BALTAZAR DIAZ. Fueron testigos de este acto los C.C. Nicolás Oérez y Epifanio Holguin y Octavio Hblguin- le primero natural del Rancho de Presidios de Abajo mayor de edad, casado los dos ulti- m DS naturales u vecinos de este lugar casados, el primero soltero el segundo labrador ##"
}