{
	"anumber": "A34090385",
	"id": "A34090385_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34090385_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAST ENTRY/OF AN ALIEN, IMM-26"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "Jamaica", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service Budget Bureau No. 43-R368.1 MM. NAT APPLICATION FOR VERIFICATION OF LAST ENTRYOF AN ALIEN (See instructions on Reverse) MAIL UNIT (Fill in with typewriter or print blook betters in ink) HIH 26 PM 2:02 Take or mail to- Fee Stamp IMMIGRATION AND NATURALIZATION SERVICE, Allen Registration No. A 34 090 384 `request that the American Consul at Toronto. Canada be furnished a verification of my last lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 19 on reverse of form. 1. My name is: (First) (Middle) (Last) Vashtine Agatha Smith-Robinson 2. Present address: (Number) (Street) (City) (State) (ZIP Code) (c/oH. Rashford) 1229 Ward Ave. Bronx New York 10472 3. Date of birth: 4. Place of birth: Aug. 30, 1906 5. I am a citizen or national of: (Country) Trelawny, Jamaica WeIo Jamaica W.T. 6. Father's name: 7. Mother's maiden name: David Smith (Deceased) Rebecca Brown ( Deceased) INFORMATION IN THESE BLOCKS PERTAIN TO MY LAST ARRIVAL INTO THE UNITED STATES 8. I was admitted under the name of: 9. Port of arrival: Vashtine Smith J.F.K. Air Port 10. Date of arrival: (Month) (Day) (Year) 11. Name of vessel or other means of conveyance: March 1, 1972 Panam 12. was 13. My occupation was: At that time I married. was not Domestic 14. Last permanent residence before my last arrival was: 37 Red Hills Road, Kingston, Jamaica W.I 15. Name and address of person in the United States to whom I was destined at the time of my last entry was: Earnest Robinson Englewood, New Jersey. 16. At time of last entry I was accompanied by: Unaccompanied 17. At the time of my last entry I traveled on an immigrant visa a permit to reenter a passport an alien registration receipt card and I have not been absent from the United States since. 18. I was was not in the United States before my last admission for permanent residence: (If so give dates of entry and departure) b. c. From From From To To To Form 1-550 OVER (Rev. 1-1-66)"
}
