{
  "anumber": "A34030555",
  "id": "A34030555_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34030555_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Tesorería General del Estado, 251092"
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "251092 it nombredela República de México 11 como Jurz del Estado Civil de este lugar, hago saber a los quela presente vieren It certifico ser rierto 1711 en el Libro No. O del Registro Civil que is a mi rargo, a la haja No. Sp encuentra asentada 1111 acta del tenor siguiente: ELC. LICENCIADO OSCAR IB ARRA RENTERIA OFICIAL MAYOR DE LA o SECRETARTA GENERAL DE GOBIERNO. CERTTFTCA POOR EXECUTIVO DEL STAOD Que en los libros copias de actas del Registro Civil de - - SAN LUIS SOYATLAN, MUNICIPIO DE TUXCUECA, JALISCO correspon- diente al año de 1915 mil novecientos quince a fojas 29 JALISCO veintinueve vuelta y bajo el número 70 setenta consta una - TESORERIA GENERAL partida de nacimiento aue exthalmente dice lo siguiente:- DEL ESTADO Dentro.- A1 margen 70- Acta numero setenta. - Nacimiento de Pablo Anava, hijo legitimo Dentro.- En San Luis Soyatlán - a las 11 once de la manana del dia 15 quince de Agosto de - 1915 mil novecientos quince. Ante mi Francisco Morando Comi sario Politico Ynterino V encargaro del Juzgado del Estado- civil de este lugary comparecio el cividadano Manuel Anava,- casado labrador de 38 treinta V ocho años de edad, origina rio V vecino del rancho de San Nicolas de esta Jurisdiccion presento a un niño ivo, en 10 primer lugar y que nacio a- yer /las 11 de 1a noche, a quien le pone por nombre PABLO* de raza blance con blanca, mexicano, hijo legitimo del COM- PA Do pareciente V de su esposa Cristina Hernandez, sin profesion JUL. 1971 de 20 veinte años de edad ET nacido es nieto por linea pa- HOME DR terna de Demecio Anava V Petra Rodrigtez que viven V por la GE materna de Luciano Hernandez V Cristina N que viven tambien Presento por Testigos a los ciudadenos Melesio Amezcua casa do iornalero de 3? treinta V dos años de edad y Epifanio - Llamas cad (sic) casado, jornalero de 46 cuarenta y seis a- CATALLY ños de edad, sin parentezeo con el nacido, ambos testigos VALOR $ 10.00 originarios y vecinos del mismo rancho. Leida la presente - ###"
}