{
	"anumber": "A34038282",
	"id": "A34038282_0066",
	"page_index": 66,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0066/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF PERMANENT RESIDENCE OF AN ALIEN, FORM I-250 ( (REV. 6-1-69)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1915, 2009, 1913, 1938]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-ROS on APPLICATION FOR VERIFICATION OF FEE STAMP UI PERMANENT RESIDENCE Bills F AN ALIEN RECEIVED Take or mail to- 29 Way 1970 DEPARTMENT IMMIGRATION AND NATURALIZATION SERVICE, of the United States of Ameries I request that the American Consul at Tijuana, Baja California, Mexico Master be furnished a verification of my lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 15. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: QUINTANA Romualdo FOIA (b)( (6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) 110 Concord Street - Los Angeles; California 90063 December 26, 1938 5. FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) JUAN QUINTANA Tepehuanes, Durango, Mexico 7. MOTHER'S MAIDEN NAME: 8. I AM NOW A CITIZEN OF: (Country) BALTAZAR DIAZ / Mexico INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE: (Last) (Fast) (Middle) 10. PORT OF ARRIVAL: QUINTANA ROMUALDO DIAZ Roma, Texas 11. DATE OF ARRIVAL: (Month) (Day) (Year) 12. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No, etc.) 08/21/56 Afoot 13. NAME AND ADDRESS OF PERSONIN THE U.S. TO WHOM IWAS DESTINED: 14. AT THE TIME OELAGTLAWFUL ADMISSION TO THE U.S. IENTERED WITH V N AN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD P n e Reg THE NAME JUAN PERSONS function QUINTANA-Sanchez IN WHOSE BEHALF Be SUCH INFORMATION the IS REQUESTED DATE AND A PERMIT to REENTER OTHER (EXPLAIN) HAVE NOT BEEN ABSENT FROM THE UNITED STATES SINCE 15. ARE AS FOLLOWS: FULL AND PLACE OF BIRTH 3 Tepehuanes, Dgo. Mexico June 24, , 1913 RELATIONSHIP ADDRESS FATHER Constelación No. 42 - Colonia \"Aeropuerto\" - Tijuana, B. Cfa. , Mexico FULL NAME DATE AND PLACE OF BIRTH April 7, 1915 BALTAZAR DIAZ Herrera Tepehuanes, Durango, Mexiço 04-7-1915 RELATIONSHIP ADDRESS MOTHER Constelación No. 42 - Colonia Aeropuerto - Ti ijuana, B. Cfa., Mexico FULL NAME DATE AND PLACE OF BIRTH FOIA (b)(6) FOIA (b)(6) RELATIONSHIP ADDRESS FOIA (b)(6) FOIA (b)(6) FULL NAME DOCS. RET. 2009 SEEN ANY DATE AND PLACE OF BIRTH FOIA (b)(6) FOIA (b)(6) RELATIONSHIP ADDRESS FOIA (b)(6) FOIA (b)(6) Aben NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that ben the subject named above was was hotp lawfully admitted for permanent residence as shown. married on Insert symbol for entries after 6/30/24. 0-1 LAWFUL ADMISSION VERIFIED INS Office: Los UnlitoConalia Date: 11/19/70 Verifier: Contact Representative, USING FORM I-550 (REV. 6-1-69)"
}
