{
  "anumber": "A34038282",
  "id": "A34038282_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0074/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SUBSTITUTION OF SECURITY, FPI-LC-10-71-3M-6052"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SUBSTITUTION OF SECURITY The obligor hereby deposits security of equal value, described hereunder, in substitution for the security herein- before pledged. It is agreed that the pledge and power of attorney previously executed applies to the newsecurity completely, even as to a default which may have antedated this substitution. DESCRIPTION OF SECURITY: Signed and sealed in the presence of- Date Name Address Name (AFFIX Address SEAL) Approved and accepted 19 (City) State) District Director) INSTRUCTIONS This form shall be executed in duplicate. The full name and residence of the obligor shall be stated and his signature, which shall conform thereto, must be witnessed by two other persons who shall sign their names and state in full their places of residence. However, no witnesses are required to the signature of an agent of an ac- ceptable surety company whose seal is affixed. All erasures and interlineations made prior to the execution of the bond must be initialed by the obligor and by the approving officer. The initials of the parties constitute their acceptance of the changes so initialed. This bond may be executed by an acceptable surety company or by any other obligor who deposits United States bonds or notes or cash as security for the performance and fulfillment of the undertaking thereon. An acceptable surety company is one whose name appears on a current Treasury Department Circular 570 as a company holding a certificate of authority as an acceptable surety on Federal bonds. A bond executed by a surety company must have attached thereto a currently valid instrument showing the authority of the agent of the surety company to execute the bond. If United States bonds or notes are deposited, the obligor must be the actual owner thereof. They must be negoti- able and not redeemable within one year of the date of the deposit. In addition to executing the bond, the obligor depositing United States bonds or notes must execute the Pledge and Power of Attorney for use when United States Bonds or Notes are Deposited as Security. Any charges made by the depository for accepting United States bonds or notes must be borne by the alien or the owner of the security. In addition to executing the bond, the obligor depositing cash must execute the Pledge and Power of Attorney for use when Cash is Deposited as Security. The acknowledgment of the execution of the Pledge and Power of Attorney in connection with the deposit of the United States Bonds or Notes or cash may be made before any officer or employee of the Immigration and Natu- ralization Service who has been authorized to administer oaths pursuant to Section 287 of the Immigration and Nationality Act without .payment of fee, or before a Notary Public. If made before a Notary Public he must affix his notarial seal and show the date his commission expires. FP1-LC-10-71-3M-6052"
}