{
  "anumber": "A34030555",
  "id": "A34030555_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34030555_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Receipt Card, 82"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FONE FOR UNITED STATES DEPARTMENT OF JUSTICE Form approved OMB No. 43-R0040 Immigration and Naturalization Service RECORD APPLICATION Applicant: Do Not Fill In This Block Nationality BY LAWFUL PERMANENT RESIDENT ALIEN FILE NO. A34 030 555 Code OI£35.1(1 SLB Checked Fee Required Fee Not Required FOR ALIEN REGISTRATION RECEIPT-CARD NO fee Collected Fee Stamp 82 FORM I-151 SYS (Please read Attached Instructions) 05/08/26 7948890 (L.S.) 1. I hereby apply for an Alien Registration Receipt Card for the following reason (Please check appropriate blocks:) (a) My alien registration receipt document was lost destroyed on or about feb. 13-76 under the following circumstances: (Date) My alien registration lost in t he street, card soc. sec. money (If my document is recovered, I will surrender it to the Immigration and Naturalization Service.) (b) My name has been changed (c) My present Form I-151 is mutilated. My evidence of alien registration (d) (e) I never received Form I-151. is on a form other than Form I-151. I am required by Section 262(b) of the Immigration and (g) My present Form I-151 is in poor con- Nationality Act to be registered and fingerprinted (f) after my 14th birthday. dition because of improper lamination. I am an alien commuter taking up actual permanent (h) I received an incorrect Form I-151. (i) residence in the U.S. My commuter Form I-151 is A-500 (If checked SLIBING (e) surrendered herewith. you (a), (b), (c) or above, see Instruction Number 7 concerning fee required.) 2. FAMILY NAME (Capital Letters) FIRST MIDDLE 4. Nationality YOUR NAME ANAYA PABLO HERNANDEZ 3. NUMBER AND STREET (Apt. No.) Mexican MAILING 1029 E. Yanonali St. 5. Alien Registration Number 6. Sex ADDRESS CITY STATE ZIP CODE A34 030 555 Male Female IN U.S. Santa Bárbara, California 93103 7. Admitted to U.S. at (City) (State) 8. Date of Admission (Mo.)(Day)(Yr.) 9. Date of Birth (Mo.) (Day) (Year) San Ysidro, California 4-17-73 8-14-1915 10. Means of Arrival (Name of Vessel, or Airline 11. Destination in U.S. at Time of Admission 12. Place of Birth (City) (Province or State) and Flight No., etc.) (Country) San Luis Soyotlan byfeet Santa Barbara, Ca. Jalisco, México. 13. Name Used When Registered as an Alien (If same as present, write 14. Name Used When Lawfully Admitted for Permanent Residence (If \"same.\") same as present, write \"same.\") Pablo Anaya Hernández same name 15. Address Outside U.S. if Temporarily Abfoad (Street, City, Country) 16. Date of Last Departure from U.S. none feb. 13 1976. 17. Dates of Absences From U.S. of 1 Year or Longer, Since Lawful Admission for Permanent Residence none 18. (If you intend to use Form I-151 as a document for travel within the next six weeks, give the date of your expected departure, list each country to be visited, and be sure to read Instruction 8 in regard to the limitations on use of Form I-151 for travel in or through certain countries.) a. Date of Proposed Departure b. Countries to be Visited none none 19. Signature of Person Preparing the Form If Other Than Applicant 20. Signature of Applicant I DECLARE that this application was prepared by me I CERTIFY that the information above is true and at the request of the applicant and is based on all infor- correct/ to the best of my knowledge and belief. D. mation of which I have any knowledge (Signature) pable anaya (Signature) Ave. C. 618-10Tij. BC Mex. feb.15-76 feb.17-76. (Address) (Date Signed) (Date Signed) RECEIVED TRANS IN RET'D-TRANS OUT FORM 1-90 3-18-26 (Rev. 9-27-75)N 25 FEB 1976"
}