{
	"anumber": "A34038282",
	"id": "A34038282_0069",
	"page_index": 69,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0069/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECEIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED AS SECURITY ( (To be held in Immigration and Naturalization Office; duplicate copy to be retained by the Depository), Form I-301 ( (Rev. 1-1-66)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 1972, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE LOS 7423 129 925 596 IMMIGRATION AND NATURALIZATION SERVICE 2. 139 925 598 3. FOIA (b)(6) RECEIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED AJ SECURITI (To be held in Immigration and Naturalization Office; duplicate copy to be retained by the Depository) 8-29-12 (Date) Los Angeles, California 90012 (City) (State) (Zip Code) The undersigned hereby acknowledges receipt from George He Boamberg, District Director For sweetys Remande Guintana-Dias of the United States bonds/notes hereinafter described, deposited by him to the order of the Attorney General, as security on bond dated August 29, 1972 , filed with Geraldine Be Grant, Immigration Inspector , on behalf of the (Name of immigration and naturalization officer and title) 1. Juan Quintana- Sanches (59) alien 2. Baltasar Dias de Quintana (57) 3. FOIA (b)(6 years of age, native of Said United States bonds/notes are assigned Not (State form of assignment, if registered) Coupon or Title of Bonds/Notes Total Face Amount Denomination Registered Serial Number Interest Dates U. S. Treasury Bond of $1,000.00 $1,000.00 430234 2-15 and 1987-92 4 Y4 % Dateds August 15, 1962 1-15-73 8-15 430128 # 4303.30 430140 $500.00 55783 (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely affix same hereto) The above-described United States bonds/notes will be returned only to or on the written order of the Attorney General, or his successor in office, or an officer of the Department of Justice, designated by either, and upon the presentation and surrender of the original of this receipt. This receipt is executed in duplicate and is not assignable. (Signature of depository) Form I-301 (Rev. 1-1-66)"
}
