{
	"anumber": "A34038282",
	"id": "A34038282_0079",
	"page_index": 79,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0079/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CONSULADO AMERICANO, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CONSULADO AMERICANO Tijuana, B. C. México Apartado Postal 68, Post Office Box 1358, Tijuana, B. C. San Ysidro, California 92073 A : Juan Quintana Sanchez Fecha 28 de Agosto de 1972 Se hace del conocimiento de usted que esta oficina considera que usted preliminarmente no llena los requisitos para recibir visa según lo dispuesto en la Sección 212(a)(15) de la Ley de Inmigración y Na.- cionalidad. Sin embargo, esta officina está dispuesta a dar ulterior consideración al caso de usted si una persona u organización interesa- da en la admisión de usted en los Estados Unidos, constituye una fianza garantizando que no se convertirá usted en carga pública, ante la Ofi- cina del Servicio Americano de Migración y Naturalización más cercana, por la cantidad de $4500.00 Esa fianza debe constituirse en nombre de usted o en los nombres de los siguientes miembros de su familia: Baltazar Diaz de Quintana (esposa) FOIA (b)(6) Para obtener esta fianza de su patrocinador debe pedir la Forma I-352 del Servicio de Inmigración y Naturalización más cercano a su lugar de residencia. Esta forma requiere la información siguiente: 1. Nombre de cada uno de los solicitantes, deletreado según su costumbre. 2. La edad de cada uno de los solicitantes. 3. El lugar en donde nació cada uno de los solicitantes. 4. La fecha anticipada y el nombre de la frontera por donde cru- zarán a'los Estados Unidos. Se sugiere que mande usted la forma I-352 a la persona que va a poner la fianza. Dicha persona debe presentar la forma al Servicio de Inmigración y Naturalización más cercano a su lugar de residencia, para que se le notifique a este Consulado cuando dicho bono haya sido pagado. * Sección 212(a)(15) de la Ley de Inmigración y Nacionalidad se refiere a: \"Extranjeros quienes, según la opinión del oficial consular al revisar la solicitud, o según la opinión del Procurador General de los Estados Unidos al tiempo de tratar la admisión a los Estados Unidos, pueden en cualesquier momento convertirse en carga pública para el go- bierno de los Estados Unidos\". (English on reverse side) (En Inglés a la vuelta)"
}
