{
	"anumber": "A34038282",
	"id": "A34038282_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REceIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED, I-301 ( (Rev. 1-1-66)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE LOS na 123 925 2g 925 590 RECEIPT OF DEPOSITORY FOR UNITED STATES BONDS OR NOTES DEPOSITED OLGURITI FOIA (b)(6) (To be held in Immigration and Naturalization Office: duplicate copy to be retained by the Depository) 8-29-12 (Date) Lon Angales California 90012 (City) (State) (Zip Code) The undersigned hereby acknowledges receipt from George K. Diabetes Director For enviyo of the United States bonds/notes hereinafter described, deposited by him to the order of the Attorney General, as security on bond dated August 29, 1973 , filed with Gardillane B. Grant, Insignation Inspector 1 on behalf of the (Name of Immigration and naturalization officer and title) 1. Jum (59) alien 2. Balbasay Dias de Quintana (57) 3. FOIA (b)(6) ears of age, native of Harleo Said United States bonds/notes are assigned Not (State form of assignment, if registered) Title of Bonds/Notes Coupon or Registered Total Face Amount Denomination Serial Number Interest Dates U. s Treasury Band of $3,000.00 82,000.00 430114 2-15 and 1987-92 414% Dateds August 15g 3962 3-15-93 $308.28 $302.37 8500.00 8500.00 55783 (If this space is insufficient for enumeration of bonds/notes, use separate sheet and securely offix some hereto) The above-described United States bonds/notes will be returned only to or on the written order of the Attorney General, or his successor in office, or an officer of the Department of Justice, designated by either, and upon the presentation and surrender of the original of this receipt. This receipt is executed in duplicate and is not assignable. (Signature of depository) Form I-301 (Rev. 1-1-66)"
}
