{
  "anumber": "A34038282",
  "id": "A34038282_0071",
  "page_index": 71,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0071/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration Bond, Form I-352"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1. A19 925 596 U.S. DEPARTMENT OF JUSTICE IMMIGRATION BOND 2. A19 925 598 IMMIGRATION AND NATURALIZATION SERVICE File No. 30 FOIA (b)(6) Approved and accepted Los Angeles, California August 29 . 19 72 (City) (State) District Director H Name and address of obligor: Romualdo Quintana-Diaz, 1126 South Kern Avenue, Los Angeles, California 90022 If this bond is executed by a surety company give the following information concerning the premium charged for execution of the bond Rate of premium Amount of premium $ Name of alien for whom this bond is furnished: (If there is more than one alien. separate schedule showing name of each alien, date and country of his birth and arrival data. signed and sealed by the obligor and made part hereof, is attached.) 1. Juan Quintana-Sanchez (6-24-13) 3. FOIA 2. Baltazar Diaz de Quintana (4-7-15) Date and country of birth of alien Date, port, and means of arrival in United States all Mexico unknown Nationality of alien all Mexico In consideration of the facts recited in paragraph or paragraphs herein numbered (3) and captioned BOND THAT ALIEN SHALL NOT BECOME A PUBLIC CHARGE and in any rider or riders attached hereto and made part hereof, the obligor above named. by subscribing hereto, hereby declares that he is firmly bound unto the United States in the sum of forty-five hundred dollars ($ 4,500.00 ), except that insofar as the bond is that the alien shall not become a public charge the obligor declares himself bound in such amount or successive amounts as are prescribed in paragraph (3) hereunder, as liquidated damages and not as a penalty, which sum is to be paid to the United States immediately upon failure to comply with the terms set forth in any such paragraph or rider. The obligor further agrees that any notice tohim in connection with this bond may be accomplished by mail directed to him at the above address. If bond is furnished for more than one alien, the obligor agrees that any references herein to alien in the singular sense shall be con- strued in the plural sense. (1) BOND FOR MAINTENANCE OF STATUS AND DEPARTURE OF NONIMMIGRANT ALIEN In consideration of the granting of the application of the above alien for permission to enter or remain tempo- rarily in the United States as a nonimmigrant under section 101 (a) (15) of the Immigration and Nationality Act, provided there is furnished a suitable bond, the obligor hereby furnishes such bond with the following conditions: If said alien is admitted to the United States for a temporary period as a nonimmigrant, or is granted an extension of temporary admission, or is granted a change in nonimmigrant classification, and if said alien shall comply with all the con- ditions of each specific nonimmigrant status which he is accorded while classified in such status, including the condition that unauthorized employment shall not be accepted, and actually departs from the United States without expense thereto on or before or such subsequent date as may be authorized in extension of his lawful temporary stay beyond such date, without notice to the obligor, then this obligation shall be void; otherwise it shall become due and payable immediately in the sum of dollars ($ ) for each alien as to whom there shall have been a failure to comply with any of the foregoing conditions, provided that in no event shall the liability of the obligor exceed the total sum of dollars ($ ); and provided further, that no adjustment of the immi- gration status of said alien shall be construed to impair or diminish this obligation. Form I-352 (Rev. 9-1-71) N"
}