{
  "anumber": "A34038282",
  "id": "A34038282_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OTice—Immigration Bond Cancelled"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1972,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ITED STATES DEPARTMENT OF JUSTIC IMMIGRATION AND NATURALIZATION SERVICE LOS 7421 300 NORTH LOS ANGELES STREET File Number A34 038 282 LOS ANGELES, CALIFORNIA 90012 038 / FOIA (b)(6) Date OTICE-IMMIGRATION BOND CANCELLED January 13, 1983 SUBJECT: Romualdo Quintana-Diaz IMMIGRATION BOND 1126 S. Kern Avenue Receipt Number LOS 7421 Los Angeles, CA 90022 Date J August 29, 1972 Amount $4,500.00 P/C Alien's Name JUAN QUINTANA-SANCHEZ BALTAZAR DIAZ DE QUINTANA FOIA (b)(6) he conditions of the above-described immigration bond have been fulfilled as to the above-named alien and you are no longer able under such bond for this alien. The nature of the security accepted on the bond is checked below. If the security was in form of U.S. Bonds or Notes or cash please comply with the pertinent instructions for the return of the security. SURETY BOND UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY. The United Scaces Boads or Notes accepted on the above-described immigration boad, and a check for any undistributed inter- est paid thereon, will be made available for return to you when the office shown below is informed of your preference for its delivery. Accordingly, would you please check the appropriate items below, sign, and return this form. IT WILL NOT BE NEC- ESSARY FOR YOU TO APPEAR AT THIS OFFICE AT THIS TIME. YOU MAY MAIL THIS FORM TO THE BELOW ADDRESS. OR PRESENT IN PERSON AT ROOM -120. I prefer to receive my securities at the office shown below I understand also that it is necessary for me to surrender my \"Receipt of Immigration Officer-United States Bonds or Notes, or Cash, Accepted as Security on Immigration Bond\" (Form I-300 or Form I-305) before my securities may be released. DO NOT CALL AT THIS OFFICE TO RECEIVE THESE SECURITIES UNTIL YOU ARE NOTIFIED. It would be more convenient for me to receive my securities at the Immigration and Naturalization Service office located at: (Street Address) (City or Town, State) (Zip Code) I prefer to receive my securities by express (collect), and hereby authorize delivery in that manner. I understand that it is necessary for me to surrender my \"Receipt of Immigration Officer-United States Bonds or Notes, or Cash. Accepted as Security on Immigration Bond\" (Form I-300 or Form I-305) before my securities may be released and accordingly this receipt is enclosed herewith. My address shown above is incorrect. The address to which the express company should deliver my securities is: (Street Address) (City or Town, State) (Zip Code) Signature of Obligor Date UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY, REDEEMED. The United Scaces Bonds or Notes accepted on the bove-described immigration bond were redeemed at maturity, of upon call, and converted to cash. Arrangement will be made for the return to you of the cash, plus any undistributed interest paid thereon, when the office shown below receives your \"Receipt of Immigration Officer-United States Bonds or Notes, or Cash, Accepted as Security on Immigration Bond (Form I-300 or Form 1-305). Accordingly, please mail (Certified or Registered Mail is suggested) the above-mentioned receipt or bring it to that office on a regular business day between the hours of 9:00A.M. and 4:00P.M. Your security will be returned by a check which will be mailed to you as soon as possible after your receipt arrives. This notice will serve as your temporary receipt pending detivery of your check. CASH ACCEPTED AS SECURITY. Arrangement will be made for the return so you of the cash accepted on the above-described immigration bond, when the office show below receives your \"Receipt of Immigration Officer-United Scates Bonds or Notes, or Cash, Accepted as Security on Immigration Bond\" (Form I-300 of Form 1-305). Accordingly, please mail (Certified or Registered Mail is suggested) the above-mentioned receipt or bring it to that office on a regular business day between the hours of 9:00A.M. and 4:00P.M. Your security will be returned by a check which will be mailed to you as soon as possible after your receipt arrives. This notice will serve as your temporary receipt pending delivery of your check. IMMIGRATION AND NATURALIZ SERVICE 300 NORTH LOS ANGELES STREET Signature LOS ANGELES, CALIFORNIA 90012 Title District Director Form 1-391 (Rev.3-14-77)N"
}