{
	"anumber": "A34109816",
	"id": "A34109816_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0025/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Biographic Information, G-325 ( (REV. 5-1-79)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1982]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['retired']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "ROC"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 FORM,G-325(REV.5-1-79)Y UNITED STATES DEPARTMENT OF JUSTICE Form Approved BIOGRAPHIC OMB No. 43-R436 INFORMATION Immigration and Naturalization Service (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILC NUMBER CHANG Ho LIN FEMALE Jun/9/15 P.O.C A-34 109816 CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. ALL OTHER NAMES USED (Including names by previous marriages) (If any) CHINA 543-78-8629 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE CHANG po-chi CHINA FATHER MOTHER (Maiden name) Shon Su-ur CHINA HUSBAND (If none so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE CHANG min-yin 4-10-13 CHINA 3/18/39 china FORMER HUSBANDS OR WIVES (If none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 233 N. ORANGE AVE. #A123 Montereypark CA USA MAR 81 PRESENT TIME 1651 S.E. LAVA DR. MILWAUKIE OREGON USA SEP 77 MAR 81 7215 S.E 2175t. Ave. PORTLand OREGON USA JAN 73 SEP 77 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR Retired none July 80 PRESENT TIME PENDLETON 218 S.W. JEFFeRSON st organizer Assembly NOV 74 July 80 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) 64 Chang STATUS AS PERMANENT RESIDENT IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE Are all copies legible? Yes EL PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN APPLICANT: THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: LOS CIT 5 400 JAN 4 1985 (date) (1) Ident FORM G-325 U.S.Government Printing Office: 1982-372-013"
}
