{
  "anumber": "A34140438",
  "id": "A34140438_0069",
  "page_index": 69,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0069/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Assify Status of Alien Relative for Issuance of Immigrant Visa, OMB No. 4-RO41"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1945,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED Screened by 9/22/2023 JUSTICE Immigration and laturalization Service Form approved OMB No. 43-RO401 PETITION TO IMMIC- Date filed Fee stamp ASSIFY STATUS OF $ 10co FEE PAID NO240-1 RANI ALIEN RELATIVE FOR JUM NATURAL & NATURILY TO SERVICE ISSUANCE OF IMMIGRANT VISA Ph BEHIX JUN 11 (2 582 By 73 BH '73 Date 6-18-75 Verifiad by off TO THE SECRETARY OF STATE: The petition was filed on 6/18/73 Remarks SLB CHECKED The petition is approved for status under section: 6-22-73 sp 4/3 Approval conditioned upon compata- SPOUSE, 201 (b) CHILD 203 (a) (2) DATE U.S. APPROVED INS. bility of blood of pet. Patricia Pik- OF ACTION 9-7-73 Ling Yee, 617 Joshua Ave., Parker, 201 (b) PARENT 203 (a) (4) Jane K.Cellisons Az 85344 with that of benef. Tang DD Man, A2 4/F Hong Keung Bldg., Hong 203 (a) (1) 203 (a) (5) got DISTRICT PHOENIX, ARIZONA ep Elung St., San Po Kong, Kowloon, H.K. CONSULATE GENERAL OF THE (PETITIONER IS NOT TO WRITE ABOV ENTHUS STAYES OF measure deceased) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrations Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States SEP 21 1 1973 The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for pomanent residence. T,570 789002123456 Block 1. - Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) (Middle) 3. Do Not Write in This Space 4. Relationship of beneficiary to petitioner TANG MAN A00-294-616 FATHER & DAUGHTER 5. Other names used; (including maiden name if married woman) 6. Are beneficiary and petitioner related by adoption? No 7. Place of birth (Country) 8. Date of birth (Month, day, year) 9. Beneficiary's marital status: CHINA Married Widowed Aug. 25-1915 Divorced Single 10. Petitioner's name (Last, in CAPS) (First) (Middle) 11. Petitioner's phone 12. Has this beneficiary ever been in the U.S.? YEE PATRICIA PIK LING 602-669-8259 Yes No 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) Deceased 14. Names, birthdates and countries of birth of beneficiary's children, if any PATRICIA Pik LING Yee 1-1-1945 CHINA 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 16. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages c. Number of prior marriages of spouse d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) 17. If this petition is for a child, (a). Is the child married? (b) Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 18. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner 20. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: FORM 1-130 RECEIVED TRANS. IN RET'D-TRANS. our DC COMPLETED (REV. 1-1-73) JUNN22121975"
}