{
	"anumber": "A34140438",
	"id": "A34140438_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/22/2023, Form I-134"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1041, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 is a member by treaty or statute and by which the after having alien was not employed until after being lawfully amigrant, and who admitted for permanent residence. In order to onreuder) qualify for such approval the applicant must have ground been physically present and residing in the United should consider carefully the States, after being lawfully admitted for permanent the immigration and naturalization residence, for an uninterrupted period of at least 1041 so one year. The granting of such approval does not takes such action he may So regarded exempt the applicant from the requirement that naving abandoned his residence in the United he be physically present in the United States for and having his inde at least one-half of the period of residence re- immigration and naturalization As 6 quired for naturalization except in the case of sequence he may be ineligible for visa or those persons who are employed by, or under start document for which lawful permanent rest contract with, the Government of the United States; fourt aliens are eligible he may be inadmissible to those persons who are authorized to perform the United States if he seeks admiss as return ministerial or priestly functions of a religious de- resident and he may becom ineligible for nomination having a bona fide organization within ralization on the basis of his original entry or the United States, and those persons who are en- - comment as an immigrant gaged solely by a religious denomination or by an EXTENSIONS The validity of a permit may on interdenominational mission organization having a word shown be extended for a period or bona fide organization within the United States as periods not encoeding one the original a missionary, brother, nun, or sister. Such approval expiration date should be applied for on Form N-470, \"Application Application for ordersich to Preserve Residence for Naturalization Purposes the expiration date (under section 316 (b) or 317, Immigration and inclication should be submitted 96 Nationality Act)\" available at any office of the prior to the expiration date 1) Immigration and Naturalization Service. submitted so as to be received by The Aliens who are absent in connection with or for to 60 thereon prior to the of the purpose of performing the ministerial or priestly milidity functions of a religious denomination having a bona The must he made on form fide organization in the United States, or who are Application for Extension of to Reanter the engaged by such a denomination or an interdenomi- United States and must by the national mission organization having a bona fide permit and by the for organization within the United States, as a mission- on Form 131 ary, brother, nun, or sister, are also eligible to make the abplication such application. Such aliens may acquire the re- the on office of quired one year of uninterrupted physical presence the imin and having after the absence. jurisdiction the place applicant EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- temporarily projourning above may also be of TUS FOR FEDERAL INCOME TAX PURPOSES: An tained at some United States consular offices alien who has actually established residence in the If validity of the person or extension thereof United States after having been admitted as an has expired the alien must obtain an immigrant visa from an American Consul before ambarking 16 for the United States -"
}
