{
  "anumber": "A34109816",
  "id": "A34109816_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization,, N-455"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 To Petitioner: In connection with the hearing to be held on your petition for naturalization, answer each of the questions below by checking \"Yes\" or \"No\" Authority for collection of the without giving any further explanation. information requested on Form N-455 The questions refer only to what has happened AFTER THE DATE you appeared and filed your petition for naturalization. They do not refer is contained in Sections 101 (f), 316, 332,335 and 336 of the Immigration to anything that happened before that date. and Nationality Act (8 U.S.C. 1101 (f), After you have answered every question, sign your name, give your address, and fill in the date and place of signing. 1427, 1443, 1446 and 1447). Submis- sion of the information is voluntary. You must BRING THIS COMPLETED LETTER WITH YOU to the hearing and give it to the naturalization examiner, who will question you The principal purposes for requesting further on the answers. the information are to enable desig- nated examiners of the Immigration AFTER THE DATE you filed your petition: (Answers) and Naturalization Service to deter- 1. Have you married, or been widowed, separated, or divorced? (If \"Yes\" please mine a petitioner's eligibility for bring documented proof of marriage, death, separation or divorce.) 1. Yes No naturalization and to make appropriate recommendations to the naturalization 2. Have you been absent from the United States? 2. Yes No courts. The information requested may, as a matter of routine use, be disclosed 3. Have you knowingly committed any crime or offense, for which you have not been to other arrested; or have you been arrested, cited, charged, indicted, convicted, fined, or federal, or imprisoned for breaking or violating any law or ordinance, including traffic violations? 3. Yes No enforcement agencies, the including 4. Have you joined any organization, including the Communist Party, or become any Selective associated or connected therewith in any way? 4. Yes No Service of State, the the naturalization Department Department component state, System, Agency, of and local Transportation, of thereof, of courts the regulatory Defense, the Interpol Department foreign Treasury, and the to and law 5. Have you claimed exemption from military service? 5. Yes No Department Central Intelligence in- 6. Has there been any change in your willingness to bear arms on behalf of the dividuals and organizations in the United States: to perform non-combat service in the armed forces of the United processing of any application or pet- States; to perform work of national importance under civilian direction, if the law ition for naturalization, or during the requires it? 6. Yes No course of investigation to elicit further information required by the Immigration and Naturalization Service to carry out 7. The law provides that a petitioner for naturalization shall not be regarded as a its functions. Information solicited person of good moral character who, at any time after the filing of the petition for which indicates a violation or poten- naturalization, has advocated in polygamy or been a polygamist; received income tial violation of law, whether civil, mostly from illegal gambling; been a prostitute or procured anyone for prostitution; criminal, or regulatory in nature, may knowingly and for gain encouraged or helped an alien to enter the United States be referred, as a routine use, to the illegally; been an illicit trafficker in drugs or marihuana: or has been a habitual appropriate agency, whether federal, drunkard. Have you been such a person or committed any of these acts? 7. Yes No state, local or foreign, charged with the responsibility or investigating, I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. enforcing or prosecuting such viola- tions. Failure to provide all or any at Park CA Monterey on 11-8-85 of the requested information may result in an unfavorable recommenda- Signed (Date) tion as to a petitioner's eligibility (City and State) for naturalization and denial by the (Full 6 Lin Signature) Change 233N Orange Ave, (Full -123 Address and Monterey ZIP Code) Park, CA 91754 court of a petition for naturalization."
}