{
  "anumber": "A34109816",
  "id": "A34109816_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuce of Immigrant Visa, Form 1-30"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1941,
        2023,
        1913,
        1944,
        1915,
        1947,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 Form approved Budget Bureau No A3.R0401 PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE FOR IS R SECURITY Date filed $1000 FEE Fen PAID SHIPP No. POO- 22 Immigration and Naturalization Service 126-7 CE OF IMMI- GRANT VISA Portland, Oregon INF Ore, CONSUL AR SECT Date 1/6/72 Verified by Reg CAN EMM TO THE SECRETARY OF STATE: TAIMAN The petition was filed on 1/6/72 Remarks The petition is approved for status under Approval conditioned upon section: SPOUSERECEIVED compatibility of blood of 201 (b) CHILD 203(a) (2) CHANG, Ho-lin, 99-7 Tung-on DATE Street, Ku-ting District, Taipei 201 (b) PARENT 203 (a) (4) ACTION DD OF WILLIAM 31,1993 L. PATTILLO NY Taiwan with that of Paul Chien- wei/ petitioner). Chang 203 (a) (1) 203 (a) (5) DISTRICT Portland, Oregon (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. 258 Block I. - Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) (Middle) 3.DoNotWrite in This Space 4. Relationship of beneficiary to petitioner CHANG, Ho-lin A19-790-694 mother 5. Other names used; Married woman give maiden name 6. Is beneficiary related to you by adoption? CHANG, Ho-lin no 7. Place of birth (Country) 8. Date of birth (Month, day, year) 9. Beneficiary's marital status: china, Republic of June 9, 1915 Married Widowed Divorced Single 10. Petitioner's name (Last in CAPS) (First) 11. Petitioner's phone 12. Has this beneficiary ever been in the U.S.? CHANG, Paul Chien-we 503-244-9327 Yes No 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) CHANG, win -yin; April 15, 1913 china Republic of 14. Names, birthdates and countries of birth of beneficiary's children, if any A. CHANG Chien-wei; Aug. 10.1939; China, Republic D. CHANG Fis-wei: Dec , 1947 China Reb of B. CHANG. Chi wei ; Oct.22,1941 china, Republic of E. c. CHANG, Yang-wei; Dec.4, 1944; China, Republicot F. FOIA (b)(6) 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Spouse and childrenA,B, c, D. E,F: 199-7 Tung. an street, Ku-ting District, Taipei. Taiwan. Rep. of china children A and F: 9640 S.W. Terwilliger Blvd. Portland, Oregon 97219 U.S.A. 16. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages c. Number of p or marriages of spouse not applicable not applicable not applicable d. Last address at which you and your spouse resided together Adidas To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street)ba (Month) (Month) (Year) not applicable ASTE 17. If this petition is for a child, (a). Is the child married? (b) Is the child your righted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none so The not applicable 18. If this petition is for a brother or sister, are both your parents the same alien's parents?not applicable If not, submit a separate statement giving full details as to parentage, dates of marriage of parent and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give napies of each and relationship to petitioner brother Win yin CHAN G. Jather ; chi-wei CHANG brother; Yang wei CHANG: brother; Fu-wei CHANG brother FOIA (b)(6 20. Have you ever filed a petition for this alien before? no If so, give place and date of filing and result: Form 1-130 UNITED STATES DEPARTMENT OF JUSTICE - Immigration and Naturalization Service (Rev. 11-1-70) Y"
}