{
  "anumber": "A34109816",
  "id": "A34109816_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 Block I. - Information About Alien Beneficiary (Continued) 21. Address in the United States where beneficiary will reside (City) (State) Portland Oregon 22. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (Zip Code, If in U.S.) 99-7 Tung- an street, Ku-ting District Taipei Taiwan Rep. of china 23. If beneficiary is in the United States, give the following information concerning beneficiary: a. He last arrived in the U.S. on b. He last arrived in U.S. as c. Show date beneficiary's stay expired or (Month) (Day) (Year) (Visitor, student, exchange alien, crewman, stowaway, etc.) will expire as shown on his Form I-94 or I-95: not applicable not applicable not applicable d. Name and address of present employer e. Date alien began this employment not applicable not applicable 24. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa at abroad the American Consulate in Taipei, Taiwan Republic ot China (City in foreign country) (Foreign country) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at (City) (State) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Counsulate in (City in foreign country) (Foreign Country) Block II. - Information About Petitioner 25. My name is (Last) (First) (Middle) 26. If you are a married woman, give your maiden name CHANG Paul chien - wei not applicable 27. I reside in the United States at (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) 9640 S. w Terwilliger Blvd. Portland Oregon 97219 28. Address abroad (if any) (Number and street) (City or town) (Province) (Country) 99-7 Tung- an street, Ku-ting District, Taipei Taiwan, Republic of china 29. I was born: (Month) (Day) (Year) In: (City or town) (State or Province) (Country) August 10, 1939 Pu-tien Fukien Republic of China 30. If you are a citizen of the United States, give the following: a Citizenship was acquired: (Check one) through birth in the U. S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate : and date and place of naturalization: CHANG, Paul Chien-wei No. 9166991 ; March 19. 1970 ; Portland, Oregon (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship Food/dante with documents Instruction 3a (2) seen and returned no b. Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. Proof of citizenship retid BB, 31. If you are a lawful permanent resident alien of the United States give the following: Birth a. Alien Registration Number: b. Date, place, and means of admission for Tawful permanent residence Birth cert eficary A Divorce doctor ner Divorcè descue, beneficiary Family c. Have you ever lost status as a lawful permanent resident alten? register If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) Block III. - Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 5) Paul Chim -wei chang Subscribed and sworn to (affirmed) before this 6th me day of Jun. A.D. 19.72 at Portland Origin (SEAL) My commission expires Betty f Bell Imm clerk (Signature of officer administering oath) (Title) Block IV. - Signature of Person Preparing Form, If Other Than Petitioner I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. gnature) (Address) (Date)"
}