{
  "anumber": "A34140438",
  "id": "A34140438_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "The Immigration and Naturalization Service, Form I-133, Form I-134"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 trealy or and to which the immigrant or after having adjusted status to that unit after beit a la affully of an immigrant, and who is considering the filing in order 10 of a nonresident alien tax return or the non-filing must lave of a tax return on the ground that he is a nonresident present and the United alien, should consider carefully the consequences lawfully permanent under the immigration and naturalization laws if he uninterruple Deroud at least does so. one granting of such does not If an alien takes such action, he may be regarded applicant from the requirement that as having abandoned his residence in the United present 17 the United States for States and as having lost his immigrant status under of the period - residence TO the immigration and naturalization laws. As a quirred toralization except its the case of consequence he may be ineligible for a visa or those who are employed by or under other document for which lawful permanent resi- the Government of the United States dent aliens are eligible; he may be inadmissible to who Numberized to perform the the United States if he seeks admission as a return- ministerial function of in religious de ing resident; and he may become ineligible for nomination hate vegenciation within naturalization on the basis of his original entry or the United and Mose Details who are en adjustment as an immigrant. gages solely asour documination or by an EXTENSIONS: The validity of a permit may, on mission genization having a good cause shown, be extended for a period or bone India processation within the United States as periods not exceeding one year from the original it missionary mother own or sister Such approval expiration date. should appeiled for an Form 1-470 Application Application for extension must be made prior to Preserve Residence for Naturalization Purposes to the expiration date shown on this permit. The (under section 316 (b) or 317, Immigration and application should be submitted not more than 90 Nationality Act)\" available al any office of the days prior to the expiration date. It must, however, Immigration and Naturalization Service be submitted so as to be received by the officer Aliens who are absent in connection with or for authorized to act thereon prior to the expiration of the purpose of performing the ministerial or priestly the permit's validity. functions of a religious denamination having a being The application must be made on Form I-131, fide organization in the United Stains or who are Application for Extension of Permit to Reenter the engaged by such a denomi nation or an interdenomi- United States, and must be accompanied by the national mission organizati on having a Sona fide permit and by the fee specified in the instructions organization within the United States, as a mission on Form I-131. ary to other nun, or sister are also eligible to make The application may be obtained from the issu- such application Such aliens may acquire the not ing office shown on Page 2 or from the office of quired one year of uninterrupted physical presence the Immigration and Naturalization Service having alter the absence jurisdiction over the place in which the applicant is EFFECT OF CLAIM TO NONRESIDENT ALIEN STA temporarily sojourning abroad. It may also be ob- TUS FOR FEDERAL INCOME TAX PURPOSES An tained at some United States consular offices. alien who has actually estab shed residence in the If validity of the permit or extension thereof United States after having been admitted as an has expired, the alien must obtain an immigrant visa from an American Consul before embarking 16 for the United States. BUREAU or ENGRAVING AND PRINTING"
}