{
	"anumber": "A34109816",
	"id": "A34109816_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-400 ( (Rev. 5-2-82) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECEIVED OMB NO. 1115-0009 ACK U.S. IMMIGRATION Expires 1/31/84 NATURALIZATION FEE STAMP SERVICE 5-29-85 APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: Nov 9 1 58 PM 84 9:40 IMMIGRATION AND NATURALIZATION SERVICE That 198675 LOS ADMIN ALIEN REGISTRATION (See INSTRUCTIONS BE SURE YOU UNDERSTAND EACH ( Show the exact spelling of your name as it appears on your alien registration Name chang, HO-LIN receipt card, and the number of your card. If you did not register, so state.) QUESTION BEFORE YOU ANSWER IT. PLEASE PRINT OR TYPE.) 316a No. A/34109816 Section of Law Date: (Leave Blank) (1) My full true and correct name is Ho-Kin CHANG (Full true name without abbreviations) (2) I now live at 233 (Number Ane Apt 4/123 and street, Monterey part 91754 (City county, state, zip code) (3) I was born on Jun 9.15 every in (Month) (Day) (Year) An-ned (City of town) (County, Kiangs, CHINA province, or state) none (Country) (4) I request that my name be changed to (5) Other names I have used are: none 3 (Include maiden name) Sex: Male Female (6) Was your father or mother ever a United States citizen? Yes No (If \"Yes\", explain fully) (7) Can you read and write English? Yes No (8) Can you speak English? Yes No (2) Can you sign your name in English? Yes No 440 Chang permanent Ho LiN was My lawful admission for residence on Jan 73 under the name of at Month) Partland pragon State) SFR Day) ( Year) (11) (a) I have resided continuously in the United States since Jam 73 5 Month) (Day) (Year) (b) I have resided continuously in the State of California since (Month) / B O CO. (Day) (Year) (c) During the last five years I have been physically in the United States for a total of months. (12) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: the 6 (13) In what places in the United States have you lived during the last 5 years? List present address FIRST. FROM To STREET ADDRESS CITY AND STATE (a) 3/1 19.8/ PRESENT TIME (b) 911 233 N. Orange the # A123 Montered Park Ca 91754 (c) ,IT 19.73 3/1 19.73 19.77 1981 SIERIST Laug Ane Milwaftie Oregon 97222 1651 S.E. dr. 9/1 (d) 19 Portland Oregon 97202 19 no others (14) (a) Have you been out of the United States since your lawful admission as a permanent resident? L Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES On do failure (b) Since your lawful admission, have you been out of the United States for a period of 6 months or longer? Yes No If \"No\", state \"None\"; If \"Yes\", fill in following information for every absence of more than 6 months. NAME OF SHIP OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED PLACE OR PORT OF ENTRY THROUGH WHICH You 5/16/79 CHINA out COMPANY, OR OTHER MEANS USED TO RETURN TO THE UNITED STATES RETURNED TO THE UNITED STATES 4/1/18 BN other SANERAPEISED Form N-400 (Rev. 5-2-82) Y (OVER) (1)"
}
