{
	"anumber": "A34140438",
	"id": "A34140438_0062",
	"page_index": 62,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0062/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( (English-Chinese) (2-68)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1946, 1943, 1971, 1970, 1972, 1938, 1945, 1969, 1968, 2023, 1963]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 Form FS-510 (English-Chinese) (2-68) Page 2 24. The following documents are submitted in support of this application Birth certificate Death certificate Evidence of own assets Medical record(s) Police certificate(s) Divorce decree Affidavit of support Photographs Marriage certificate Military record Offer of employment Other (describe) tiest 25. Personal financial resources (a) Cash (c) Real estate (value) (1(a) (b) Bank deposits (d) Other (describe) () 26. Father's name and address (If deceased, so state giving year of death) TANG Man-hing deceased in 1946 in China 27. Mother's maiden name and address (If deceased, so state giving year of death) YU Shee deceased in 1949 in China 28. Name and address of next of kin in home country (If neither parent is living) (brother) V none TANG CHAU TSANG Village 29. List all places of residence for 6 months or more since your sixteenth birthday Country, Province, District, Heung, Village, Street address, Dates(From-To) Calling or occupation China, Kwangtung, Mou Ming, Sun Tung, Sun Tung Village SPS itility birth-1938 China, Kwangtung, Siu-lwan, 10 Ng Lane Ting 1938-1943/4 -do- China, Kwangtung, Lok Cheong, Lau Ha, Fu Village 1943/4-1945/9 -do- China, Kiangsi, Lung Nam, 1945/9-1945/111 #do- China, Kwangtung Canton Hung Tak 5th Hong, #114 2/F 1945/11-1946/11 -do- B.C.C. H.K. Kowloon 1090 Ching St. Wong Tai Sin 1946/11-1969/4 merchant U.S.A. 617 Joshua Ave. Parker Arizona 85344 1969/4-1970/2 none B.C.C. H.K. Kowloon 1390 Bhock 16 Wong Tai Sin R/E 1970/2-1972/8 herBalist B.C.C. H.K. \"Kowloon Hong Keung St. Hong Keung Bldg. A-2 4/F 1972/8-present herbalist 30. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Name and address Dates (From-To) Type of membership and office held, if any H.K. Civic Association 1968-present member Wong Tai Sin Old age Welfare Association 1972-present supervisor Wong Tai Sin Kai Fong Old Age Co. Ltd. 1971-present director Wong Tai Sin Kai Fong Welfare Association Ltd. 1963-present director 31. List all languages, including your own, that you can speak, read and write Language ## Speak Read it Write If Cantonese fluen't fluent fluent 32. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) 1969/4-1970/2 as tourist 33. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain) Yes No 34. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) Yes No to 35. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) Yes N No to 36. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, 3 whether you applied for nonimmigrant immigrant visa and whether the visa was issued or refused) Yes No in 1969 for tourist visa and approved Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) Yes * No Have you ever registered with a draft board under United States Selective Service law? (If answer is Yes, explain) Yes No"
}
