{
  "anumber": "A34140438",
  "id": "A34140438_0076",
  "page_index": 76,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0076/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATUTORY DECLARATION, B324018"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1923,
        1946,
        1943,
        1971,
        1970,
        1876,
        1945,
        1887,
        1934,
        1969,
        2023,
        1927,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/22/2023 STATUTORY DECLARATION I, TANG MAN ( 73R K ), holder of Identity Cand No. B324018 solemnly of A2, Hong and sincerely Keeng declare mansion that: 4th floor, Hong Keing Sheet, San Ro Kong, Hong King (1) I have always used TANG MAN ( z ) as my name and have never used have no other name whatsoever my present Identity card no. is B324018 and 9 never held a Hong Kong Identity card in any Men name at any Alen time (2) 9 was born on 25th august 1915 at San Tury Village San Tony Heung Man thing, Kwantung, China ( the $5112 #) (3) 9 was married an LSV. February, 1943 ar Shin Kwan, Kwantung China 32/7) 9 was mamid only once and have never taken any concubine (4) My wife's name was WONG KONG HA ( is 1. She died on 4th February 1971 at Kwong wach Hospital, Kawloon Hong Kong (5) my blood father TANG MAN HING F x SBP ) was born on 28th December, 1876 ar San Tung Village San Tung Hanny, man ming, Kwant my China (Trs 3921# # and he died in February 1946 My blood mother Madam Yulhwas born on (st. June, 1887 ar San Tung viclage SanTung and Having Man ming, Kwangtong China (IPIZ T # she died in January, 1949 (6) I have only are daughter, PATRICIA Pik LING TENG Jzp 2b 2/2 ). She was born on She 1st. January 1945 at Ying Chuck, Kwang hug, China to HAT is now residing at 617, Joshua Avenue, Parker, ariz and U.S.A. (7) The NAME particulars of my blood brother and sisters are as follows: Relationship when and where Born and Present address (a) TANG CHAU TSANG ) Brother 21st. May 1923 San Tung Village, San Tung you Henry, Mau thing Kwanting, ahma (PEA to tx ERB 289083 (b) TANG a LAN ) Sister (b) TANG oi LAN Present Address: San Tunp Village San Tung Having Mau thing, ) Sister Kwantung china EAR $9207 ff 19th Mau September 1927, SanTung vilage, San Tury Henry IT'S thing 2921 #) PAINTS 7x high in] Present Address San To Santury Heing. (c) TANG AH FAN (if II sister K th Kx 49in)# mau my KwangRoy China 10th man august, 1934, San Tung Village, San Tury Heny. ming, Kwaughing, China present man address ming Sam Thing village San Tury Heing, apart from the above, 9 have no other riblings in SAB 39207#) Kwang tump. China ( ity (8) 9 have applied for a visa (no. 009497, datedHar of March any kind (969) and Hong kang Certificate USA of The identity no C.107598 to enter the United States q in fact visited during period between 4th april, 1969 and 1st. February, 1970. (a) I first came to Hone Kong on 25th November 1946 (10) I have never visited mainland China since 9 first anived in Hong kong on 25Th (November, 1946 ."
}