{
	"anumber": "A34109816",
	"id": "A34109816_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Alien Registration Application,, I-151"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/22/2023 8. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States (If you have engaged therein briefly describe and show periods of such employment or business activity.) 9, I have have not claimed nonresident alien status for Federal income tax purposes. either by filing no income tax return at all or by filing a return as a nonresident since I became a permanent resident of the United States (If such status was claimed by filing an income tax return as a nonresident alien, state the years for which you filed such a return. your address shown in each such return, and the location (city and state) of the Internal Revenue Service office with which you filed each such return: if you failed to file an income tax return at all because you regarded yourself as a nonresident alien for Federal in- come tax purposes. state the years for which you did not file a return for that reason.) from 10. do do not intend to return to the United States after my temporary visit abroad 11. do do not intend to retain my status as a lawful permanent resident. 12. CHECK ONE: My Application Alien Registration Form 1.90 Receipt for issuance Card of is attached, Alien Registration James Receipt Card is attached. 13. The Permit to Re-enter. if issued. should be forwarded with my Alien Registration Receipt Card to; U.S. Embassy or Consulate at Taipei, Taiwan, Republic of china My address as shown in block #1. on reverse. U.S. Immigration and Naturalization Office at Other (Specify) HO-TN 14 I do swear (affirm) that I know the contents of this application signed by me and that the statements herein are true and correct. (If application completed by other than applicant, that person must execute item 15.) NOTE.-This application may be sworn before an officer of the Immigration and Naturalization Service the in Chang without payment of notarial fee. (Signature of applicant) Subscribed and sworn to (affirmed) before The this 26 day of @ April A.D. 19 73 at for (SEAL) My commission expires USINS Garenella Carl.Rop (Title) (Signature of officer administering oath) 15. SIGNATURE OF PERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. (Signature) (Address) (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Alien Registration Receipt Card Action with regard to application for permit to re-enter 151 submitted by Alien returned Ge DENIED (See denial notice for reason(s).) AR-103 or AR-3 submitted by Alien returned GRANTED Permit valid to 1YR 5-1-74 New I-151 issued on basis of 1-90 Single entry Multiple entries Restriction on travel in following countries waived: none 215 DATE DELIVERY OF PERMIT INITIALS OF EMPLOYEE OF U. S. APPROVED INS. BY MAIL ACTION T.T. EFFECTING DELIVERY TO APPLICANT PERSONALLY DD 1973 OFFICE DATE DISTRICT Wm. L. Pattillo POV 5-3-73 PORTLAND, OREGON"
}
