{
  "anumber": "A34140438",
  "id": "A34140438_0060",
  "page_index": 60,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0060/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1983,
        1915,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PHO. PHO his IV 4140438 ies UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HAS NOT BEEN PREVIOUSLY IN ph THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) I & NS FILE NUMBER, IF TANG Man KNOWAL A20 294 616 ACTION BY-IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE SEC. 212(a) (14) g, UNITED STATES VIA LABOR CERTIFICATION ra is. er spohy PAA 846 NOT APPLICABLE T (Name of vessel or flight no. of arrival) INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT from 212(e) 212(h) ATTACHED Z - 212(g) 212(i) MO.-DAY-YR. OF BIRTH 20's 013 NOT REQUIRED COUNTRY OF BIRTH OCCUPATION COUNTRY OF AST MARITAL STATUS SEX NATIONALITY 414 RESIDENCE M S W D SEP 8/25/1915 China Herbalist Hong Kong FINAL ADDRESS STREET ADDRESS CITY, STATE, AND ZIP CODE, IF IN THE UNITED 617 Joshua Avenue Parker Arizona 85344 STATES ACTION OF S. I.O. ACTION ON APPEAL U. S. P. H. S. AVAILABLE Continue Chinese CLASS A OF CLASS AT O2, HONG KONG REQUIRES ATTENTION OF USPHO JCR This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL Consulate General IR-5 AMERICAN FOREIGN STATE/OTHER AREA LIMITATION AT Hong Kong 000 IMMIGRANT VISA NO. Harriet K hiller 809 Harriet K Miller ISSUED ON (Day) (Month) (Year) American Vice Consul of the United States of America. 8 March 1974 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 7 July 1974 PASSPORT NO. OR OTHER TRAVEL DOCUMENTS (Describe) Certificate of Identity No. C-305057 ISSUED TO TANG Man BY HK. Immigration Office, HK. Tariff Item No. 21 ON 25 May 1973. Fee Paid $20 EXPIRES Local Cy Equiv. 25 May 1983. U. S. Government Printing Office: 1971-416-150 FORM 12-68 FS-511"
}