{
  "anumber": "A34140438",
  "id": "A34140438_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0040/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM 1-133 ( (Rev. 3-1-74)Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "China",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2019,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITEDSETEEHED by NARA9/21/2023USTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP DEC TB OF PERMIT TO REENTER THE UNITED STATES $ 1000 FEE PAID 76-1187 4Rai as provided in section 223 of the 230 NORT IMMIGRATION & NATURAL SERVICE Immigration and Nationality Act PHOENIX Phoenix, Additional Use typewriter or print in block letters with ball-point pen. Date 12-18-75 Verified by KR issuance I hereby apply for (check one) of Permit to Reenter the United States CHECKED extension FAMILY (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Regist tration Receipt 12/21/2019 - TANG MAN Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked Extension'' you must submit the reentry per- (No. and Street) (Apt. No.) mit you wish to have extended. MAILING P.O.BD 731 ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) PARKER (State) AZ. 85344 (ZIP Code) A- 34-140-438 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 8-25-1915 CHINA CHINESE DARK BROWN BLACK HEIGHT 5 FEET 3 INCHES VISIBLE MARKS AND SCARS 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS TANG MAN GRANTED ADJUSTMENT WAS GRANTED SFR 3-20-74 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) F4GHTNO 846 PAN, AM AIR LINE IRS FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME TANG CHUCK FUN TANG YEE S 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD LOS ANGELES,CAL. 1-10-1976 ABOUT ONE YEAR NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL AIR SIAM AIR LINE CO. FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: CASHIER NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER YEE'S MARKE T 527-45-7316 612 CALIF. AVE, PARKER, AZ. 85344 10. MAILING ADDRESS ABROA D (Number and Street) FUNG (City/Town) (State/Province/District) (Country) HONE 3RD ROOR, NGAN FUNG ST. NWONG SAN CHUEN, WONG TAI SIN , KOWLOON, 11. COUNTRIES TO BE VISITED (List each country) KONG TAIWAN TAIPEI, REPUBLIC OF CHINA; z HONG KONG 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): THE REASON IS To GET MARRY AND SIGHT SEEING. RECEIVED TRANS IN RET'D - TRANS.OUT COMPLETED FORM I 131 (Rev. 3-1-74)Y OVER 12/24/75 12/14/75"
}