{
  "anumber": "A34261850",
  "id": "A34261850_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Residencia Legal Permanenente para Obtener una Tarjeta de Registro de Extranjeros - Tarjeta I-151"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTAMENTO Spreened by NARA 4/3/2023 TADOS UNIDOS Form approved O.I. 235.1(1) OMB No. R0046 SERVICIO DE INMIGRACION Y NATURALIZACIO NO RECORD LOS SLB CHECKED No fee paid Ec Files #254 FBC Applicant: Do Not Fill In This Block CO SOLICITUD POR UN EXTRANJERO CON FILE NO. A34-261-850 Sp-Searc Nationality Code G360 sent 'RESIDENCIA LEGAL PERMANENTE PARA Fee Required Fee Not Required OBTENER UNA TARJETA DE REGISTRO DE Fee Stamp EXTRANJEROS - TARJETA I-151 82 NR SYS (Tenga la bondad de leer las instrucciones adjuntas) 1. Por la presente solicito una Tarjeta de Registro de Extranjeros (Alien Registration Receipt Card) debido a las razones que expongo a continuación (marque la casilla apropiada): (a) Mi tarjeta de registro de extranjeros se ha extraviado, ha sido destruida el 11-7-75 (FECHA) o aproximadamente en esa fecha, bajo las siguientes, circunstancias: Guadalafara, Mex. (SI RECOBRO MI DOCUMENTO. SE LO ENTREGARE AL SERVICIO DE INMIGRACION Y NATURALIZACION) (b) Mi nombre ha cambiado. (c) Mistarjeta I-151 está dañada. (d) Mi prueba de registro de extranjero está en (e) Nunca recibi la tarjeta I-151. forma distinta a la Tarjeta I-151. (g) na Sección 262 (b) de la Sev de Inmigración (f) Mi actual tarjeta I-151 se encuentra en mal Oe Naturalización exige que se me estado debido a una laminaci on defectuosa. dactitates despues de cumplir los 14 (1) Recio una arjeta -151 uncorrect anos de edad. (i) So unextramero que viaja constantemente, entrando y saliendo de los .UU ZI Winded tomaré residencia permamente Vos EE.UU. Adjunta a los presentes, entrego mi tarjeta de viaje \"Form I-191 (Si marco UNG de 14. casillas (a). (b). (c) ó (e) que anteceden vea la Instrucción número 7. sobre el pago del derecho requerido) 2. Nombre y Apellide on mayusculas) Nombres Segundo nombre 4. Nacionalidad apellido. ALFARO DE GOMEZ, Trinidad Mexican 3. Direccion postal Número y,calle (Apt No.) en los Estados 309 West First Street 5. Núm. del Registro de 6. Sexo Unidos Número ZIP Extranjeros Varon Hembra Ciudad San Pedro, California 90731 Estado unknown 7. Admitido a los EE.UU (Ciudad) (Estado) 8. Fecha de admisión (Mes) (Dia) (Ano) 9. Fecha de nacimiento (Mes Dia Año) San Ysidro, California JAN 1972 2-23-12 10. Forma de transporte (Nombre del buque. 11. Destino en los EE.UU. cuando fue admitido 12. Lugar de nacimiento (Ciudad), (Provincia o Estado) linea. aerea. número de vuelo, etc.) (País) Mexico auto Los Angeles, Ca. Aualulco del Mercado, Jal. 13. Nombre que usó cuando se inscribié como extranjero (Si es el mismo que tiene ahora. 14. Nombre que usó cuando fue admitido legalmente como residente permanente (Si es el escriba 'same'') same ARCLA mismo que tiene ahora, escriba **same*) ALFARO DE GOMEZ, TRINIDAD same 15. Dirección fuera de los EE.UU. si reside temporalmente en el extranjero (Calle. Ciudad, Pais) 16. Fecha de la última salida de los EE.UU. None fusf 102 October 1, 1975 17. Fechas durante las que permanecio ausente de los EE.UU: por un año o más, desde que fue admitido legalmente como residente permanente 18. (Si usted riene la intención de usar la Tarjeta 1-151 como documento de viaje en las próximas seis semanas; indíque la fecha en que tiene intención de salir del pais, el nombre de cada pais que piensa visitar y esté seguro de leer la Instrucción 8 en cuanto a las limitaciones del uso de la Tarjeta I-151 para viajar a ciertos paises O a través de ellos.) a Fecha en la que se propone salir del pais b. Paises que va a visitar Junio 976 19. Firma de la persona que ha preparado el formulario. si no es el.solicitante mismo. 20. Firma del solicitante. DECLARO que prepare esta solicitud a petición del solicitante. y que tode le CERTIFICO que la información anterior es correcta y cierta a mi real saber y indicado se basa en toda la información que se me proporciono al respecto. entender. trinised alford (FIRMA, Second (DIRECCION) Request (FIRMA) (FECHA Sent DE LA FIRMA) 11-28-75 (FECHA DE LA FIRMA) JLT2-3-14 RECEIVED TRANS IN RET'D-TRANS OUT COMPLETED 360 SENT FORM 1-90 (Spanish) (Rev. 4-1-75) N 5/17/78 If"
}