{
  "anumber": "A34261850",
  "id": "A34261850_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Solicitud por un extranjero con residencia legal y permanente para obtener una tarjeta de registro de extranjeros, 4mbo 443-r0040"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTAMENTOcmened A/3$2083A UNIDOS Form approved Servicio de Inmigración y Naturalización OMB No. 43'-R0040 SOLICITUD POR UN EXTRANJERO CON RESIDENCIA LEGAL PERMANENTE PARA OBTENER UNA TARJETA DE REGISTRO DE EXTRANJEROS (Tenga la bondad de leer las instrucciones adjuntas) NOTA: Si usted necesita su tarjeta urgentemente, deberá presentar personalmente esta solicitud y sus correspondientes anexos debidamente llenados en la Oficina del Servicio de Inmigración. Si hace la solicitud en persona, traiga consigo tres fotografias que se ajusten a las especificaciones indicadascen la siguiente hoja de este formulario. alford Frinidad ESCRIBA A MAQUINA CON UN BOLIGRAFO EN LETRAS DE MOLDE 1. NOMBRE APELLIDO (Letras mayusculas) NOMBRE SEGUNDO NOMBRE TIMBRE GOMEZ TRINIdAd 2. DIREC- (NUMERO Y CALLE) (Apt. No.) LOS344758 CION POSTAL EN LOS ESTADOS 4430 FLORIZEL UNIDOS (CIUDAD) (ESTADO) (NUMERO ZIP) 24 NOV 1980 Los ANGELES CALF-90032 3. NUMERO DE REGISTRO DE EXTRANJERO A34261850 4. NOMBRE QUE USO CUANDO SE INSCRIBIO COMO EXTRANJERO. (SI ES EL MISMO QUE TIENE AHORA, ESCRIBA \"SAME\".) SAME 5. FECHA DE NACIMIENTO (Mes/dia/ano) 6. LUGAR DE NACIMIENTO NUMERO DE TELEFONO 2-17-12 MEXICO 2227565 8. ADMITIDO A LOS ESTADOS UNIDOS EN: (CIUDAD Y ESTADO) 9. MODO DE TRANSPORTE (Nombre del barco. o linea aérea y numero de vuelo, etc.) SANISIDRO CALIF. BUS 10. DESTINO EN LOS EE.UU. CUANDO FUE ADMITIDO 11. CREO QUE MI FICHA SE ENCUENTRA EN LA OFICINA DE INMIGRACION SANGELES EN (Ciudad y Estado) 12. FECHAS DURANTE LAS QUE PERMANECIO AUSENTE DE LOS EE.UU. POR 1 ANO o MAS, DESDE QUE FUE ADMITIDO LEGALMENTE COMO RESIDENTE PERMANENTE none 13. NECESITO UNA NUEVA TARJETA DEBIDO A QUE: (A) Mi documento de registro de extranjero se ha extraviado o ha sido destruído bajo las siguientes circunstancias. (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) Lost purse 11-80 (B) Mi tarjeta actual está danada. (Adjunte su antigua tarjeta). (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) (C) Mi nombre ha cambiado. (Adjunte el decreto del tribunal o el certificado de matrimonio y la antigua tarjeta). (SE REQUIERE EL PAGO EN CONCEPTO DE DERECHOS. VEASE LA INSTRUCCION NUMERO 1) (D) Debo estar registrado y se me deben tomar las huellas digitales una vez cumplidos los 14 años. (Adjunte su antigua tarjeta). (La Oficina de Inmigración puede tomarle las huellas digitales o usted puede pedir que se las tome un agente en la comisaria de policia o en la oficina de un alguacil. Usted y el agente deben firmar y fechar la tarjeta, una vez que se hayan tomado las huellas digitales. Usted TIENE QUE utilizar la tarjeta para huellas digitales, Formulario FD-258 que nuestra oficina le facilitará). (NO SE REQUIERE PAGO) (E) Soy un extranjero que viaja constantemente a los Estados Unidos y se dispone a tomar residencia permanente en los EE. UU. (Adjunte su antigua tarjeta) (NO SE REQUIERE PAGO) (F) Recibi una tarjeta incorrecta. (Adjunte su antigua tarjeta) (NO SE REQUIERE PAGO) (G) Nunca he recibido una tarjeta. (NO SE REQUIERE PAGO) (H) Otra (Explique) (NO SE REQUIERE PAGO) ACTION BLOCK (Para uso del funcionario consular o de inmigracion). This applicant was interviewed by me under oath on (Date) at (City). REMARKS: Fecha y firma del solicitante (Signature and Title) Serial Number of new I-151, if any Trinked GOMES, GRANTED DELIVERED Fecha y firma de la persona que llena el Formulario en caso de no DENIED U.S.APPROMED. tratarse del solicitante mismo. DATE of ACTION DD JAN 20 1981 off Fingerprint card forwarded to the FBI to comply with Section 262 b (Initials and Date) DISTRICT Call-In Letter Sent (Date) I-189 to Production Facility JAN (Date) Signature of Immigration Officer Form I-90 (Spanish) John CALITS RECEIVED TRANS. IN RET'D. TRANS. OUT COMPLETED (Rev. 5-31-78)N"
}