{
  "anumber": "A34261850",
  "id": "A34261850_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Nº 128026, Nº 128026"
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/3/2023 No. 128026 II nonthre de la República de México IS comn Juez del Estado Civil de rste lugar, hagn saber a Ins que la presente uieren I certifica ser rierto que pll pl Lihrn N° (1) del Renistro Civil que PS a mi rargo, a la hoja N° 9.- - SP purchentra asentada un arta del tenor siguiente: Al margen. Acta Numero 18 dieciocho. Matrimonio de Go briel Gomez Rodriguez-con Ma. Trinidad Alfaro. - Huellas di JALISCO gitales de los contraventes.- Dentro: En Etzatlan, Jalisco a 20 veinte de Febroro de 1956 mil novecientos cincuenta II seis, a las 12 doce horas Agustin perez Meza Presidente Mu inicipal y Oficial del Registro civil de este lugar, compa reciéron para celebrar su matrimonio el C. Gabriel Gomez Rodriguez, soltero agricultor de 44 cuarenta Y cuatro años originario de Santa Cruz y vecino del mismo lugar con domi DESORERIA GENERAL DELL cilio; en la casa numero - de 1a calle Santa Crus hijo de BRTHDO Blas Gomez finado y de Dolores Rodriguez finada con domici lio -- y Maria Trinidad Alfaro de 42 cuarenta U dos affos , originaria de Santa Cruz If vecina del mismo lugar. hida de Margarito Alfaro y de Cristina Garcia finados ambos contra yentes radicarán en Santa Cruz, raza mestiza, Mexicanos, - quienes manifestaron su voluntad de unirse en matrimonio, DEL optando conciente y deliberadamente por el realmen de socie FORD ESTADO dad legal. Los interengdos cummlieron con todos los mandatas de ley, como consta en el expediente relative U no habien JALISCO dose denunciado impedimento clguno, estando conformes los contrauentes el suscrite Official del Registro Civil deola HACHERIDA ró unidos en statrimonto en nombre de 1a sociedad II debla Ley a los señores GARRIEL GOMEZ RODRIGUEZ con TRINIDAD ALFARO GARCIA. quienes imprinteron sus huella digital al - margen de esta acto 11 fueron ificados por los seffores Liborio de Gradatajara de eded GE esta vecindad digital Gabriel Come2 Ro driguez Trinidad Alfaro. Sirnado. - Liborio Mondozd R. fir mado y rubricado. Sedonia Bernal firmado VALOR $ 10.00 ES COPIA SAGADA DESSU ORIGINAL DE DONDE ar COUPULISO: EIZATIAN"
}