{
  "anumber": "A34261850",
  "id": "A34261850_0060",
  "page_index": 60,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0060/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, A-FOIA (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/3/2023 AFFIDAVIT OF SUPPORT STATE OF CALIFORNIA COUNTY OF LOS ANGELES LUIS A BOBADILLA, of 304 North Reno Street, Los Angeles, California, being first duly sworn deposes and says: I am a citizen of Mexico, and a legal resident of the United States. Alien Reg. No. A FOIA (b)(6) I am married to Guadalupe G. Bobadilla. We are both employed, and we have 3 dependents. I am employed with the Grines Systems of 12804 South Spring Street, Los Angeles, California. I am employed in the capacity of shipping clerk. I have been employed by this company 7 years. My salary is $480.00 per month. My wife is employed with Frank Lee of California of 910 South Wall Street, Los Angeles, California. Her salary is $85.00 per week. She has been employed by this company since 1-28-60. My personal property consists of an automobile, and household furniture. I maintain an account with the Coast Dederal Savings and Loan Association. Now, my mother inlaw: Trinidad Alfaro Vda. de Gomez and her 2 daughter's: FOIA (b)(6) FOIA (b)(6) citizens of Mexico, and residents of Guadalajara, Jalisco, Mexico, are desirous of entering the United States as Legal Residents, and I am ready to receive them. Therefore, I respectfully request the Hon. American Consul to grant them the necessary Visa. In the event that my request is granted, I hereby promise that I shall be responsible for their support and welfare, so that they will never become a burden to this country. SUBSCRIBED AND SWORN TO BEFORE me this 8th day of August 1972 Bobadilla Carmer Palls OFFICIAL SEAL CARMEN PALLAIS NOTARY PUBLIC . CALIFORNIA PRINCIPAL OFFICE IN My Commission Expires Oct. 25, 1972 LOS ANGELES COUNTY I, Guadalupe G. Bobadilla, hereby approva the above Affidavit of Support executed by my husband in behalf of my mother and 2 sister(s. Guadalupe G. Bobadilla"
}