{
	"anumber": "A34261850",
	"id": "A34261850_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Information about your residences and employment., Form N-4 ( (Rev 07/19)N"
		},
		"years": {
			"ms_years_nlp_v1": [1992, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/3/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever is less Begin with your current address 11 you need more space, continue on separate paper: Street Number and Name, City, State Country and Zip Code Dates (month/day/year) From To 1443 SUNKIST AV LA PUENTE CA 91746 1992 present ( NO THIRS- B. List your employers during the last five (5) years List your present or most recent employer first If none. write \"None\" II you need more space, continue on separate paper. Employer's Name The Employer's Address Dates Employed (month/day/year) Occupation/position Street Name and Number City State and ZIP Code From To HOUSEWIFE $64400 APPX 67 PRESENT WILMINGTON Nurse HOSPITAL. AIDE- 7 NO OTHERS Part 5. Information about your marital history A. Total number of times you have been married 01 If you are now your husband or wite Brow married. complete the following 1930 regarding Family name GOMEL Given name Middle initial GABRIEL Address (10 Deceased '69. Date of birth Country of birth Citizenship (month/day/year) Social A# (if applicable) Immigration status Security# (If not d US Citizen) Naturalization (If applicable) (month/day/year) Place (City. State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse V WO OTHERS Part 6. Information about your children. B. Total Number of Children 08 Complete the following information for each of your children If the Ind lives with you, state \"with me\" in the address column; otherwise give city/state/country of child's current residence If deceased, write \"deceased III the address column II you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address GUADALUPE G BOBADILLA 8/27/30 MEXICO MEXICAN FOIA (b)(6) 1213 W REXWOOD W COVINA PASCUAL GOMEZ 4-18-37 MEXICO MEXICAN WITH ME DELFINA LINARES 3-13-39 MEXICO AMERICAN 1516 N VILLA DINUVA CA ISIDRA GOMEZ 2-18-44 MEXICO MEXICAN 1239 RONNIE ST W COVINA SANTIAGO GOMEZ 5-15-46 MEXICO MEXICAN NONE GUADALAJARA MEXICO FOIA (b)(6) Form N-400 (Rev 07/17/91)N Continued on next page 512 NO OTHERS"
}
