{
  "anumber": "A34261850",
  "id": "A34261850_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEparamento de NAtica de Estados Unidos, I-90A ( (Rev. 5 -31-78)N"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DEPARTAMENTOODED Tex by NARA DE 4/3/2023 LOS ESTADOS UNIDOS Servicio de Inmigración y Naturalización GOMEZ TRINIdAd FECHA: 4430 FLORIZEL LOS ANGELES CALE 90032. A Numero 54261850 de Tenga la bondad de presentarse en la oficina que aparece a continuación, a la hora y en el lugar indicados, para mantener una entrevista relativa a su solicitud de la tarjeta de identificación. Dirección de la oficina Sala número Piso número Fecha y hora Pregunte por INSTRUCCIONES: TRAIGA CONSIGO LO SIGUIENTE: 1. Su tarjeta de registro de extranjero u otro comprobante de registro de extranjero que usted posea actualmente. 2. Fotografias: Tenga la bondad de presentar esta carta al fotografo. Dos fotografias a color con fondo blanco se requieren. Las fotos deben ser lustrosas, sin ser retocadas, y sencillas (sin ser montadas). La dimensión de la cara debe ser como una pulgada de la barbilla hasta el pico del cabello. La persona debe aparecer en la foto con tres cuar- tos de la cara en vista con el oído derecho completamente visible. Favor de usar lápiz o pluma con punta suave para ligeramente marcar al revés de cada fotografia su nombre completo y el número de su tar- jeta de residente permanente de Los Estados Unidos (mica). IMPORTANTE: Si las fotografias no cumplen con estos requerimientos, serán regresadas a usted, cual causará demora en procesar su aplicacion o peticion. 3. Otras: ES IMPORTANTE QUE USTED ACUDA A ESTA CITA Y QUE TRAIGA ESTA CARTA CONSIGO. SI NO LE ES POSIBLE HACERLO, EXPONGA SUS MOTIVOS, FIRME A CONTINUACION Y DEVUELVA ESTA CARTA INMEDIATAMENTE A ESTA OFICINA. No me es posible acudir a la cita debido a que: Firma Fecha Form - 90A (Rev. 5-31-78)N"
}