{
	"anumber": "A34261850",
	"id": "A34261850_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0042/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/3/2023 AL BUREAU OF INVESTIGATION TATES DEPARTMENT OF JUSTICE 1. LOOP WASHINGTON, D.C. 20537 APPLICANT TO OBTAIN CLASSIFIABLE FINGERPRINTS 7 67775 66260 3 1 USE BLACK PRINTER S INK DE 2 DISTRIBUTE INK EVENLY ON INKING SLAB 3 WASH AND DRY FINGERS THOROUGHLY 4 ROLL FINGERS FROM NAIL TO NAIL AND AVOID ALLOWING FINGERS TO SLIP vea 5 BE SURE IMPRESSIONS ARE RECORDED IN CORRECT ORDER RIE 6 IF AN AMPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER MAKE A NOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER BLOCK 7 IF SOME PHYSICAL CONDITION MAKES IT IMPOSSIBLE TO OBTAIN PERFECT IMPRESSIONS SUBMIT THE BEST THAT CAN BE Ca OBTAINED WITH A MEMO STAPLED 10 THE (AND EXPLAINING THE CIRLUMSIANCES 8 EXAMINE THE COMPLETED PRINTS TO SEE iF THEY CAN BE CLASSIFIED BEARING IN MIND THAT MOST FINGERPRINTS THE LINES BETWEEN CENTER LOOP AND DELTA MUST SH PRINTIT FALL INTO THE PATTERNS SHOWN ON THIS CARD (OTHER PATTERNS OCCUR INFREQUENTLY AND ARE NOT SHOWN HERE) 2. WHORL THIS CARD FOR USE BY: LEAVE THIS SPACE BLANK 1 LAW ENFORCEMENT AGENCIES IN FINGERPRINTING APPLI. CANTS FOR LAW ENFORCEMENT POSITIONS. 2 OFFICIALS OF STATE AND LOCAL GOVERNMENTS FOR PUR. DELIAS POSES OF EMPLOYMENT LICENSING AND PERMITS AS AUTHOR RED BY STATE STATUTES AND APPROVED BY THE ATTORNEY ENERAL OF THE UNITED STATES LOCAL AND COUNTY ORDI ANCES UNLESS SPECIFICALLY BASED ON APPLICABLE STATE TELEPHONE ATUTES DO NOT SATISFY THIS REQUIREMENT U.S GOVERNMENT AGENCIES AND OTHER ENTITIES REQUIRED , FEDERAL LAW OFFICIALS OF FEDERALLY CHARTERED OR INSURED BANK G INSTITUTIONS TO PROMOTE OR MAINTAIN THE SECURITY F THOSE INSTITUTIONS THESE LINES RUNNING BETWE ISTRUCTIONS: DELTAS MUST BE CLEAR PRINTS MUST FIRST BE CHECKED THROUGH THE APPRO. IATE STATE IDENTIFICATION BUREAU AND ONLY THOSE FINGER 3. ARCH INTS FOR WHICH NO DISQUALIFYING RECORD HAS BEEN FOUND ICALLY SHOULD BE SUBMITTED FOR FBI SEARCH PRIVACY ACT OF 1974 (P.L. 93.579) REQUIRES THAT FEDERAL ATE OR LOCAL AGENCIES INFORM INDIVIDUALS WHOSE SOCIAL CURITY NUMBER IS REQUESTED WHETHER SUCH DISCLOSURE IS ANDATORY OR VOLUNTARY BASIS OF AUTHORITY FOR SUCH DICITATION AND USES WHICH WILL BE MADE OF IT IDENTITY OF PRIVATE CONTRACTORS SHOULD BE SHOWN SPACE EMPLOYER AND ADDRESS THE CONTRIBUTOR IS THE AME OF THE AGENCY SUBMITTING THE FINGERPRINT CARD TO FBI FBI NUMBER IF KNOWN SHOULD ALWAYS BE FURNISHED IN E APPROPRIATE SPACE SCELLANEOUS NO RECORD OTHER ARMED FORCES NO SSPORT NO (PP). ALIEN REGISTRATION NO (AR) PORT SE JRITY CARD NO (PS) SELECTIVE SERVICE NO (SS) VETERANS ARCHES HAVE NO DELTAS ADMINISTRATION CLAIM NO (VA) FD-258 (REV. 12-29-82) WOLCOTTS FORM I-FD-258LN a U.S. G.P.O. 1986-496-934"
}
