{
  "anumber": "A34598493",
  "id": "A34598493_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "73. Who helped the Pilgrims in America? 73. Quien ayudó a los peregrinos en Norte America? 74. What is the name of the ship that brought the Pilgrims to America? 74. Como se le llama al buque que trajo a los peregrinos a Norte America? 75. What were the thirteen original states of the United States called? 75. Cómo se les llamaban a los trece estados originales en les Estados Unidos? 76. Name three rights or freedoms guaranteed by the Bill of Rights. 76. Nombre tres derechos O libertades garantizados por la Declaración de Derechos. 77. Who has the power to declare war? 77. Quién tiene el poder de declarar la guerra? 78. Name one amendment that guarantees or addresses voting rights. 78. Nombre una enmienda a la Constitución que garantiza o trata del derecho de votar (sufragio). 79. Which president freed the slaves? 79. Cual presidente emancipó a los esclavos? 80. In what year was the Constitution written? 80. En qué ano fue escrito la Constitución? 81. What are the first ten amendments to the Constitution called? 81. Cómo se llaman las primeras diez enmiendas de la Constitución? 82. Name one purpose of the United Nations. 82. Nombre un próposito de las Naciones Unidas. 83. In what city does Congress meet? 83. En que ciudad se reune el Congreso? 84. Whose rights are guaranteed by the Constitution and the Bill of Rights? 84. De quien son los derechos garantizados por la Constitución y por la Declaration de Derechos? 85. What is the introduction to the Constitution called? 85. Como se llama a la introducción de la Constitucion? 86. Name one benefit of being a citizen of the United States. 86. Nombre una ventaja de ser ciudadano de los Estados Unidos."
}