{
	"anumber": "A34598493",
	"id": "A34598493_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0015/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (Rev. 07/19/91)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Servi Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. Family Given Middle Name Name Initial RIOS DE VEGA AMALIA U.S. Mailing Address - Care of 421 N. LOUCKS AURORA, IL. 60505 Resubmitted Street Number Apt. and Name 421 N. LOUCKS # City County AURORA KANE State ZIP Reloc Sent ILLINOIS Code 60505 Date of Birth Country (month/day/year) 07-02-14 of Birth MEXICO Social A Security # 319-62-0507 034 598 493 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant I am a permanent resident child of United States citizen parent(s) Interviewed C. d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. No F.P. (age) 01-21-76 CHICAGO, IL. Citizenship MEXICAN Name on alien registration card (if different than in Part 1) SAME AS ABOVE Other names used since you became a permanent resident (including maiden name) RISS-SANCHEZ Sex Male Height Marital Status: Single Divorced Female Married Widowed 5.00 Can you speak, read and write English ? No Yes. Action Absences from the U.S.: Denied MP / 1/ 10/98 Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip Yes No Yes No To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}
