{
	"anumber": "A34590015",
	"id": "A34590015_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34590015_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Form N-400, Form N-400"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please print or type information) Last Name First Name Middle Name Social Security Number Allen Number Address City State Zip Code Date of Birth Sex Telephone Number I, authorize (Applicant's Name) (Licensed medical doctor or licensed clinical psychologist) to release all relevant physical and mental health information related to my medical status to the INS for the pur applying for an exception from the English language and U.S. civics testing requirements for naturalization. I under penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information on the form and any e submitted with it is all true and correct. I am aware that the knowing placement of false information on the Form and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. Signature Date Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U. S. history and civ required of applicants for naturalization. The Immigration and Naturalization Service's regulations requi applicants for an exception based on disability submit this certification form, completed by a licensed medical d licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complet and phrases. 1. Date of your most recent examination of the applicant. 19 2. Is this your first examination of the individual? Yes No If yes, who is the regular attending physician? 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, 1 professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English and/or U.S. history and civics. Describe in detail. If applicant has a mental disability or impairment, please DSM diagnosis. may"
}
