{
	"anumber": "A34590015",
	"id": "A34590015_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34590015_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "GOBIERNOO DEL ESTADO LIBRE Y SOBERANO DE SINALOA, 13586"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SINALOA N En nombre de la Republica de México, y como =DIRECTOR DE GOBERNACION== de este Gobierno, hago saber a los que la presente vieren,y certifico ser cierto. que en el Ar- chivo General de este Departamento y en el libro de copias de actas de =MATRIMONIO del año de MIL NOVECIENTOS TREINTISHIS. correspondiente a la Oficina del Registro Civil de PERICOS,MOCORITO, SIN se encuentra asentada una acta del tenor siguiente Al Márgen: 83.-Acta numero ochenta y Matrimonio de Luis Rocha y Isabel Cazarez.-AL CENTRO: En Pericos,alas 9 nueve dias del mes de Mayo del año de 1936= mil novecientos treinta y seis, ante mi J. .Enrique Cazares Ofi cial del Registro Civil, de este lugar, comparecieron con el ob jeto de celebrar su matrimonio el ciudadano Luis Rocha y la = señorita Isabel Cazares el primero dijo:ser originario del == Lugar para el sello Hormiguero y vecino de los Mezcales catolico, agricultor; de= 25 veinticinco años de edad,hi; legitimo del ciudadano Anice to Rocha y de la señora Juana Elenes,con domicilio en el Hor= miguero. La señorita Cazares, dijo ser originaria y vecina de== los Mezcales, catolica de ocupacion domestica de 23 veintitres años de edad, hija natural del Ciudadano Tolcuato Cazares y de la señora Rosa Cazares,com domicilio en los Mezcales.Ambos == contrayentes manifestaron que verificada su presentacion ma== trimonial el dia 13 trece de Abril del corriente año y que he chas las publicaciones de ella por el termino legal sin que== se haya interpuesro impedimiento alguno,en este acto piden al Feder Ejecutive presente Oficial autorice su concertada union en virtud de ha ber llenado todos losrequisitos que previene la ley se did == lectura a los articulos 180 ciento ochenta al 188 ciento 0== chenta y ocho del Código Civil, interrogados los contrayentes= en cumplimiento de lo que se dispone el articulo 125 ciento== veinticinco del citado Código,si es su voluntad unirse en ma= trimonio tomandose y entregandose mutuamente por marido y mu jer y habiendo contestado ambos en sentido afirmativo. Y6,el 0 Ciudadano .Enrique Cazares, Oficial del Registro Civil, es= te lugar,hice la siguiente declaración.) En Nombre de la Socie= dad declaro unidos en perfecto y legitimo matrimonio al ciuda dano Luis Rocha y a la señorita Isabel Cazares, En virtud de = haber cumplido con elo que dispone en articulo 131 ciento == treinta y uno del Codigo Sanitario. Federal Vigente. Fueron tes tigos de este acto los ciudadanos Pedro Gastelum, Fidel Angulo y Diego Rocha. todos mayores de edad,y con domicilio el prime= ro en losMezcales el segundo en el Zapote y el tercero en== la Juridicción.Leida la presente acta a los contrayentes y t= testigos manifestaron su conformidad y firman los que supieron J.Enrique Cazares.-Luis Rocha.-M.Isabel.Cazares Pedro Gaste= lum.-Diego Rocha.-Rubricas.-Doy fe.-J.Enrique =Rubri= ca.= ===Y a solicitud de parte interesada extiendo el presente en= la Ciudad de Culiacan de Rosales, Sinaloa a los V treintal minu dias del mes de Enero de mil novecientos setenta y cinco LIC.JOSE DE JESUS CALDERON OJEDA. Confronte.- Ejecutive"
}
