{
	"anumber": "A34590015",
	"id": "A34590015_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34590015_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 6/1/22023, Title 18, United States Code, Section 1546"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 3. All licensed medical doctors or licensed clinical psychologists completing this form mus licensed practitioners in the State where they practice. Medical attestations will be accepted from the following: licensed medical doctors (MDs) and licensed clinical psychologists. 4. All forms must be signed, certified, and dated by the licensed medical doctor or licen clinical psychologist. The certification must be filed within 6 months of its completion signature. Penalties. Both the applicant and the licensed medical doctor or licensed clinical psychologist are requ to complete and sign the form under penalty of perjury. All statements contained in respons questions in this certification are declared to be true and correct under penalty of perjury. Title 18, United States Code, Section 1546, provides in part: Whoever knowingly makes under oath, or as permitted under penalty of perjury u) Section 1746 of Title 28, United States Code, knowingly subscribes as true, any f statement with respect to a material fact in any application, affidavit, or other docur required by the immigration laws or regulations prescribed thereunder, or knowi presents any such application, affidavit, or other document containing any such 1 statement - shall be fined in accordance with this title or imprisoned not more than years or both. If either the applicant or the licensed medical doctor or licensed clinical psychologist includ this certification form any material information that the party knows to be false, the appli and/or licensed medical doctor or licensed clinical psychologist may be liable for crin prosecution under the laws of the United States. The knowing placement of false information on the application may subject the applicant an licensed medical doctor or psychologist to criminal penalties under Title 18 of the United St Code and to civil penalties under Section 274C of the Immigration and Nationality Act, 8 U 1324c. Privacy Act Notice: Authority for the collection of the information requested on this for contained in 8 U.S.C. 1182(a)(15), 1183A, 1184(a), and 1258. The information will be principally by the Service to whom it may be furnished to support an individual's application naturalization under the Immigration and Nationality Act. Submission of the informatic voluntary. It may also, as a matter of routine use, be disclosed to other federal, state, local foreign law enforcement and regulatory agencies. Failure to provide the necessary informa may result in the denial of the applicant's request for an exception to the English language U.S. history and civics requirement in the applicant's naturalization application. Reporting Burden: A person is not required to respond to a collection of information unle displays a currently valid OMB control number. We try to create forms and instructions tha accurate, can be easily understood, and which impose the least possible burden on you to prc us with information. Often this is difficult because some immigration laws are very com Accordingly, the reporting burden for this collection of information is computed as follow learning about the form, 30 minutes; 2) completing the form, 60 minutes; and 3) assembling filing the application, 30 minutes, for an estimated average of 120 minutes per response. If have comments regarding the accuracy of this estimate, or suggestions for making this 1 simpler, you can write to the Immigration and Naturalization Service, 425 I Street, N.W., R 5307, Washington, D.C. 20536. Do not mail your completed application to this address."
}
