{
	"anumber": "A34598493",
	"id": "A34598493_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Interview Instructions and Information, INS-1023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "states citizens. As For of the natura want to toom: naturalized United naturalizition. An individual nature le for meet interview yes : determine if you are el sidency the following requirements: lawful admission for permanent demonstration residence, of good & moral character and is the period Constitution, of is understanding presence in of the the United English States, Language 2nd kno-ledge of the history and govern Unlied States. At interview, the INS officer will: Provide Professional, Efficient, and Courteous service 2nd explain the nature of the issia 2.1 the requireme the interview be conducted under oath. Allow Attorney Other Representative who has filed a Form G-28 with the may bring INS accompa 1-2-2 the interview. the intervie= in or edition, the INS if you select are exempt an interpreter for you If you have the certain INS officer. disabilities, a family 2.7 or from the English language requirements, you to legal guardian may accompany may you during the interview, at the discretion of Test Your Understanding of English 2nd Knowledge of the History 2nd will bejudges Government by your of the and provide you - the test results. Your understanding of spoken English will repeat reward tions normally understand spoken English. If you pass sin during the interview. If necessary, the INS officer co' not questions the that first you understand the questions or do schedule not a second interview for you io take the test again. naturalization from any of tice interview. requirements, the INS or will if you present a certificate from an authorize of fraud. isting entity the test, the INS officer will not test you at the interview unless there is evidence Receive Your Oral or Documentary Evidence to support your claim to eligibility for natura for must also answer cf the INS officer's question during the interview that relate to your eligibility If you have question or comments regarding your interview, you may ask is spee's of the with interviez) an INS You also mail questions or comments to the district director or officer-in-charge is the INS may Executive Secretariat, Attention: Customer Service Comments. 425 I Street NW. Washington, After your interview, the INS officer will fill out the in.formation below which you should's A # 34 598 493 10/22/98, TC#124 Toe. results your understanding of you English were and interviewed knowledge of the history and government of the United States On by INS officer of. Yes passed the English language test. read/ Frite English Yes 20 exempt from the English language requirement, or the requirement FES waived Yes filed to demonstrate the ability to speak! Yes failed to demonstrate a knowledge of the history and government of the United State Yearpassed the history and government test. The Estary and government requirement was waived. If during the interview you failed to demonstrate an understanding of will the English scheduled language of the will not be for servicw history and government of the United States, you to take the too's again. The INS will notify you later of the final decision on your application. (12/15/97) 24.02"
}
