{
  "anumber": "A34590015",
  "id": "A34590015_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34590015_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Pre- Screening Questionnaire, I-151/I-551 NAME:"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Pre- Screening Questionnaire I-151/I-551 NAME: Maria Isabel Cazarez de DATE: PRESENT NAME: MaRia Rocha Rocha A# 034590015 AGENCY INTERVIEWER: El Concilio 1. Age 18 or more: (Y) (N) 2. Date admitted as a lawful permanent resident: 2-14-75 3. Resided in the United States for 5 years or more as LPR? (Y) (N) 4. Is application based upon 3 years of marrige to USC? (Y) (N) 5. Last three months in State or LA area? (Y) (N) 6. During the last 5 years has not been out of the US 1 yr? (Y) (N) 7. During the last 5 years has not been out of the US 30 mo. ? (Y) (N) 8. Willing to bear arms or perform non combatant services? (Y) (N) 9. Cannot speak English 50/20, 55/15 or 65/20 (Y) (N) 10. Has applicant knowingly commited any crimes or offenses, for which he/she has been charged with, including traffic violations. (Y) (N) 11. Has applicant now or ever been a member of any oranizations that may attempt to overthrow the American Goverment? (Y) (N) 12. The law provides that the petitioner shall be regarded as aperson of good moral character. Has applicant been such a person? (Y) (N) 13. Can applicant understand and write English? Can he she demonstrate spanish test (Y) (N) 14. Persons with military service must be continued for military clearance. Do they understand? (Y) N/A"
}