{
	"anumber": "A34590015",
	"id": "A34590015_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34590015_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 S. Department of Justice immigration and Naturalization Service File No: A 34 590 015 Date: 9-21-99 Officer: Thong Examination of your application (N400) shows that additional information, documents, or forms are needed before /our application can be acted upon. Please RETURN THIS LETTER WITH REQUESTED INFORMATION and/or DOCUMENTS to: Immigration & Naturalization Service, P.O. Box 1668, Bellflower, CA 90707, before 89 days from the date of your interview. All documents must be Original or Certified Copies. Any document in a foreign language MUST be accompanied by a translation in English and the translator must certify hat he/she is competent to translate and that the translation is accurate. Failure to do so may result in the denial of your application. I Complete Arrest Report(s), Court Disposition(s), and Probation Report(s), as applicable, for: NOTE: All Court Dispositions MUST be certified by the court issuing the record. If a record is no longer available, you must submit documentation from the appropriate agency as to it's unavailability. If a record has been sealed or expunged, court records showing such must be submitted. Police Clearance(s) from the local law enforcement agency(ies) from all jurisdictions where you have resided for the last 5 years. Birth Certificate of Marriage Certificate of Proof that your spouse has been a U.S. citizen for more than three years. [U. S. birth certificate or passport, naturalization certificate, or certificate of citizenship.] I Evidence of Bona Fide Marriage. Bring any documents which assist in establishing the validity of your marriage such as, but not limited to, birth certificates of any children born of the marriage, joint lease agreements or home ownership documents, joint bank and credit accounts, joint tax returns, proof of joint ownership in other property such as investments, automobiles, life insurance, health insurance, etc. I Divorce Decree, (Interlocutory and Final Decree), of Death Certificate of Your passport(s) and any travel documents issued by the I.N.S. Proof of Child Support for Bring evidence of your payment of financial support ,such as canceled checks, money order receipts, and bank drafts, showing your payment record, along with copies of any court or government orders relating to the required payment of support. ] Proof of Selective Service Registration. [Selective Service System telephone #(847) 688-6888 or (847) 688-2576]. NOTE: If you failed to register with the Selective Service System before you reached age 26, you must do the following. 1. Request and complete Selective Service System's Questionnaire form. Answer the questions fully, Make A Copy, and return the form to the Selective Service. 2. You will then receive an Advisory Letter from the Selective Service. 3. Bring the copy of the Questionnaire and the Advisory Letter with you to your next interview with Immigration. Copies of tax returns for tax year(s) . Bring copies of any correspondence relating to payment arrangements and copies of any returns for which you claimed to be a non-resident. I Your written declaration and a letter from your church explaining how your religious beliefs prevent you from taking the full oath Form N-648 is required to establish your eligibility for exception(s) to the requirements of Section 312 of the INA. The form must be completed in it's entirety with a detailed explanation for each question. Question #3 must include the origin, nature, and extent of your medical condition as it relates to the disability requirements of Sec. 312 of the INA. Failure to comply with these instructions will result in a delay in the adjudication of your application for naturalization. I The medical certification form, N-648, you submitted lacks certain required information. The form must be completed in it's entirety with a detailed explanation for each applicable question. Question #3 must include the origin, nature, and extent of your medical condition as it relates to the disability exceptions. The doctor or psychologist must describe in detail how your medical condition prevents you from fulfilling the requirements of Sec. 312 of the INA. Please return this notice to your physician ad ask them to complete each question with a detailed explanation. Failure to comply with these instructions may result in the rejection of the form N-648. Other : Please see Attached Your application has been continued for the following reason(s). You will be notified by mail regarding the date and time of your next interview. I ] Reexamination on ability to : ( ) Read, ( ) Write, ( ) Speak, or Understand English; or ( ) Knowledge of U. S. History and Government I A more in-depth interview regarding the issue(s) of: I ] Another interview regarding your eligibility for exception(s) to the requirement(s) of Section 312 of the I.N.A. I No further action on your part is required at this time. As soon as the item(s) checked below are received by the INS, your application can be acted upon: Your [ Permanent Immigration File, [ ] FBI Fingerprint Clearance, [ Verification of Military Service, or Other: Form N-14 (Rev. 9/16/97)"
}
