{
  "anumber": "A34598493",
  "id": "A34598493_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Attachment(s) to Form N-335, Form N-4-00"
    },
    "years": {
      "ms_years_nlp_v1": [
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Attachment(s) to Form N-335 Applicant: Amalia Rios De Vega Application for Naturalization, Form N-400 Alien Number: A034598493 Application ID: CHI*000039073 Your application is hereby denied in accordance with the Title 8 Code of Federal Regulations Section(s) listed below: Reason: Lack of prosecution CFR8 Reference: Part 335 Examination on Application for Naturalization Section 335.7 Failure to Prosecute Application After Initial Examination An applicant for naturalization who has appeared for the examination on his or her application as provided in Section 335.2 shall be considered as failing to prosecute such application if he or she, without good cause being shown, either failed to excuse an absence from a subsequently required appearance, or fails to provide within a reasonable period of time such documents, information, or testimony deemed by the Service to be necessary to establish his or her eligibility for naturalization. The Service shall deliver notice of all such requests for appearance or supporting evidence, in writing, to the applicant either in person or to the applicant's last known address. In the event that the applicant fails to respond within 30 days of the date of notification, the Service shall adjudicate the application on the merits pursuant to Section 336.1 of this chapter. (Revised 2/3/95; 60 FR 6647) Explanation: You failed your first exam on October 22, 1998, and then you failed to appear for the second examination. You did not provide the following documents which were requested by the Service: Your Evidence Of Exam Passed"
}