{
	"anumber": "A34598493",
	"id": "A34598493_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form FS-510 ( Immigration and Nationality Act, FS-510"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1950, 1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form FS-510 (Spanish) (2-68) Page 4 42. ¿Alguien le ayudó a llenar esta solicitud? (Si la respuesta es afirmativa, indique el nombre y el domicilio de la persona que Sí No le ayudo, e indique si es pariente, amigo, agente de viajes, abogado, etc.) (Yes) (No) [Were you assisted in completing this application? (If answer is Yes, give name and address of person assisting you indicating whether relative, friend, travel agent, attorney, or other) Nombre completo Domicilio Relación con la persona que (Name) (Address) le ayudó (Relationship) Profa e interprete 16 de Sept. 24 ninguna Esther A. de Bribiesca. La Piedad, Mich. Mex. NO ESCRIBA EN LOS ESPACIOS DEBAJO DE ESTA LINEA EI funcionario consular le indicará como debe contestar los párrafos 43 y 44 (DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44) 43. Declaro estar exento de ineligibilidad para recibir una visa y de exclusión bajo el rubro del párrafo 41, por las siguientes razones: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 41 for the following reasons:) SECTION 212(a) (14) IMMIGRATION & NATIONALITY ACT 44. Declaro ser: (I claim to be a) Inmigrante de preferencia, sujeto a la limitación numérica de (Pais extranjero 0 zona dependiente) [ preference immigrant subject to the numerical limitation for (foreign state or dependent area) ] Inmigrante especial sujeto a la limitación numérica del Hemisferio Occidental (Special immigrant subject to Western Hemisphere numerical limitation) Inmigrante especial que no está sujeto a limitación numérica. (Special immigrant not subject to limitation) Pariente inmediato de ciudadano norteamericano. (Immediate relative of a United States citizen) BORN IN MEXICO Mi declaración se basa en los siguientes hechos: (My claim is based on the following facts:) Entiendo que estoy obligado a entregar mi visa al funcionario de Inmigración de los Estados Unidos en el lugar donde solicite entrada a dicho país, y además entiendo que el poseer una visa no me da derecho a entrar a los Estados Unidos si en ese momento se determina que soy inadmisible de acuerdo con las leyes de inmigracion. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) También entiendo que cualquier declaración hecha por mí en esta solicitud, que sea intencionalmente falsa 0 tergiversada, 0 el haber ocultado inten- cionalmente algún hecho esencial, puede ser causa de que se me rehuse permanentemente la entrada a los Estados Unidos, y de que, si ya hubiere entrado a los Estados Unidos, podría estar sujeto a enjuiciamiento penal, deportación, 0 ambos. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) Yo, el suscrito, solicitante de una visa de inmigrante para los Estados Unidos, juro solemnemente (o afirmo) que todas las declaraciones que aparecen en esta solicitud fueron hechas por mi, incluyendo las respuestas a los párrafos del 33 al 42 inclusive, y que éstas son verídicas y completas a mi mejor saber y entender. Ademas, juro (o afirmo) que en caso de ser admitido en los Estados Unidos, no llevare a cabo actividades que serian perjudiciales al interés público o pondrian en peligro el bienestar, la seguridad o la tranquilidad de los Estados Unidos, ni me dedicare a actividades prohibidas por las leyes de los Estados Unidos en lo relacionado con espionaje, sabotaje o desorden público, ni a otras actividades subversivas a la seguridad nacional, ni a ninguna actividad que tenga por objeto oponerse, dominar o derrocar el Gobierno de los Estados Unidos por medio de la fuerza, la violencia u otros medios anticonstitucionales; que no me uniré, afiliaré o participaré en las actividades de ninguna organización que esté inscrita o que deba inscribirse de acuerdo con la Sección 7 de la ley de Control de Actividades Subversivas de 1950. Comprendo perfectamente las declaraciones que anteceden, habiendo pedido y obtenido una explicación de cada una de las clausulas que no habia entendido con claridad. [I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answer to parts 33 through 42 inclusive, and are true and complete to the best of my knowl- edge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconsti- tutional means; or join, affiliate with or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an expla- nation on every point which was not clear to me.] SEP 22 iramalin kio Firma del Solicitante (Signature of Applicant) FEB 1975 Firmado y juramentado ante mí, el día del mes de del año de en la ciudad de MEXICO, D. Fg (Subscribed and sworn to before me this day of 19 Deffit Firma del Funcionario Consular (Consular Officer) TARIFF ITEM NO. 20. FEE PAID U.S. $5.00 PAID Donna Hamilton LOCAL CY EQUIV. of the tod States"
}
