{
  "anumber": "A34598493",
  "id": "A34598493_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Historical and Political Questions"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "44. What are the thirteen original colonies? 44. Cuales son las trece colonias originales? 45. Who said \"Give me liberty or give me death\"? 45. Quien dijo \"Deme libertad O deme la muerte\"? 46. Which countries were the principal allies of the United States during World War II? 46. Cuáles fueron los paises aliados principales de los Estados Unidos durante la segunda guerra mundial? 47. What is the 49th state of the United States? 47. Cual es el 49° estado de los Estados Unidos? 48. How many terms can a President serve? 48. Por cuántos periodos puede eligirse al presidente? 49. Who was Martin Luther King Jr.? 49. Quien fue Martin Luther King Jr.? 50. Who is the head of your local government? 50. Quien es el jefe de su gobierno local? 51. Name one of the requirements a person must meet in order to be eligible to become President. 51. Nombre uno de los requisitos una persona debe cumpir para hacerse eligible a ser eligido presidente. 52. Why are there 100 Senators in the United States Senate? 52. Por que hay 100 senadores en el senado? 53 Who selects the Supreme Court justices? 53. Quien selecta los jueces de la Corte Suprema? Presidente . 54. How many Supreme Court justices are there? 54. Cuántos jueces hay en la Corte Suprema? 55. Why did the Pilgrims come to America? 55. Por qué vinieron los peregrinos a Norte America? 56. What is the head executive of a state government called? 56. Como se llama el ejecutivo principal del gobierno de un estado? 57. What is the head executive of a city government called? 57. Cómo se llama el ejecutivo principal del gobierno de una ciudad?"
}