{
  "anumber": "A34598493",
  "id": "A34598493_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34598493_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "87. What is the most important right granted to United States citizens? 87. Cual es el derecho mas importante concedido a los ciudadanos de los Estados Unidos? 88. Who meets in the United States Capitol building? 8S. Quienes reunuen en el Capitolio de los Estados Unidos? 89. What is the White House? 89. Qué es la Casa Blanca? 90. Where is the White House located? 90. Dónde esta ubicada la Casa Blanca? 91. What is the name of the President's official home? 91. Cómo se llama la residencia oficial del presidente? 92. Name one right guaranteed by the First Amendment. 92. Nombre un derecho garantizado por la primer enmienda a la Constitución. 93. Who is the Commander in Chief of the United States military? 93. Quién es el General en Jefe de todas las fuerzas militares de los Estados Unidos? 94. Which President was the first commander in Chief of the United States military? 94. Qué presidente fue el primer General en Jefe de las fuerzas militares de los Estados Unidos? 95. In what month do we vote for the President of the United States? 95. En que mes votamos para el presidente de los Estados Unidos? 96. In what month is the new President inaugurated? 96. En que mes toma posesión el nuevo presidente? 97. How many times may a Senator be re-elected? 97. Cuántas veces puede ser re-eligido un senador? 98. How many times may a Congressman be re-elected? 98. Cuantas veces puede ser re-eligido un representante? 99. What are the two major political parties of the United States today? 99. Cuales son los dos partidos politicos más grandes en los Estados Unidos actualmente? 100.How many states are there in the United States? 100.Cuántos estados hay en los Estados Unidos?"
}