{
  "anumber": "A34600978",
  "id": "A34600978_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Spanish) ( (2-68), Screeneded by NARA, 5/10/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 Form FS-510 (Spanish) (2-68) Page 2 25. Recursos financieros personales (Personal financial resources) a) Efectivo D1s. 500.00 c) Bienes raíces (su valor) Dls. 0.00 (Cash) 11 [Real Estate (value) ] b) Depósitos bancarios 0.00 d) Otros (describanse) 2,000.00 (Bank deposits) [Other (describe) Automóvil y muebles hogar 26. Nombre completo y domicilio del padre (si ha fallecido indiquese en qué año murió) [Father's name and address (If deceased, so state giving year of death) ] Antonio López, falleció en 1955. 27. Nombre completo de soltera y domicilio de la madre (si ha fallecido indiquese en qué año murió) [Mother's maiden name and address (If deceased, so state giving year of epbmucena Tapia, falleció en 1970. 28. Nombre completo y domicilio de su pariente más cercano en el país de su residencia (este dato debe consignarse si ambos padres han fallecido) [Name and address of next of kin in home country (if neither parent is livingesus Negrete Tapia, esposo, Calle 29. Enumere todos los lugares en que Ud. ha residido durante seis meses 0 más desde que cumpuo los Tb anos. Listrall places of residence no six Tensión #68 months0 or more since your sixteenth birthday) sas, Mexico 19, D. Mexico. Ciudad o pueblo Provincia o Depto. Pais Fechas (Dates) Ocupación (City or town) (Province) (Country) Desde-Hast (from-to) (Calling or occupation) Curimeo, Michoacán, México 8/31 a 9/62 Hogar México, D. México 9/62 a 7/72 Hogar California, EUA 7/72 a 4/74 Hogar México, D.F., México 4/74 a la fecha Hogar 30. Enumere todas las organizaciones de las que Ud. es 0 haya sido miembro, socio 0 afiliado desde que cumplió los 16 años (inclusive las organizaciones profesionales, vocacionales, sociales y políticas) [List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) ] Nombrey domicilio de la organización Fechas (Dates) Categoria de miembro o Cargo ejercido (Name and address) Desde-Hasta (from-to) (Type of membership and office held, if any) Ningunas 31. Enumere todos los idiomas, inclusive el propio, que Ud. habla, fee y escribe. (List all languages, including your own, that you can speak, read and write) Idioma (Language) Hablo (Speak) Leo (Read) Escribo (Write) Españel Sí Sí Sf 32. Enumere, incluyendo fechas, los períodos durante los cuales ha residido 0 visitado los Estados Unidos. (Cite e! tipo de visa que usó o condición en que hizo la(s) visita(s) Estuve en EUA desde 7/72 hasta 4/74, con la Forma SW-434. [Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) 33. ¿Ha recibido Ud. tratamiento para desórdenes mentales, alcoholismo 0 por ser adicto a barbitúricos, en algún hospital, institución, Sí No 0 en cualquier otro lugar? (Si la respuesta es afirmativa, explique) (Yes) (No) [Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain) ] 34. ¿Ha sido Ud. arrestado, convicto 0 recluído en prisión 0 internado en algún asilo para indigentes, 0 en alguna otra institución de Sí No caridad? (Si la respuesta es afirmativa, explique) (Yes) (No) [Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) ] 35. ¿Se le ha concedido a Ud. perdón 0 amnistía, decreto de rehabilitación, 0 algún otro acto de clemencia 0 acción semejante? (Si la Sí No respuesta es afirmativa, explique) (Yes) (No) [Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) 36. ¿Ha solicitado Ud. alguna vez visa para entrar a los Estados Unidos? (Si la respuesta es afirmativa indique cuándo y d'inde la Sí No solicitó, si la solicitó de inmigrante o de no-inmigrante, y si ésta le fue otorgada o rehusada) B-2 Mex (Yes) (No) [Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) ] several times 37. ¿Se le ha rehusado a Ud. entrada a los Estados Unidos durante los últimos doce meses? (Si la respuesta es afirmativa, explique) Sí No [Have you been refused admission to the United States during the last twelve months? (If answer is Yes, explain) (Yes) (No) 38. ¿Se ha inscrito Ud. en el Servicio Militar, bajo las leyes del Servicio Selectivo de los Estados Unidos (United States Selective Service Sí No Law) (Si la respuesta es afirmativa, explique) (Yes) (No) [Have you ever registered with a draft board under United States Selective Service Laws? (If answer is Yes, explain) ] 39. ¿Ha solicitado Ud. en alguna ocasión que se le exima del entrenamiento y servicio en las fuerzas armadas de los Estados Unidos, 0 ha Sí No salido y permanecido fuera de los Estados Unidos para evadir 0 evitar el servicio militar? (Si la respuesta es afirmativa, explique) (Yes) (No) Have you ever applied for relief from training and service in the United States armed forces or departed from or remained outside United i to avoid or evade military service? (If answer is Yes, explain) 40. ¿ts su interio.or entrar a los Estados Unidos desde Canadá, México, 0 desde alguna isla adyacente a los Estados Unidos, dentro de Sí No los dos años de haber llegado a dichos países 0 islas adyacentes? (Si la respuesta es afirmativa, consigne el nombre de la (Yes) (No) empresa de transportes que usó para entrar, o por medio de la cual piensa entrar a México, Canada o a tal isla adyacente) [Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island) ]"
}