{
	"anumber": "A34636911",
	"id": "A34636911_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT AND PREFERENCE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1968, 1974, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "'STATE OF CALIFORNIA AFFIDAVIT OF SUBPORT COUNTY OF ORANGE AND PREFERENCE FOR IMMIGRATION PURPOSES (7) 1 THAT OUR TRUE NAMES ARE HERNAN CORTEZ-SOLURJO ADMITTED FOR PERMANENT 2 RESIDENCE IN THE UNITED STATES AT sys ON MAY 23, 1971 UNDER ALTEN REGISTRATION NUMBER FOIA (b)(6) AND GLORIA CORTEZ - MELGOZA ADMITTED FOR PERMANENT RESIDENCE 3 JN THE UNITED STATES AT sys ON JUNE 20, 1968. THE ALJEN REGISTRATION NUMBER 4 ASSIGNED ME JS FOIA (b)(6) 5 (2) 6 THAT WE ARE HUSBAND AND WIFE AND SINCE OUR ARRIVAL JN THE UNITED STATES RESIDE AT 188 S. HEWES - ORANGE, CALIFORNIA OUR TWO FOIA (b)(6) 7 LIVE WITH My MOTHER, DULORES SOLORIO, AT ZAMORA MICHOACAN, MEXICO. 8 (3) 9 THAT ENCLOSED WITH THIS AFFIDAVIT OF SUPPORT AND PREFERENCE ARE A copy 10 OF OUR INCOME TAX RETURN FILED FOR YEAR 1974, A LETTER OFFERING EMPLOYMENT FUR THE BENEFICIARY, NJCOLAS CORTEZ - CORTEZ. 11 (4) 12 THAT AT THIS TIME OUR GREATEST DESIRE JS TO HAVE NICULAS CORTEZ-CORTEZ, 13 FATHER TO THE SPONSOR, BE ISSUED A VISA FOR PERMANENT RESIDENCE JN THE UNITED 14 STATES. SAID SUBJECT NOW RESIDES AT ZAMORA, MICHOACAN, MEXICO AND JF ISSUED A VISA WILL RESIDE WITH us AND WILL NEVER BECOME A PUBLIC CHARGE TO THE GOVERNMENT 15 F THE UNITED STATES. 16 (5) 17 THAT WE HOPEFULLY PRAY THAT NICOLAS CORTEZ-CORTEZ WILL BE GIVEN FULL 18 CONSIDERATION AND PREFERENCE TO BE ISSUED A VISA FOR PERMANENT RESIDENCE JN THE UNITED STATES. 19 20 21 22 FIBRE Heman lotes S 23 HERMAN CORTEZ_SOLORJO 24 Subscribed and sworn to before me this 25 19 day Gloria 26 GLORJA CORTEZ-CORTEZ Notery public la end for the County of Orange, State of California 27 28 OFFICIAL SEAL ELIAS S. ACEVEDO 29 NOTARY PUBLIC-CALIFORNIA ORANGE COUNTY My Commission 1976 30 31 32"
}
