{
	"anumber": "A34636911",
	"id": "A34636911_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Gobierno del Estado de Michoacán de Ocampo - TESORERIA GENERAL, Nº 24521"
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Sobierne del Estado de Michoacan de Ocampo TESORERIA GENERAL CERTIFICADO NUMERO 19,440.-EL CIUDADANO LICEN CIADO RICARDO RUIZ GUILLEN, DIRECTOR INTERINO DEL ARCHIVO GE NERAL DEL PODER EJECUTIVO DELESTADO DE MICHOACAN DE OCAMPO.= CERTIFICA:- Que en el libro copiador de ac- tas de Matrimonio, leventadas en el Juzgado del Registro - Civil de Tlazazalca, durante el año de 1936, y a fojas 11 vuelta, se encuentfa asentada la que sigue:- Al Margen. Numero 17.-Matrimonio de CORTES NICOLAS Y SOLORIO MA. DOLO RES.- A1 centro.- Número 17.-En Tlazazalca, Michoacan, a - las 12 doce horas del día 14 catorce de Marzo de 1936 mil- novecientos treinta y seis, presentes en esta Oficina ante el infrascrito Juez, el señor Nicolas Cortés Y la señorita María Dolores Solorio, el primero de 20 veinte años de TOTAL edad, soltero, labrador, hijo de Juan Cortés, finado y --- E Felipa Cortés, de 40 cuarenta años de edad, sin profesión- Y la Segunda, de 19 diecinueve años de edad, celibe, sin-- profesión, hija de José Refugio Solorio, de sesenta y cin- CO años de edady de Lucia Luna, finada, ambos vecinos de-- la Tenencia de Acuitzeramo, de este Municipio. El preten-- diente, presentó como testigos a los Ciudadanos Enrique -- DE Cortés y Antonio del mismo, apellido, de 39 treinta y nue- ve y 22 veintidos años de edad, casados, labradores, de - la misma vecindas y sin parentesco con el onteresado y la- pretensa a los Señores Francisco Anaya y Jose Reuffgio Ma- res, mayores de edad, casados, labradores, vecinos de la - misma Tenencia y sin parentesco con la interesada. Habiendo manifestado el padre de la señorita que da su consentimien- to. Declaran los señores testigos que conocen a los contra- yentes desde hace mas de tres años y que les consta a cien- cia cierta, bajo protesta legal que no tienen impedimento pa ra celebrar su matrimonio. Ynterrogados los pretendientes si es su voluntad unirse en matrimonio legitimo, contestaron -- afirmtivamente, con este motivo el propio Ciudadano Juez dijo en alta e inteligible VOZ. \"Declaro en nombre de la key y de la Sociedad. que quedan ustedes unidosen legitimo matrimonio con todos los derechos y prerrogativas que la fey otorga y con las ovligaciones que impone. Se hace cons- tar por la presente que se cumplieron todos los requisitos y for alidades que la Ley otorga con las obligaciones que -- se impone. Se hace constar por la presente que se cumplieron todos los requisitos y formalidades que la Ley de Relaciones Familiares exige en este acto el que se di6 por términado con la cartilla respectiva la firman con el suscrito Juez los que supieron hacerlo.-Doy Fé.-Cornelio Andrade.Firnado.-Es copia- tfa, fielmente tomada de su original.-Day Fé.-Una firma ilegible - mamas Los derechos de este Certificado fueron cubiertos en la Oficina de Rentas de esta cap. A SOLICITUD del interesado se expide el presen Agos-73 te en la ciudad de Morelia, Michoacan, a los 24 días del mes - Recibo Núm. 2039295 Importe 30.00 de Agosto de 1973. VALOR DE ESTA HOJA $2.00 ARCHIVO GENERAL DEL PODER VO DEL ESTADO No 24521 AGO. 24 1973 Pingle MORELIA MICH."
}
