{
  "anumber": "A34636911",
  "id": "A34636911_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Corona Growers, Inc. P.O. BOX 801 CORONA, CALIFORNIA 91720 PHONE (714) 737-5940 December 5, 1975 American Embassy Visa Section Mexico, D.F. Gentlemen: We understand that Nicolas Cortez Cortez, who lives in Aquit- zeramos, Michoacan, Mexico would like to immigrate to this country. In view of this, we are hereby offering the said Nic- olas Cortez Cortez employment with this company as a fruit picker. The employment we offer would for approximately 46 weeks of the year and would be available immediately upon the person's arrival in the United States. His minimum rate of pay would be 2.35 per hour and when work- ing on an incentive basis he could earn much more, In addition, we have bachelor type apartments available for 4.50 per week including utilities, We also give the following fringe bene- fits to all our employees: paid vacations, paid holidays, ex- cellent health insurance, a savings plan and a pension plan. We employ approximately 75 workers the year round and last season, at the peak of our harvest, we had approximately 350 workers, No special skills nor knowledge of the English Language are necessary. Yours very truly, Corona Growers, Inc. Marone Flares Norma Flores, Secretary STATE OF CALIFORNIA) SS COUNTY OF RIVERSIDE) Subscribed to and sworn before me, a Notary Public in and for the said County, this 5th day of December, 1975. OFFICIAL SEAL Notary John Public n. Nevers JOHN N. VEVERS NOTARY PUBLIC-CALIFORNIA RIVE My Commission Expires June 19. 1978 SIDE COUNTY P. 0. Box 801, Corona, CA. 91720"
}