{
	"anumber": "A34698683",
	"id": "A34698683_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Relative in the United States to be Granted a Immigrant Visa,, Form I-130."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 2023, 1933, 1944, 1977]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7728/2023 UNITED STATES DEPARTMENT JUSTICE Form Approved Immigration and Naturalization Service OMB NO. 43-RO 401 TO PLEASE NOTE FEE PAID Fee Stamp CLASSI ATUS OF YOU ARE THE PETITIONER 10.00 EN RELATIVE FOR AND YOUR RELATIVE ISSUANCE OF IS THE IMMIGRANT VISA BENEFICIARY 1. Name of beneficiary (Last, in CAPS) MAJID (First) (Middle) 2. Do Not Write in This Space 3. Names, birthdates and countries of birth of NAVID CHAUDHRY ABDUL MAJID beneficiary's children 4. Other names used: (including maiden name if married) As ABOVE FOIA (b)(6) 5. Country of beneficiary's birth 6. Date of beneficiary's birth (Month, day, year) PAKISTAN APRIL 15 1912 7 My name is: (Last, in CAPS) (First) (Middle) 8. My phone number is: MAMOOD IQBAL (916)842-5903 9 Other names used (including maiden name if married woman) 10. Relationship of beneficiary to myself 1GBALMAHMOODCHAUDHRY FATHER 11. I was born (Month) (Day) (Year) in: (Town or city) (State or Provincel (Country) 5-15-1944 BAHAWALNAGAR PUNJAB PAKISTAN 12 If you are a citizen of the United States. give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) acquired through naturalization, give name under naturalized, number of naturalization certificate, and date and place naturalization: DR lQBAL MAMOOD # 10462605 3-29-76, SACRAMENTO CALIF. U.S.A (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? (a) If so, give number of certificate and date and place of issuance: (b) If not submit evidence of citizenship in accordance with instruction (2) 13. If you are a lawful permanent resident alien of the United States. give the following: a. Alien Registration Number b. Date, place. and means of admission for lawful permanent residence A 14. Beneficiary's marital status: 15. of beneficiary's spouse. if married. and date and country of birth (Omit this item if petition is for your Married Widowed Divorced Single HAMIDA BEGUM MAY10, 1933 PAKISTAN 16. Full address of beneficiary's spouse and children. if any (Omit this 'item it petition is for your spouse) HOUSE BII 65/67, BLOCK OKARA PUNJAB. PAKISTAN 17 If this petition is for your spouse or child. give the following: a. Date and place of your present marriage Names of my prior spouses Names of beneficiary's prior spouses 18 Has this beneficiary ever been in the U. S.? YES NO 19. Are beneficiary and petitioner related BY adoption? The Panlab YES NO Corporation of the City of whore General of 157 United at femarity (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by meland that the atements herein are true and correct. Signature of petitioner (See Instruction No. 5) I spart Mamode Subscribed and sworn to (affirmed) before me this 26th day Dec. A.D. 1977 at. LAHORE PAKISTAS (SEAL) My commission expires (SIGNATURE OF OFFICER ADMINISTERING OATH) Bernondalt Hernard SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER Vice Connut of the United States of America I declare that this document was prepared by me at the request of the petitioner and is based on all information of which 1 have any knowledge. (SIGNATURE) (ADDRESS) (DATE) FORM -130 RECEIVED TRANS IN RET'D TRANS OUT COMPLETED (REV. 1-1-77) N"
}
