{
  "anumber": "A34636911",
  "id": "A34636911_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE, I-550 ( REV. 5-1-72N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1969,
        1915,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED. IMMIGRATION AND NATURALIZATION SERVICE OMB NO. 43-RO36 IMMIGRATION AND APPLICATION ERIFICATIONOFRA SERVICE FEE STAMP LAW PE NENT RESIDENCE OKEN ALIEN JUN 13 10 55 AM '73 Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, In connection with immigrant Visa application(s) of my relative(s) listed in item 15 below. I request that the American Consul at Mexico CHY D.F. be furnished a verification of my lawful admission into the United States (City and Country abroad) for permanent residence. I have read and fully understand the instructions appearing on the reverse of this form, concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS CORTEZ HERNAN SOLORIO AFOIA (b)(6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 188 S. HEWES ORANGE, CALIF 92669 ARRIK 6, 1939 5. MY FATHER'S NAME: NICOLAS CORTEZ DE CORTEZ 6. MY PLACE OF BIRTH WAS: (City) (Country) ACUTTZERAMO,HICH, Mexico 7. MY MOTHER'S FULL MAIDEN NAME: Me DOLORES Socorip MERICO 8. I N NOW A CITIZEN OF: Country) INFORMATION IN THESE BLOCKS PERTAINS TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. MY U.S. PORT OF ARRIVAL WAS MY DATE OF ARRIVAL WAS: / CORTER (Month) (Day) (Year) HERNAN AND SOLORIO Sys THE MEANS OF ARRIVAL WAS: (Show Name of Vessel for Airline and Flight No. etc.) MAY23 ADDRESS PERSON 1971 IN THE ON FOOTE 12. NAME AND OF U.S. TO WHOM 1 WAS DESTINED: GLORIA CORTEZ (UVFE) 188 5 HEWES ORANGE CALIF 92665 13. I first obtained an immigrant visa at a United States consular office abroad on (date) (location). At that time. I was was not married MEXICO City D.F. MAY 11, 1971 14. Including my present marriage I have been married 0 times. The name of my present spouse is: GLORIA CORTEZ to whom I was married on DEC.10 1969 at HARIO, MICHOACALL MEXICO If married more than one time list (date) (location) names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION is REQUESTED ARE AS FOLLOWS: FULL NAME Nicolas CERTER CORTEZ DATE AND PLACE OF BIRTH FEB 13, 1915 ACUITZERANG Mich MEXICO R REATIONSHIP FATHER CALLE JUAREZ 1792 ZAMORA, MICH MEXICO FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby informed that the subject named XHernan Corts above was was not lawfully admitted for permanent residence. His \"A\" file shows the following: Date of First Admission for Permanent Residence: 5/23/71 Symbol SA-1 Issuing Post and Date of Issuance of IV: SYS LAWFUL ADMISSION VERIFIED Marital status an time of first admission: Single: Married: Date: NS OFFICE: you 6/13/73 Verifiero Divorced: To Representative Widowed Evell USTNS FORM 1-550 (REV. 5-1-721N"
}