{
	"anumber": "A34636911",
	"id": "A34636911_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Gobierno del Estado de Michoacán de Ocampo, 5059"
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "gobierno del Estado de Michoacan de Ocampe TESORERIA GENERAL CERTIFICADO NUMERO 8261 EL CIUDADAN O LICENCIADO MIGUEL ANGEL AGUILAR IBARRA, DIRECTOR DEL ARCHIVO GENERAL DEL PODER EJECUTIVO DEL ESTADO DE MICHOACAN DE OCAMPO.-- CERTIFICA:- Que en el libro copiador de actas de Nacimiento, levantadas en el Juzgado del Registro Civil de Tlazazalca, durante el año de 1939 y a fojas 40 vuelta - 41 frente, se encuentra asentada la que sigue: Al margen. y No. 111.- CORTEZ HERMAN.- Al centro.- En el pueblo de Tla- zazalca del Estado de Michoacan, siendo las 15 quince ho-- ras del día treinta de Abril de mil novecientos treinta y HE nueve, se recibió en este Juzgado ante el infrascrito Juez una constancia expedida por el Jefe Municipal de la Tenencia Acuitzerano de este Municipio, la cual se al apéndice respectivo, de la que aparece que le fué agrega pre- sentado a dicho funcionario por el Señor Nicolás Cortez de veintidos años de edad, casado, labrador. mexicano, origi- nario y vecino de la misma Tenencia, un niño vivo que na-- ció el día seis del actual a las veintidos horas y en una casa de la propia Tenencia, a quien pusieron por nombre apellido HERMAN CORTEZ, 50. quinto hijo legítimo del com-- y pareciente y de su esposa Ma. Dolores Solorio, de vein tiún años de edad, sin profesión, del origen vecindad domicilio de su conyugue. Abuelos paternos del niño Juan y -- Cortez y Felipa Cortez y maternos; J. Refugio Solorio Lucía Luna. Se levanta la presente ante los testigos Ciu-- y dadanos J. Jesús Serrato y Bautista Heredia mayores de edad, casados, labradores, de la misma vecinded y sin rentesco con los interesados, quienes, leida que les fue pa la presente manifestaron conformes y firman con el suscri- Una firma ilegible. to Juez los que saben hacerlo.- Doy fé.- J. Jesús Ríos A SOLICITUD del interesado se expide el presente Los derechos de este Certificado fueron cubiertos en la Oficina de Rentas en la Ciudad de Morelia, Michoacan, a los 9 días del mes - de Esta Cap. de Abril de 1973. GENERAL Recito Núm 1570438 BEL POBER EJECU VO DEL ESTADO Importe $37.50 ulyund ABR 9 1973 VALOR OF ESTA HOJA $2.00 MORELIA MICH. No 5059"
}
