{
  "anumber": "A34600978",
  "id": "A34600978_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Gobierno del Estado de Michoacán de Ocampo, 22,028"
    },
    "years": {
      "ms_years_nlp_v1": [
        1931,
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 Gobizeno del Estado Tesorería Michoacin General CERTIFICADO NUMERO. 22,028.-EL CIUDADANO LICENCIADO= ELIAS VARGAS JUAREZ JEFE DEL ARCHIVO GENERAL DEL PODER EJE= CUTIVO DEL ESTADO DE MICHOACAN DE OCAMPO. CERTIFICA:- Que en el libro copiador de actas de Matri monio, levantadas en el Juzgado del Registro Civil, del Munici pio, de Panindícuaro, Mich, durante el año de 1931,y a fojas - 55, vuelta, se encuentra, asentada la que sigue: Al Margen.Par tida Número. 75 -Matrimonio de NEGRETE JOSE JESUS con LOPEZ = MARIA JESUS. centro.- En la illa de Panindícuaro, a las- 9 nueve horas del día 19 diez y nueve de noviembre de 1931, mil novecientos treinta y uno, fué presente en este Juzgado - ante el infrascrito Juez a fin de verificar su matrimonio el señor JOSE JESUS NEGRETE de 18 años soltero jornalero de campo hijo del finado Francisco de su apellido y de Floren-- cia Tapia que vive de 50 años viuda del anterior sin profe- ción y la señorita MARIA JESUS LOPEZ, tambien de 18 diecio- cho años de edad, soltera sin profeción hija de Antonio L6-- pez y de \"aría Nepomucena Tapia de 62 y 50 años de edad res pectivamente casados jornalero de campo y sin profeción por- su orden todos originarios y vecinos de la Tenencia de Curi- meo de este Municipio. E1 pretendiente presentó por testigos- a los Ciudadanos Antonio Alfaro y Jesús Perato y la preten COMPLETED sa a José Refugio Aviña y Esteban Rojas, mayores de edad, casa dos, agricultores de este lugar y sin parentesco con los inte resados habiendo manifestado los padres de la señorita que - dan su consentimiento .Declaran los señores testigos bajo la protesta de decir verdad que conocen a los pretendientes ha- ce más de 3 tres años, y les consta de manera cierta que no- tienen impedimento legal para verificar su matrimonio .Inte- rrogados los pretendientes si es su voluntad unirse en legí- timo matrimonio contestaron afirmativamente con este motivo- el propio Ciudadano Juez dijo en alta e inteligible voz. De - claro en nombre de la Ley y de la Sociedad que quedan uste - des unidos en en legítimo matrimonio con todos los derechos y prerrogativas que la Ley otorga y con las obligaciones que impone.Se hace constar por la presente que se cumplieron to- dos los requisitos y formalidades que la Ley de Relaciones - familiares exige en este acto el que se dió por terminado con la lectura de la cartilla respective. Se leyó esta acta - a los interesados y manifestaron estar conformes con su con- \"Año de Juárez: tenido firmandola con el infrascrito Juez los que supieron - Los derechos do este Certificado mtm hacerlo e intervinieron. Doy fe. Ignacio Mendez. Rubricados. fueron cubiertos en la Oficina de Rentas de esta Cap. A SOLICITUD Del interesado se expide el presente en la - Nov 72. Recibo Num. 857360. Ciudad de Morelia Michoacán, a los N dias del mes de Noviem- 30.00 Importe U ra bre de 1972, mil novecientos setenta dos VALOR DE ESTA HOJA ARCHIVO GENERA! 2.00 DEL PODER EJECUTIVO DEL ESTADO No 82852 NOV. 7 1972 7 MICH"
}