{
	"anumber": "A34684390",
	"id": "A34684390_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34684390_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ESTADO DE DURANGO Registro Civil, Nº 414847"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Onion- IL LEIB DL s 8- SERVICE No. 414847 ESTADO DE DURANGO Registro Civil DMOUS El Gobernador Constitucional del Estado, El Secretario General de Gobierno, IUZGADO DEL REG. CIVIII SAN JUAN BE USAL En nombre de la Repriblica de México Y como Juez del Estado Civil de este lugar hago saber a los que la presente vieren Y certifico ser cierto que enel libro No. del Registro Civil que es a micargo a fojas 24 FRENTE. se encuentra asentada un acta del tenor siguiente: AL MARGEN: 57 NUMERO CINCUENTA Y SIETE NACIMIENTO DL LA NIÑA MAZIA GARCIA ADAME. AL CENTRO. - EN SAN JUAN DE GUADALUPE A WAS 12 DOCE HOMAS DEL DIA 4 - CUAT=0 DE MAYO DE MIL NOVECIENTOS CATOOCE, ANTE MI EL CIUDADANO JESUS VELÁZQUEZ JEFE POLITICIO DEL PARTIDO Y JUEZ DEL ESTADO CIVIL DE ESTE- MUNICIPALIDAD, PCR MINISTER 10 DE LA LEY COMPA-ECIÓ EL CIUDADANO ESPI- IDION GA-CIA SÁNCHEZ, MAYOR DE EDAD, CASADO, JORNALE=0, OR GINA - 10 Y VECINO DE ESTE LUGAR, QUIEN PRESENTÓ UNA BOLETA DEL JEFE DE CUARTEL-- 60. SEXTO, CON LA QUE ACCEDITA QUE EN ESTE LUGAR EL DIA 12 DIECISIETE DE ABOIL PROXIMO PASADO, NACIO VIVA UNA NIÑA A LAS 6 SEIS DE LA MANA- NA, HIJA LEGIT IMA DEL EXPONENTE Y DE SU ESPOSA LA SENO MANUELA ADA- ME CONTREPAS QUE VIVE Y A QUIEN SE LE PUSO POR NOMBRE MARIA GAnCIA A- DAME, LA NIÑA NACIDA ES NIETA POR LINEA PATERNA DEL SENO- LEANDRO GA CIA Y DE LA SENORA PEEDAD SANCHEZ AMBOS QUE VIVEN Y PO LA MATEONA -- DE MA-COS ADAME Y DE LA SENORA GOEGO IA CONTREPAS QUE VIVEN. FUE=ÓN - TESTIGOS DE ESTE ACTO LOS CIUDADANCS JUAN RODRIGUEZ Y ELISEO REYNA, MAYORES DE EDAD, CASADO EL 10. PRIMERO Y SOLTE EL 20. SEGUNDO Y 05 GINAPIOS Y VECINSO DE ESTE LUGAR. CON LO QUE TERMINO LA PRESENTE ACTA QUE LEIDA QUE LES FUE AL EXPONENTE Y TESTIGOS MANIFESTARON CONFO-MI -- DAD EN EL CONTENIDO, NO FIEMANDO CON EL SUSCRI TO JUEZ POR LO SABER . - JESUS VELÁZQUEZ LA PRESENTE ES CORLA-FIEL SACADA DE SU ORIGINAL, EXPEDIDA EN SAN JUAN DE GUADALUPE A LOS NUEVE DIAS DEL MES RERO DE MIL NO VECIENTOS SETENTA Y CUATRO DOY EE.- E.L. JUEZ DEL REGISTRO DEL ESTADO CIVIL. UZGADO DEL REG. CIVIL GOADALUPE DGO. SEVENY GALVAN LOZANO."
}
