{
	"anumber": "A34698683",
	"id": "A34698683_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RESULT OF EXAMINATION"
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1985, 2006, 1999, 2023, 2000, 2012]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 RESULT OF EXAMINATION COURT ACTION English: Speaks OK Reads OK Write OK Classes NO Govt. oth Date 9-21-89 DENIED NEG DC G-325 ID. G-325B Grounds run G-325 Rec. Br. NEG N-426 Examiner PBA COML 31 quil or Cont'd G-325C Other Cont'd to suc (If Requested) wig bonion beneficiary IU gpc tu 2819 Eligibility 101 (f): OK Action or documents still required: Documents presented: T-151 CONKI BA CPEUR SIR OK DELOLA MHEA OVIH Ca (QM) NR CX - complete list Jump keyr of all children, dates. (10) & places of with (12) the (19) NEG numbers dates of enly all alien Regestration (13) (13) waived. exumpt Petitioner DOAS per DL under oath approved May all statements preliminary tooq investigation. woust laugh cpsq 5/6/97 of enley 18 JAN 1985 Investigation made at the Recommendation CV Skinds DE 5/4/84 19 Preliminary and Designated Examiner or INGRICION (Date) Recommendation C2 Kennath 24 may 19 Preliminary Examiner (Date) 8y (a) (14 barinou R USE nugsi ipc VLING grater (OL beyon OL beyons PILCE AGSLE DESC w) que nuileg 219162 nbou of ency SPLOSQ pk sensions questionation pis MINION STRAIN? poirs 195 surpoused 155c or busing of continue pous USE grace OL boppe ID que is this VISOLUGA su yaxucm or bau to (11 becope \" OLGIGHT abone CIDICE of inc subjoices inc of inc rpc que of (pre boppou CITINGU pocu began THE nutracy out-poin of ency betice poss scarges communication in Discoquini gis green or thre sug age 132) [SMART squizzion (01 becamics qualité 511 of beling us abonic yes (1) 10 the numsq nutou because 2000 (or II 1999 spice Unc Act baung biscoquit 1912 Legion must THE will square (or mug (e) (1) bention Section pare Largeq IN rpc noticy 2012 for If 10071 Like Assur suc ⑉ TOS 2006 (2) signature 10 que - (01 become sug pass 001 spingeusq secu (g) Lodner rust wi pc cpxu86q to (3) am POLD ou against (s) W because birth (1) COLLECT USTIC avg 1112 betting 102 awa ipc Come LOL the V'K no gebou oil Low (10 accombank beenou DAMICVIE YMD TORACE bELLION LOK"
}
