{
  "anumber": "A34698683",
  "id": "A34698683_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Personal Information Form, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1960,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 Page 2 25. Personal financial resources (a) Cash Ks 30 000/ (c) Real estate (value) R ! 50 000 (b) Bank deposits (d) Other (describe) 26. Father's name and address (If deceased, so state giving year of death) Ch Newal deceased 195L 27. Mother's maiden name and address (If deceased, so state giving year of death) Brube deceased 1960 28. Name and address of next of kin in home country FOIA (b)(6) 29. List all places of residence for 6 months or more since your sixteenth birthday City or town Province Country Dates (From-To) Calling or occupation American E - Punjal INDIA 1-99848-1447 sirrer Nara Penigal Panslan 1447 to shopkeeper service 30. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Name and address Dates (From-To) Type of membership and office held, if any N/A 31. List all languages, including your own, that you can speak, read and write Language Speak Read Write Undy yes yes yes ENglish Punjab yes yes yes you yes yes 32. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) 4 July 1976 to 19 october 1976 33. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or Yes No alcoholism? (If answer is Yes, explain) 34. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse Yes No or other charitable institution? (If answer is Yes, explain) 35. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or Yes No similar action? (If answer is Yes, explain) 36. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether Yes No you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) from imagent 37. Have you been refused admission to the United States during the last 12 months? Yes No (If answer is Yes, explain) 38. Have you ever registered with a draft board under United States Selective Service laws? Yes No (If answer is Yes, explain) 39. Have you ever applied for relief from training and service in the United States armed forces or departed Yes No from or remained outside the 'United States to avoid or evade military service? (If answer is Yes, explain) 40. Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States Yes No within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island)"
}