{
	"anumber": "A34698683",
	"id": "A34698683_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023, 1981, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 She IV 4698683 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HASNOT 9923708 BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) & NS FILE NUMBER, IF CHAUDHRY ABDUL MAJID KNOWN ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION NEW P/K 703 2/20/78 NOT APPLIC ABLE (Name of vessel or flight no. of arrival) INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT 212(e) 212(h) 3 ATTACHED A34698683 212(g) 212(i) MO.-DAY-YR. COUNTRY OF BIRTH OF BIRTH OCCUPATION 822 COUNTRY OF LAST MARITAL STATUS SEX NATIONAL ITY, RESIDENCE 04-15-12 Pakistan AgricuDe X M is W SEP M D Pakistan F Pakistani FINAL ADDRESS STREET ADDRESS CITY, STATE. AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 306 Bruce Street YREKA, CALIF. 96097 841 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL IR-5 000 FOREIGN STATE/DEPENDENT AREA AI LAHORE, PAKISTAN Bernard Other IMMIGRANTVISA NO. Bernard J. Alter ISSUED ON (Day) (Month) (Year) Vice Consul of the United States of America. 23 January 1978 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHTATTHE END OF (Day) (Month) (Year) 22 May 1978 PASSPORT NO AC810183 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED PHOTOGRAPHY TO AC810183 BY Government of Pakistan, Lahore Tariff Item UNITED STATES AMERICA ON Feb. 22, 1971 Fee Paid $20 EXPIRES Local Cy EquiRs.200.00 Feb. 21,1981 IV 4698683 FORM FS-511 1-73"
}
