{
	"anumber": "A34698683",
	"id": "A34698683_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice to Petitioner Concerning Your Petition for Naturalization and the Proposed Recommendation for Dismissal, N-1024"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Depar ent of Justice Immigration and Naturalization Service District Director 300 North Los Angeles Street Los Angeles, CA. 90012 ROOM 8416 NOTICE TO PETITIONER CONCERNING YOUR PETITION FOR NATURALIZATION AND THE PROPOSED RECOMMENDATION FOR DISMISSAL DATE JUNE 18. 1987 ABDUL MAJID CHAUDHRY UNITED STATES DISTRICT COURT AT 11419 SPRUCE ST. LOS ANGELES, CALIFORNIA LYNWOOD, CA 90262 ALIEN # A34 698 683 PETITION # 519975 YOUR PETITION FOR NATURALIZATION IS PENDING FOR THE REASON(S) CHECKED BELOW: YOU HAVE FAILED TO DEMONSTRATE A KNOWLEDGE OF THE GOVERNMENT AND HISTORY OF THE UNITED STATES OF AMERICA YOU HAVE FAILED TO DEMONSTRATE THE ABILITY TO READ/WRITE SIMPLE ENGLISH SENTENCES. YOU HAVE FAILED TO SUBMIT DOCUMENTS OR OTHER INFORMATION PREVIOUSLY REQUESTED, SPECIFICALLY COMPLETE LIST OF ALL CHILDREDN AND ALIEN REGISTRATION INFORMATION FOR THEM. YOU HAVE FAILED TO APPEAR FOR CONTINUED PRELIMINARY HEARING. MAY 2, 1986 YOU HAVE FAILED TO INFORM THE SERVICE OF YOUR CURRENT MAILING ADDRESS, IF APPLICABLE. YOU HAVE FAILED TO APPEAR AT A FINAL HEARING IN WHICH YOUR PETITION WAS PRESENTED. At the time you filed your petition for naturalization, you were advised of these necessary requirements. But since then, you have failed to comply. If you wish to proceed with your petition you must comply with them by JULY 20, 1987 . Re-examinations and/or explanations on how to comply with these requirements can be obtained by appearing in person on JULY 20, 1987 at the address shown at the top of this letter. Bring this letter with you. Thereafter, if you have not complied, a recommendation for dismissal of your petition will be made on AUGUST 17, 1987 for the reason (s) stated above. The recom- mendation will be made at the final hearing before The United States District Court. You should first report to room 329, 312 N. Spring Street, Los Angeles, CA 90012 at 12:30 P.M. if you wish to contest the recommendation. It is not necessary that you personally appear at the hearing if you do not intend to contest the recommendation The recommendation will be made without prejudice to any later application you may wish to submit to petition for naturalization. You may retain counsel to represent you at this hearing, although such representation is not required. The final decision on your eligibility will be made by the Court. ERNEST E. GUSTAFSON DISTRICT DIRECTOR"
}
