{
  "anumber": "A34698683",
  "id": "A34698683_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form Approved OMB No. 4-43-R46"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['n.a']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "Pakistan"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 FORM G-325 (REV. 5-1-79)Y UNITED STATES DEPARTMENT OF JUSTICE BIOGRAPHIC Form Approved OMB No. 43-R436 INFORMATION Immigration and Naturalization Service (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER CHAUDHRY ABDUL MAJIDA FEMALE 4-15-12 PAKISTAN A- 31694685 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. GUJRAT (If any) N/A INDIA 561-51-5218 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER NAWAB DIN AMRITSAR- INDIA MOTHER (Maiden name) HURMAT BIBI BATALA INDIA HUSBAND (If none so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE CHAUDHRY HAMIDA 50-10-33 AHMADPUREAST 3-15-49 OKARA PNDIA PAKISTAN FORMER HUSBANDS OR WIVES (If none, so State, FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE BIB, ZAINAB 10-5-14 3-14- 1-15-40 AMRITSAR INDIA BEGUM RAZIA 12-5-24 2-7-41 9-7-47 DIED BAHARYAL NASHR PAKISTAN APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 11419 SPRUCE ST LYNWOOD CALIFORNIA U-S-A 11 78 PRESENT TIME 11171 BULLIS RD # C LYN WOOD CALIFORNIA U-S-A 6 78 11 78 306 BRUCE ST YREKA CALIF U.S.A 2 78 6 78 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR B1T-65-67 C Block OKARA PUNJAB PAKISTAN 8 47 2 78 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR L R Black 4410 MAIN RD. KANSAS CITY TAX PREPARER 79 PRESENT TIME MISSUVRI 64111 Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) STATUS AS PERMANENT RESIDENT Abone majui Chandling 8-10-82 IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) CHAUDHRY ABDUL MAJID A 0 34 698 683 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: LOS CIT E 400 20 APR 1994 (date) (1) Ident FORM G-325 U.S.Government Printing Office: 1982-372-013"
}