{
	"anumber": "A34600978",
	"id": "A34600978_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL, PERMANENT RESIDENCE OF AN ALIEN, FORM 1-550 (REV.6-1-69"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023, 1942]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPART MENT OF JUSTICE Screened NARA 5/10/2023 FORM APPROVED IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 APPLICATION FOR VERIFICATION OF FEE STAMP LAWFUL PERMANENT RESIDENCE NOTE - Copy of birth record of F AN ALIEN petitioner is - ake or man to- attached. IMMIGRATION AND NATURALIZATION SERVICE, Oct 13 5.42PM México, D.F., México, I request that the American Consul at be furnished a verification of my lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 15. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: NEGRETE-Lopez, José Luis AFOIA (b) (6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 16039 Vanowen St., Apt. 3, Van Nuys, CA., 91406 June 2, 1942 5. FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) Jesús Negrete-Tapia Curimeo, Michoacán, Méx. 7. MOTHER'S MAIDEN NAME: 8. I AM NOW A CITIZEN OF: (Country) María de Jesús López-Tapia México INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE (Last) (First) (Middle) 10. PORT OF ARRIVAL: NEGRETE-López, José Luis San Ysidro, Calif. 11. DATE OF ARRIVAL: (Month) (Day) (Year) 12. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No., etc.) Jan. 15, 1971 Afoot 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: 14. AT THE TIME OF LAST LAWFUL ADMISSION TO THE U.S. I ENTERED WITH Angelina Gallegos de Negrete, wife, AN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD Van Nuys, Calif. A PERMIT TO REENTER OTHER (EXPLAIN) AND I HAVE NOT BEEN ABSENT FROM THE UNITED STATES SINCE 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH María de Jesús López de Negrete 8/31/15 Curimeo, Michoacán, México RELATIONSHIP ADDRESS Mother Calle Alta Tensión 68, Colonia Molino de Rosas, México 19, D.F., Mexico. FULL NAME DATE AND PLACE OF BIRTH FOIA (b)( (6) FOIA (b)(6) RELATIONSHIP ADDRESS FOIA (b) (6) FOIA (b)(6) FULL NAME DATE AND PLACE OF BIRTH FOIA (b) (6) FOIA (b)(6 RELATIONSHIP ADDRESS FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that admitted subject for permanent residence as shown. was visa was issued the named above not lawfully Jose Luis Negre te Lopez Lapey at MEXICO D.F. Insert symbol for entries after 6/30/202FIED LAWFUL ADMISSION INS Office: LOS ANGELES on 1-6-71 IR-1 Verified:ontact Representative, USINS 2. again Date: 10-10-72 FORM 1-550 (REV. 6-1-69)"
}
