{
  "anumber": "A34643000",
  "id": "A34643000_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34643000_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "femenino"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form Approved, Form 510 ( (Spanish)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (Spanish) 2-68 Form Approved DEPARTAMENTO DE ESTADO Budget Bureau No. 47-R0150 SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCION? Este cuestionario debe llenarse por DUPLICADO a máquina 0, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las pregunta entes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pre fuere insuficiente, sírvase contestar en hojas aparte, por duplicado, indicando los mismos números de läs preguntas del cuestionario a las que correspondan las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5.00. Estos derechos deben abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda nacional, 0 mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de. su enjuiciamiento, deportación, o ambos. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) HERNANDEZ DE LOPEZ VICTORIA RINCON 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name) Victoria Hernández Rincón.- 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet (if Roman letters not used) No me corresponde. - 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Dia (Day) Mes (Month) Año (Year) 25 de Junio de 1914. 59 Ciudad o pueblo (City or town) (Prov. o Dpto.) (Province) País (Country) Atoyac Jalisco Mexico. 7. Nacionalidad 8. Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino X Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) (Single (never married)) Incluyendo mi matrimonio actual, me he casado una.- Mexicana veces. (including my present marriage, have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) El Hogar. - Allende # 96 Atoyac Jal Mexico.- 12. Motivo del viaje a los EE.UU. Reunirme a mi (Purpose in going to the United States) 13. Nombre completo domicilio del cópyuga Tebas Critza de la esposa) [Name and address of wife/husband (give maiden name wife) hijo residente legal, Allende # 96 Atoyac Jal Mexico.- 14. Nombres y domicilios de los hijos menores de 21 años 15. La(s) persona(s) nombrada(s) en los números 13 y 14 me (no me) acom- (Names and addresses of children under 21 years of age) pañará(n) a los Estados Unidos 0 se (no se) reunirá(n) conmigo posterior- Ninguno mente en dicho país (0) [Person(s) named in 13 and 14 (will) (will not) accompany or follow me to the United States] Tache lo que no corresponda (Cross out words that do not apply) Me acompanara mi esposo.- 16. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanentemente, 17. Puerto de entrada indíquelo) Permanentemente. (Intended port of entry) [Length of intended stay (if permanently, so state) ] Calexico Cal, USA, 18. Domicilio que tendrá en los Estados Unidos (Final address in the United States) Rt. Box 410 A 19. ¿Tiene Ud. pasaje hasta su destino final? (Do you have a ticket to final destination?) Bakersfield California, 93307/ USA. Oportunamente lo obtendre 20. Nombre, parentesco, y domicilio de la persona con guien se reumirá en Estados Unidos.1 hijo: JoseRemberto Lopez Hae Nombre y domicilio de su fiador (si no es la misma persona u orga- nizacion indicada en el numero 20.) [Person you intend to join (Give name, address and relationship, if any) Rt. Box 410 A. [Name and address of sponsoring person or organization (if different Bakersfield Calif, 93307. USA. from 20) ] Mi hijo. 22. Filiación personal: (Personal description) 23. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Height) 1.55 (Color of hair) Castano m (ft.) cm. (in.) b) Color de los ojos d) Tez (Complexion) (Color of eyes) Ningunas. cafes. Morena.- 24. A esta solicitud se anexan los siguientes documentos: (The following documents are submitted in support of this application) Certificado de nacimiento Certificado de defunción (Birth certificate) Comprobante de medios económicos propios Certificado(s) médico(s) (Death certificate) (Evidence of own assets) KCertificado(s) de policía (Medical record(s) Certificado de divorcio Declaración jurada de manutención (Police certificate(s)) Fotografías (Divorce decree) (Affidavit of support) <Certificado de matrimonio (Photographs) Hoja de servicio militar Oferta de empleo (Marriage certificate) Otros (describanse) (Military record) (Offer of employment) [Other (describe) ] X Pasaporte Mexicano.- ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}