{
	"anumber": "A34684390",
	"id": "A34684390_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34684390_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OBLICITUD DE VISA DE INMIGRATE Y REGISTRO DE EXTRANJERO"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Form FS-510 (Spanish) Form Approved 2-68 DEPARTAMENTO DE ESTADO Budget Bureau No. 47-R0150 OLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este cuestionario debe llenarse por DUPLICADO a máquina 0, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las preguntas pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sírvase contestar en hojas aparte, por duplicado, indicando los mismos números de las preguntas del cuestionario a las que correspondan las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5.00. Estos derechos deben abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda nacional, 0 mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de. su enjuiciamiento, deportación, o ambos. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) RAMIREZ MARIA GARCIA DE 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name) 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet (if Roman letters not used) ) MARIA GARCIA ADAME 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Dia (Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Prov. o Dpto.) (Province) País (Country) 17 DE ABRIL DE 1914 59 años SAN JUAN DE GUADALUPE DURANGO MEXICO 7. Nacionalidad 8. Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Gasado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) Mexicana (Single (never married)) Incluyendo mi matrimonio actual, me he casado UNA veces. (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) EL HOGAR Gonzalitos # 109 Ote. San Nicolás de los Garza, NL. 12. Motivo del viaje a los EE.UU. 13. Nombre completo y domicilio del cónyuge (consignar el apellido de soltera de la esposa) (Purpose in going to the United States) [Name and address of wife/husband (give maiden name of wife) ] MANUEL RAMIREZ Radicar ADAME- Gonzalitos 109 Ote. San Nicolas de los Garza 14. Nombres y domicilios de los hijos menores de 21 años N.L. Mekildada(s) persona(s) nombrada(s) en los números 13 y 14 me (no me) acom- (Names and addresses of children under 21 years of age) pañará(n) a los Estados Unidos 0 se (no se) reunirá(n) conmigo posterior- mente en dicho país [Person(s) named in 13 and 14 (will) (will not) accompany or follow me to the United States] Tache lo que no corresponda (Cross out words that do not apply) 16. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanentemente, 17. Puerto de entrada indíquelo) (Intended port of entry) [Length of intended stay (if permanently, so state) ] permanente por: Laredo, Texas 18. Domicilio que tendrá en los Estados Unidos 19. ¿Tiene Ud. pasaje hasta su destino final? (Final address in the United States) (Do you have a ticket to final destination?) 1410 Realto St. Oxnard, Calif. 93030 USA 20. Nombre, parentesco y domicilio de la persona con quien se reunirá en los 21. Nombre y domicilio de su fiador (si no es la misma persona u orga- Estados Unidos. nización indicada en el numero 20.) [Person you intend to join (Give name, address and relationship, if [Name and address of sponsoring person or organization (if different any) HIJO) RICARDO RAMIREZ GARCIA - 1410 Realto from 2Q) Ornard, Calif. 93030 USA 22. Filiación personal: (Personal description) 23. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Height) (Color of hair) Castano 1. m (ft.) 60 Ningunas cm. (in.) b) Color de los ojos d) Tez (Complexion) (Color of eyes) Cafes Moreno 24. A esta solicitud se anexan los siguientes documentos: (The following documents are submitted in support of this application) Certificado de nacimiento Certificado de defunción Comprobante de medios económicos propios Certificado(s) médico(s) (Birth certificate) (Death certificate) (Evidence of own assets) X (Medical record(s) Certificado(s) de policía Certificado de divorcio Declaración jurada de manutención Fotografías (Police certificate(s) (Divorce decree) (Affidavit of support) Certificado de matrimonio (Photographs) Hoja de servicio militar Oferta de empleo Otros (describanse) (Marriage certificate) (Military record) (Offer of employment) [Other (describe) Pasaporte Mexicano, Carta de Sosteni- miento. ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
