{
	"anumber": "A34600978",
	"id": "A34600978_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV 4 600978"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 has IV 4600978 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HASNOT FORM I-151 ISSUED L-120 BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) I & NS FILE NUMBER, IF LOPEZ De NEGRETE, Maria de Jesus NEE: Lopez Tapia KNOWN ACTION BY:IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION S. IMMIGRATION 165 SYS 1036 Noor NOT APPLICABLE (Name of vessel or flight no. of arrival) FFS 14 1975 INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT ADMITAL SA-I 59 212(e) 212(h) ATTACHED 3 212(g) 212(i) MO.-DAY-YR. 08-31-15 COUNTRY 582 OF BIRTH OCCUPATION 0 Housewife COUNTRY 5C2 OF LAST 9 MARITAL STATUS SEX NATIONALITY OF BIRTH RESIDENCE M S W SEP M Mexico D Mexico XX F Mexican FINAL ADDRESS STREET ADDRESS CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 16039 Vanowen St. Van Nuys, Calif. 91406 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN Embassy SA-1 FOREIGN STATE/DEPENDENT AREA AT Mexico, D. F. Western Hemisphere 005 Persiko Pumily IMMIGRANT VISA NO. 397 Robert D. ISSUED ON (Day) (Month) (Year) of the United States of America. 17 Jan. 1975 Vice Consul THE VALIDITY OF THIS VISA EXPIRES MIDNIGHTATTHE END OF (Day) (Month) (Year) 16 May 1975 PASSPORT NO. 5446 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO Jesus Lopez de Negrete BY SERVICE Mexican Foreign Office ON Tariff Item OF AMERICA 15 Jan 1975 Fee Paid $20 EXPIRES Local Cy Equiv eop 14 Jan 1977 IV 4600978 FORM FS-511 1-73"
}
