{
	"anumber": "A34636911",
	"id": "A34636911_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORM 1-90 ( (Spanish) ( (Rev. 9/27-75N)"
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Estonia",
				"Cuba",
				"Bulgaria",
				"Albania",
				"Vietnam",
				"Latvia",
				"Lithuania"
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DEPARTAMENTO DE JUSTICIA DE LOS ESTADOS UNIDOS (Sirvase separar esta hoja antes Servicio de Inmigración y Naturalizacion de presentar la solicitud) SOLICITUD POR UN EXTRANJERO CON RESIDENCIA LEGAL PERMANENTE PARA OBTENER UNA TARJETA DE REGISTRO DE EXTRANJEROS - TARJETA I-151 INSTRUCCIONES SIRVASE LEER LAS INSTRUCCIONES CUIDADOSAMENTE NO SE REMBOLSARAN LOS DERECHOS. 1. FINALIDAD - Este formulario e para solicitar una Tarjeta de Registro de Extranjeros (Alien Registration Receipt Card, Form I-151) por cualquier de los motivos que se indican bajo el punto 1 al anverso de este formulario. Esta solicitud puede ser utilizada únicamente por un extranjero que es un residente legal permanente en los Estados Unidos. 2. COMO DEBE PREPARARSE - Llénese un solo ejemplar. a máquina o escribiendo con tinta en letras de molde. 3. DOCUMENTOS DE PRUEBA Con esta solicitud, se le exige presentar cualquier Tarjeta de Registro de Extranjeros (Alien Registration Receipt Card. Form I-151) o cualquier otra prueba de registro de extranjeros que usted posea actualmente. Una solicitud para una nueva Tarjeta de Registro de Extranjeros con un nombre distinto al que aparece en la tarjeta que se le entrego anteriormente, será aprobada únicamente si su nombre ha cambiado debido al fallo de un tribunal de jurisdicción competente o por razón de matrimonio. Si usted está solicitando que se le emita una tarjeta con un nombre distinto, debe adjuntar a esta solicitud una copia certificada de su partida de matrimonio o del mandato judicial que cambio su nombre. Si usted vive en un Estado en el cual, conforme al mandato judicial que cambia su nombre se le exige cumplir con otros requisitos antes de que el mandato tenga vigor, usted también debe adjuntar un certificado del tribunal que indique que usted ha dado cumplimiento a las condiciones del mandato que cambió su nombre. 4. FOTOGRAFIAS - Excepto en el caso de un solicitante menor de 14 años de edad, con esta solicitud deben someterse dos fotografías del solicitante, tomados no mas de treinta dias antes de la fecha de esta solicitud. Las fotografías deberán ser de 1 1/2 por 1 1/2 pulgadas, y deberán mostrar una distancia de aproximadamente 1 1/4 pulgadas desde la parte superior de la cabeza hasta la barbilla. NO deberán estar pegadas en una tarjeta ni montadas en forma alguna y deberán ser de papel delgado, tener un fondo claro y mostrar claramente su cara de frente sin sombrero. No se aceptarán instantaneas, fotografías de grupo, retratos de cuerpo entero, O fotografías de máquinas automáticas. NO FIRME SUS FOTOGRAFIAS. Utilizando un lápiz blando o de carboncillo para no dañarlas escriba su número de registro de extranjero al dorso de la fotografía sin apretar el lápiz. Se prestará consideración especial para no exigir fotografías a solicitantes que se encuentran recluídos debido a su edad o a una incapacidad física. 5. HUELLAS DACTILARES - Al pedir el remplazo de una tarjeta destruida o perdida o de una tarjeta mutilada cuando la tarjeta mutilada no se presenta con la solicitud, todo solicitante de 14 o más años de edad deberá presentar una ficha dactiloscópica completa (Formulario FD-258). Usted podrá registrar sus huellas dactilares en el formulario FD-258 en una oficina de este Servicio o, si así prefiere, puede presentar el formulario FD-258 en naestación de policia u oficina de alguacil y pedir que un agente alli registre sus huellas dactilares en la tarjeta. Usted deberá firmar dicha tarjeta en presencia del agente que le toma las huellas dactilares, quien también debe firmar la tarjeta y dejar constancia de la fecha en los espacios correspondientes. Es importante suministrar toda la información que se pide en la tarjeta. 6. PRUEBAS DE SU LLEGADA - Si no recuerda la fecha exacta de su llegada o el puerto de entrada por el que fue admitido a los Estados Unidos, o el nombre del buque o compañía de aviación que usó para su transporte, quizas pueda obtener esa información examinando antiguos papeles o documentos que tenga, tales como una tarjeta de embarque, etiquetas de equipaje, recibos de pago de impuestos, pasaporte o Tarjeta de Identificación de Inmigrante, O consultando con amigos, o parientes que viajaron con usted. Trate de dar información exacta sobre su llegada, de la mejor manera posible. en las partes correspondientes de este formulario. 7. DERECHOS - Si marco las casillas (a), (b) o (c) del punto 1. o(e) si su entrada como inmigrante o el ajuste de su condición se efectuo más de un año antes de presentar la solicitud, deberán pagarse diez dólares (US$10) por concepto de derechos por el registro de esta solicitud. No se requiere pagar ningún otro derecho. EL PAGO NO SERA VUEL SEA CUAL FUERE LA RESOLUCION DEL CASO. NO ENVIE DINERO EN EFECTIVO POR CORREO. TODOS LOS PAGOS DEBEN SER ENVIADOS POR LA CANTIDAD EXACTA. El pago por cheque o giro postal debe ser girado sobre un banco u otra institución ubicada en los Estados Unidos y ser pagadero en moneda de los Estados Unidos. Si usted es residente de las Islas Virgenes, el cheque o el giro deben hacerse pagaderos al \"Commissioner of Finance of the Virgin Islands. Si usted es residente de Guam, el cheque o el giro deben hacerse pagaderos al **Treasurer, Guam. Todos los demás solicitantes deben hacer sus cheques o giros pagaderos al \"Immigration and Naturalization Service.\" Cuando el cheque se libra contra la cuenta de una persona que no es el solicitante. el nombre del solicitante debe aparecer en el anverso del cheque. Cheques personales serán recibidos sujeto colección. Un cheque que no se puede cobrar hace la solicitud y cualquier documentos entragados inválidos. Un cheque en pago de derechos que falta de ser cobrable resultará en la imposición de una costa de cinco dólares (U.S.$5) Si el pago se hace mediante el tipo de giro internacional que no puede enviarse por correo, el giro debe extenderse a la orden del Director de Correos (\"Postmaster\") de la ciudad en los Estados Unidos a la que se envía la solicitud y en la parte superior de la solicitud se deberá indicar claramente el nombre de esa ciudad, el número del giro y la fecha. 8. EL USO DE LA TARJETAI COMO DOCUMENTO DE VIAJE - Un residente legal permanente de los Estados Unidos que regresa al país después de una ausencia provisional que no exceda de I año, puede presentar su Tarjeta I-151 en lugar de una visa, siempre y cuando que durante esa ausencia no viajo a los siguientes países, ni pasó en transito por ellos: Cuba y zonas comunistas de Corea o Viet-Nam (con la excepcion de personas que tienen su tarjeta I-151 pero que aún no han cumplido los 16 años cuando hacen la solicitud) Albania, Bulgaria, Checoeslovaquia, Estonia, Hungría, Latvia, Lituania, Mongolia Exterior, Republica Popular China, Polonia, Rumanía, República Democratica Alemana, Union de Repúblicas Socialistas Sovieticas, o Yugoslavia. Las oficinas del Servicio de Inmigración y Naturalización le proporcionarán información en relación con las exenciones en cuanto a estas restricciones. 9. DONDE PRESENTAR ESTA SOLICITUD Si usted está en los Estados Unidos, presente la solicitud a la oficina de Inmigración que tenga jurisdicción en el lugar de su residencia. Si usted esta fuera de los Estados Unidos. presente la solicitud (bien sea personalmente o por conducto de un funcionario consular de los EE.UU.) a la oficina de Inmigracion de los EE.UU. fuera de los Estados Unidos que tenga jurisdicción respecto al lugar en que está usted residiendo temporalmente. Si ha marcado la casilla 1(g), debe presentar la solicitud personalmente en la oficina de Inmigracion, donde se le tomarán las huellas dactilares y se procederá a la inscripción. 10. SANCIONES - ley dispone graves sanciones para los que, a sabiendas y con intención. falsifican uocultan un hecho importante o usan un documento falso al presentar la solicitud O. a sabiendas, falsifican. alteran O de alguna otra forma hacen uso ilicito de la Tarjeta I-151. Asimismo, una declaración falsa puede dar por resultado la denegación de esta solicitud y de cualquier otra solicitud que usted pueda presentar para recibir cualquier beneficio conforme a las leyes de inmigración de los Estados Unidos. Toda declaración que acompane esta solicitud se considerará como que forma parte de la solicitud. FORM 1-90 (Spanish) (Rev. 9-27-75)N"
}
