{
	"anumber": "A34636911",
	"id": "A34636911_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application or Petition Form No. I-90, I-485, ETC."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATTON SERVICE Processing Sheet PAGINA DE PROCEDIMIENTO Application or Petition Form No. I90 File No. NUMERO DE SOLICITUDE (I-90, I-485, ETC. ) NUMERO DE ESTRANJERO DATA COLLECTION FOR ALIEN DOCUMENTATION, IDENTIFICATION & TELECOMMUNICATION SYSTEM (ADIT) COLECCION DE INFORMES PARA EL SYSTEMA DE DOCUMENTACION, IDENTIFICACION Y TELECOMUNICACION DE LOS ESTRANJEROS Please print or type information requested below: FAVOR DE USAR LETRA DE MOLDE 0 ESCRIBIR A MAQUINA LOS INFORMES PEDIDOS ABAJO: COMPLETE NAME N,COLAS CORTEZ CORtEZ NOMBRE E APELLIDO COMPLETO COMPLETE MAILING ADDRESS 188 HEWS DIRECCION COMPLETA DE CORREO Since CALIF 92669 MOTHER'S FIRST NAME Felipa NOMBRE DE SU MADRE FATHER'S FIRST NAME JOAN NOMBRE DE SU PADRE CITY/TOWN/VILLAGE OF BIRTH M.CHOACA ZAMORA LUGAR DE SU NACIMIENTO (CIUDAD 0 PUEBLO.) CITY OF RESIDENCE WHEN APPLYING FOR A VISA OR IMMIGRANT STATUS ZAMORA 1292 Ave, JUNREZ CIUDAD DE RESIDENCIA CUANDO HAGA APLICACION PARA VISA DE INMIGRANTE CITY OF DESTINATION AT TIME OF ORIGINAL ADMISSION ORANGE CIUDAD DE DESTINO AL TIEMPO DE ENTRADA ORIGINAL COMO INMIGRANTE LOCATION OF CONSULATE WHERE IMMIGRANT VISA OBTAINED (OR IMMIGRATION OFFICE WHERE ADJUSTED) mexico LUGAR DEL CONSULADO DONDE OBTUVO VISA DE INMIGRANTE 0 OFIGINA EN QUE CAMBIO A City DATE OF BIRTH Lobiels 13, 1913 RESIDENTE LEGAL FECHA DE NACIMIENTO PORT OF ENTRY WHEN ADMITTED AS IMMIGRANT OR OFFICE WHERE ADJUSTED TO LAWFUL PERMANENT RESIDENT SAN YSiDRo LUGAR DE ENTRADA AL TIEMPO DE ADMISION ORIGINAL COMO INMIGRANTE 0 OFICINA EN QUE SYMBOL ADMITTED UNDER (CLASSIFICATION) SA-1 CAMBIO A RESIDENTE LEGAL CLASIFICACION DE VISA DE INMIGRANTE (SA-1, 0-1, IR-1, IR-2, ETC.) DATE ADMITTED FECHA DE ADMISION ORIGINAL COMO INMIGRANTE 0 DE CAMBIO A RESIDENTE LEGAL OR ADJUSTED TO LAWFUL PERMANENT RESIDENT FeBReRO 19,76 This form may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this sheet on top of all material in file until initial decision is made Form I-468 (ADIT) FPI.LOM.6.78.50M-1412 (Rev. 11-1-70)"
}
