{
	"anumber": "A34600978",
	"id": "A34600978_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Michoacán de Ocampo, 3,974 TRES MIL NOVECCIENTOS SETENTA Y CUATRO"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1942]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Michaarán Tesorería General de del @campo Estado UNIDOS SECURITY UNIVERSITY CERTIFICADO NUMERO 3,974 TRES MIL NOVECIENTOS SETENTA Y CUATRO, EL CIUDADANO LICENCIADO ALVARO MIRANDA GARCIA JEFE , DEL ARCHIVO GENERAL DEL ESTADO DE MICHOACAN DE OCAMPO CERTIFICA:- Que en el libro copiador de Actas de cimiento, levantadas en el Juzgado del Registro Civil, del Muni- Na cipio de Panindicuaro, durante el año de 1942 y a fojas 92 frente, se encuentra asentada la que sigue:- Al margen.- Número 210 Doscientos diez.- NEGRETE JOSE LUIS.- Al centro.- En la Vi- lla de Panindicuaro, Michoacán, a las 10 horas del día cinco de- Junio de 1942 mil noveciento cuarenta y des . T Jesús Negrete mexicano, agricultor de 35 años de edad, originario la Tenenci we Curtimeo ae este Municipio, presento en gado ante el infrascri to Juez, un nino vivo que dice nació a de las una horas del día dos del actual en el domicilio expresado- - Volor a quien pusieron por nombre y apellido JOSE LUIS NEGRETE, hijo- legitimo del compareciente y de su esposa Maria Jesús Lopez, me xicana de 30 años de edad, de oficio labores del hogar, origina- ria y vecina del mismo lugar de su conyuge, siendo abuelos pa--- Pera ternos del niño Francisco Negrete finado y Florencia Tapia que- vive y maternos Antonio López y Nepomusena Tapia que viven am- bos en el mismo domicilio de nacionalidad mexicana.- Se levanta- la presente ante los ciudadanos José Campos y Benigno Linares-- de 60 y 23 años de edad, casados, con domicilio el primero en casa numero 8 de la Avenida Independencia y el segundo en casa- - sin número de la misma avedina, mexicanos, agricultores y sin parentezeo con los interesados, leída que les fué la presente, expresaron su conformidad, firmandola con el suscrito Juez. quienes supieron hacerlo Doy fe.- Una firma ilegible. A SOLICITUD del interesado se expide el presente, en la Giudad de Morelia, Estado de Michoacán, a 10 de abr mil novecientos setenta. Los Derechos de este Certificado importantes $ 37.50 fueron Cubiertos en la Oficina de Rentas de Esta Cap. Abr.9/70 Según recibo 087611 10,000 E.-10-69 IIT"
}
