{
	"anumber": "A34600978",
	"id": "A34600978_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34600978_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT IN BEHALF OF APPLICANTS FOR IMMIGRANT VISAS, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 2023, 1915, 1942]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 AFFIDAVIT OF SUPPORT IN BEHALF OF APPLICANTS FOR IMMIGRANT VISAS I, JOSE LUIS NEGRETE LOPEZ, residing at16039 Vandwen Street, in Van Nuys, California, being first duly sworn, depose and say THAT: 1. I am married; was born in Curimeo, Michoacán, México, on June 2, 1942; was admitted to the United States, for permanent resid- ence, on January 15, 1971, at San Ysidro, California; have resid ed in the United States continuously since the latter date; and am holder of Form I-151 of the U.S. Immigration and Naturaliza tion Service, my alien registration number being A FOIA (b)(6) 2. It is my intention and desire to have the following persons now residing in México, D.F., México (Calle Alta Tensión #68, Co lonia Moline de Resas, Zona 19), come to the United States for permanent residence: María de Jesus López de Negrete, female, born in Curimen, Michoa cán, México, on August 31, 1915, married, my mother. FOIA (b)(6) FOIA (b)(6) The three persons described in this Paragraph No. 2 are herein-- after known as the prospective immigrants. 3. (a) I am employed by W & W Wholesale Nursery, Inc., of Chats- worth, California, and derive an income of $120.00 for a 40-hour week, plus overtime at $3.83 per hour. (b) I own personal property consisting of three motor vehicles - and household furniture having an aggregate reasonable value of $5,000.00, and a present encumbrance of $1,500.00. 4. The following persons are dependent upon me for support: Consuelo Angelina Negrete, my wife, born in Canoga Park, Calif., USA., 31 years of age, a citizen of the United States. FOIA (b)(6) FOIA (b)(6), FOIA (b)(6), and FOIA (b)(6) NEGRETE, my child- FOIA (b)(6) ren, residing with me and my wife. 5. I have heretofore contributed to the support of the prospec-- tive immigrants; I desire to sponsor the said prospective immi- grants because of their close relationship to me; and specific - plans have been made by me for the support of said prospective - immigrants in the United States, if admittedthereto."
}
