{
  "anumber": "A34698683",
  "id": "A34698683_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34698683_0049/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, Form 1-134 ( (Rev. 3-1-76)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 UNITED STATES DEPARTMENT C STICE Form approved Immigration and Naturalization S OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS; FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, DR IQBAL MAMOOD residing at 1118 so OREGON Street. , (Name) (Street and number) YREKA CALIFORNIA 96097 U.S.A. (City) (State) (ZIP Code, if in U.S.) (Country) being duly sworn depose and say: 1. I bornon 5-15-1944 at BAHAWAL NAGAR PAKISTAN Also, answer either a, b or c. as appro- was (Date) (City) (Country) priate, if you are not a native born United States citizen. (a) If a United States citizen through naturalization, give number of certificate of naturalization 0462605 (b) If a United States citizen through parent(s) or marriage, give number of own certificate of citizenship If none obtained, attach statement explaining how citizenship derived. (c) If an alien lawfully admitted to the United States for permanent residence, give 'A' number 2. That I am 33 years of age and have resided in the United States since 19 MAY 10, 1970 3. That this affidavit is executed in behalf of the following person(s) at present at residing OKARA PAKISTAN : COUNTRY MARRIED OR RELATIONSHIP TO NAME SEX AGE OF BIRTH SINGLE DEPONENT PAKISTAN DEAR FATHER MR. ABDUL MAJID M 65 MARRIED (THEM UNDER INDM 44 PAKISTAN MRs HAMIDA BEGUM F MOTHER THEN UN DIVIDED INDIA) FOIA (b)(6) 4. (Amounts shown in answer to this question must be in United States dollars.) MEAT & POULTRY (a) That I am employed as, OF engaged in the business of VETERINAY MEDICAL with USDA F.S. Q.S. INSPECTION OFFICER (Name of concern) at 620 CENTRAL AVE Bidg 2-C and derive a net annual income of $ $18,867 (b) That I have on deposit in savings ALAMEDA (Address) CAL IF 94501 banks in this country $ $20,000 (c) That I have other personal property, the reasonable value of which is $ 10,000 (d) That I have stocks and bonds in the amount of $ x , market value, as indicated on attached list which I certify to be true and correct to the best of my knowledge and belief. (e) That I own real estate at valued at $ , with mortgages or other encumbrances there- on amounting to $ (f) That I have life insurance in the sum of $ 20,000 cash surrender value of $ (g) That if self-employed, I attach a copy of my last income tax return or report of commer- cial rating concern which I certify to be true and correct to the best of my knowledge and belief. (See instructions for nature of evidence of net worth to be submitted) 5. That the following persons are dependent upon me for support: (Place a check in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) HOLLY PARTIALLY NAME OF PERSON DEPENDENT DEPENDENT AGE RELATIONSHIP TO ME FEHMIDA AMERICAN nee 34 WIFE FOIA (b)(6) Form I-134 (Rev. 3-1-76)N"
}