{
  "anumber": "A34643000",
  "id": "A34643000_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34643000_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ABANDONMENT BY ALIEN OF STATUS AS LAWFUL PERMANENT RESIDENT, FORM 1-407 ( (Rev. 2-1-75)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "file LOS UNITED STATES DEPARTMENT OF JUST = IMMIGRATION AND NATURALIZATION S CE ABANDONMENT BY ALIEN OF STATUS AS LAWFUL PERMANENT RESIDENT 1. FAMILY NAME (Capital Letters) FIRST NAME MIDDLE NAME FILE NUMBER Hernandez de Lopez, Victoria A34643000 2. LAST PERMANENT ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) Rt. 2, Box 410 Bakersfield, CA 3. DATE OF BIRTH COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP 06-25-14 mexico mexico 4. DATE OF DEPARTURE FROM UNITED STATES NAME OF VESSEL, AIRLINE OR OTHER MEANS PORT OF DEPARTURE FROM OF DEPARTURE approx. march 1977 by can U.S. Calexico, CA 5. IN ENDED PERMANENT ADDRESS ABROAD 6. I VOLUNTARILY Ayenge AM ABANDONING 96 Jalisco HAVE ABANDONED mexico STATUS MY AS LAWFUL PERMANENT RESIDENT OF THE U.S. BECAUSE: Because of my husbands illness I had to return to mexico 7. DATE OF ABANDONMENT OF OF THE STATUS AS LAWFUL PERMANENT RESIDENT U.S. 02-20-80 8. SELECTIVE 10A. SELECTIVE SERVICE BOARD NUMBER AND LOCATION (City, Town and State) SERVICE STATUS 9. MY DEPARTURE OR PRESENCE OUTSIDE THE U.S. IS Vs NOT FOR THE PURPOSE OF AVOIDING OR EVADING SERVICE IN THE ARMED FORCES OF THE UNITED STATES. 10. DOCUMENTS SURRENDERED. (Describe) 1-15/A346431 000 11. SIGNATURE OF ALIEN DATE PLACE Vidoria Hernandez L 02-20-80 Los Angelu, ca FOR GOVERNMENT USE ONLY REMARKS OF IMMIGRATION OR CONSULAR OFFICER: paroled in to visit son DISPOSITION OF DOCUMENTS SURRENDERED: (Record Serial Numbers, Date Destroyed, etc.) 1-151 destroyca SIGNATURE OF IMMIGRATION OR CONSULAR OFFICER TITLE DATE PLACE TO: am DISTRICT DIRECTOR Maroney Los (City) Angeles (State) II ca FOR FILE 2/20/80 Lostangelie, en DATE 2-20-80 FORM 1-407 (Rev. 2-1-75)N"
}