{
  "anumber": "A34636911",
  "id": "A34636911_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34636911_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTAMENTO DE ESTADO CITUDAD DE INMIGRANTE Y REGISTRO DE EXTRANJERO, Form 2-310 ( (Spanish)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (Spanish) Form Approved 2-68 DEPARTAMENTO DE ESTADO Budget Bureau No. 47-R0150 ICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este cuestionario debe llenarse por DUPLICADO a máquina 0, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las preguntas pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sirvase contestar en hojas aparte, por duplicado, indicando los mismos numeros de las preguntas del cuestionario a las que correspondan las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5.00. Estos derechos deben abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda nacional, 0 mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de su enjuiciamiento, deportación, o ambos. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) Cortes Cortes Nicolas. 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name)) NICOLAS CORTEZ CORTEZ 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet (if Roman letters not used) Nicolas Cortes Cortes 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of Birth) Dia (Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Prov. 0 Dpto.) (Province) Pais (Country) 13 Febrero 1915 60 años Acuitzerano Michoacan México. 7. Nacionalidad 8. Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) (Single (never married)) Incluyendo ml matrimonio actual, me he casado veces. Méxicano (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) Campesino Juárez 1792 Zamora, Mich. México. 12. Motivo del viaje a los EE.UU. 13. Nombre completo y domicilio del cónyuge (consignar el apellido de soltera de la esposa) (Purpose in going to the United States) [Name and address of wife/husband (give maiden name of wife) Reunirme can mi Hijo. Ma Dolores Solorio el mismo. 14. Nombres y domicilios de los hijos menores de 21 años 15. La(s) persona(s) nombrada(s) en los numeros 13 y 14 me the me) acom- (Names and addresses of children under 21 years of age) pañará(n) a los Estados Unidos 0 se (no se) reunirá(n) conmigo posterior- mente en dicho país FOIA (b)(6) [Person(s) named in 13 and 14 (will) (will not) accompany or follow me to the United States] Tache to que no corresponda (Cross out words that do not apply) N. P. 16. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanentemente, 17. Puerto de entrada indiquelo) (Intended port of entry) [Length of intended stay (if permanently, so state) ] Indefinido, SAN ISIDRO CALIF. 18. Domicilio que tendrá en los Estados Unidos 19. client pasaju aasta SB GUSGINO mual (Final address in the United States) (Do you have a ticket to final destination?) 256 Hewes ... Orange Cal 926 E.U. Si 20. Nombre, parentesco y domicilio de la persona con quien se reunira en los 21. Nombre domicilio de su fiador (si no es la misma persona 11 orga. Estados Unidos. nización indicada en el número 20.) [Person you intend to join (Give name, address and relationship, if [Name and address of sponsoring person or organization (if different any) ] Hernan Cortes Solorio Mi Hijo el from 20) mismo domicilio 22. Filiacion personal: (Personal description) 23. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Height) 1.65 (Color of hair) Cano. m (ft.) cm. (in.) b) Color de los ojos d) Tez (Complexion) NInguna. (Color of eyes) 417 Verdes Blanca Delgado 24. A esta solicitud se anexan los siguientes documentos: (The following documents are submitted in support of this application) Certificado de nacimiento Certificado de defunción Comprobante de medios económicos propios Certificado(s) médico(s) (Birth certificate) (Death certificate) (Evidence of own assets) (Medical record(s) Certificado(s) de policía Certificado de divorcio Declaracion jurada de manutencion Fotografías (Police certificate(s)) (Divorce decree) (Affidavit of support) (Photographs) Certificado de matrimonio Hoja de servicio militar Oferta de empleo Otros (describanse) (Marriage certificate) (Military record (Offer of employment) [Other (describe) ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}