{
  "anumber": "A34733884",
  "id": "A34733884_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0054/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1975,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 SFR IV 4733884 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HASNOT BEEN PREVIOUSLY IN /-151 # 9273601 DELIVERED 4-13-75 THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) I & NS FILE NUMBER, IF SITLANI NARAINDAS TOLARAM KNOWN ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION 129 ATION PAA 125 SEArd NOT APPLICABLE 30% (Name of vessel or flight no. of arrival) INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT APR131975 ADMITTED 212(e) 212(h) ATTACHED 3 MO.-DAY-YR. Info 212(g) 212(i) COUNTRY F BIRTH OCCUPATION OF BIRTH V30 RESIDENCE 135 COUNTRY of AST MARITAL STATUS EX NATIONAL M W D SEP M 8-30-07 Pakistan Retired F Indian FINAL ADDRESS STREET ADDRESS CITY, STATE. AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 3440, Monroe St., Apt.3, Santa Clara, Calif. 950 041 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN Embassy NP-1 London England FOREIGN STATE/DEPENDENT AREA AT PAKISTAN 258 IMMIGRANT VISA NO. - 2145 ISSUED ON Consul of the United States of America. (Day) 3- APRIL (Month) 1975 (Year) THE VALIDITY OF THIS VISA EXPIRES MIDNIGHTATTHE END OF (Day) (Month) (Year) 2 - AUGUST 1975 PASSPORT NO. J 521823 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO Naraindas T. SITLANI ANTACHED BY Government of India Bombay Tariff Item N SERVICE ON March 31st 1973 Fee Paid $20 Local Cy Equ. S OF AMERICA EXPIRES March 30th 1978 IV 4733884 BC FORM 1-73 FS-511 Joyils 5/14/75"
}