{
  "anumber": "A34733884",
  "id": "A34733884_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Application Form,, N-4-150."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1978,
        2023,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 13. I have have not engaged in business or employment outside the United States since I became a permanent resident of the United States. (if you have engaged therein, briefly describe and show periods of such employment or business activity.) Aleif 14. Since the time became a permanent resident of the United States, I have filed a federal income tax return as a nonresident. Yes No. (if \"Yes\", state the years for which you filed tax return as a nonresident, your address shown in each such return, and the location (city and state) of Internal Revenue Service office where filed.) INgld HEEL 15. Since the time I became a permanent resident of the United States. I have failed to file a federal income tax return with respect to income I earned outside the U.S. because Pregarded myself as a nonresident alien and therefore exempt from tax on such earnings. Yes No. (If \"Yes\". state the years for which you failed to file tax returns for that reason.) KSHLE9 16. X do not intend to return to the United States after my temporary visit abroad. 17. Xan do not intend to retain.my status as a lawful permanent resident. 18. CHECK My Alien Registration Receipt Card is attached. Application Form 1-90 for issuance of Alien Registration Receipt Card is attached. ONE: My Permit to Reenter. which wish to have extended, is attached. 19. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if submitted or applied for that card. should be forwarded to My address as shown in block #1. on reverse. Embassy or Consulate at Q U.S. Immigration and Naturalization Office at Other (Specify) 20. If application is for issuance of a Permit to Reenter execute Block A of Item 20 only. If application is for extension of a Permit to Reenter execute Block B of Item 20 only. If application was completed by other than the applicant, that person must execute Item 21. BLOCK A BLOCK B I D5C do swear (affirm) that I know the contents of this application signed 1 certify that I know the contents of this application signed by me and that the statements herein are true and correct. by me and that the statements herein are true and correct. YORK (Signature of applicant 4 (Signature of applicant) Subscribed and sworn to (affirmed) before me this day of LO. 19 26 federal Playa November 77 Date: (Month) (Day) (Year) at IHWOOCH (SEAL) My commission expires: Catherine Darom /13/22 (Signature of officer administering oath) (Title) 21. SIGNATURE OF PERSON PREPARING FORM. IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Ingid PNCK (Signature) (Address) (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Alien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter 1-151 submitted by alien returned DENIED (See denial notice for reason(s) 1. 11/3/78 AR-103 or AR-3 submitted by alien returned GRA NTED Permit valid to June 18, 1979 achering New 1-151 issued on basis of I-90 Garver Single entry Multiple entries H347331864 Restriction on travel in following countries waived: 0700552 DATE OF 6/20/78 DELIVERY OF PERMIT INITIALS OF EMPLOYEE BY MAIL EFFECTING DEL VERY ACTION kiley TO APPLICANT PERSONALLY OFFICE N.Y.C. OFFICE me EXIENZIO Myc June DATE 22 1978"
}