{
  "anumber": "A34733884",
  "id": "A34733884_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Special Tracer Information, G-14"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 UNITED STATES 9131 DEPARTMENT Special Immigration and Naturalization OF Service RECEIVED JUSTICE check INFORMATION you MAY 2 21978 File Date: No: for ny 344052 C Natuga New 2 M 914 Your assistance in furnishing additional identifying information is requested so that we may act upon or reply to your communication. Please fill in the necessary information and return this letter and any attached material to this office. Your \"A-\" (Alien Registration) No. A34-733-884 No., Any if Other File Known Your Full Name Narain das Tolaram Sitlani Complete Present Address 35 North Way, Chappaqua Address in U.S. at Time of Entry 3440 Monroe St., Santa clara N.Y 10514 califi95051 Birthdate 8/30/1907 Birthplace Pakistan Date of Entry 8/10/1977 Place of Entry New York Airline and Flight Number or Vessel of Arrival Air India 105 Type Residence of Entry Visa, (Temporary Reentry Visitor, Permit, Student, etc.) Permanent Reentry permit Destination in U.S. as Shown on Entry Document 3440 Monroe St, Santa Claia Name Used at Time of Arrival Naraindas Tolaram Sitlani Ca. 95051 Other Names Used at Any Time Please fill in the following if an application or previous correspondence concerning this matter was forwarded to this Service: Type of Application: Date of Application or Correspondence: Your address as shown on application or correspondence: 35 North Address of Service office where application or correspondence was forwarded: Form G-14 26 Federal Plage (Rev. 4-7-72)N NY"
}