{
  "anumber": "A34733884",
  "id": "A34733884_0057",
  "page_index": 57,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0057/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (English) ( (2–68)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1950,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (English) (2-68) Page 4 42. Were you assisted in completing this application? (If answer is Yes, give name and address of person assisting Yes No you indicating whether relative, friend, travel agent, attorney, or other) Name Address Relationship R. N. Sitlani 19, Hamilton Close, Langstone, Hants. P09 1RP (SON) - he typed up the application. DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44 43. I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 41 for the following reasons: Section 212(a)(14) of the Nationality Act for the Not Applicable Statutorily Exempt Attached Not Required 44. I claim to be a NON PAKISTAN preference immigrant subject to the numerical limitation for (foreign state or dependent area) Special immigrant subject to Western Hemisphere numerical limitation Special immigrant not subject to limitation Immediate relative of a United States citizen My claim is based on the following facts: I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this applica- tion have been made by me, including the answers to parts 33 through 42 inclusive, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be probibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to or the control, or overtbrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. sitlam (Signature of Applicant) 3 - APR 1975 Subscribed and sworn to before me this day of 19 at TARIFF ITEM NO. 20 (Consular FEE 0 $5.00 Omoe 0: LO IV. CONSUL OF THE UNITED states OF AMERIDA AT LONDON, ENGLAND"
}