{
  "anumber": "A34733884",
  "id": "A34733884_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, FORM 1-31 ( (Rev. 4-76N)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Mexico",
        "India",
        "United States",
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1907,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 RECEIVED UNITED STATES DEPARTMENT OF JUSTICE Fore approved. Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP OF PERMIT TO REENTER THE UNITED STATES NOV 0-54-80 as provided in section 223 of the Immigration and Nationality Act Natural Immugiation and ization Service NC247880 Use typewriter or print in block letters with ball -point pell. Yesks New issuance I hereby apply for (check one) of Permit to Reenter beliver the United permit States locally extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME Sitlan, NaraindasTolaram IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked Issuance'' above. IN CARE OF C/O Ranjit Sitlani If you checked 'Extension'' you must submit the reentry per- (No. and Street) (Apt. No.) mit you wish to have extended. MAILING ADDRESS (City) 35 North way ALIEN REGISTRATION NUMBER IN U.S. \"Chappaqua\" (State) N.Y 10514 (ZIP Code) A- 34-733-884 FILL IN ITEMS 2 THROUGH 6 ONLY F APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 8/30/1907 Pakistan India Black White HEIGHT 5 FEET O INCHES VISIBLE MARKS AND SCARS Mole on forehead 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF Naraindas Tolarry Sithani BIKATON IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED Seattle 4/13/75 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL Naraindas Tolaram Sitlani New York NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: Pan Am 4/10/79 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD New York NAME OF TRANSPORTATION COMPANY IF Pan Am Jan DEPARTURE IS TO 1980 BE BY VESSEL, About GIVE NAME OF VESSEL One year FILL IN ;TEM 7, ONLY IF APPLICATION is FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT 6/20/78 (City and State) N.Y. IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 11/2/79 9. PRESENT OCCUPATION: Retired NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER 567-35-0326 ARR 10. MAILING ADDRESS ABROAD(Number and Street) (City/Town) (State/Province/District) (Country) 11. Industrial COUNTRIES TO BE VISITED (List country) Assr. Bldg, Apt.B2, Churchgate, each England India Bombay 400 020 India 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): Visit family FORM 1-131 (Rev. 4-1-76)N RECEIVED TRANS IN RET'D-TRANS.OUT COMPLETED OVER 4/24/80"
}