{
  "anumber": "A34733884",
  "id": "A34733884_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Registration Receipt Card Application Form I-90, I-94"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        8500
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 10. I have have not have engaged therein, briefly describe and show periods of such employment or business activity.) engaged in business or employment outside the United States since I became a permanent resident of the United States. (If you 11. Since 1 became a permanent resident of the United States I have such filing return, a return and as the a nonresident location (If such status was claimed by filing an income tax return as a nonresident alien, state the years for which you filed such a return, address shown in or each have not claimed nonresident alien status for Federal income purposes, either by filing no income tax return at all by yourself as a nonresident alien for Federal income tax purposes, state the years for which you did not file 0 return for that reason.) (City and State) of the Internal Revenue Service office with which you filed each such return; if you failed to file an income tax return at your all because you regarded 1184 Ing:- B19 Sirg Elone 11st 12. do do not intend to return to the United States after my temporary visit abroad. 13. do not intend to retain my status as a lawful permanent resident. 14. CHECK My Alien Registration Receipt Card is attached. Application Form 1-90 for issuance of Alien Registration Receipt Card is attached. ONE: My Permit to Reenter. which I wish to have extended, is attached. 15. The Permit to Reenter, if issued or extended, and my Alien Registration Receipt Card if I submitted or applied for that card, should be forwarded to: My address as shown in block #1. on reverse. U.S. Embassy or Consulate at H/53/8 U.S. Immigration and Naturalization Office at Other (Specify) HIC 16. If application is for issuance of a Permit to Reenter execute Block A of Item 17 only. If application is for extension of a Permit to Reenter execute Block B of Item 17 only. If application was completed by other than the applicant, that person must execute Item 18. M.N. BLOCK A 15 BLOCK B I do swear (affirm) that I know the contents of this application signed certify that I know the contents of this application signed by me and that the statements herein are true and correct. by me and that the statements herein are true and correct. 21 flsm x Sillami A.N. 5/54/81 (Signature of applicant) Subscribed and sworn to (affirmed) before me this 9 (Signature of applicant) day of October at n. (Month) (SEAL) My commission expires my the 19 8 and Date: (Day) (Year) #76 4/13/12 Signature of officer administer ing oath) Election *Title) 17. SIGNATURE OF BERSON PREPARING FORM, IF OTHER THAN APPLICANT I declare that this document was prepared by me at the request of the applicant and is based on al information of which have any knowledge. 30.00 IN91 (Signature) (Address) (Date) APPLICANT-DO NOT WRITE BELOW THIS LINE Action with regard to Afien Registration Receipt Card Action with regard to application for issuance or extension of Permit to Reenter 1-151 or 1-551 submitted by alien returned DENIED (See denial notice for reason(s) AR-103 or AR-3 submitted by alien returned GRANTED Permit valid to 1YR From DATE of issue New 1-551 issued A 34 733 on basis of I-90 884 Single entry Multiple entries 10/9/8500 Restriction on travel in following countries waived: vice DATE ACTION OF 10/29/81 SERIAL NO OF PERMIT ISSUED DELIVERY OF PERMIT INITIALS OF EMPLOYEE lection. BY MAIL EFFECTING DELIVERY C SAUA 1254694 TO APPLICANT PERSONALLY LR OFFICE DATE OFFICE NYC 12/15/81"
}