{
  "anumber": "A34733884",
  "id": "A34733884_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes: An Alien who has actually established residence in the United States after having been admitted as an alien is a eligible for tax relief if he meets certain conditions. The form number is N-4-70, and the title is 'Application to Preserve Residence for Naturalization Purposes'."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 is a member by treaty or statute and by which the alien was not employed until after being lawfully having admitted for permanent residence. In order to considering tax return or qualify for such approval the applicant must have ground that he been physically present and residing in the United carefully the States, after being lawfully admitted for permanent and residence, for an uninterrupted period of at least one year. The granting of such approval does not exempt the applicant from the requirement that action, he his residence he be physically present in the United States for in the lost his at least one-half of the period of residence re- immigrant status and naturalization laws quired for naturalization except in the case of As he may be ineligible for visa or those persons who are employed by, or under for which lawful permanent resi- contract with, the Government of the United States; eligible, he may be inadmissible to those persons who are authorized to perform the States if he seeks admission as a return- ministerial or priestly functions of a religious de- and he may become ineligible for nomination having a bona fide organization within on the basis of his original entry or the United States, and those persons who are en- an immigrant gaged solely by a religious denomination or by an interdenominational mission organization having a The validity of a permit may, on bona fide organization within the United States as shown be extended for a period or a missionary, brother, nun, or sister. Such approval exceeding one year from the original should be applied for on Form N-470, \"Application to Preserve Residence for Naturalization Purposes extension must (under section 316 (b) or 317, Immigration and shown on this Nationality Act)\" available at any office of the submitted not more than Immigration and Naturalization Service. expiration date It must to be received by Aliens who are absent in connection with or for prior to the purpose of performing the ministerial or priestly functions of a religious denomination having a bona made fide organization in the United States, or who are on form of Permit to Beenter engaged by such a denomination or an interdenomi- national mission organization having a bona fide must be accompanied by the specified in the organization within the United States, as a mission- ary, brother, nun, or sister, are also eligible to make such application. Such aliens may acquire the re- be obtained from quired one year of uninterrupted physical presence Page 2 or from the office of after the absence. Naturalization Service having place in which the applicant is EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- abroad It may also be TUS FOR FEDERAL INCOME TAX PURPOSES: An States consular offices alien who has actually established residence in the or United States after having been admitted as an immigrant 16 embarking"
}