{
	"anumber": "A34733884",
	"id": "A34733884_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34733884_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Effect of Claim to Nonresident Alien Status for Federal Income Tax Purposes: An Alien who has actually established residence in the United States after having been admitted as an immigrant or alien with approved status to that of a nonresident alien tax return on the ground that no resident alien should consider carefully the consequences under the immigration and naturalization laws if he does so."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by O 10/2023 is a member by treaty or statute and by which the immigrant or after that alien was not employed until after being lawfully of an immigrani, filing admitted for permanent residence. In order to of a nonresident noir-filing qualify for such approval the applicant must have of a tax return been physically present and residing in the United alien, should States, after being lawfully admitted for permanent under the residence, for an uninterrupted period of at least does so one year. The granting of such approval does not If an exempt the applicant from the requirement that as having he be physically present in the United States for States and at least one-half of the period of residence re- quired for naturalization except in the case of those persons who are employed by, or under other contract with, the Government of the United States; vent alien those persons who are authorized to perform the five United States ministerial or priestly functions of a religious de- ng resident naturalization nomination having a bona fide organization within adjustment the United States, and those persons who are en- gaged solely by a religious denomination or by an EXTENSIONS interdenominational mission organization having a good cause bona fide organization within the United States as periods not a missionary, brother, nun, or sister. Such approval expiration date should be applied for on Form N-470, \"Application Application for to Preserve Residence for Naturalization Purposes the expiration (under section 316 (b) or 317, Immigration and application should be Nationality Act)\" available at any office of the days prior to the Immigration and Naturalization Service. submitted se authorized 10 adi Aliens who are absent in connection with or for the permit's validity the purpose of performing the ministerial or priestly functions of a religious denomination having a bona The application fide organization in the United States, or who are Application engaged by such a denomination or an interdenomi- United States national mission organization having a bona fide permit and Form organization within the United States, as a mission- ary, brother, nun, or sister, are also eligible to make such application. Such aliens may acquire the re- quired one year of uninterrupted physical presence after the absence. EFFECT OF CLAIM TO NONRESIDENT ALIEN STA- TUS FOR FEDERAL INCOME TAX PURPOSES: An alien who has actually established residence in the United States after having been admitted as an 16"
}
