{
	"anumber": "A35145366",
	"id": "A35145366_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0014/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 STATE OF CALIFORNIA AFFIDAVIT OF SUPPORT COUNTY OF ORANGE Santa Ana, California 1 We, ROBERT C. McCAFFERTY and LAURA ARGELIA PONCE DE 2 McCAFFERTY, Being duly sworn according to the law depose 3 and say the following 4 1. That we reside at 4782 Via De La Luna, Yorba Linda, 5 California, USA. 6 2. That I, (husband) am an American Citizen dee to the 7 fact that I was born in Pittsburgh, Penn. And that I, 8 (wife) was admitted into the United States of America as 9 a permanent resident on 4-21-72 at Eagle Pass, Texas. 10 Alien no. is A FOIA (b)(6) reg. 11 3. That I, (husband) am employed by Autonetics Division 12 at 3370 Miraloma Ave. Anaheim, Calif. and have a monthly 13 earning of $1441.00. 14 4. That the aliens to be sponsered are (wife's) mother 15 and father; MANUEL PONCE DURON and SOLEDAD VALDES DE 16 PONCE, who reside at Col. Zaragoza 2142, Nueva Rosita, 17 Coah, Mexico. That we agree to assume complete financial 18 well being of said name aliens should they be admitted 19 into the United States of America as Permanent Residents. 20 5. That this affidavit is made by us for the purpose of assisting the American Consulate in determing that should they be admitted into the United States of America they will at no time become a public charge upon any community nor to this government. 25 6. That we, ROBERT C. McCAFFERTY and LAURA ARGELIA 9-9 26 PONCE de McCAFFERTY, are willing and able to receive, 27 maintain and support these said name aliens should they be 28 admitted into the United States of America as Permanent 8 #29 Residents, and do hereby guarantee that they will at no 30 time become a public charge upon any community nor will they become a public charge to this government. Rowerlocker Robert C. McCafferty faur Laura Argelia Ponce de McCafferty,"
}
