{
	"anumber": "A35145366",
	"id": "A35145366_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "VERIFICATION OF ALIEN LAWFUL PERMANENT RESIDENCE, FORM 1-550 ( (REV.6-1-69)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1913, 1972, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OR JUSTICE FORM APPROVED, IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 APPLICA JN. . VERIFICATION OF FEE STAMP LAWFUL PERMANENT RESIDENCE OF AN ALIEN CONSULATE Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, UNITED SEP STATES GENERAL OF OF THE request that the American Consul at MONTERREY, NUEVO [MONTERAL E xico be furnished 15 197AMERICA I a verification of my lawful admission into the United States for permanent residence to be used in connection with the person(s) listed MEXA under item 15. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: MCCAFFERTY LAURA ARGELIA A FOIA (b)(6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 513 W. CenteR ST, AP 73 PLACENTIA CA 5. FATHER'S NAME: 72670 6. MY PLACE August OF BIRTH WAS: (City) (Country) 24,1939 MANUEL PONCE DURAN n.Rosita , COAH. MEXICO 7. MOTHER'S MAIDEN NAME: CARLOTA GARCIA LUNA 8.1 AM NOW A CITIZEN OF: (Country) MEXICO 13:60 new INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. PORT OF ARRIVAL: McCAFFERTY, LAURA ARGELIA PONCE DE EAGLE PASS Texas 11. DATE OF ARRIVAL: (Month) (Day) (Year) 12. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No., etc.) APRiL 1972 CAR 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOMIWAS DESTINED: 14. AT THE TIME OF LAST LAWFUL ADMISSION TO THE U.S. I ENTERED WITH ROBERT e. M-CAFFERTY AN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD 1050 #1 N. BRADFORD Ave A PERMIT TO REENTER OTHER (EXPLAIN) PLACENTIA, CA, 92670 AND NOT UNITED STATES SINCE P's HAVE BEEN married ABSENT FROM THE Plurs 5. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH 28 you MANUEL PONCE DURON Nov. 9, 1913., NAVA, COAHUILA, Mexico RELATIONSHIP ADDRESS FATHER COLONIA ZARA 602A#2142 Nueva Rosita ,COAH. mexico FUDL NAME DATE AND PLACE OF BIRTH SOLEDAD VALDEZ GAONA DE PONCE MARCH 15, 1912 RANCHO ELCRISTAL, Cohn RELATIONSHIP ADDRESS Step MOTHER COLONIA ZARAGOZA # 2142 Nueva Rosita, COAH. Mexico FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that the subject named above was was not lawfully admitted for permanent residence as shown. Lauran Q.MECapforty Visu issued on 4-18-72 Insert symbol for entries after 6/30/24. IR-1 LAWFUL ADMISSION INS Office: has langely Caly Date: Contact Verifier: USINS Representative. VERIFIED 9-5-72 FORM I-550 (REV. 6-1-69)"
}
