{
  "anumber": "A35145366",
  "id": "A35145366_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificado, N. 3/4"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1584
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 R + n' 214-al margin-Cata dascientos leatures Defruision Resecuritos de freed de Lean leatificade 189. leative Juan w Sabinos Eds. w se opens Rasita Jusiodicion za Scinda las 10 haves all dea 2 de Dad de laffauti mi Praf E lises K. inverts Rain's alamy all Register Quil camp excess de they surceits pasal Dr. Daniel Ji of presents undersign prevently elazed can Registra in la numero de leidule de is Direcion Senerally Securities asistencia f6409g decides 30882 ini que ispane que allow 8 P.M haras del dis 29 de nov. fadhicio a concernence w Sincept leardroce Respiratories surante una u hear casado de 43 awas in dad, absers, can intermenian givens fice al Sr. Gaalas Das guig Vas ofing e Isidos de que minin m ilhuals high daminilis end S.L.P. la leal January 1584, del any A. de E Deadowed Sera inhurnado en face camino in la presente acts frision interest ce withing de este self areate agi but Induss anals feminan can Rubricas cial Seguirds we Regists level EL a LIC. JAVIER CORDERO MARTINEZ, OFICIAL PRIMERO ENCARGADO DEL TE, Y SOBERANO DE COAHUILA DE ZARAGOZA, BE LA LIBRE OFICIALIA MAYOR DE LA SECRETARIA GENERAL DE GOBIERNO DEL ESTADO INDEPENDIEN DESPACH la vista y el cual obra en el Archivo General de este Gobierno, en el Libro No. CERTIFICA.- Que la presente copia fotostatica concuerda fielmente cen su original que tuve a de Copias de Actas de DEFUNCIONES IV Tomo, I Nva. Rosita, Coah. de la Oficialia 2a. a foja (s) No. 173 y 174 del Registro Civil de al año de 1957 pil novecientos cinsuenta y siete. correspondiente UNIVERSITY SUFRAGIO EFECTIVO. NO REELECCION Saltillo, Cash, 30 de Sep. 19 74 ESTADO DE COAHUILA DE ZARAGOZA awes nolis ints FODER EJECUTIVO"
}