{
	"anumber": "A35145366",
	"id": "A35145366_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Necesidad de una Reforma Jurídica, No. 12, y. 4. 93"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 CORDERO OFICIAL ETARIA GENERAL DE DE ZARAGOZA, copia fotostatica concuerda Color obra on el Archivo Genaral de este Gobierno, en el litro No. UNQ Tomo. I NACIMIENTOS UNICA Adas de da la Oficialia clal Registra Civil els NUN. ROSITA GOAH. a foin (s) No. 112 y 113 corresponsiente 1925 MIL INSUEGIENTBS MEINTECINCO SUFRAGIO EFECTIVO, NO REFLECCION 29 Sabilia, Cock which enero 75 is W ZARAGOZA allex aderients. EXECUTIVO June it: 402 Onel mineral de ecion Nz Jan Jivan ideasina Distrito de menclova estado in't boahmbe ; do Zaragaza a too sinsente gingers dies delmas de seviembia del ano de 1925mil no. E cients vinte do civil E Foregun Royes comparscin EPE. Jeans if cinco ij a 13trees hurras els boy unt elmay deferta Pones te 45 senarchta, cinco anon ele s dad formalsno ennade eivilmente originois d Romes Urisps esta do de boahuila of verim de st began have has 30treinta amo depressint vivo am mino explanion do; que en high legition sugo jiha do en In er/po Vatenting Duran do strein tarjocho ares dieded originance ds Romas arisps cauhuita after rus def dia deldin 9 move de del Free Chava Crein by is have hornous the diamine Genine spice and charle. - I Virrantin Lonor z Pelipe Vacinino Ambis in A maternis son hermonegitah Punzon zing maria ds Jeins ins squirrs am his finades fl exponents ago lecreste acto in is conform can An continuito n press year de his tist manuel Cigns 66 Refugio Rivas excede form alongic Epinisto him limes carado femaloro Ambos monores de educy visims x eath I may i has we iron of if Registro bivil E Exey will Rights Rebugin its a to Diagni Ferns Price"
}
