{
	"anumber": "A35145366",
	"id": "A35145366_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 LOS IV 5145366 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS HASNOT BEEN PREVIOUSLY IN I 151 NO 9054402 Delivered MAR 22 1975 THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) 1& NS FILE NUMBER IF PONCE-DURON, MANUEL KNOW.N ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION U. S. IMMIGRATION TOLLI KIDGE EAGLE PASS, TX. EGP 144 774 144 EGP 4457 NOT APPLICABLE (Name of vessel or flight no. of arrival) MAR 221115 INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT 212(e) 212(h) ADMITTE ATTACHED 3 (CLASS) 212(g) 212(i) UNTIL MO DAY YY COUNTRY OF BIRTH OCCUPATION COUNTRY LAST MARITAL STATUS SEX NAT ONALITY OF BIRTH Servica RESIDENCE 11-09-13 Chauffer System S W D SEP M F ME ICAN INAL ADDRESS STREET ADDRESS CITY. STATE. AND ZIP CODE. IF AVAILABLE IN THE UNITED 4782 Via de la Luna. Yorva Linda, Calif. STATES 041 ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. Y 9 This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CONSULATE GENERAL CLASSIFICATION SYMBOL AMERICAN SA-1 005 MONTERREY, N. L., MEXICO FOREIGN STATE/DEPENDENT AREA AT WESTERN HEMISPHERE George IMMIGRANT VISA NO. Vice Consul Jr 1335 ISSUED ON (Day) (Month) (Year) of the United States of America. JAN 31 1975 THE VALIDITY OF THISVISA EXPIRES MIDNIGHTATTHE END OF (Day) (Month) (Year) MAY 30 1975 PASSPORT NO. 7206/74 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED PHOTOGRAPH TO Soledad Valdes de Ponce to OREIGN BY Coahuila State Passport Office UNITED STATES SE ON Tariff Item No. 21 October 2, 1974 mnc Fee Paid $20 EXPIRES Local Cy Equiv October 1, 1975 IV 5145366 FORM FS-511 1.73"
}
