{
  "anumber": "A35145366",
  "id": "A35145366_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35145366_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Al margen: Un serello em al escudo nacional guadice. 'Presidencia Municipal San Juan de Salinas, Cuy.', C. 14 y. 4. / Cintos eua- renta yius."
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 Act n 41 Alwargen Un sells can al esceeds nacional que dice: Cuinto eua \"Presidencing municipal fan Jusan de Solimain Cz renta y ins. M-' 141 cients eurosenta years. Legalign cim all A Inancel Pauce Deeining la fra de Sabinas: Saledad Valdez Issons al centro Kan it mineral de Sakinos Grode Coahwila de zzorogoga, spends gives Rosita, Quesisdission de Ann Juan has 20 Hs. del aia 13a november de, ignorate too Civil, campaserium conel fin de univer in mi b. Vistor heyes M. Ofinial Segunds del Regis matrimonised Ar. manuel Sauce y la Son Selected Valdey Isaona- Elpriness es me Viegus, de 47 miss all edad, winds, absens, origina xis weirs de iste lugar, caw damicilio in cals. nia garagoga #2142 higs legitiessdel Ar. Jese's Pause doguetys yea from Valencha Seemon, author finston ha Regunda ea mejicans, de 46 aus de edad, winda, profesors de masia, originain de La Rodada, Carhuisha y vecina de iste lugar, can domicilis in cals. nia findep endencia 172 higa legitimaded dr. famael Valdey Flored years ma. free Gaona Pleases, ambor fruits campaseen como testifies los b. b. Jesin E. Ruin roga R., Refael Floses Toon, Jesses agrical e, Sevenians contained maldoneds, mylicanse evagoned de isad y de into vecinded, la que protection en legal-forms, haciendales washe remarken que increased conducen can folcessed ante no autori dad, manifestands que no hey impediments legalalgums pasa celebrated este restriction for sandrer personalmente a los canter yentis- El pusexits interrogana Lovepetite gents sies Au volunted uncase in el uno can el atso bajo it ligimen Canyugal, conforme a los capitulacimes we trimunialed que tienes presentaden cantes tands ambon from afraination. ynro halients impidiments come selfe."
}