{
	"anumber": "A35550903",
	"id": "A35550903_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35550903_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, I-550 ( (REV. 7-1-70)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE FORM APPROVED. IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO 43-R0368 APPLICATION FOR VERIFICATION OF FEE STAMP LAWFUL PERMANENT RESIDENCE AMERICAN CONSULATE GENERAL OF AN ALIEN Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, DEC 26 1973 In connection with immigrant visa application(s) of my relative(s) listed in item 15 below, I request that the American Consul at Guadalajara, Jalisco, Mexico. be furnished a lawfol admission into the United States for UAD MEXICO (City and Country abroad) permanent residence. I have read and fully understand the instructions appearing on the reverse of this form concerning the desirability of attaching documentary evidence to prove relationship if the immigrant visa applicant is my parent, spouse, or unmarried child under the age of 21 years. 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: MORIN Leticia Galvez A FOIA (b)(6) 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 814 Spring St., San Jose, California, 95110 03-29-39 5. MY FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) Crecenciano Galvez Sapotitan de Hidalgo, Jal. Mexir 7. MY MOTHER'S FULL MAIDEN NAME: 8. I AM NOW A CITIZEN OF: (Country) in Amelia Mejia Mexico INFORMATION IN THESE BLOCKS PERTAINS TO MY ADMISSION INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME USED WHEN ADMITTED FOR PERMANENT RESIDENCE (Last) (First) (Middle) 10. MY U.S. PORT OF ARRIVAL WAS: MORIN Leticia Galvez San Ysidro, California. 11. MY DATE OF ARRIVAL WAS: (Month) (Day) (Year) AND THE MEANS OF ARRIVAL WAS: (Show Name of Vessel or Airline and Flight No., etc.) 01-28-59 automobile 12. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: Apolinar Morin (husband) Santa Maria, California 13. I first obtained an immigrant visa at a United States consular office abroad on 01-28-59 at Tijuana At that (date) (location) time, I was was not married. 14. Including my present marriage I have been married one times. The name of my present spouse is: Apolinar Morin to whom I was married on 09-14-58 at Sapotitan, Jalisco, Mexico. If married more than one time, list below (date) (location) names of previous spouse(s) and places and dates of marriage and explain how marriage(s) were terminated: 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH Sapotitan de Hidalgo Jalisco, Crecenciano GALVEZ Ramirez 09-14-09, Mexico, RELATIONSHIP ADDRESS father 5 de Mayo 47, Sapotitan de Hidalgo, Jalisco, Mexico. FULL NAME DATE AND PLACE OF BIRTH Sapotitan de Hidalgo, Jalisco, Amelia Mejia GALVEZ 02-23-14, Mexico. RELATIONSHIP ADDRESS Mother 5 de Mayo 47, Sapotitan de Hidalgo, Jalisco, Mexico. FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS 16. FULL SIGNATURE OF APPLICANT AS NOW USED Lelicia morn FORM I-550 (REV. 7-1-70)Y LOS"
}
