{
  "anumber": "A35550903",
  "id": "A35550903_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35550903_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICA QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CIVIL DE ZAPOTITAN DE HIDALGO JALISCO."
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1438
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 POOR EXECUTIVO DE OFFICE EL C. LICENCIADO OSCAR IBARRA RENTERIA SUB/SRCRETARIO GENERAL DE GOBIERNO CERTIFICA QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CIVIL DE ZAPOTITAN DE HIDALGO JALISCO. JALISCO CORRESPONDIENTE AL AÑO DE MIL NOVECIENTOS TREINTA Y OCHO A FOJAS UNO VUELTA Y BAJO EL NUMERO UNO SECRETARIA GENERAL CONSTA UNA PARTIDA DE MATRIMONIO QUE TEXTUALMENTE DICE DE \"al manger / theme Presenciance GOBIERNO lia 'Mejiana Peritras Hidalyn, a 2 dos de margo de 1438 mil novecientos treinta y acho a has 13 trese horas 0 DELO mi nutos, ante mi, Aures' Flores, Comisario municipal eneargado del Registro Civil, de eate lugar, comparecis presenciant Galveg, soltero labra don de 29 veintinue amas de edad, original sidy verino de este lugar, can domicilis en una seen de este miami lugar donde no? hay momenclatura, hijo de Rosalis Galvez, la lerador y de Silvestra Ramirez que vivero, yj ame lia mejia, iciline de 24 amos originaria you need na de eate misson lugar sin profecious, hair legitime de g. mejia y de maria Refugio Macias que river err este misms begar. ambas radiearanie eate lugar, sociale raga mestiga estolicas, mexiconos, quierces manifectaron aw soluntad de unirse en matemonis, optands concents y deliveradamente passel regimen de Socidad legal. Los interesados sumpliers sow todos los mandatos de ley, se cumplis can ls orderiads en el artisule die Codings Civil, some couste in el expediente relative as este matrimonis marands can el incomes de what que abra archino a suyas documentis se les dis lectura in presencia de los interesados y testigos y 1075 410 haliendrae demuncia impediments al i MEDICAL SECURITY & guns, cl eneargads del Registra Civil gue subscribe declaro' invides in matrims nio in nombre de la Sociedad y de BarLey PARA CERTIFICADOS a Presenciano Galving y a amelia myja, DEL REGISTRO CIVIL guienis imprimieron digital al mar VALOR $ 20 00 son los testinos are presenciasion este gen de esta acta y fueron identified"
}