{
  "anumber": "A35550903",
  "id": "A35550903_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35550903_0014/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, FOIA (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1967,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 AFFIDAVIT OF SUPPORT State of California SS County of Los Angeles I, ROSALIO GALVEZ MEJIA , residing at 2820 Delevan Dr., Los Angeles, Calif. 90065 BEING FIRST DULY SWORN, DEPOSE AND SAY That I am a citizen of MEXICO born at Zapotitan, , Jalisco, Mexico on Nov. 24, 1939.- I am married to Soledad Galvez citizen of Mexico and legal permanent resident of U.S.A. That I am 37 years of age and have resided in the United States since Jan. 12, 1967 when I was admitted as a legal permanent resident at port FOIA (b)(6) of San Ysidro, Calif. as per alien card No. A THAT it is my intention and desire to have the following person (s) at present residing at Zapotitan, Mexico come to the United States. as legal permanent residents. Country Relationship Name Sex Age of Birth to deponent Amelia Mejia de Galvez F 62 Mexico Mother FOIA (b)(6) THAT I am employed or engaged in the business of Spot welding Mole-Richardson Co. with Hollywood, Calif. at and derive a net annual Income of $ 8,824.00 Plus my wife's net annual income 7,190.00 Total of $ 16,014.00 THAT I have deposits in Banks in this country $ Guadalajara, Mexico & THAT I own Real Estate at Los Angeles, Calif. valued at $ 35,000.00 App. with mortgages or other enoumbrances amounting $ 16,000.00 App. THAT I have other personal property with a reasonable value of $ 8,500.00 App.with encumbrances amounting $ --- o - THAT I have Life Insurance in the sum of $ 5,000.00 with cash surrender value of $ None THAT the following persons are dependent upon me for support Jointly my wife, we support our two children. THAT I am willing and able to receive, maintain and support the prospective immigrants listed above. That I am ready and willing"
}