{
  "anumber": "A35622626",
  "id": "A35622626_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35622626_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATA, Nº 102"
    },
    "years": {
      "ms_years_nlp_v1": [
        2024,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "53 EL C LICENCIADO creened by NARA 5/10/2024 SECURITY Silvo UNIDOSMENL DEL CHAO SALVADOR MUNOZPEREZ OFICIAL MAYOR DE I.A SECRETARTA GENERAT DE CERTIFICA QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CML DE ION DE TULA. JALISCO. CORRESPONDIENTE AL ANO DE JALISCO MIL NOVECIENTOS SETENTA A FOJAS Y CUARENTA YS EIS FRINTE. DOS. Y BAJO 46 UNO. SECRETARIA GENERAL CONSTA PARTIDA MATRIMONIO, DE En The UNA EL/NUMERO DE , NOVENTA de Y Jula QUE TEXTUALMENTE DICE GOBIERNO Jalisco. a Lro 21 minitim diss del was de ACTA No. 91 Governi de 1972 mil novecientos setenta y doo a las 17 discussite horas ante mi. Dadoo Watniconco Dastillauor Rables Oficial del Registro Civil de este lugar de: Joil Valle comparecieron Ele Jose Valle Basutto, pattern, easues Banjas Calex Vasutli & Juana ciante words de 61 securite years años, originario de Ta Perrula di isto EL summeries. y vecino de con domicilio, en calle Deceive Leon will 44 hijo de Eliciano Valle y de Passuala Basutto finades con domicilio en y Suana Barajas Column no sattern, de 42 wancata I droduces de idad de Ocupasiones doministics originaria de To Signa de ut bepin vecina con de domicilio esta en Calle Pollocion Evens Leon Give 44 hija de somas Borajas y de Maria Columendos finade con ambos contrayentes radicarán en uta misma Pollecion locations domicilio en Catalicos & mexicanos quienes manifestaron su voluntad de unifse en-matrimonio. optando consciente y deli- beradamente por el régimen de steeded Legal. Los interesados cumplieron con todos los mandatos de ley. como consta en el expediente MEREGIST cressions relativo y no habiéndose denunciado impedimiento alguno, el suscrito Oficial del Registro Civil declaró unidos matrimonie en nombre de la Sociedad y de la Ley, a Barajos los señores lose Valle Basulto 4 Juana Calmerors quienes imprimieron su huella digital al margen de esta acta y fue Raing plades Real Gable Posalia Bibian Goney Glays essed employer FOTD identificados por los señores Goberto levers Vilagging satters Canal, end- Fail ) poblacism few le few la presents actor lupal mayorous I le edad can domicidio in ista la ratificancy conforme firman pale pilion AGO. PAGAB 19 1978 STARS Jose Valle Rosulta Rosalis Qeeecead alays PARA CERTIFICADOS DEL REGISTRO CIVIL o VALOR $ 20 00"
}