{
  "anumber": "A35938326",
  "id": "A35938326_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A35938326_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICA QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CIVIL DE JALOSTITLAN JALISCO, 54272"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 3 : EL C LICENCIADO SALVADOR MUNOZ PEREZ OFICIAL MAYOR DE LA ELECTIVIVO DEL SECRETARIA GENERAL DE GOBIERNO POOR OFFICE CERTIFICA QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CIVIL DE JALOSTOTITIAN JALISCO CORRESPONDIENTE AL ANO DE MIL NOVECIENTOS TRECE.- JALISCO A FOJAS CI NCUENTA Y CUA TRO VUELTA - Y. BAJO EL NUMERO DOSCIENTOS CUARENTA Y OCHO.- SECRETARIA GENERAL CONSTA UNA PARTIDA DE NACIMIENTO. QUE TEXTUALMENTE DICE DE IMPRESIO N GOBIERNO XEROGRAFICA Mc. mmero 248 la much who = Danija En a' love 9 move manang 12. due gelles di 1910 mil tree anto m J than Always, President Many Municipal Emongado Responsibility com omo de San an dys. are ager, a de ta lands macro in Microlis Renny casado, d3 trunta anis de edad I The logic of mino gate noo, if se ttamaia Abundio Canny's w by light in 5i quick legan j de su ilin weres de r rentionation anno matumo de edad ambs Quide Hanson I m s Maydelana Inc. de 64 scunta oz water, anis, g. Tominio Ting de 56 cinementa Jarge of Malandad Jammy green belign Annelma of unto, seis ams de idad amby gameless g memo de again Luida June are before ta p. Et form opin 1no urman feer = infrado P g Please GUADATAJARA JALISCO DIEZ DE AGOSTO DE MIL NOVECIENTOS SETENTA Y SEIS. STATEMENT & ESTADOS GENERAL UNIVERSITY SCHOOL DE MAISCO of PAGABE and 1976 ESTABE PARA CERTIFICADOS DEL REGISTRO CIVIL o VALOR $ 20 00"
}