{
	"anumber": "A36154648",
	"id": "A36154648_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36154648_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration,, FS-511"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "LOS IV36154648 UNITED STATES OF AMERICA THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION HAS My/2 XHAS NOT BEEN PREVIOUSLY IN I-BIST No. 9261473 Mailed 04 MAY-1977 THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) USA I & NS FILE NUMBER, IF HO (YUEN) WAI-FONG KNOWN ACTION BY IMMIGRANT INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC. 212(a)(14) STATES VIA LABOR CERTIFICATION U.S. IMMIGRATION 170 170 635 CIOOP NOT APPLICABLE (Name of vessel or flight no. of arrival) APR 161977 INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATUTORILY EXEMPT ADMITTED IRS 3 212(e) 212(h) ATTACHED UNTIL (CLASS) 212(g) 212(i) MO.-DAY-YR. 2015 NOT REQUIRED COUNTRY of BIRTH OCCUPATION COUNTRY OF LAST MARITAL STATUS SEX IONALITY OF BIRTH RESIDENCE M W D SEP 08-05-11 China Housewife X F Chinese FINAL ADDRESS STREET ADDRESS CITY, STATE, AND ZIP CODE IF AVAILABLE IN THE UNITED STATES 813 E C Acacia Ave. Glendale, Ca. 91205 04C ACTION OF S.I.O. ACTION ON APPEAL U.S.P.H.S. c/o Kathy King This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION 24 CLASSIFICATION SYMBOL AMERICAN Embassy IR-5 000 FOREIGN STATE/OTHER AREA LIMITATION AT Taipei, Taiwan theaty IMMIGRANT VISA NO. --351-- R. R. Rodgers ISSUED ON (Day) (Month) (Year) Vice Consul of the United States of America. 28th Dec 1976 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 27th Apr 1977 PASSPORT NO. (65) MFA 675425 OR OTHER TRAVEL DOCUMENTS (Describe) PHOTOGR ATTACHED ISSUED TO KINICE HO, WAI-FONG BY Ministry of Foreign Affairs UNITED STATES OF AMERICA Taipei, Taiwan ON Tariff Item No. 21 Aug 28 76 Fee Paid $20 EXPIRES Local Cy Equiv Aug 28 79 IV36154648 FORM 1 73 FS-511"
}
