{
  "anumber": "A36155773",
  "id": "A36155773_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36155773_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GRANT DEED, 970"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1974,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 970 CORDING REQUESTED BY ex06377pc5 RECORDED AT THE REQUEST OF GALIF. LAND TITLE CO. AND WHEN RECORDED MAIL TO RECORDED IN OFFICIAL RECORDS OF LOS ANGELES COUNTY, CA Name Mr. & Mrs. Tsai 19138 Martha AUG 12 1974 AT 8 A.M. Street Address City Cerritos, California Recorder's Office State Zip SPACE ABOVE THIS LINE FOR RECORDER'S USE MAIL TAX STATEMENTS TO DOCUMENTARY TRANSFER TAX $ 15.95 Name FE COMPUTED ON FULL VALUE OF PROPERTY CONVEYED. Street Address Same as above x OR COMPUTED ON FULL VALUE LESS LIENS AND $ City ENCUMBRANCES REMAINING AT TIME OF SALE C State Zip S.MeClaim for ge Real estate Shopp Signature of Declarant or Agent determining tax. Firm Name TRANSFER TAX $ GRANT DEED (Escrow No. 1343 ) By this instrument dated July 22, 1974 for a valuable consideration, CLETUS E. PIERCE and BARBARA A. PIERCE, husband and wife hereby GRANTS to SHIH-ING TSAI and BETTY K. TSAI, husband and wife as joint tenants the following described Real Property in the State of California, County of Los Angeles City of Cerritos Lot 37 of Tract No. 30826, as per map recorded in Book 800, Pages 28 and 29, inclusive of Maps, in the office of the County Recorder of said County. LEVAL OFFICIAL SEAL NAN L. WILSON NOTARY PUBLIC CALIFORNIA PRINCIPAL OFFICE IN ORANGE COUNTY Cletus E. Pierce My Commission Expires Oct. 12, 1976 Barbara Q.Pierce Barbara A. Pierce STATE OF CALIFORNIA On July 24 , 1974 before me, the undersigned, a Notary Public in and for said COUNTY OF Orange SS. County and State, personally appeared Cletus Pearce and Berbara a Pierce known to me to be the person S whose name S are subscribed to the within /instrument, and acknowledged to me that they executed Notary's Signature Ran L. Walson the same. - OFFICIAL SEAL NAN L. WILSON NOTARY PUBLIC CALIFORNIA PRINCIPAL OFFICE IN ORANGE COUNTY - My Commission 12, MAIL TAX STATEMENTS AS DIRECTED ABOVE 41710280-14"
}