{
	"anumber": "A36154620",
	"id": "A36154620_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36154620_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "Japan", "United States", "China"]
		},
		"years": {
			"ms_years_nlp_v1": [1899, 1975, 1942, 1914, 2023, 1926, 1933, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. 7/14/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form approved OMB No. 43-RC401 Date filed Fee stamp PETITION TO CLASSIFY STATUS OF LIEN RELATIVE FOR 6-12-75 ISSUANCE OF IMMIGRANT VISA JUL 28 1975 TO THE SECRETARY OF STATE: The petition was filed on 6-12-75 Remarks The petition is approved for status under section: U.S. APPROVED INS. SPOUSE, 201 (b) CHILD 203 (a) (2) DATE NOV 7 1975 OF ACTION Surea AMERICAN CONSULAR SECTION TAIPEL TAIWAN ENTRASSY 201 (b) PARENT 203 (a) (4) DD 203 (a) (1) 203 (a) (5) DISTRICT LOS ANGELES, CALIF. NOV 25 1975 (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) RECEIVED The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. Block 1. Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) (Middle) 3. Do Not Write in This Space 4. Relationship of beneficiary to petitioner Mother CHU LING CHIH 6. Are beneficiary and petitioner related by adoption? 5. Other names used; (including maiden name if married woman) No 9. Beneficiary's marital status: 7. Place of birth (Country) 8. Date of birth (Month, day, year) Japan China Married Widowed Divorced Single Mar 25, 1914 12. Has this beneficiary ever been in the U.S.? 10. Petitioner's name (Last, in CAPS) (First) (Middle) 11. Petitioner's phone Quan Emily Shen 714-992-2443 Yes No 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) Shen Ko Chung, Mar 20, 1899, in China 14. Names, birthdates and countries of birth of beneficiary's children, if any Shen Ching Wu, Apr 28, 1926, Shen Yu HUL May 7, Shen Lin Wu, Shen Li Wu, Dec 21, 1933, Shen Ning Hua, Sep 14, 19950 Shen Shun wu, Aug 16, 1940, Shen Yi Hua, Mar 1, 1942, in China 15. Full addressiof beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Shen Ching wu, Shen Li wu Shen Shun Wu in 14 Lane 16, Wenchow St., Taipei, Taiwan, Republic of China Shen Ning Hua and Shen Yi Hua in USA, Shen Yu Hua and Shen Lin Wu in People 16. If this petition is for your spouse or child, give the following: Republic of China a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse d. Last address at which you and your spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) 17. If this petition is for a child, (a). Is the child married? (b). Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, se state. 18. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner. 20. Have ever a before? you Ko filed China for this alien Shen No If so, give place and date of filing and result. FORM I-130 RECEIVED TRANS IN RET'D-TRANS OUT COMPLETED (REV. 2-1-74) Y My"
}
