{
	"anumber": "A36176268",
	"id": "A36176268_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36176268_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR VERIFICATION OF LAWFUL PERMANENT RESIDENCE OF AN ALIEN, FORM 1550 ( (REV. 6-1-69)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 1917, 1962, 1922]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE NARA. FORM APPROVED, IMMIGRATION AND NATURALIZATION SERVICE BUDGET BUREAU NO. 43-R0368 APPLICATION FOR VERIFICATION OF FEE STAMP LAWFIJL PERMANENT RESIDENCE No OF N ALIEN Take or mail to- AMERICAN CONSULATE GENERAL IMMIGRATION AND NATURALIZATION SERVICE, June-30-8 I request that the American Consul at Guadala jara, Jalisco, Mexico MAY 31 1973 be furnished a verification of my lawful admission into the United States for permanent residence to be used in connection with the person(s) listed under item 15. GUADALAJARA, MEXICO 1. MY NAME IS (Last, in CAPS) (First) (Middle) 2. MY ALIEN REGISTRATION NUMBER IS: IBARRA Juan Vasque A12 997 207 3. MAILING ADDRESS IN U.S. (Number and Street) (City) (State) (Zip Code) 4. MY DATE OF BIRTH IS: (Month) (Day) (Year) 3180 La Jolla St. Anaheim, Calif. 92806 June 12, 1922 5. FATHER'S NAME: 6. MY PLACE OF BIRTH WAS: (City) (Country) Antonio Ibarra Villa Obregon, Jal, Mexico 7. MOTHER'S MAIDEN NAME: 8. I AM NOW A CITIZEN OF: (Country) Maria Vasques Mexico INFORMATION IN THESE BLOCKS PERTAINS TO MY LAST ARRIVAL INTO THE UNITED STATES FOR PERMANENT RESIDENCE 9. NAME UNDER WHICH ADMITTED FOR PERMANENT RESIDENCE: (Last) (First) (Middle) 10. PORT OF ARRIVAL: IBARRA Juan Vanques Calexico 11. DATE OF ARRIVAL: (Month) (Day) (Year) 12. MEANS OF ARRIVAL: (Name of Vessel, or Airline and Flight No., etc.) Sept. 21, 1962 Bus Afoot 13. NAME AND ADDRESS OF PERSON IN THE U.S. TO WHOM I WAS DESTINED: 14. AT THE TIME OF LAST LAWFUL ADMISSION TO THE U.S. IENTERED WITH FOIA (b)(6) AN IMMIGRANT VISA AN ALIEN REGISTRATION RECEIPT CARD A PERMIT TO REENTER OTHER (EXPLAIN) AND I HAVE NOT BEEN ABSENT FROM THE UNITED STATES SINCE 15. THE PERSONS IN WHOSE BEHALF SUCH INFORMATION IS REQUESTED ARE AS FOLLOWS: FULL NAME DATE AND PLACE OF BIRTH Rosario Valadez Ibarra Oct. 3g 1917, Villa Obregon, Jal., Mexico RELATIONSHIP ADDRESS Wife Lista De Correo, Villa Obregon, Jalisco, Mexico FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS FULL NAME DATE AND PLACE OF BIRTH RELATIONSHIP ADDRESS NOT TO BE FILLED OUT BY APPLICANT 16. FULL SIGNATURE OF APPLICANT AS NOW USED The Secretary of State is hereby respectfully informed that the subject named above was was not lawfully admitted for permanent residence as shown. X Juan y barra VISA air Insert LAWFUL symbol for ADMISSION entries after VERIFIED 6/30/24. INS Office: Los 9-5-82 Date: 5-23-73 0-1 Verifier: Evelyn presentative, Feburg USINS FORM 1-550 (REV. 6-1-69)"
}
