{
  "anumber": "A36176268",
  "id": "A36176268_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36176268_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (Spanish) ( (2–68)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Form FS-510 (Spanish) (2-68) Page 3 41. Las de los Estados Unidos que rigen la emisión visas, requieren que cada solicitante de visa declare si pertenece 0 no a cualquiera de las clases de as inadmisibles a los Estados Unidos. Las clases de personas inadmisibles se describen a continuación. Lea minuciosamente los párrafos que siguen; la comprensión de su significado y las, respuestas que Ud. dé a las preguntas siguientes asistirán al funcionario consular a tomar una decisión respecto de su eligit Jad para obtener una visa. United States laws governing the issuance of visas require each applicant to state whether or not he is a member of any class of individuals excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understand- ing of their content and the answers you give to the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa. EXCEPTO CUANDO LA LEY DISPONGA L0 CONTRARIO, LOS EXTRANJEROS COMPRENDIDOS EN CUALQUIERA DE LAS SIGUIENTES CLASES DE PERSONAS NO SON ELEGIBLES PARA OBTENER UNA VISA DE INMIGRANTE: (EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA) a) Los retardados mentales, los dementes 0 quienes hayan sufrido uno 0 más ataques de locura; quienes sufran de personalidad psicopática, desviación sexual, 0 defecto mental; quienes sean adictos al uso de narcóticos, los alcohólicos crónicos 0 quienes sufran de alguna enfermedad contagiosa peligrosa; quienes tengan algún defecto físico, enfermedad 0 incapacidad que afecte su capacidad para ganarse la vida; los indigentes, los mendigos profesionales y los vagos; quienes hayan sido convictos de algún delito que implique depravación moral 0 quienes admitan haber cometido los elementos esenciales de tal delito, 0 quienes hayan sido sentenciados 0 confinados cuando menos durante un total de cinco años por haber sido declarados culpables de dos 0 más delitos; los polígamos 0 quienes practiquen 0 prediquen la poligamia; las prostitutas 0 quienes hayan negociado en prostitución, lo mismo que quienes se hayan beneficiado financieramente con la prostitución y quienes hayan sido proxenetas 0 hayan importado personas para dedicarlas a la prostitución; quienes pretendan entrar a los Estados Unidos para negociar en prostitución 0 en cualquier otro vicio comercializado, 0 para llevar a efecto cualquier acto sexual inmoral; las personas que intenten entrar a los Estados Unidos con el objeto de trabajar en ocupaciones calificadas 0 no calificadas y que no hayan obtenido previamente la certificación respectiva del Secretario del Trabajo de los Estados Unidos, y aquellas personas que posiblemente se convertirían en carga pública en los Estados Unidos. (a) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity; aliens afflicted with psycopathic personality, sexual deviation, a mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn a living; aliens who are paupers, professional beggars, or vagrants; aliens convicted of a crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to confinement for at least five years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in, benefitted financially from, procured or imported persons for the purpose of prostitution, or who seek entry to the United States to engage in prostitution or other commercialized vice, or any immoral sexual act; aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor; and aliens likely to become a public charge in the United States. ¿Pertenece Ud. a alguna de las clases de personas arriba mencionadas? (Do any of the foregoing classes apply to you?) Sí No (Si la respuesta es afirmativa, explique) (Yes) (No) (If answer is Yes, explain) b) Quienes pretendan regresar a los Estados Unidos antes de haber transcurrido un año desde que fueron excluídos de los Estados Unidos, 0 quienes hubieren sido arrestados y deportados de dicho país 0 expulsados a costa del Gobierno, en lugar de ser deportados; 0 sacados como personas indigentes, 0 como extranjeros enemigos; las personas que hayan obtenido 0 tratado de obtener una visa u otra documentación por medio de fraude 0 por tergiversa- ción intencional de los hechos; aquellos que no sean elegibles para la ciudadanía estadounidense 0 quienes hayan salido y permanecido fuera de los Estados Unidos para evadir el servicio militar en tiempo de guerra 0 emergencia nacional; quienes hayan sido convictos por violar 0 tratar de violar ciertas leyes 0 reglamentos concernientes a los narcóticos 0 a la marihuana, 0 quienes sean conocidos como traficantes 0 se crea que hayan traficado ilícitamente con narcóticos 0 marihuana; quienes traten de entrar a los Estados Unidos provenientes de territorios contiguos 0 islas adyacentes, dentro de los dos años de su arribo a tal territorio 0 isla, si su entrada al mismo la verificó usando los servicios de una empresa de transportes no signataria de conven- ciones internacionales; quienes no lean y comprendan algún idioma 0 dialecto; quienes a sabiendas y por remuneración hayan aconsejado 0 ayudado a cualquier otro extranjero a entrar 0 tratar de entrar a los Estados Unidos infringiendo las leyes; y, quienes habiendo estado en los Estados Unidos en calidad de visitantes de intercambio no hayan llenado ei requisito de los dos años de residencia fuera de dicho pais. (b) Aliens who seek re-entry within one year of their exclusion from the United States, or who have been arrested and deported from the United States, or removed at Government expense in lieu of deportation, or removed as an alien in distress or as an alien enemy; aliens who procure or attempt to pro- cure a visa or other documentation by fraud or willful misrepresentation; aliens who are not eligible to acquire United States citizenship, or who have departed from or remained outside the United States to avoid United States military service in time of war or national emergency; aliens who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or marihuana, or who are known or believed to be, or to have been, an illicit trafficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within two years of their arrival therein on a non-signatory carrier; aliens who are unable to read and understand some language or dialect; aliens who, know- ingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law; and aliens who are former exchange visitors who have not fulfilled the two-year foreign residence requirement. ¿Pertenece Ud. a alguna de las clases de personas arriba mencionadas? (Do any of the foregoing classes apply to you?) Sí No (Si la respuesta es afirmativa, explique) (Yes) (No) (If answer is Yes, explain) c) Quienes sean, 0 en cualquier momento hayan sido anarquistas, 0 miembros 0 afiliados a cualquier partido comunista u otro partido totalitario, inclusive cualquier subdivisión u organismo afiliado del mismo; quienes prediquen 0 ensenen 0 hayan predicado 0 enseñado, ya sea personalmente 0 por medio de material escrito 0 impreso, 0 por afiliación a alguna organización: oposición al gobierno organizado, 2) derrocamiento del gobierno por la fuerza 0 la violencia, 3) el asalto 0 asesinato de funcionarios del gobierno por el hecho de serlo, 4) la destrucción ilegal de bienes, 5) el sabotaje, 6) las doctrinas del comunismo mundial 0 el establecimiento de una dictadura totalitaria en los Estados Unidos; y quienes pretenden entrar a los Estados Unidos-para llevar a cabo actividades perjudiciales 0 ilegales que sean de naturaleza subversiva. (c) Aliens who are, or at any time have been, anarchists, or members of or affiliated with any Communist or other totalitarian party, including any subdi- vision or affiliate thereof; aliens who advocate or teach, or who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (1) opposition to organized government, (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official character, (4) the unlawful destruction of property, (5) sabotage, or (6) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States; and aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of a subversive nature. ¿Pertenece Ud. a alguna de las clases de personas arriba mencionadas? (Do any of the foregoing classes apply to you?) Sí No (Si la respuesta es afirmativa, explique) (Yes) (No) (If answer is Yes, explain)"
}