{
	"anumber": "A36176268",
	"id": "A36176268_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36176268_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, NARA-129703"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1962, 2023, 1975]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 AFFIDAVIT OF SUPPORT STATE OF CALIFORNIA COUNTY OF SANTA CLARA 1 Juan Ibarra Vasquez, residing at 323 Curtner Ave., Palo Alto, CA being duly sworn deposes and says: 2 1) That he is a Mexican citizen by birth in Mexico and legal per- manent resident of the United States since September 21, 1962 with 3 alien registration number A12 997 207 via Calexico, California 4 2) That he is married to Maria Rosario Valadez de Ibarra, also a Mexican citizen residing in Mexico. 5 3) That it is his intention and desire that the following person 6 presently residing at 323 Curtner, Palo Alto, California be granted an immigration visa: 7 MARIA DEL ROSARIO VALADEZ DE IBARRA - born in Mexico - about 8 59 years old - married - his wife 9 4) That he has permanent employment with Rickeys Hyatt House - 4219 El Camino Real, Palo Alto, California earning $3.43 10 per hour working in the Gardnening Department. That they also have the following property: 11 a) Cattle - 90 heads valued at about $270,000.00. b) Real Estate Property at Calle Guerrero, Villa Obregon valued 12 at about $35,000.00. c) Real Estate at Hermosillo St., Villa Obregon, Jal., valued at 13 about $50,000.00. d) 153,46.80 Hectareas valued at about $12,740.00. 14 e) Land composed of Ten Hectareas (10.66.89) valued at $1,200.00 f) Lande composed of 10.18-74 valued at about $1,200.00. 15 g) Land composed of 13.00 06 valued at about $1,200.00 h) Land composed of 15-46-72 valued at about $2,000.00 16 i) Land composed of 24-29-34 and valued at about $2,000.00 j) Land composed of 25-36-83 valued at about $1,500.00 17 k) Land composed of 10-66-89 valued at about $1,200.00 (above evaluation was made in Mexican Pesos) 18 1) Savings account at Bank of America - Placentia Branch $5,200.00 m) Banko Industrial de Jalisco - Savings account $85,000.00 (Interest 19 not included). (Mexican Pesos) 20 5) That they have no one depending on them for support. 21 6) That he is ready, willing and able to supply his said wife with room, board and any financial assistance she may need in 22 the United States for an indefinite period of time. That he is willing to assume this responsibility because he needs his 23 wife to come and reside permanently with him in the United States. That the reason he did not apply for her immigration to join him 24 prior to this date is because there were minor children at home who needed their mother to be with them at all times. That his 25 small children have now left the home and his wife will be alone in Mexico if he does not have her come and reside in the USA. 26 7) That he has immigrated four other members of his family, his sons, gainfully employed in the United States. 27 8) That he guarantees the support of his wife in the U s and will not permit her to become a public charge in this country. 28 Subscribed and sworn to before me Angie NOTARY PUBLIC in korha and for this 20th day of 1975 juan the County of Santa Clara - State of California - My Commission expires 12/28/77"
}
