{
	"anumber": "A36578904",
	"id": "A36578904_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36578904_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ESTADO LIBRE Y SOBERANO DE ZACATECAS, VALOR 5720, VALOR 5746"
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 ESTADO LIBRE SAMPLE DE VALOR VALOR 75.50 7:50 PAPEL ESPECIAL PARA CERTIFICADOS DE LAS ACTAS DEL Ano sdemil novecientes SESENTA Y UNO En nombre, dela Republica de Mexicoy como Iuvez del Estado civil deeste tugar hago saberales que la presente vieren, y certifico ser cierto, queenellibro númerouno del registro civil quees amidergoala IENTO TREINTA Y CUATRO. se encuentra asentada una Actadel tenor siguiente AL MARGEN. - Acta Numero 194 Nacimiento de la nina- Verena Martinez hija legitima. -AL CENTRO. - If En la- Estación de Camacho del Municipio de Mazapil Esta- DEL REGISTED do de Zacatecas, siendo las 10 diez horas del día- 15 quince de Septiembre de 1914 mil novecientos ca WILL torce, ante mi Francisco Rodriguez Agente del Re-- gistro Civil en este lugar compareció el C. Cipria no Martinez originario de Canada Blanca, Zacatecas y vecino de este lugar de 36 veintiseis amos de - CAMACHO, ZACS. edad Casado Civil y Eclesiasti icamente el que pres- ento una nina viva nacida en su domicilio el dia- 10. del mes de Septientre de 1914 mil novecientos MPIO, DE MAZAPIL cat or ce, a las 23 veintitres horas ocupando el 3/0 lugar de la familia, a quien puso por nombre Verena Martinez; hija de Cipriano Martinez de 26 veinti-- seis anos de edad y de la Senora Simona Moreida -- de 24 veinticuatro a.00 de edad originaria de Cana da Blanca, Zacatecas y vecina de este lugar dedica da a las labores domesticas. Abuelos Paternos Salo me Martinez de 60 sesenta anos de edad y Anastacia Solis de 50 cincuenta anos de edad.Abuelos Matern- OB Apolinar Moreida Finado y Estanislada Olivo de- 64 sesenta y cuatro de edad. Fuer on testigos-- de la presente acta los Ciudadanos Emeterio Torres y Pantaleon Torres mayores de edad y vecinos de ou este lugar.-LEIDA que fue la presente al compare- ciente y testigos fueron conformes y firmaron la- presente el Agente del Registro Civil. -Francisco- Rodriguez -Emeterio Torres -Pantaleon Torres, RUBRICAS. Es copia que certifico estar fielmente -"
}
