{
	"anumber": "A36578904",
	"id": "A36578904_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36578904_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 TO THE SECRETARY OF STATE: REMARKS The petition was filed on PERSONAL INTERVIEW CONDUCTED The petition is approved for status under section: APPROVED INS. DOCUMENT CHECK ONLY SPOUSE, 201 (b) CHILD 203 (a) (2) DATE FIELD INVESTIGATION COMPLETED OF APR 2 1978 ACTION APPROVAL PREVIOUSLY FORWARDED 201 (b) PARENT 203 (a) (4) DD 203 (a) (1) Josaph Sweek 203 (a) (5) DISTRICT LOS ANGELES, CALIF REMARKS(Continued) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 20 Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in Monterey Mexico (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied. the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 21. My residence in the United States is: (C/O. if appropriate) (Apt. No.) (Number and Street) (Town or city) (State) (ZIP Code) 86931 Garden View Ave., So. Gate, Calif. 90280 22. My address abroad (if any) is: (Number and street) (Town or city) (Province) (Country) 23. Last address at which I and my spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) Aguanaval, Coahuila Mexico Avenida Ferrocarril 25 Oriente 1/28/49 5 55 24. Address in the United States where beneficiary will reside (City) (State) 8693 1/2 Garden View, So. Gate, So. Gate Calif. 90280 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) Avenida Ferrocarril, 25 Oriente, Torreon, Coahuila, MEXICO 26. If this petition is for a child. (a). Is the child married? (b). Is the child your adopted child? If so. give the names, dates, and places of birth of all other children adopted by you. If none. so state. 27. If this petition is for a brother or sister. are both your parents the same as the alien's parents? If not. submit a separate statement giving full details as to parentage. dates of marriage of parents. and the number of previous marriages of each parent. 28. If separate petitions are also being submitted for other relatives. give names of each and relationship to petitioner. NONE 29. Have you ever filed a petition for this alien before? No If so. give place and date of filing and result. 30. If beneficiary is in the United Sta give the following information concerning beneficiary: (a) Last arrive S. On Last arrived in U. S. as (c) Date beneficiary's stay expired or will (Month) 1. (Year) (Visitor, student exchange alien, crewman, stowaway, etc.) expire as shown on his Form 1-94 or I-95 (d) Name and address of present employer (e) Date alien began this employment"
}
