{
  "anumber": "A36578904",
  "id": "A36578904_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36578904_0024/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL Examination of Visa Applicants, 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 PLACE MONTERREY, MEXICO MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION DECEMBER 14,1978 CITY COUNTRY At the request of the American Consul at MONTERREY, N. L. MEXTOO NAME AGE- SEX I certify that on the above date I examined Verena Martinez Moreira de Herrera 64 F I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A,B, or C- diagnosis, and pertinent details*): CLASS B.- Overweight Wt. 127 Lbs. Ht. 4'9 Umbilical hernia CLASS C.- - Refractive error: Uncorrected L20/30 R20/30 Possible correatable with glasses Normal color vision Chest X-ray report NORMAL (70mm Dec. 14,1978) from Dr. HUMBERTO GUERRA, M. D. Blood serological report NEGATIVEV. D. R. L. from Dr. MARIANO SANTOS ,M.D. Other special report(s) (when needed) from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT DECEMBER 14,1978 50157-101 *Continue on reverse side if necessary. * GPO 1975 OL -580-458 (79-1) OPTIONAL FORM 157 (Formerly FS-398) SERAFIN VILLARREAL, M. D. January 1975 DEPT. OF STATE"
}