{
  "anumber": "A36620966",
  "id": "A36620966_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36620966_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Optional Form 2230B, Screeneded by NARA, 6/1/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/1/2023 Optional Form 230B Page 3 29. Enumere todas las organizaciones, de las que usted es o haya sido miembro, socio o afiliado desde que cumplió los 16 años (inclusive las organizaciones profesionales, vocacionales, sociales y políticas). [List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (include professional, vocational, social and political organizations) Nombre y domicilio de la organización Fechas (Dates) Categoría de miembro O cargo ejercido (Name and address) Desde Hasta (Type of membership and office held, if any) (from to) 30. Enumere todos los idiomas, inclusive el propio, que usted habla, lee y escribe (List all languages, including your own, that you can speak, read and write) Idioma (Language) Hablo (Speak) Leo (Read) Escribo (Write) Spanish yes yes yes 31. Enumere, incluyendo fechas, los períodos durante los cuales ha residido o visitado los Estados Unidos. (Cite el tipo de visa que usó o condición en que hizo la(s) visita(s).) (Si nunca visitó este país, manifiéstelo.) [Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never so state) I have been two times in wit h permit from the american Consulate 32. ¿Ha recibido Ud. tratamiento para desórdenes mentales, alcoholismo o por ser adicto a narcóticos en algún hospital, institución, Sí No o en cualquier otro lugar? (Si la respuesta es afirmativa, explique) (Yes) (Notx [Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain) ] 33. ¿Ha sido Ud. arrestado, convicto O recluído en prisión o internado en algún asilo para indigentes, o en alguna otra institución Sí No de caridad? (Si la respuesta es afirmativa, explique) (Yes) (No) [Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) 34. ¿Se le ha concedido a Ud. perdón o amnistía, decreto de rehabilitación, o algún otro acto de clemencia O acción semejante? (Si la Sí No respuesta es afirmativa, explique) (Yes) (No) [Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) 35. ¿Ha solicitado Ud. alguna vez visa para entrar a los Estados Unidos? (Si la respuesta es afirmativa indique cuándo y dónde la Sí No solicitó, si la solicitó de inmigrante o de no-inmigrante, y si ésta le fue otorgada 0 rebusada) (Yes) (No) [Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) 36. ¿Se le ha rehusado a Ud. entrada a los Estados Unidos durante los últimos doce meses? (Si la respuesta es afirmativa, explique) Sí No [Have you been refused admission to the United States during the last twelve months? (If answer is Yes, explain)) (Yes) (No) 37. ¿Se ha inscrito Ud. en el Servicio Militar, bajo las leyes del Servicio Selectivo de los Estados Unidos (United States Selective Sí No Service Law) (Si la respuesta es afirmativa, explique) (Yes) (No) [Have you ever registered with a draft board under United States Selective Service Laws? (If answer is Yes, explain) ] 38. ¿Ha solicitado Ud. en alguna ocasión que se le exima del entrenamiento y servicio en las fuerzas armadas de los Estados Unidos, Sí No o ha salido y permanecido fuera de los Estados Unidos para evadir o evitar el servicio militar? (Si la respuesta es afirmativa, (Yes) (No) explique) [Have you ever applied for relief from training and service in the United States armed forces or departed from or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) 39. ¿Es su intención entrar a los Estados Unidos desde Canadá, México, o desde alguna isla adyacente a los Estados Unidos, dentro Sí No de los dos años de haber llegado a dichos países o islas adyacentes? (Si la respuesta es afirmativa, consigne el nombre de la (Yes) (No) empresa de transportes que usó para entrar, 0 por medio de la cual piensa entrar a México, Canada 0 a tal isla adyacente) [Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island)) 40. Las leyes de los Estados Unidos que rigen la emisión de visas, requieren que cada solicitante de visa declare si pertenece o no a cualquiera de las clases de personas inadmisibles a los Estados Unidos. Las clases de personas inadmisibles se decriben a continuación. Lea minuciosamente los párrafos que siguen; la comprensión de su significado y las respuestas que Ud. dé a las preguntas siguientes asistirán al funcionario consular a tomar una decisión respecto de su eligibilidad para obtener una visa. United States laws governing the issuance of visas require each applicant to state whether or not he is a member of any class of individuals excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understanding of their content and the answers you give to the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa."
}