{
	"anumber": "A36624091",
	"id": "A36624091_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0012/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMIGRATION BOND"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1969, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OT 1437 Screened by NARA, 7/20/2023 JSTICE IMMIGRATION BOND File No. SERVICE bligor; and Marine Insurance Company, 2600 E Nutwood Ave, Fullerton, CA 92631 ed by is surety company complete the following: Rate premium: $10,00 per anum 6( Amount of premium ne name and address of the person who executed a written instrument with the surety company requesting it to post the bon Alphonso Monraz & Maricela Monraz 11725 S. Menlo Ave. Hawthorne, CA 90250 B. Name of arien for whom this bond is furnished: (If there is more than one alien, separate schedule showing name of each alien, date and country of his birth and arrival data, signed and sealed by the obligor and made part hereof, is attached.) Name: Tranquilina Espinoza Date and country of birth of alien: 10-27-37 Mexico Date, port, and means of arrival in United States: Nationality of alien: 4-17-63 Calexico, CA Mexican C. In consideration of the facts recited in paragraph or paragraphs herein numbered paragraph 3 and captioned Bond That Alien Shall Not Become A Public Charge (and in any rider or riders lettered and captioned attached hereto and made part hereof) the obligor above named, by subscribing hereto, hereby declares that he is firmly bound unto the United States in the sum of Six Thousand and dollars ($ 6,000.00 (except that inso- far as the bond is that the alien shall not become a public charge the obligor declares himself bound in such amount or successive amounts as are prescribed in paragraph (3) herein) as liquidated damages and not as a penalty, which sum is to be paid to the United States immediately upon failure to comply with the terms set forth in any such paragraph or rider. The obligor further agrees that any notice to him in connection with this bond may be accomplished by mail directed to him at the above address. If bond is furnished for more than one alien, the obligor agrees that any references herein to alien in the singular sense shall be construed in the plural sense. The obligor acknowledges receipt of a copy of this executed bond and any attached rider or riders specified above. The burden of establishing compliance with the terms of the bond rests on the obligor. If this bond has been executed in consideration of the facts recited in paragraph (1) captioned \"Bond for Maintenance of Status and Departure of Non-immigrant Alien\" and has been furnished for more than one alien, the amount due for each alien who fails to comply with the terms thereof shall be. dollars ($ ), not to exceed the total sum of dollars ($ ). D. Signed and sealed in the presence of - Date: October 14, 1976 Name Name Address Address Charles L. Hezmalhalck Attorney-in-Fact (Witness) (Witness) (SEAL) (Obligor) E. PLEDGE AND POWER OF ATTORNEY FOR USE WHEN UNITED STATES BONDS OR NOTES ARE DEPOSITED AS SECURITY The United States Bonds/Notes described in the following schedule are hereby pledged as security for the performance and fulfillment of the foregoing undertaking in accordance with 6 U.S.C. 15, 31 CFR Part 225, and Treasury Department Circular 154 (Revised), dated October 31, 1969, and I the obligor named in this bond do hereby appoint the Attorney General of the United States as my attorney for me and in my name to col- lect or to sell, assign and transfer said United States bonds or notes and I agree that in case of any default in the performance of any of the con- ditions herein to which I have subscribed, my said attorney shall have the power to collect said bonds/notes or any part hereof or to sell, assign, and transfer said bonds/notes or any part thereof, without notice, at public or private sale, free from equity of redemption and without appraise- ment or valuation, notice and right to redeem being waived, and to apply the proceeds in whole or in part to the satisfaction of any damages, de- mands, or deficiencies arising by reason of such default, as my said attorney may deem best. TITLE OF BONDS/NOTES COUPONS FACE INTEREST VALUE RATE SERIAL NO. INTEREST ATTACHED DATES PLEDGE AND POWER OF ATTORNEY FOR USE WHEN CASH IS DEPOSITED AS SECURITY The amount of ($ ), cash money of the United States, is hereby pledged as security for the performance and fulfillment of the foregoing undertaking, and I, the obligor named in this bond, hereby appoint the Attorney in General of the United States as my attorney for me and in my name to collect or to assign and transfer the said sum of money, and I agree that, the case of any default in the performance of any of the conditions herein to which I have subscribed, my said attorney shall have full power to collect said sum of money or any part thereof or to assign and transfer said sum or any part thereof, without notice and to apply said sum or any part thereof to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as I my said attorney may deem best. further empower my said attorney, in the event all the conditions herein to which I have subscribed have been complied with and the bond is canceled, to deliver the said sum of money plus any interest accrued thereon, to me at my risk and expense by such means as he shall select. IN WITNESS WHEREOF, I have hereunto set my hand and seal this day of 19 (SEAL) Before me, within the county of in the State of (or the District of Columbia), personally appeared the above named and acknowledged the execu- tion of the foregoing power of attorney. Witness my hand this day of 19 (Signature) (Title) F. Bond approved and accepted 19 (City) (State) (District Director) I-352 (Rev. 12-1-73)N THIS COPY TO BE RETAINED BY PERSON REQUESTING SURETY COMPANY TO POST BOND"
}
