{
  "anumber": "A36624091",
  "id": "A36624091_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GOBIERNOO DEL ESTADO LIBRE Y SOBERANO DE SINHALA, 34087"
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SINALOA 68087 NO = =OFICIAL MAYOR En nombre de la Republica de México y como de este Gobierno, hage saber a los que la presente vieren, y certifica ser cierto que en el Ar- china General de este Departamento y en el libro de copias de actas de NACIMIENTOS del año de MIL NOVECIENTOS CATORCE. correspondiente a la Oficina del Registro Civil de MOCORITO, SINALOA. se encuentra asentada una acta del tenor siguiente Al Márgen : - Número 272. Doscientos setenta y dos.-Nacimiento de Tranquilina Espinoza. Al Centro:- En La Villa de Mocorito, a las 13 trece de Octubre de 1914 mil novecientos catorce ante - mí, Antonio Gil, Oficial del Registro Civil de sta Cabecera, compareció el Señor Encarnación Espinoza, de 28 veintiocho años de edad, soltero, labrador, -- originario y vecino de ésta Villa y presentó una -- Lugar para el Sello niña viva, nacido en Guamuchil, ésta alcaldia Cen- tral, á las 5 cinco de la mañana del día 6 seis de Julio del presente año, á quien pone por nombre: TRANQUILINA ESPINOZA, hije natural del exponente y- Pedes Ejecutive de Juana Pérez. Fueron testigos de éste acto los Chind señores Benigno Velázquez Homobono Montes, mayores- de edad, idóneos y de este domicilio. Leída esta - Redoda acta á compareciente y testigos la ratificaron y - no firmaron por no saber. El Ofl. del R. Civil. Ant. Gil. Rúbrica. Y a solicitud de parte interesada, extiendo- de el presente en la Ciudad de Culiacán de Rosales Sinaloa, a los diez dias del mes de Abril de mil novecientos setenta y ocho. Coppos LIC.RAUL RENE ROSAS ECHAVARRIA. Poror Conscrite. Elemths"
}