{
	"anumber": "A36620966",
	"id": "A36620966_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36620966_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Optional Form 2230B, Optional Form 230B"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1945, 1951, 2023, 1931, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 Optional Form 230B Page 2 16. Nombre, parentesco (de haberlo) y domicilio de la persona con quien 17. Nombre y domicilio de la persona u organización que lo patrocina se reunirá en los Estados Unidos. (si no es la misma indicada en el número 16) (Person you intend to join (Give name, address and relationship, if (Name and address of sponsoring person or organization (If differ- any)) Jose Jauregui, son, 2421 Repet to Ave., ent from 16)) Montebello, Ca. N.A. 18. Filiación personal: (Personal description) 19. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Color of hair) (Height) gy 5m. (ft.) 7.1cm. (in.) None b) Color de los ojos d) Tez (Color of eyes) (Complexion) 1. brn moreno 20. Motivo del viaje a los EE.UU. 21. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanente, (Purpose in going to the United States) indíquelo) (Length of intended stay (If permanently, so state)) F8 gain my son,Jgse Jauregui permantly 22. Puerto de entrada 23. ¿Tiene usted pasaje hasta su destino final? (Intended port of entry) (Do you have a ticket to final destination?) San Ysidro, Ca. yes 24. Recursos financieros personales (Personal financial resources) (a) Efectivo (Cash) (c) Bienes raíces (su valor) 700,00.00, Mexican Money (Real Estate (Value)) (b) Depósitos bancarios (Bank deposits) $320,000 Mexican Cy. (d) Otros (describanse) (Other (describe)) 25. Nombre completo, domicilio, fecha y lugar de nacimiento 1 padre (si ha fallecido, indíquese en qué año murió) (Father's name, address, date and place of birth (If deceased, so state giving year of death)) Jose Jauregui Aguirre, dead unknown, Temacapulin, Jal., 1951 26. Nombre completo de soltera, domicilio, fecha y lugar de nacimiento de la madre (si ha fallecido, indíquese en qué año murió) (Mother's maiden name, address, date and place of birth (If deceased, so state giving year of death)) Leandra Aguayo Contreras, dead, unknown, Temacapulin, Jal., 1945 27. Nombre completo, domicilio y grado de parentesco de su pariente más cercano en el país de su residencia (este dato debe consignarse si ambos padres han fallecido) (Name, address and relationship of next of kin in home country (If neither parent is living)) Carmelo Jauregui, Temacapulin, Jal., 28. Enumere todos los lugares en que usted ha residido durante seis meses o más desde que cumplió los 16 años: (List all places of residence for 6 months or more since your sixteenth birthday) Ciudad o pueblo Provincia o Depto. País Fechas (Dates) Ocupacion (City or town) (Province) (Country) Desde - Hasta (from - to) (Calling or occupation) Temacapulin, Jal. Mex. 1931-1971 Agricultor Mexicali, BC. \" 1971-1978 \""
}
