{
  "anumber": "A36622433",
  "id": "A36622433_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OFFER OF EMPLOYMENT TO ALIEN, ENCLOSure 2"
    },
    "years": {
      "ms_years_nlp_v1": [
        1980
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ENCLOSURE 2 DEPARTMENT OF STATE OFFER OF EMPLOYMENT TO ALIEN INSTRUCTIONS: Please fill out this form by typewriter or in legible block letters in ink. Please answer all questions. If there is insufficient room on the form, answer on a seperate sheet of paper, using the same numbers as on the form. Sign the form before a notary public and return it-directly to the prospective employee named in No. 1 below. 1. NAME OF ALIEN Family name (in capital letters) First name Middle name Maiden name FIGUEROA De Ortega MARIA ROSARIO Soto 2. PRESENT ADDRESS OF ALIEN Number and street City or town State or Province ZIP Code Country 4823 STRICLAND DR OXNARD, CALIFORNIA 93060 U.S A 3. NAME OF EMPLOYER (Full name of organization) 4. TELEPHONE (Area code & No.) a VILLA CAPIATRANO APARTMENTS 499-8534 (805) 5. ADDRESS Number and street City County State ZIP Code 721 Aleric St. Oxnard , Ventura, Calif. 903030 6. BRIEF DESCRIPTION OF EMPLOYER'S BUSINESS OR ACTIVITY 7. NUMBER OF EMPLOYEES (If under ten) CONDOMINIUM APT RENTALS 6 8. DESCRIPTION OF JOB OFFERED TO THE ALIEN CLEANING APTS HOUSE CLEANING 9. TOTAL HOURS PER WEEK ALIEN TO BE EMPLOYED 10. TOTAL WEEKS PER YEAR 40 FORTY 50 FIFTY 11. RATE OF PAY $ 3.00 per HR 12. The alien named in No. 1 above has been fully informed of the details of employment by letter or contract. YES XX NO I swear (affirm) that I know the contents of this offer of employment signed by me, and the statements herein are true and correct. Signature of Employer/Agent Subscribed and sworn to (affirmed) before me this 6 day of 197.9 OFFICIAL SEAL Dam (SEAL) DAVID A. BACA My commission expires 3/28/80 NOTARY PUBLIC CALIFORNIA PRINCIPAL OFFICE IN VENTURA COUNTY My Commission Expires March 28, 1980"
}