{
  "anumber": "A36622433",
  "id": "A36622433_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "En nombre de la República de México y como Juez del Estado Civil de este lugar, hago saber a las que la presente, Nº 152396"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "No 152396 n nombre de la República de México y roma Duez del Estado Civil de este lu- gar, hago saber a los que la presente uteren y certifico ser rierto que en el Li- brn N's/a- del Registro Civil que # mi rargo, a la hoja N° 3. tres BP encuentra asentada una arta del tenor siguiente: Al mergen Kuímero 5. cinco: Defunción del Señor Porfirio Rodriguez Almejo:- DENTRO:- En la Delegación Mpal. de Us majac, Mpio. de Sayula Jal. siendo 16 diez y seis horas del dia 24. veinticuatro de Ehero de 19 58 mix novecientos e cincuenta y ocho, ante mi Eusebio Almejo Larios, Delegado - Mpal. y oficial del Registro Civil deeste lugar, comparecio el C. Jose Rodriguez Muíio's, soltero campecino de 39 treinte V nueve cios de edad, con domicilio en la casa marcada con el numero 270 docientos setenta, de 1a calle Eidalpo de es departamento te lugar, y menifesto: Que en la casa Número 243. docientos cuarente V tres de la misms calle, V & las 23 veintitres - horas del di'a 23 veintitres de los corrientes, Callecio & = consecuencia de asma Cardiacs V & la eddd de 66. sesenta y - seis dins, el Señor Porfirio Rodriguez Almejo casado y deja viuda & la Seno Rosario Figueros, de su segundo Matrimonio y del primero deja huerrenos & 4. cuatro bijos que son: J. Jesus, Maria, Ramona y el compereciente, el primero casado y los demas solteros, todos con el mismo apellido de Rodri- puez Muñizz:- El cadaver se inhumard mafiana en el Cementerio Mpal. de este lugar en FOZO de 1/a en propieded:- Fueron - testigos del presente acto los .Co Cervantes Laure ano y Teofilo Cano Santos, ambos casados y mayores de edad vecinos deeste lugar:- Se termino la presente acta con su lectura y comformes con su contenido firmo el que supo ha cerlo. E. M. O.D.R.C. cirmados Eusebio Almejo y Jose Ro driguez M. Bubricas:- Es copia cue Certifico concuerds riel mente con su Original de donde se compulso la cual se expi VALOR $6.00 A LA VIELTA."
}