{
  "anumber": "A36624091",
  "id": "A36624091_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT ON BEHALF OF APPLICANTS FOR IMMIGRANT VISA, 01234456789"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1977,
        1937
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "creened by NARA, 7/20/202 AFFIDAVIT OF SUPPORT ON BEHALF OF APPLICANTS FOR IMMIGRANT VISA STATE OF CALIFORNIA ) SS: CITY AND COUNTY OF LOS ANGELES) Alfonso Monraz We, and Marisela Higuera de Monraz being duly sworn according to law, depose and say as follows: I That we reside at 11725 So. Manilow, Howthorne, California, 2 That we make this affidavit for the purpose of facilitationg the entry into the United States as immigrant(s) of the following alien(s): NAME ADDRESS (1) Tranqulina Espinoza de Higuera Josefa Ortiz de Dominguez 590, Col. Guajardo, (2) Tecate, B. C. Mexico (3) (i) RELATIONSHIP TO AFFIANT (if none, nature of interest in alien) (1) Mother in Law (2) (3) (4) 3. That we are willing and able to receive the alien(s) after her Schedus) entry into the United States as immigrant (s) and to guarantee that S he (these) will not become a public charge on the Government of the United States or any subdivision thereof for conditions that may exist at the time of her (sbecom) entry; 4. That I was born in Mexico, D. F. Mexico on Oct. 27. 1937 and that I am a citizen of Mexico : 5. (If alien) That I was lawfully admitted to the United States for permanent residence on 4-17-63 at Calexico, and that my Alien Register number is FOIA (b)(6) ; 6. That I was naturalized at on and that my Naturalization Certificate number is 1. that my spouse was born in Guamuchil, Sinaloa, Mexico on 3-16-45 and is a citizen of Mexico ; a (If alien) That my spouse was lawfully admitted to the United States for permanent residence on 4-3-64 at San Ysidro. CA and that my spouse's Alien Register number is FOIA (b)(6) ; 9. That my spouse was naturalized at on and that my spouse's Naturalization Certificate number is the That I am employed by South Bay Iron Works as Owner and Manager and that my spouse is employed by Homemaker as That our current income is $ 12,163. per yr. and $ per and that in addition we have the following resources Bank Savings $ Real Estate, value $ 120,000.00 businebach is free of and home 68,000.00 Dlls. encumbrance except for $ 100,000.00 in both properties. Other Assets: 12. her proof of our income and resources is attached hereto as follows: Income tax return for 1977 and copy of the lot deed. 13. That the following persons are dependent upon us for their sole or principal support NAME RELATIONSHIP FOIA (b)(6) Subscribed and sworn to before me Affiant this 21st. day of February in the year 19 79. Warvide Spouse Manag OFFICIAL SEAL DELFINO VARELA Public NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY My Commission Expires Feb. 26, 1980"
}