{
  "anumber": "A36622433",
  "id": "A36622433_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, F-260"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        1978,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPTIONAL FORM 155 (Formerty PS 5PFP DEPT OF STATE 50155-10 Loa 6622433 THE IMMIGRANT IMMIGRANT VISA AND ALIEN REGISTRATION X HAS HAS NOT OF: F-260 BEEN PREVIOUSLY IN THE UNITED STATES (Family Name First Names Middle Numer & NS FILE NUMBER IF Figueroa de ORTEGA, Maria del Rosario KNOWN ACTION BY IMMIGRANT INSPECTOR THE HAMIGRANT NAMED ABOVE ARRIVED IN THE UNITED SEC STATES VIA LABOR CERTIFICATION 394 AUTO NOT APPLICABLE Name of vessel in first the st arrival IR / INFLIGIBILITY FOR VISA WAIVED UNDER SECTION ATTAC HED UNITED 212(e) 212(h) NOT REQUIRED 212(g) 212(1) MEXICE ARRITAL STATUS MEXICAN 06-04-19 587mc House 980 582 Fl 82 FINAL ADDRESS CITY STATE CODE TE AVAILABLE IN THIS UNITED 4823 Stricland Dr. Oxnard California 93030 STATES ACTION OF STO ACTION ON APPEAL USBHS DF, This Visa is issued under Section 221 of the Immigration in and Nationality Ach and upon the basis of y the facts Stated in the application Possession of a VISA does not entitle the bearer to enter the United States if at the time the seeks to enter he is found to be unadmissible, t pon arrival m the United States it must be surrendered to a United States Immuration Officer IMMIGRANT CLASSIFICATION GLASSIFICATION SYMBOK AMERICAN CONSULATE GENERAL IR-1 100 Tijuana B. Cta. Mextoo FOREIGN STATE OTHER AREA LIMITATION IMMIGRANT VISA NO 206 0 Joanno In Moot Jonani ISSUED ON 15 JAN month) (Year) Consul of the United of the United States of America 17 States America THE VALIDITY OF THIS VISA EXPIRES AIDNIGHT AT THE END OF (Day) (Month) (Year) 14 MAY 1979 PASSPORT NO.. Im 466 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED Maria del Rosal 10 Figuerea de Octore IO BY Mex. Cons. at bos ngeles, Cal ifornia Tariff Item No and STATES ON Feb.8,1977 Fee Paid $20 EXPIRES tocal Cy Equiv Feb 7 1979 IV 6622433 GPO 1978 9-254-230(53-1)"
}