{
	"anumber": "A36622433",
	"id": "A36622433_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "SCCITUD DE VISA DE INMIGRATE Y REGISTRO DE EXTRANJERO, Form OF-20 ((Spanish) (1-77)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2975, 1914, 1910]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Form OF-230 (Spanish) (1-77) DEPARTAMENTO DE ESTADO SC CITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO IN CCIONES. Este cuestionario debe llenarse por DUPLICADO a máquina o, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las preguntas pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sirvase contestar en hojas aparte, por duplicado, indicando los mismos números de las preguntas del cuestionario a las que corresponden las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentación de esta solicitud de visa de inmigrante son de US $5,00. Estos derechos deben abonarse en dólares de los Estados Unidos o en su equiva- lente en moneda nacional, o mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, puede ser causa de exclusión permanente de los Es- tados Unidos. Aun cuando el peticionario ya hubiere sido admitido a los Estados Unidos, una declaración fraudulenta puede ser motivo de su enjuiciamiento, deportación, o ambos. DEPARTMENT OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filed out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $5,00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and /or deportation. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) FIGUEROA dE ORTEGA MARIA ROSARIO Soto 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aquí el apellido de soltera) (Other names used or by which known (if married woman, give maiden name) ) Maria Rosario FIGUEROA-Soto 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (v.g.: árabe) (Full name in native alphabet ORTEGAtters not FIGUEROA US MARIA ROSARIO Soto 4. Fecha de nacimiento/ Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Dia((Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Prov. o Dpto.) (Province) País (Country) 26 MAYO 1914 64 ATOYAC JALISCO, MEXICO 7. Nacionalidad 8. Sexo (Sex) 9. Estado Civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado MEXICANA (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) (Single (never married) ) 2 Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) HOUSE KEEPER (ATS) 4823 STRICLAND DR OXNARD CALIFORNIA 93030 12. Nombre completo, domicilio, lugar y fecha de nacimiento del cónyuge (dé el apellido de soltera de la esposa) (Name, address, date and place of birth of wife/husband (Give maiden name of wife) ) VALENTIN ORTEGA 4823 STRICKLANS DR OXNARD, CALIFORNIA 93030 CAMARILLO CALIFORNIA U.S.A DECEMBER 12, 1910 Fecha y lugar en que se celebró el matrimonio (Date and place of marriage) NOVEMBER 8, 2975 1000 OAKS (VENTURA COUNTY) CALIFORNIA 13. Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos. (Names, addresses, dates and places of birth of all children) NINGUNO 14. Personas nombradas en los números 12 y 13 que me acompañarán 15. Domicilio definitivo en los EE.UU. 0 me seguirán a los Estados Unidos: (Final address in the U.S.) (Person named in 12 and 13 who will accompany or follow me to the United States) 4823 STRICLAND DR OXNARD, CALIF 93030 NINGUNO ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED FREE AT CONSULAR OFFICES O. THE UNITED STATES OF AMERICA"
}
