{
	"anumber": "A36622433",
	"id": "A36622433_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF DEATH, 5600"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1911, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CERTIFICATE OF DEATH 5600 887 STATE FILE NUMBER STATE OF CALIFORNIA-DEPARTMENT OF PUBLIC HEALTH LOCAL REGISTRATION DISTRICT AND CERTIFICATE NUMBER 1A. NAME OF DECEASED-FIRST NAME 18. MIDDLE NAME 1c. LAST NAME 2A. DATE OF DEATH-MONTH DAY. YEAR 2B. HOUR 173 JOSEPHINE ORRENTE DIAZ June 2, 1968 4:30 P M 3. SEX 4. COLOR OR RACE 5. BIRTHPLACE COUNTRY (STATE OR FOREIGN 6. DATE OF BIRTH 7. AGE (LAST BIRTHDAY, IF UNDER YEAR IF UNDER 24 HOURS BOSTES DATE HOURS STERITY Female Cauc. Arizona. Feb. 1, 1911 57 YEARS DECEDENT 8. NAME AND BIRTHPLACE OF FATHER 9. MAIDEN NAME AND BIRTHPLACE OF MOTHER PERSONAL Marcelino Orrente Mexico Francisca ? Arizona DATA 10. CITIZEN OF WHAT COUNTRY 11. SOCIAL SECURITY NUMBER 12. MARRIED. NEVER MARRIED WIDOWED 13 NAME OF SURVIVING SPOUSE (IF WIFE ENTER MAIDEN NAME) U.S.A. 553-16-3452 DIVORCED (SPECIFY) Divorced 14. LAST OCCUPATION 15 NUMBER OF YEARS IN 16. NAME OF LAST EMPLOYING COMPANY CR FIRM 17. KIND OF INDUSTRY OR BUSINESS THIS OCCUPATION OF SELF EMPLOYED so STATE Owner 6 Self-employed Resturant 18A. PLACE OF DEATH-NA OF HOSPITAL OR OTHER IN-PATIENT FACILITY 18a. STREET ADDRESS- AND NUMBER OR LOCATION) 18c INSIDE CITY CORPORATE LIMITS SPECIFY YES OR NO PLACE Scene of Accident StaPaula Freeway, Main St.Off-ramp Yes OF DEATH 18D. CITY OR TOWN 18E. COUNTY 18F. LENGTH OF STAY IN COUNTY OF DEATH 18G LENGTH OF STAY 1A CALIFORNIA Ventura Ventura 25 YEARS 50 YEAHS USUAL 19A. USUAL RESIDENCE-STREET ADDRESS (STREET AND NUMBER OR LOCATION) 19B INSIDE CITY CORPORATE LIMITS 20. NAME AND MAILING ADDRESS OF INFORMANT (SPECIFY YES OR NO) RESIDENCE (IF DEATH OCCURRED IN 145 James Drive Yes Eugene Ortega (son) INSTITUTION ENTER 19c. CITY OR TOWN 19p. COUNTY 19E. STATE 2935 Paula Street RESIDENCE BEFORE Ventura Ventura Calif. Oxnard California COUNTY ADMISSION) 21A. CORONER: I HEREBY CERTIFY THAT 21B. PHYSICIAN: I HEREBY CERTIFY THAT DEATH OCCURRED AT 21c. PHYSICIAN OUTCORONER SIGNATURE AND DECATE OR TITLE 210 DATE SIGNED DEATH OC CURRED AT THE THE HOUR. DATE AND PLACE STATED ABOVE PHYSICIAN'S HOUR DATE AND PLACE STATED ABOVE FROM THE FROM THE CAUSES STATED BELOW AND THAT ATTENDED THE DECEASED CAUSES STATED BELOW AND THAT HAVE HELD ON FROM TO AND OR CORONER'S THE REMAINS OF DECEASED AS RECUIRED BY LAW ENTER MONTH DAY YEAR ENTER MONTH DAY YEAR LAST SAW THE 21F PHYSICIAN 5 6-3-68 21E ADDRESS CALIFORNIA AN CERTIFICATION YEAR LICENSE NUMBER SECURITY INVESTIGATION 3291 Loma Vista Rd. Ventura INVESTIGATION OR INQUEST) 22A. SPECIFY BURIAL. ENTONBMENT 22B. DATE 23. NAME OF CEMETERY.OR CREMATORY 24. IMBALMER- SIGNATURE (IF BOTT EMBALMED LICENSE NUMBER FUNERAL OR CREMATION DIRECTOR Burial 6/6/68 Ivy Lawn Cemetery AND Donald Greens 28 DATE ACCEPTED FOR 5319 REGISTRATION LOCAL 25. NAME OF FUNERAL DIRECTOR (CR PERSON ACTING AS SUCH) 26. IF NOT CERTIFIED BY CORONER WAS 27. LOCAL REGISTRAR SIGNATURE THIS DEATH REPORTED TO CORONER? LOCAL REGISTRAR REGISTRAR Ted M. Mayr Funeral Home (SPECIFY YES OR NO Stepker A. Cosy JUN 5 1968 29. PART 1. DEATH WAS CAUSED BY ENTER ONLY ONE CAUSE PER LINE FOR A. B. AND C IMMEDIATE CAUSE (A) TRANSECTION OF CERVICAL SPINAL CORD APPROXI MATE DUE TO. OR AS A CONSEQUENCE OF INTERVAL CONDITIONS. IF ANY. WHICH (B) FRACTURED ODONTOID PROCESS OF EPISTROPHEUS BETWEEN CAUSE GAVE RISE TO THE IMMEDI- ONSET OF AND ATE CAUSE (A). STATING DUE TO. OR AS A CONSEQUENCE OF DEATH DEATH THE UNDERLYING CAUSE LAST. (C) 30. PART II: OTHER SIGNIFICANT CONDITIONS- CONTRIBUTING TO DEATH BUT NOT RELATED TO THE IMMEDIATE CAUSE GIVEN IN PART is 31. WAS OPERATION OR BIOPSY PERFORMED FOR 32A. AUTOPSY SPECIFY 32฿ \" YES WERE FINDINGS CON ANY CONDITION IN ITEMS 29 301 SPECIFY DERED DETERMINING OPERATION AND/OR BIOPSY) No YES OR NO CAUSE OF DEATH SPI YES YES 68-C-191 33. SPECIFY ACCIDENT. SUICIDE OR HOMICIDE 34. (SPECIFY NONE FARM FACTORY PLACE OF INJURY FREEWAY HIGHWAY. STREET 35. INJURY AT WORK 36A DATE OF INJURY MONTH DAT YEAR 36B HOUR OFFICE BUILDING ETC SPECIFY YES OR NO: Accident Freeway No June 2, 1968 4:30 P. 63-68 37s. DISTANCE FROM PLACE OF 37A. PLACE OF INJURY (STREET AND NUMBER OR LOCATION AND CITY OR TOWN) 38. WERE LABORATO TESTS DONE FOR DRUGS 39. WERE LABORATORY TESTS INJURY INJURY TO USUAL OR TOXIC CHEMICALS SPECIFY YES OR NO: DONE FOR ALCOHOL RESIDENCE ITEM 19 SPECIFY YES OR NO FORMATION Sta Paula Freeways, Ventura Main St.Off-remp 6 No Yes MILES may 40. DESCRIBE HOW INJURY OCCURRED (ENTER SEQUENCE OF EVENTS WHICH RESULTED IN INJURY NATURE OF INJURY SHOULD OZ ENTERED IN ITEM 29) Vinture Driver of vehicle which lost control and struck overpass railing A. B. C. D. E F. STATE REGISTRAR REV 1.1.68 VS-11"
}
