{
  "anumber": "A36624091",
  "id": "A36624091_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ST. PAUL FIRE AND MARINE INSURANCE COMPANY, 10870 CPS Rev-74 Printed in U.S.A."
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        2023,
        1976,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 Class 1 ST. PAUL FIRE AND MARINE INSURANCE COMPANY (A Capital Stock Company) ST. PAUL, MINNESOTA Fidelity and Surety CERTIFIED COPY OF POWER OF ATTORNEY Department Original on File at Home Office of Company. See Certification. KNOW ALL MEN BY THESE PRESENTS: That the St. Paul Fire and Marine Insurance Company, a corporation organized and existing under the laws of the State of Minnesota, and having its principal office in the City of Saint Paul, Minnesota, does hereby constitute and appoint Char L. Hezmalhalch Fullerton, California its true and lawful attorneys(s)-in-fact to execute, seal and deliver for and on its behalf as surety, any and all bonds and undertakings, recognizances, contracts of indemnity and other writings obligatory in the nature thereof, which are or may be allowed, required or permitted by law, statute, rule, regulation, contract or otherwise, and the execution of such instrument(s) in pursuance of these presents, shall be as binding upon the said St. Paul Fire and Marine Insurance Company, as fully and amply, to all intents and purposes, as if the same had been duly executed and acknowledged by its regularly elected officers at its principal office. This Power of Attorney is executed, and may be certified to and may be revoked, pursuant to and by authority of Article V,-Section 6(C), of the By-Laws adopted by the Board of Directors of the ST. PAUL FIRE AND MARINE INSURANCE COMPANY at a meeting called and held on the 23rd day of January, 1970, of which the following is a true transcript of said Section 6(C). \"The President or any Vice President, Assistant Vice President, Secretary or Resident Secretary, shall have power and authority (1) - To appoint Attorneys-in-fact, and to authorize them to execute on behalf of the Company, and attach the Seal of the Company thereto, bonds and undertakings, recognizances, contracts of indemnity and other writings obligatory in the nature thereof, and (2) To appoint Special Attorneys-in-fact, who are hereby authorized to certify to copies of any power-of-attorney issued in pursuance of this section and/or any of the By-Laws of the Company, and (3) To remove, at any time, any such Attorney-in-fact or Special Attorney-in-fact and revoke the authority given him.\" Further, this Power of Attorney is signed and sealed by facsimile pursuant to resolution of the Board of Directors of said Company adopted at a meeting duly called and held on the 6th day of May, 1959, of which the following is a true excerpt: \"Now therefore the signatures of such officers and the seal of the Company may be affixed to any such power of attorney or any certificate relating thereto by facsimile, and any such power of attorney or certificate bearing such facsimile signatures or facsimile seal shall be valid and binding upon the Company and any such power so executed and certified by facsimile signatures and facsimile seal shall be valid and binding upon the Company in the future with respect to any bond or undertaking to which it is attached.\" IN TESTIMONY WHEREOF, the St. Paul Fire and Marine Insurance Company has caused this instrument to be signed and its corporate seal to be affixed by its authorized officer, this 11th day of February A. D. 19 76 ST. PAUL FIRE AND MARINE INSURANCE COMPANY STATE OF MINNESOTA S S. County of Ramsey Vice President. On this 11th day of February 1976 before me came the individual who executed the preceding instrument, to me personally known, and, being by me duly sworn, said that he is the therein described and authorized officer of the St. Paul Fire and Marine Insurance Company; that the seal affixed to said instrument is the Corporate Seal of said Company; that the said Corporate Seal and his signature were duly affixed by order of the Board of Directors of said Company. NOTARIAL IN TESTIMONY WHEREOF, I have hereunto set my hand and affixed my Official Seal, at the City of Saint Paul, Minnesota, the day and year first above written. V. C. INNES MINIS Notary Public, Ramsey County, Minn. My Commission Expires April 27, 1976 CERTIFICATION I, the undersigned officer of the St. Paul Fire and Marine Insurance Company, do hereby certify that I have compared the foregoing copy of the Power of Attorney and affidavit, and the copy of the Section of the By-Laws of said Company as set forth in said Power of Attorney,* with the ORIGINALS ON FILE IN THE HOME OFFICE OF SAID COMPANY, and that the same are correct transcripts thereof, and of the whole of the said originals, and that the said Power of Attorney has not been revoked and is now in full force and effect. IN TESTIMONY WHEREOF, I have hereunto set my hand this 14th day of October 19 76 Secretary *Unlimited as to character and amount. 10870 CPS Rev. 10-74 Printed in U.S.A."
}