{
	"anumber": "A36620966",
	"id": "A36620966_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36620966_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICA"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 EL C. LICENCIADO LA C. MARIA DE LA PAZ CASTELLANOS MORA JEFE DEL EXECTIVE DEL ARCHIVO GENERAL DE GOBIERNO CERTIFICA POOR MENCH QUE EN LOS LIBROS DUPLICADOS DE ACTAS DEL REGISTRO CIVIL DE TEMACAPULIN MUNICIPIO DE VILLA OBREGON, JALISCO. CORRESPONDIENTE AL AÑO DE1940 MIL NOVECIENTOS CUARENTA. A FOJAS 10 DIEZ VUELTA. JALISCO Y BAJO EL NUMERO 17 DIECISTETE CONSTA UNA PARTIDA DE MATRIMONTO. QUE TEXTUALMENTE DICE IMPRESIO Al bleta margen Matrimonio numerolf dicersites Tantingo January son Huney Ventro Em Temacapulism gal, a 25 vinticines de mayo de 1940mil novecientor cuarenta. a las 10 diez horas, ante me Jecundino Forces Oficial del Register Civil de estre lugar comparecieron Jantiago January guays, de 25 venticines X anor de edads solters, agricultor, originaris de este lugar getime de Joing Jauriqui vecino de este lugar y de Leandra vecins del rancho de Cofradia de esta comprencion, hijo y ite Aguayo tiun vecina del mismo rancho. y Clota Huney de 21vin cho de Los charcon, Municipis de Mexticacan of vecina del de anon de edad. solterar domestica,originaria del raw. Bapotillo, de esta comprencion, hija legitimarde Jose Mu oreg vecinor del mismo rancho, ambor mexicanor, de raza mestiza, catalicors quinnes manifestarm su NO luntad de unirse en matrimonio optaron conciente y for deliveradamente for el regimen de sociedad legal. de Loy, se cumplis' con lo ordenado en el articuls 92 intererador complieron con todor los mandator moventa y dos del Codigo Civil, como sonsta en el ex pedicate relative a este matrimonio marcado you el = IMPRESION= XEROGRAFICA IMPRESIO XEROGRATICA N-> PARA CERTIFICADOS DEL REGISTRO CIVIL VALOR $ 30.00 FGJTI-18"
}
