{
  "anumber": "A36622433",
  "id": "A36622433_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICA, 36080"
    },
    "years": {
      "ms_years_nlp_v1": [
        1913,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "30030 OFICIAL DEL REGISTRO CIVIL EJECUTIVO EL C. de éste lugar que suscribe, CERTIFICA OTHOO QUE EN LOS LIBROS original DE ACTAS DEL REGISTRO CIVIL DE Unión de Guadalupe, Municipio de Atoyac, Jalisco, JALISCO CORRESPONDIENTE AL AÑO DE 1913 mil novecientos trace SORERIA GENERAL A FOJAS 32 treinta y dos frente DEL Y BAJO EL NUMERO 18 detentable ocho ESTADO CONSTA UNA PARTIDA DE NACIMIENTO QUE TEXTUALMENTE DICE: Al margen.-Numero 78.-Setenta y ochoo-Ma. del ROSARIO FIGUEROA SOTO.-Na- cimiento.-Dentro.- Unión de Quadalupe, Comisaría Municipal de la Villa de Atoyac, Jalisco, a 1/0. primero de julio de 1913 mil novecientos trace, a las 11 once de la mañana, ante mi Atanasic Chávez, Comisario Kunicipal y Encargado del Registro Civil de éste luger, comparació el ciudadano Pascual Figueros, casado, Labrador, de 54 cincuenta y cuatro años de edad, origi- nario y vecino del rancho del Destacamento, de ésta comprención y expuso: cus el día 4 cuatro de 'pubiomo pasado a las 6 seis de la manana en el ran- cho antes mencionado naoió la niña que presenta viva que se llamaré Ma. del ROSARIO FIGUEROA SOTO: su hija la form M 6/2. lugar y de su esposa la seño- ra Ma. del Carmen Sota Figures, domestics de 42 cuarenta y dos anos, del misico origon y Vecindad, unboa mexicanos de raza mestiza y de religion católica. Abuelos pateri Innoie F1 works Jesefa Soto, finados y ma- ternos: Fortine Soto y Timotea Kanzalez no vivon demicilio del com- pareciente. Fueron testigos preamite actos Pedro lovazrubias y J. Mercede des Sosa, mayoros de adad, casados, lab dores.,3 veciace de éste lugar.- Se les leyo y conformes son su content firm el que .-Firmado.- 4- tanasio Chavez.-Padro Covarnubi * dople que vonound fielmente oon su original de donde se compulso. UNION DE GUADALUFE, Jal., 12 de agosto de 1976 mil novecientos seteta y neis Por A. del Oficial delt. C. ED Srio. DE: STEP greg Gregorio Ch. Chaves UNSETTING JALISCO CANERIA GENERA elegacion de Haciende EN 676716"
}