{
  "anumber": "A36622433",
  "id": "A36622433_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CONFIDENTIAL RECORD OF CHURCH MARRIAGE, FORM VS-123 (REV. 4)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CONFIDENTIAL RECORD OF CHURCH MARRIAGE TO BE FILED WITH THE COUNTY CLERK PURSUANT TO 4213 CIVIL CODE 391 COUNTY CLERK'S NUMBER 1A. NAME OF HUSBAND-FIRST NAME 18 MIDDLE NAME 1c. LAST NAME Valentine Tapia Ortega 2. DATE OF BIRTH YEAR 3. AGE (LAST BIRTHDAY 4. BIRTHPLACE (STATE OR FOREIGN COUNTRY 12-12-10 64 YEARS Ca. PERSONAL 5A. RESIDENCE OF HUSBAND-STREET ADDRESS (STREET AND NUMBER RHRAL ADDRESS OR LOCATION 5B. CITY OR TOWN 5c. COUNTY (IF OUTSIDE CALIFORNIA ENTER STATE DATA OF 4823 Strickland Dr. Oxnard Ventura HUSBAND 6A. PRESENT OR LAST OCCUPATION 6B. KIND OF INDUSTRY OR BUSINESS 7. HIGHEST SCHOOL GRADE COMPLE 8th 8th Retired 8A. NAME OF FATHER OF HUSBAND 18B. BIRTHPLACE OF FATHER 9A. MAIDEN NAME OF MOTHER OF HUSBAND 9B. BIRTHPLACE OF MOTHE (STATE OR FOREIGN COUNTRY) (STATE OR FOREIGN COUNTRY) Valentine Ortega, Sr. Calif, Theodora Tapia Ca. 10A. NAME OF WIFE-FIRST NAME 110B. MIDDLE NAME 10c. LAST NAME Rosa Maria Ortega 11. DATE OF BIRTH MONTH DAY YEAR 12. AGE (LAST BIRTHDAY 13. BIRTHPLACE STATE OR FOREIGN COUNTRY) k 5-16-14 61 YEARS Mexico PERSONAL 14A. RESIDENCE OF WIFE-STREET ADDRESS (STREET AND NUMBER RURAL ADDRESS R LOCATION) 14B. CITY OR TOWN 14c. COUNTY (IF OUTSIDE CALIFORNIA ENTER STAT DATA OF Same As above WIFE 15B. KIND OF INDUSTRY OR BUSINESS 16. HIGHEST SCHOOL GRADE COMPLETED 17. MAIDEN NAME OF WIFE 15A. PRESENT OR LAST OCCUPATION (IF PREVIOUSLY MARRIED Housewife 3rd. FigueRCA 18A. NAME OF FATHER OF WIFE 18B BIRTHPLACE OF FATHER 19A. MAIDEN NAME OF MOTHER OF WIFE 19B. BIRTHPLACE OF MOTH I (STATE OR FOREIGN COUNTRY) (STATE OR FOREIGN COUNTRY) Pasqual FIGUEROA Mexico Carman Soto Gonzales Mexico WE. THE HUSBAND AND WIFE NAMED IN THIS CERTIFICATE. EACH FOR HIMSELF. STATE THAT THE FOREGOING INFORMATION IS CORRECT TO THE BEST OF OUR KNOWLEDGE AND BEL AFFIDAVIT AND THAT NO LEGAL OBJECTION TO THE MARRIAGE IS KNOWN TO US. OF HUSBAND AND WIFE 20A. SIGNATURE OF HUSBAND Typia Ortern Valentine 20B. SIGNATURE Rosa OF WIFE ortega 22A. SIGNATURE OF PERSON PERFORMING CEREMONY AND OFFICIAL TITLE 21. I HEREBY CERTIFY THAT THE ABOVE NAMED MAN AND WOMAN WERE JOINED BY ME IN MARRIAGE IN ACCORDANCE WITH THE LAWS OF THE STATE OF CALIFORNIA Rev.marcPrvenDD.minister CERTIFICATION 22B. NAME OF PERSON PERFORMING CEREMONY PRINT) (TYPE 22c. DENOMINATION IF PRIEST. MINISTER OF PERSON November 8th 19 75 ON PERFORMING MONTH DAY YEAR Rev. Marc Rowen, D.D. Non-Sectaria CEREMONY 22D. ADDRESS-STREET ADDRESS. CITY OR TOWN. AND STATE AT Thousand Oaks CALIFORNIA CITY OR TOWN 100E.T.O.B1#249, Tho. oaks, Ca. 91360 23. DATE ACCEPTED FOR FILING 24. COUNTY CLERK--SIGNATURE COUNTY NOV 10 1975 ROBERT L. HAMM BY Barbara Dallison CLERK DEF FORM VS-123 (REV. STATE OF CALIFORNIA-DEPARTMENT OF HEALTH OFFICE OF THE STATE REGISTRAR OF VITAL STATISTICS SEE REVERSE SIDE FOR FURTHER EXPLANATION AND APPLICABLE CODE SECTIONS hereby cerrity that the annexed instrument is a true Gave COURS correct copy of the original on file in my office. ROBERT L. HAMM, County Clerk of the County of Ventura, State of California and ex-official Clark of the Superior Court therein OCT 1978 SECURITY Heady COUNTY,"
}