{
	"anumber": "A36620966",
	"id": "A36620966_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36620966_0017/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BEFORE THE UNITED STATES OF AMERICA CONSULAR OFFICIALS, SS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1972, 1942]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/1/2023 BEFORE THE UNITED STATES OF AMERICA CONSULAR OFFICIALS UNITED STATES OF AMERICA ) STATE OF CALIFORNIA ) SS RE: SANTIAGO AGUAYO JAUREGUI COUNTY OF LOS ANGELES ) Prospective Immigrant JOSE JAUREGUI NUNEZ: First duly sworn deposes and says under Oath: That his residence is at 24211 Repetto Ave, in Montebello, California. That his wife is said CRUZ JAUREGUI, and they do not have no one that depend on them for support here in the United States of America. Your affiant states that he is a law-abiding legal resident of the United States of America. His entry into the United States of America was on the 15th day of November 1972. His alien card number is A FOIA (b)(6) That he is a citizen of the Republic of Mexico, born on the 4th day of September 1942. Your affiant further states that he is willing and able to sponsor said SANTIAGO AGUAYO JAUREGUI, his father. His residence is at Mexicali, B.C. Mexico. Affiant states that he is employed by ST. HART CONTAINER CORPORATION, located at 180 E. La Jolla Ave, in Placentia, California. His earnings from his employment is $5.10 per hour and he works 40- hours per week. ( Letter of employment is herewith made part of this instrument. ) Affiant states that he and his wife have other assets that consists of: automobile, housheld appliance, household furniture and personal property that has the replacement value of $ 9,500.00) Real Estate that has the market Value of $85,000.00. That his rental income derives at $475.00 per month. That his savings with the Bank of America, Slauson and Estern Ave, branch. It is the desire of your affiant and his wife to procure the legal entry to said prospective immigrant said SANTIAGO AGUAYO JAUREGUI, that they will not allow him to become a burden to the Government. Your fffiant states that his father the prospective immigrant is in good health mentally and physically and will not be a charge to the County. Affiant repeats that he will guarantee the support of his father and therefore will guarantee his shelter, food, clothing and all that is necessary for his support during his alienage in the United States of America."
}
