{
  "anumber": "A36622433",
  "id": "A36622433_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Establish the Status of an Alien Relative for Issuance of Immigrant Visa"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service OMB Form 2\" No. 43-RO401 ed Date filed PETITI I Fee stamp SIFY STATUS OF ALIEN RELATIVE FOR 23 DEC 1975 ISSUANCE OF IMMIGRANT VISA 12-5-98 TO THE SECRETARY OF STATE: The petition was filed on DEE-5- 1975 Remarks The petition is approved for status under section: U.S. APPROVED INS. SPOUSE, 2-15-77 Ref theney. appeared 201 (b) CHILD 203 (a) (2) DATE 201 (b) PARENT 203 (a) (4) firster Orrian to ac ownfide interview manager ACTION OF sweet DD 445/1384 203 (a) (1) LOS ANGELES, CALIF 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age) parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. SUB IR OMI Block 1. - Information About Alien Beneficiary 2. Name (Last, in CAPS) (First) (Middle) 3. Do Not Write in This Space 4. Relationship of beneficiary to petitioner ORTEGA Rosa Maria WIFE 6. Are beneficiary and petitioner related by adoption? 5. Other names used; (including maiden name if married woman) Fiqueroa (aup - 632 No 7. Place of birth (Country) 8. Date of birth (Month, day year) 9. Beneficiary's marital status: Mexico (First) June (Middle) 1914 Married Widowed Divorced Single 10. Petitioner's name (Last, in CAPS) 11. Petitioner phone 12. Has this beneficiary ever been in the U.S.? ORtEGA Valentine NMN 647-5507 (691) Yes No 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) 14. Names, birthdates and countries of birth of beneficiary's children, if any none 15. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 16. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse Nov ThousAndCAKer d. Lastaddress at which you and your spouse resided together (2) From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) Oxnard CA U.S.A 4823 Strickland DR 9-24-75 11-24-75 17. If this petition is for a child, (a). Is the child married? N/A (b). Is the child your adopted child? N/A If so, give the nmes, dates, and places of birth of all other children adopted by you. If none, so state. 18. If thipetition is for a brother or sister, are both your parents the same as the alien's parents? N/A If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 19. If seprate petitions are also being submitted for other relatives, give names of each and relationship to petitioner. NO 20. Haveyou ever filed a petition for this alien before? NO If so, give place and date of filing and result. FORMI RECEIVED TRANS IN RET'D-TRANS. C (REV.2-1-7Y COMPLETED"
}