{
	"anumber": "A36622433",
	"id": "A36622433_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Adjustment of Status to Lawful Permanent Resident ( 01-2376, Form I-45, Application for Adjustment of Status to Lawful Permanent Resident"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1910, 1975, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Block 1. - Information About Alien Beneficiary (Continued) 21. Addss in the United States where beneficiary will reside (City) (State) 4:23 StRICKLand DR, Oxnard, CA 93030 22. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (Zip Code. if in U.S.) CARE #4444 DeTriuana Bx.CardMexico $50.00 23. If beneiciary is in the United States, give the following information concerning beneficiary: a. He lastarrived in the U.S. on b. He last arrived in U.S. as C. Show date beneficiary's stay expired or will (Moth) (Day) (Year) (Visitor, student, exchange alien, rawman, stowaway, etc.) expire as shown on his Form I-94 or 1-95: 1-6-75 VisitoR Nov 10,1975 d. Name ind address of present employer e. Date alien began this employment none none 24. Check the appropriate box below and furnish the information required for the box checked: d-24-12 Beneficiary will apply for a visa abroad at the American Consulate in Ijuana B.C. Mexico (661) (Would) (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in Tijuana, B.C. Mexico (GITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Block II. - Information About Petitioner 25. My name is (Last) (First) (Middle) 26. Other names used; (including maiden name if married woman) ORTEGA Valentine NMN none 27. I reside in the United States at (C/O, if appropriate) (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) 4823 StRickLand DR. Oxnard, CA 93030 28. Address abroad (if any) (Number and street) (Town or city) (Province) (Country) n/A 29. I was born: (Month) (Day) (Year) In: (Town or city) (State or Province) (Country) Dec 12 1910 CamaRillo U.S.A. 30. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate, and date and place of naturalization: (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? su 91161 (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with Instruction 4a. (2). b. Have you or any person through whom you claim citizenship ever lost United States citizenship? If so, attach detailed explanation on separate sheet. 31. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A N/A N/A C. Have you ever lost status as a lawful permanent resident alien? N/As If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) 32. Have you attached all required documents (see instruction No. 4)? Yes Block III. - Oath or Affirmation of Petitioner swear (affirm) that know the contents of this by me anet that the statements herein are true and correct. Signature AMPARO of petitioner OFFICIAL E. (See SEAL Instruction potition_signed No. 6) Valenline Orlega Subscribed and swort firmed) before CAL RIOS me this ORNIA 24th day of nov A.D. 1975 at Ornard californie CALIFORNIA (SEAL) My commission PRINCIPAL VENTURA express COUNTY 1979 (SIGNATURE amparo OF OFFICER ADMINISTERING k OATH) Rive notary (TITLE) Public My Commission Expires July 30, 1979 V. of I Block - Signature Person Preparing Form, If Other Than Petitioner eclare that this document was prepared by me ar the request of the petitioner and is based on all information of NCTT I have an vledge. 428 n. Dran Leve Orfuard 11-24-75 SIGNATURE) (ADDRESS) Easy (DATE,"
}
