{
	"anumber": "A36624091",
	"id": "A36624091_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: Optional Form 2Form Number: 2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1905, 1968, 1974, 2023, 1967, 1976, 1930, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 Optional Form 230B Page 2 16. Nombre, parentesco (de haberlo) y domicilio de la persona con quien 17. Nombre y domicilio de la persona u organización que lo patrocina se reunirá en los Estados Unidos. (si no es la misma indicada en el número 16) (Person you intend to join (Give name, address and relationship, if (Name and address of sponsoring person or organization (If differ- any)) ent from 16) ) aricela Monraz - hija, ver No. 15 Maricela y Alfonso Monraz igual No. 15 Jesus Higueras, J18919 Sexton Street Escalon, Californian95320 18. Filiación personal: (Personal description) 19. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Color of hair) (Height) castaño 5 m. (ft.) 8 cm. (in.) ninguna b) Color de los ojos d) Tez (Color of eyes) (Complexion) cafe morena 20. Motivo del viaje a los EE.UU. 21. ¿Cuánto tiempo piensa permanecer en los EE.UU.? (Si permanente, (Purpose in going to the United States) indíquelo) (Length of intended stay (If permanently, so state)) emigrar permanentemente 22. Puerto de entrada 23. ¿Tiene usted pasaje hasta su destino final? (Intended port of entry) (Do you have a ticket to final destination?) San Ysidro, California si 24. Recursos financieros personales (Personal financial resources) Una casa en Tecate USS 15.000.00 (a) Efectivo (Cash) $ 400.00 (c) Bienes raíces (su Una Mexicali US$ 10.000,00 (Real Estate (Value)) none (b) Depósitos bancarios (Bank deposits) Muebles, aparatos electricos (d) Otros (describanse) (Other (describe)) joyas, etc. US$ 5.000,00.- 25. Nombre completo, domicilio, fecha y lugar de nacimiento del padre (si ha fallecido, indíquese en qué año murió) (Father's name, address, date and place of birth (If deceased, so state giving year of death)) Encarnacion Espinoza Duarte - Mocorito, Sinaloa, Mexico, 11-12-1905 - Tecate, B.C.Mexico 26. Nombre completo de soltera, domicilio, fecha y lugar de nacimiento de la madre (si ha fallecido, indíquese en qué año murió) (Mother's maiden name, address, date and place of birth (If deceased, so state giving year of death)) Juana Perez Ibarra-Sinaloa, Mexico, 24-7-1907, fallecida en 1968 27. Nombre completo, domicilio y grado de parentesco de su pariente más cercano en el país de su residencia (este dato debe consignarse si ambos padres han fallecido) (Name, address and relationship of next of kin in home country (If neither parent is living)) no pertinente 28. Enumere todos los lugares en que usted ha residido durante seis meses o más desde que cumplió los 16 años: (List all places of residence for 6 months or more since your sixteenth birthday) Ciudad o pueblo Provincia o Depto. País Fechas (Dates) Ocupacion (City or to n) (Province) (Country) Desde - Hasta (from to) (Calling or occupation) Guanuchil Sinaloa Mexico 8-1930 a 7-1939 hogar Mexicali Baja California Mexico 7-1939 a 1-1967 hogar Tec baja California Mexico 1-1967 a 9-1974 hogar Lo: California USA 9-1974 a 5-4-1976 hogar Tr Baja California Mexico 5-1976 a la fecha hogar"
}
