{
	"anumber": "A36624091",
	"id": "A36624091_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36624091_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SINAILOA, 1007"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1935]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 GOBIERNO DEL ESTADO LIBRE Y SOBERANO DE SINALOA En nombre de la Republica de Mexico y como SUB-SECRETARIO de este Gabierno, hago saber a los que la presente sieren, ser cierto que en el Ar- chiva General de este Departamento y en el libro de copias de actas de MATRIMONIOS del año de MIL NOVECIENTOS TREINTA Y CINCO. correspondiente a la Oficina del Registro Civil de GUAMUCHIL, SIN se encuentra asentada una acta del tenor siguiente Al Márgen:-No. 29. Veintinueve. -- Matrimonio de José Higuera y Tranquilina Espinoza. Al Centro: En Guamuchil Municipalidad de Mocorito, Sinaloa, siendo las - 17 diez y siete horas del día 9 nueve de Marzo de 1935, mil novecientos treinta y cinco, ante mi, Casimiro Sais E., Juez- Menor Propietario encargado del Registro Civil de éste lu gar, comparecierón con el objeto de celebrar su matrimonio el Ciudadano José Higuera y la Señorita Tranquilina Espinoza, Lugar para el Sello el primero dijo: ser natural del Palmar de los Sepúlveda, Municipalidad de Sinaloa y vecino de éste lugar, soltero de oficio mecanico, de 20 veinte años de edad, hijo legitimo de los finados Juan Higuera y María Acosta. La Señorita Tran- qulina Espinoza dijo: ser originaria de Mocorito, Municipali- dad de su nombre, y vecina de este lugar, célibe, de 19 diez- y nueve años de edad, con ocupaciones del hogar, hija natural del Señor Encarnación Espinoza y de la señora Juana Pérez. Ambos contrayentes manifestaron que verificada su presentación matrimonial el día 7 siete de Febrero último, del presente año, que hechas las publiaciones de ella por el término legal- sin que se ha lla interpuesto impedimento alguno de los señala dos por el articulo 164 ciento sesenta y cuatro del Código Civil, que presentado un cértificado médico en este acto con forme lo dispone el articulo 131 ciento treinta y uno del 06 digo de Salubridad vigente del Estado, que otorgado el consen timiento del Ciudadano Encarnación Espinoza padre de la contra yente y ratificado hoy por el mismo, piden al presente Oficial autorice su concertada unión en virtud de haberse llenado todos los requisitos que previene la Ley se dió lectura a los arti culos 180 ciento ochenta al 188 ciento ochenta ocho del Código Civil. Interrogados los contrayentes en cumplimiento de lo que dispone el articulo 125 ciento veinticinco del citado Código, - si es us voluntad unirse en matrimonio tomándose y entregan-- dose mutuamente por marido y mujer, y habiendo contestado am-- bos en sentido afirmativo. Y6, el Ciudadano Casimiro Sais E., Oficial del Registro Civil de éste lugar, hice la siguiente declaración \"En nombre de la Sociedad Declaro Unidos en perfecto y legitimo matrimonio al Ciudadano JOSE HIGUERA y a la Señorita TRANQUILINA ESPIMOZA. Fueron testigos de este- acto los Ciudadanos Herminio Sais Jr., Jesús Rodriguez y Vicen te C. y López, mayores de edad, idóneos y vecinos de esté lugar. Leída la presente acta por el suscrito Oficial a los contrayentes y testigos, manifestaron su conformidad ratifica- ron su contenido y firmaron los que supieron. Doy Fé. C. Sais- E.-H. Sais Jr. Jesus Rodriguez. V.C. y López. Rúbricas. -C. Sais E. Rúbrica. Y a solicitud de parte interesada, extiendo sente en la Ciudad de Culiacán de Rosales Sinaloa, a los seis - dias del mes de Abril de mil novecientos setenta ocho, LIC. JESUS MANUEL VIEDAS ESQUERRA."
}
