{
	"anumber": "A36622433",
	"id": "A36622433_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A36622433_0017/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF DEATH, 5600 1039"
		},
		"countries": {
			"ms_countries_nlp_v1": ["France"]
		},
		"years": {
			"ms_years_nlp_v1": [1975, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "CERTIFICATE OF DEATH STATE OF CALIFORNIA DEPARTMENT OF HEALTH 5600 1039 STATE FILE NUMBER OFFICE OF THE STATE REGISTRAR OF VITAL STATISTICS LOCAL REGISTRATION DISTRICT AND CERTIFICATE NUMBER 1A NAME OF DECEASED - FIRST NAME 1B MIDDLE NAME 1c LAST NAME 2A DATE OF DEATH MONTH DAY YEAR 2B HOUR CLAMANCE MOTT ORTEGA May 20, 1975 4:59 A. M 3 SEX 4 COLOR OR RACE 5 BIRTHPLACE COUNTRY STATE OR FOREIGN 6 DATE OF BIRTH 7 AGE BIRTHLAY IF UNDE YEAR IF UNDER 4 HOURS MONTHS Female Cauc. Gap, France April 6, 1900 75 YEARS DECEDENT 8 NAME AND BIRTHPLACE OF FATHER 9 MAIDEN NAME AND BIRTHPLACE OF MOTHER PERSONAL Emilee Mott - France Isoleine Marin - France DATA 10 CITIZEN OF WHAT COUNTRY 11 SOCIAL SECURITY NUMBER 12 MARRIED NEVER MARRIED WIDOWED 13 NAME OF SURVIVING SPOUSE (If WIFE ENTER MAIDEN DIVORCED (SPECIFY U.S.A. 561-03-5434 Married Valentine Ortega 14 LAST OCCUPATION 15 NUMBER OF YEARS IN 16. NAME OF LAST EMPLOYING COMPANY OR FIRM KIND OF INDUSTRY OR BUSINESS THIS OCCUPATION EMPLOYED SO STATE Packing House 15 S. P. Milling Co. Agriculture 18A PLACE OF DEATH-NAME OF HOSPITAL OR OTHER IN PATIENT FACILITY 18B STREET ADDRESS (STREET AND NUMBER OR LOCATION INSIDE CORPORATE LIMITS PLACE St. John's Hospital 333 North \"F\" Street Yes OF DEATH 180 CITY OR TOWN 18E COUNTY 18F 18G Oxnard Ventura 66 66 YEARS YEARS USUAL 19A USUAL RESIDENCE-STREET ADDRESS STREET AND NUMBER OR LOCATION) 19B INSIDE CITY CORPORATE LIMITS 20 NAME AND MAILING ADDRESS OF INFORMANT SPECIFY YES OR NO RESIDENCE 4823 Strickland Drive No Mr. Valentine Ortega (IF DEATH OCCURRED IN INSTITUTION ENTER 19c CITY OR TOWN 190 COUNTY 19E STATE 4823 Strickland Drive RESIDENCE BEFORE ADMISSION Oxnard Ventura California Oxnard CA1 ifornia 93030 21A CORONER HEREBY THAT 21B PH SICIAN WHEREBY CERTIFY THAT DEATH 21c DEATH OCCURRED THE Chash OR CORONER 21c DATE SIGNED THE JR DATE AND PLACE STATED PHYSICIAN'S HOUR DATE AND PLACE STATED ABOVE FROM FROM THE CAUSES STATED BELOW AND THAT ATTENDED THE DECEASED CAUSES STATED BELOW AND THAT HAVE HELD ON FROM TO AND 5-20-75 OR CORONER'S THE MAINS OF DECEASED AS REQUIRED BY LAW ENTER MONTH DAY YEAR ENTER MONTH DAY CERTIFICATION AN YEAR 21E ADDRESS Charles Dart, M.P. 21 5/12/75 5/18/75 5/18/75 INVESTIGATION 729 N. \"A\" St., Oxnard, Ca. (-23333 22A SPECIFY BURIAL ENTOMBMENT 22B DATE 23. NAME OF CEMEJERY OR CREMATORY 24 EMBALMER SIGNATURE BODY EMPALMED LICENSE NUMBER FUNERAL OR CREMATION Oxnard, California DIRECTOR AND Burial 5-22-75 Santa Clara Cemetery LOCAL 25 NAME OF FUNERAL DIRECTOR (OR PERSON ACTING AS SUCH) 26. NOT CORONER 27 LOCAL REGISTRAR- Ted SIGNATURE m. with Mayu LOCAL DATE RECEIVED REGISTRAR #2293 FOR REGISTRATION BY COUNTY THIS DEATH REPORTED TO CORONER Ted M. Mayr Funeral Home SPECIFY REGISTRAR Nono Stephen A. Coray m.o. MAY 22 1975 29 PART 1. DEATH WAS CAUSED BY IMMEDIATE Rinal AS CONSEQUENCE failyne OF ENTER ONLY ONE CAUSE PER LIN FOR A B AND C 1 Week APPROXI (A) MATE SECTION DUE A INTERVAL CONDITIONS IF ANY WHICH CAUSE (B) TO OR BETWEEN GAVE RISE TO THE IMMEDI 1 Week ONSET OF AND ATE CAUSE (A) STATING DUE TO THE UNDERLYING CAUSE LAST OR AS A Replace CONSEQUENCE OF aodie 3: WAS OPERATION OR 32A DEATH DEATH (C) aneargm 1 Week 30 PART II OTHER SIGNIFICANT CONDITIONS CONTRIBUTING TO DEATH BUT NOT RELATED TO THE IMMEDIATE CAUSE GIVEN PART I. ANY CONDITION IN OR 30' SPECIFY 328 Sepsi OF ERATION No 33 SPECIFY ACCIDENT SUICIDE OR HOMICIDE 34 PLACE OF INJURY SPECIFY 35 INJURY AT WORK 36A DATE OF INJURY 366 HOUR OFFICE BUILDING ETC INJURY 37A PLACE OF INJURY (STREET AND NUMBER OR LOCATION AND CITY OR TOWN 378 DISTANCE 38 39 INFORMATION MILES 40 DESCRIEE HOW INJURY OCCURRED A B C D E E RAR"
}
