{
  "anumber": "A39228199",
  "id": "A39228199_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A39228199_0038/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL Examination of Applicants for United States Visas, FORM 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Sreened by NARA, 9/25/2023 PLACE MEL CAL EXAMINATION OF APPLICANTS Mackay Memorial Hospital FOR UNITED STATES VISAS DATE OF EXAMINATION Apr.29, 1985 CITY COUNTRY AI the request of the American Consul at Hong Kong R.O.C. NAME AGE SEX Liu Chi 72 M I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON (73) 1457357 MFA Apr. 18, '85 1 examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid I. ymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale fuberculosis, active Leprosy. infectious MENTAL CONDITIONS Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7. USPHS Regs.) CLASS B Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being CLASS C Minor Conditions (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination. including the X-ray and other reports below, revealed: (1) No defect. disease. or disability. (2) Defect. disease, or disability, or previous occurrence of one or more attacks of insanity. as follows (give class-/ - A, B. or C-diagnosis, and pertinent details*): P.E. BP 120/70. Chest X-ray report # A851198 Normal. There is hypertensive cardiovascular disease. Kun-Wu Tsan M.D. from Dr. RPR. Qualitation non-reactive Kun-Wu Tsan M.D. Blood serological report from Dr. Other special report(s) (when needed) from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOF Medical Examiner 2 1985 DATE OF FINAL REPORT Kun-Wu san Isan TITLE 50157-102 'Continue on reverse side if necessary OPTIONAL FORM 157 (Rev. 5-78) U.S.GPO:1960-0-311-153/6143 Dept. of State"
}