{
	"anumber": "A39228199",
	"id": "A39228199_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A39228199_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, FORM I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1916, 1984, 1937, 1941, 1914, 2023, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Sreened by NARA, 9/25/2023 OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-83 PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp FC SSUANCE OF IMMIGRANT VISA 84304212 (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) I-130 130 35.00 TO THE SECRETARY OF STATE: CHIPL 22 0871 /84 8-11-84 APPROVED USA REMARKS 16011601H080 01:07 The petition was filed on PERSONAL INTERVIEW CONDUCTED The petition is approved for status under section: OCT 17 1984 DOCUMENT CHECK ONLY FIELD INVESTIGATION COMPLETED SPOUSE, 201 (b) CHILD 203 (a) (2) ACTION DATE OF Sincerts Kuitifion APPROVAL PREVIOUSLY FORWARDED SLB CHECKED 201 (b) PARENT 203 (a) (4) DD BywwB LOS/POR 10-10-84 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: Liu Chi /1 Bay VPL Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? NoNe L-000 YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? ChiNA Oct 8 1914 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) titz (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) LiU DAVid Shi-YUN (805)947-8030 12. Other names used by petitioner (including maiden name if married woman) Father Shi-YUN Liu 4/1 LR IER 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse QiAN , Shu - JUN Feb. 23, 1916 ChiNA 19767 =A = HEADED 14. 2nd FL, 30 JiNG spouse He Li, NaN HUA Xi Rd, Guangzhou, GUANgdoNg, people's Chinja Rep. of Full address of beneficiary's and children, if any (Omit this item if petition is for your spouse) 1/1/15 [x 17) + # III) 19th I 23032111 15. Names, birthdates and countries of birth of beneficiary $ children: Liu, shi-YUN if 122 it Oct 21, 1937 Liu, ChANG -YUN ii) Liu, ShuN-YUN 51/1757 1941 Liunchu-YUN 42 Liu, Yi- YUN 1944 All born IN chinA 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in TAipel TAIWAN (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the (STATE) Brown Immigration and Checkee, Naturalization CONSIDERED DECREE ER Service at (CITY) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 2519 SAltbush ct PAlmdAle 93550 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) 3-2, NO 135 Sect. / HSiN-HairR Taipei, Taiwan Republic of hiNA 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) Zip 106 (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City), (Province) (Country) A VB h =iss= - (106, 10/32 On OVER Received Work Relocated Completed SSL RET'D TRANS. OUT 601044 M a RECEIVED TRANS. IN COMPLETED FORM I 130 Ap- no- Da (Rev. 9-1-82) Y by Initial Resubmit Received Sent proved ried turned"
}
