{
	"anumber": "A39230142",
	"id": "A39230142_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A39230142_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-9230142"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OPTI ORM 155A (6-82) (Form 511) NSN 7540-01-126-7761 50155-201 IV £9230142 , , IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN LI CHIEH-LIN ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION NWORY 212(e) 212(h) 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH NANHAI CHINA 10JAN13 AUGI 1985 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY TAIPEI TAIWAN CHINESE (TWAN) ADMITTED (class) MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME Y I'M Is LIN-SHIH CHIN W D SEP FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED 4802 GRACE AVE. STATES CYPRESS, CA 90630 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED RETIRED UNR F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL CONSULATE GENERAL IR5 AMERICAN FOREIGN STATE/OTHER AREA LIMITATION HONG KONG CHINA AT IMMIGRANT VISA NO. 100 TAI 851 0703 201 William Finnegan ISSUED ON (Day) (Month) (Year) American Consul Consular Officer of the United States of America 17JUL85 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 13NOV85 PASSPORT NO. (74) MFA 1646162 OR OTHER TRAVEL DOCUMENTS (Describe) PHOTO ISSUED TO FORLIGH BY UNITED STATES Tariff No. 21 ON Fee Paid $75 EXPIRES Local Cy, Equiv. IV- 9230142 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S."
}
