{
	"anumber": "A39230142",
	"id": "A39230142_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A39230142_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, F-230 ( (Rev. 6-82)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "Japan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1948, 2023, 1913, 1944, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 Forr F-230 (Rev. 6-82) TSS-229 (1/83) DEPARTMENT OF STATE B APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insuffici- ent room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry CO uld be grounds for your prosecution and/or deportation 1. the Family name % First name and middle name LI CHIEH-LIN 2. Other names used or by which known (If married woman, give maiden name) LI, CHE-LIN LIN, LI 3. Full name in native alphabet (If Roman letters not used) With 4. Date of birth 5.4# Age 6. # # * Place of birth Year Month a Day X (Country) (Province) 1913/01/10 (City or town) 72 CHINA KWANGTUNG NANHA1 7. N # Nationality 8. Sex 9. Marital status % * 4 Single (never married) Married Widowed Divorced CHINESE Male Separated Female 1 * Including my present marriage, I have been married times. 10. Occupation 11. Present address Retired Professor #2-1, Sec. 3, Hua-yuan 6th Rd. Hsin-tien, Taipei,ROC 12. Name and address of wife/husband (Give maiden name of wife) WANG, SHIEN-CHI/Same as item 11 hereinabove Date and place of marriage Oct. 10, 1944 at Szuchuan China 13. Names, addresses, dates and places of birth of all children LI, LUI-YIN/6-101, Sec. 2, Hua-yuan 10th Rd. Hsin-tien, Taipei/1947 Jan. 3/ Kwangtung China Li, Lui-Chien/Tokyo, Japan / May 15, 1948/ Taiwan, R.O.C. Li Lmi-Chian/4 1048/Taiwan FOIA (b)(6) 14. auuress in the Person(s) named in 12 and 13 who will accompany or United States follow me to the United States. 4802 Grace Ave. Li, Wang Shien-Chi Cypress CA 90630 U.S.A. 16. 17. Person you intend to join (Give name, address and (16) relationship, if any) Name and address of sponsoring person or organization (If different from 16) FOIA (b)(6) Not Applicable 18. Personal description 19. Marks of identification (a) Color of hair (c) Height None Silver Gray 5 feet 2 inches (b) ARE Color of eyes (d) Complexion 20. Purpose in going to the United States Brown Medium Immigrant 21. 22. 23. Length of intended stay (If permanently, so state) Intended port of entry Permanently Los Angeles, CA Do you have a ticket to final destination? Yes THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
