{
	"anumber": "A39230142",
	"id": "A39230142_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A39230142_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, 130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Taiwan", "China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 U.S. Department of Justice OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-86 PET TO CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp FOR ISSUANCE OF IMMIGRANT VISA SMARD (PLEASE NOTE - YOU ARE THE PETITIONER AND 21 MAR 1985 # 846905 YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: 3-21-85 REMARKS The petition was filed on U.S. APPROVED INS. The petition is approved for status under WESTERN ADI. CENTER PERSONAL INTERVIEW CONDUCTED section: DOCUMENT CHECK ONLY MAR 29 1985 FIELD INVESTIGATION COMPLETED SPOUSE, DATE 201 (b) CHILD 203 (a) (2) OF APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD WAC/LOS/#19 85107032 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: Li, Chieh-Lin Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? Lin, Li YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? China 01-10-13 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 11. The beneficiary is my: (relationship) FOIA (b)(6) FOIA (b)(6) Father 12 Other names used by petitioner (including maiden name if married woman) FOIA (b)(6) 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) Wang, Shien-Chi, 10-19-24, born in China 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) No. 2-1, Sec. 3, Hua-Yuan 6th Rd., (Lin 11, Chu-Kung Li), Hsin-Tien City, Taipei, Taiwan, Republic of China 15. Names, birthdates and countries of birth of beneficiary's children: Li- 01-03-45. china 1st daughter FOIA Lui-Chien Li 05-15-48 Burwan 2nd daughter (b)(6) Lui-Chias Li 05-15-48 Taiwan 3rd daughter 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in Taipei, Taiwan, Republic of China (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at n/a (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in n/a (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 4802 Grace Avenue Cypress, CA 90630 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) No. 2-1, Sec. 3, Hua-Yuan 6th Rd., Hsin-Tien City, Taipei, Taiwan, Republic of China 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) No. 2-1, Sec. 3, Hua-Yuan 6th Rd., Hsin-Tien City, Taipei, Taiwan, Republic of China (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) AS 1532 2k 2-13 State F OVER Initial Resubmitted Relocated Re turned Receipt Received Sent Company RECEIVED TRANS. IN RET'D TRANS OUT COMPLETED FORM I-130 (Rev. 5-5-83) N 25 MAR 1985 of in"
}
