{
  "anumber": "A40040849",
  "id": "A40040849_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040849_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INTERNATIONAL RENDITION HOUSE LTD., PMT36(b)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 International Rendition House Ltd. 13, Luard Road, 10/F., Southern Commercial Building, Hong Kong. Telephone: 5-201292 FRH PMT36(b) TRANSLATION THE FEDERATIVE REPUBLIC OF BRAZIL JURISDICTION OF PENALTY EXECUTION AND THE OFFICE OF THE DIRECTOR OF THE CORRECTIONAL INSTITUTIONS DISTRICT OF CURITIBA (Crest) THE STATE OF PARANA THE NOTARY OFFICE No. 7390 THE 1ST OFFICE PENALTY EXECUTION CRIMINAL ANTECEDENTS I certify, at the request of the concerned person, that from books, papers belonging to a lawsuit, (and) papers and registers of penalty execution in this office, one cannot find the name of the person CHIANG SHI YING , son of Chiang Pei Qing and of Chiang Li Shi , has been convicted. I, ( ? ) , (Stella Regina Taques Batista) Section Head responsible for information. The matter referred is true and I took notice of it. Curitiba, 20th of February, 1987. Recognized endorsement (signed) Certified translation of a Brazilian NICOLAU ABUBARHAM document marked PMT36 12) Clerk Date: 2/4/87 THE 8TH Dr. Jamil Dualibi - Tabelião INTERNA ONAL RENDITION HOUSE LTD. NOTARY Dr. Luis Ubiratan Dualibi Jack OFFICE Authorized Clerks (Address & Tel.) Authorized Signature(s) I recognize the signature Marcos Antonio Riberiro Auth. Clerk St. Paul 5th March, 1987 This certificate does not In the witness of truth include the archive records in the 2nd Office of Each recognized (signed) Penalty Execution. endorsement Cz$236Joel Soares - Authorized Clerk Cost Cz$ Signature checked with the archived dossier"
}