{
	"anumber": "A40040848",
	"id": "A40040848_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040848_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Service Processing Sheet, A4-010-84"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened-byNARA,9/25/2023 OCSCRISTION: MARITAL srarus: Vitaused sex ILMICRATIC 10 NATUSRALIZATION SERVICE procedures Shour HEIGHT= in LC- Section of counrer OF FORMER Law NATIONALITY 3/6(a 71cc No. A40-040-848 China JAN 20 1993 FIXAL ACTION & INTERVIEW Date and Initials 8 English= Speaks ob Reads inhosites one ocalute Date c Initials (3 $ C3 withdravals Date Lasticle Government: INS Test of STAND. TEST 8 8 C , Oach raken: correctate secure s Date and Initials & - LCTIOK OR DOCUMENTS soul REQUIRED. Documents presented: K-551, Recramination ' C , see accasted H-24 ARC= 440.046.848 & ( ) ocher 8 c , visa File DOB= 2/12/09 & c , rose Audie & POE/COE LOS-IR-5 . . DOE 5/29/87 & CIO/COL: JAN 2 0 1993 RECORNMENDATION= CA APPROVED DISTRICT DIRECTOR Date and Initials COMMENTS: Mani JAN 2 0 1993 Recommended by: LOS 4482 Approval (stamp) OATH OF ALLEGIANCE Oath with IHS , nodified Oath. Delete part(s) Procise to Bear ASMS C Noncombat Duty osch with Court Course No. 246 NAME CENTES L HEREBY DECLARE, on each. chsc I absolucely and encirely reasonce and abjuce all allegisacc and (isclicy co rad Loceign prince. pocencace. scace, or sovereigacy of whom or which I have herecofoce been a subject oc cicixen: chac I will suppose sas deleas the CORSCICUCION and che lavs of. che Unices scaces of America against all cacaics. foreign and domescic chsc I will bear crve faich and allegiance CO the same: chac I will bear 35ms on behalf of the Vaites scaces when required by che lav: Chac I will perform noncoabscrac service in che Armed Forces of che Uniced scaces obca required by che Lav. chac I will perform work of ascional imposcance under civilian direction when required by che Lov: and chac I cake this obligacion freely vichouc any mcacal reservacion or purpose of evasion: so HELP HE COO. Ia acknowledgemenc abercol I have berevaco affixed my signature. Yu LING SHEN Signacuse MW may or DIS be crepticed or strumped so shou instructions, requested, it received, or ouber dream data which way Xap Ch above ad 800 a all in al. used beck dedicate Is red LR."
}
