{
	"anumber": "A40040848",
	"id": "A40040848_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040848_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1946, 1986, 2023, 1909, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. department of Justice Screened by NARA, 9/25/2023 OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Re'otive DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp A# U.S. APPROVED INS., was I-130 130 35.00 WESTERN ADJ. CENTER EMPL 22 09/08/86 G-28 or Volag# 10002222A500 02-11 NOV 21 Section of Law: 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) Il's Petition was filed on 09/08/86 (priority date) J.W. Watergr. Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Document Check Stateside Criteria 203 (a)(5) AM CON: HONG WAC 1035 Field Investigations I-485 Simultaneously LONG REMARKS A. Relationship STATES OF AMERICA HONG KOLE CONSULATE GENERAL OF THE UNIT 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No DEC 29 1986 B. Information about you C. Information about yognalien relative PM 1. Name (Family name in CAPS) Bob (First) 1/1/20 (Middle) 1. Name (Family name in CAPS) (First) (Middle) it SHEN Chung-teh iR SHEN F Yu th Ling 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 213 S. Ynez Avenue #8D Block C, Flat 407, Viking Villas 70 Tin Hau Temple Road us (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Monterey Park, CA 91754 Hong Kong 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country Shanghai Jiangsu, China Jiangyin Jiangsu, China 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Single NY 12-26-1946 Female Widowed Divorced 2-12-1909 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Chung Teh SHEN, Bob C.T. SHEN, Bobby SHEN SHEN Ling, SHEN Lin s 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 5-8-1979, Las Vegas, Nevada 2-15-1939, China IC 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended Michele Kuter 6-16-1976 ed. N/A N/A Original Certified seen a true and and correct copy. 3/2/8/86 Live, USINS ZZ 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following Naturalization He or she last arrived as a (visitor, student, exchange alien, crewman, Give number of certificate. date and/place it was issued stowaway, temporary worker without inspection, etc.) N/A No. 12802948, 8-14-1986, Los Angeles, CA Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) HI Have you obtained a certificate of citizenship in your own name? Yes No If \"Yes\", give number of certificate date and place it was issued Date authorized stay expired, or will expire as shown on Form 1.94 of I-9! 15. Name and address of present employer (if any) N/A 14. If you are a lawful permanent resident alien, complete the following. Date and place of admission for, or adjustment to. lawful permanent Date this employment began (month/day/year) residence: INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned SEP 2 1985 Form I-130 (Rev. 06-23-86) Y"
}
