{
	"anumber": "A40040849",
	"id": "A40040849_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040849_0032/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMIGRATION DEPARTMENT, REGISTRATION OF PERSONS'S HEADQUARTERS., RP 4/120/87 III."
		},
		"years": {
			"ms_years_nlp_v1": [1987, 1986, 2023, 1913, 1964, 1950]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 IMMIGRATION DEPARTMENT, REGISTRATION OF PERSONS HEADQUARTERS, 8/F PARK COMMERCIAL CENTRE. SHELTER STREET, CAUSEWAY BAY, RP 4/120/87 III. HONG KONG REF. 2 MAR 1987 DATE 4. No change in occupation has been reported to this office SERIAL NO. 255513 since you acquired your Identity Card. TO: Madam CHIANG Shi-ying ( ET ). Block C, Flat 407, Viking Villas, 70 Tin Hau Temple Road, Hong Kong. CERTIFICATE OF REGISTERED PARTICULARS S I, CHAN Tak-yim, SUPERVISOR (CERTIFICATE) CHAN Tak-yim by virtue of the powers and discretions vested in me under Section 2 and Regulation 23 of the Registration of Persons Ordinance SUPERVISOR (Certificate) and Regulations respectively, Cap. 177 of the Laws of Hong Kong (Revised Edition 1973), and in accordance with your written request hereby certify that you are the holder of Hong Kong Identity Card No. B787464(8). ) ankthat 2. The record shows that Identity Card No. 1343973 was issued to you in September 1950 in the name CHIANG Shi-ying On re-registration on 11th March 1964 for Identity Card No. B787464 you : (i) elected to retain this name, (ii) registered your alias as SHEN CHIANG Shi-ying ( it B7 R), (iii) declared that you were 50 years of age and that your date of birth was the 13th day of the 5th moon, (iv) declared your place of birth as 'Shanghai', (v) registered your occupation as 'Housewife', (vi) declared SHEN Yu-ling ( it E TN, holder of Identity Card No. B787463 new Identity Card No. B787463(A)), as your husband, and (vii) never registered any juvenile dependants. 3. On 8th October 1986 your Identity Card No. B787464 was replaced by new Identity Card No. B787464(8) on which your year of birth was registered as 1913'. Regulation 21 of the Registration of Persons Regulations states:- The burden of proving the truth of the contents of any written application for an identity card or the contents of the identity card itself, shall lie on the applicant for such identity card, or the person to whom such identity card has been issued, or on any other person alleging the Any Alterations or Erasures Render This Certificate Invalid truth of such contents. ROP 57"
}
