{
  "anumber": "A40040848",
  "id": "A40040848_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040848_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 2230 ( (English-Chinese) (Rev.12-78), Screened by NARA, 9/25/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1888,
        1946,
        1942,
        1943,
        1874,
        1982,
        1955,
        2023,
        1926,
        1931,
        1951,
        1983,
        1924,
        1950,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 OPTIONAL FORM 230 (English-Chinese) (Rev. 12-78) Page 2 24. Personal financial resources (a) Cash (c) Real estate (value) US$10,100.00 (1(A) (b) Bank deposits (d) Other (describe) RIT## As 25. Father's name, address, date and place of birth (If deceased, so state giving year of death) SHEN, Zhen-jia Oct. 1874 Jiangyin, Jiangsu, China Deceased Jun. 1924 26. Mother's maiden name, address, date and place of birth (If deceased, so state giving year of death) JIN, Shi May 1888 Jiangyin, Jiangsu, China Deceased Dec. 1955 27. Name, address and relationship of next of kin in home country (If neither parent is living) SHEN, Quen 50 Lane 838, Peijing West Road, Shanghai, Jiangsu, China Brother 28. List all places of residence for 6 months or more since your sixteenth birthday Country, Province, District, Heung, Village, Street address, Dates(From-To) Calling or occupation (-) China Jiangsu Jiangyin Cheongjing North Street 9/1926- 8/1931 Student China Jiangsu Shanghai Woosung 9/1931-12/1942 Student/Marine fifficer China Sichuan Chongcing Bureau of Navigation Dorm. 1/1943- 1/1946 Marine Inspector China Jiangsu Shanghai 16 Lane 109, Wing Hong Rd. 2/1946- 4/1949 Assist. Manager R.O.C. Taiwan Taipei 6Lane9, Ching Tien Hoping E Rl 5/1949-12/1949 Manager 24 Wuhu St. 1/F1. Kowloon, HK 1/1950- 8/1951 Manager 7A Humphrey's Ave. G/F1... Kowloon, Hong Kong2./195.2- 9/1959 Manager./P.roprietor 5 Prat Ave. 4/F1.,Kowloon, Hong Kang 10/1959- 7/1982 Proprietor Block C, Flat 407,Viking Villas,70 Tin Hau TempleRd8/1982-Present P.roprietor/Retired HK 29. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Name and address Dates (From-To) Type of membership and office held, if any B M ( -£) N/A 30. List all languages, including your own, that you can speak, read and write Language Speak Read Write Chinese Chinese Chinese Chinese 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) From May 27, 1983 to June 18, 1983 Nonimmigrant Visa B-2 32. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or alcoholism? (If answer is Yes, explain) Yes £ No 33. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) Yes No to 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) Yes ₹ No H 35. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) Yes X * No to ) HK 04-18-1983 B-2 Visa issued 36. Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) Yes No 37. Have you ever registered with a draft board under United States Selective Service lawe? (If answer is Yes, explain) Yes No to 38. Have you ever applied for relief from training and service in the United States armed forces or departed from or remained outside the United States to avoid or evade military service? (If answer is explain) Yes * No 39. Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island) Yes R No"
}