{
	"anumber": "A40040849",
	"id": "A40040849_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040849_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, FM-12-78"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1909, 1939, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 OPTIONAL FO (English-Chinese) (REV. 12-78) DEPARTMENT OF STATE DEPT. OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is US$25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name () SHEN First name and middle name (&) Shi-ying 2. Other names used or by which give maiden name). Chiang Shi-ying, CHIANG Shih-yin 3. Full name in native alphabet (If Roman letters not used) 4. Date of birth Chinese (Year) (Month) A (Day) E Western (Day) B (Month) A (Year) # calendar calendar 13 May 1913 5. Age (##) 6. Place of birth (Give in Chinese and English) (Country) 3) (Province) (District) (Heung) # (Village) # 74 China Jiangsu Jiangyin 7. Nationality ii 8. Sex 9. Marital status Male Female Single (never married) Married Widowed Divorced Separated Chinese Including my present marriage, I have been married one times. 10. Occupation 11. Present address Housewife Block C, Flat 407, Viking Villas, 70 Tin Hau Temple Rd. HK 12. Name, address, date and place of birth of wife/husband (give maiden name of wife) SHEN, Yu-ling Block C, 407, Viking Villas, 70 Tin Hau Temple Road, Hong Kong Birth Date: February 12, 1909 Birth Place: Jiangyin, Jiangsu, China Date and place of marriage February 15, 1939 Shanghai, Jiangsu, China 13. Names, addresses, dates and places of birth of all children. SHEN, Chung-ming 2G 4/F1. Merry Court, 6 Fessenden Rd. 12-12-1944 Chongcing, Sichuan, Kowloon China SHEN, Chung-teh 1370 Sunnyslope Drive 12-26-1946 Shanghai, Jiangsu, Monterey Park, CA 91754, USA China FOIA (b)(6) 14. Person named in 12 and 13 who will accompany or follow me to 15. Final address in the United States the United States. 1370 Sunnyslope Drive, Monterey Park, CA 91754, SHEN, Yu-ling USA 16. Person you intend to join (Give name, address and relationship, 17. Name and address of sponsoring person or organization (If if any) different from 16) SHEN, Chung-teh Son 1370Sunnyslope Drive, Monterey Park,CA91754 N/A USA 18. Personal description 19. Marks of identification (a) Color of hair (c) Height Grey 5 feet R 0 inches N/A (b) Color of eyes (d) Complexion me 20. Purpose in going to the United States Dark Brown Fair Immigration 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? Permanent Los Angeles Not yet THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}
