{
	"anumber": "A40040849",
	"id": "A40040849_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040849_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INTERNATIONAL RENDITION HOUSE LTD., PMT36(c)"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 International Rendition House Ltd. 13, Luard Road, 10/F., Southern Commercial Building, Hong Kong. Telephone: 5-201292 FBH PMT36 (c) TRANSLATION THE FEDERATIVE REPUBLIC OF BRAZIL JURISDICTION OF PENALTY EXECUTION AND THE OFFICE OF THE DIRECTOR OF THE CORRECTIONAL INSTITUTIONS DISTRICT OF CURITIBA (Crest) THE STATE OF PARANA THE REGISTER OFFICE OF THE 2ND OFFICE ELIVALDO BARBOSA MAIA Clerk CRIMINAL ANTECEDENTS No. 414 I certify, at the request of the concerned person, that from the search proceeded in archives and dossier store of this Registry (2nd Office) which registers the correctional institutions for prisoners in the Penalty Establishment of the State, as well as in books, papers belonging to a lawsuit, papers and registers of orders of imprisonment of sentenced, convicted criminals or with the ordinance of preventive imprisonment in the State, nothing can be found in relation with the person CHIANG SHI YING , son of Chiang Pei Qing and of Chiang Li Shi . I, , (Stella Regina Taques Batista), Head of General Office of Dossier, checked it and had it typewritten. The matter referred is true and I took notice of it. Curitiba, 12th of March, 1987. o HATT T19ma aux (signed) Clerk of the 2nd Office This certificate does not The 11th Notary Public By comparison I recognize include the archive of the the signature 1st Office of Penalty Ignes Maria Pretti Caetano Execution. (signed) NOTARY PUBLIC (chop) Witnesses of oath-making (?) 12 Mar. 1987 (?) (?) Cost Cz$ 12,00 (4 names) (signed) CURITIBA PARANA ( ? )"
}
