{
  "anumber": "A40040848",
  "id": "A40040848_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040848_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "years": {
      "ms_years_nlp_v1": [
        1984,
        1910,
        1911,
        1987,
        1973,
        2023,
        1964,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 IMMIGRATION DEPARTMENT, REGISTRATION OF PERSONS HEADQUARTERS, 8/F PARK COMMERCIAL CENTRE. SHELTER STREET. CAUSEWAY BAY. RP 4/120/87 IV. HONG KONG REF. DATE 2 APR 1987 SERIAL NO. 256162 3. On 29th February 1984 your Identity Card No. B78746 was replaced by new Identity Card No. B787463( A) on whi TO: Mr. SHEN Yu-ling citi L FJ, your year of birth was registered as 1911 Block C, Flat 407, 4. On 13th August 1984 your date of birth was amended Viking Villas, from year of birth 1911 (not verified) to 12th 70 Tin Hau Temple Road, February 1910 (not verified)'. Hong Kong. 5. After acquiring your Identity Card on 6th May 1964 you subsequently notified this office of your changes i occupation as follows : Date CERTIFICATE OF REGISTERED PARTICULARS Occupation 12th September 1984 'Proprietor/Manager of Marin I, CHAN Tak-yim, SUPERVISOR (CERTIFICATE) Supply Company, 5 Prat Avenue by virtue of the powers and discretions vested in me 4th floor, Kowloon. under Section 2 and Regulation 23 of the Registration of Persons Ordinance 11th February 1987 1 Retired' and Regulations respectively, Cap. 177 of the Laws of Hong Kong (Revised Edition 1973), and in accordance with your written request hereby certify that you are the holder of Hong Kong Identity Card No. B787463(A). X XXXXX 2. The record shows that Identity Card No. 1343971 was issued to you in September 1950 in the name SHEN I Yu-ling (X) L JJ ). On re-registration on 11th March 1964 for Identity Card No. B787463 you : CHAN Tak-yim (i) elected to retain this name, SUPERVISOR (Certificate) (ii) never registered an alias and have not registered one since acquiring your Identity Card on 6th May 1964, iii) declared that you were 53 years of age and that your date of birth was the 12th day of the 2nd moon, (iv) declared your place of birth as Shanghai', (v) registered your occupation as Merchant' of Marine Supply Company, 5 Prat Avenue, 4th floor, Kowloon, (vi) declared CHIANG Shi-ying ), holder of Identity Card No. B787464 (new Identity Card No. B787464(8)), as your wife, and (vii) never registered any juvenile dependants. ( Regulation 21 of the Registration of Persons Regulations states:- The burden of proving the truth of the contents of any written application for an identity card or the contents of the identity card itself, shall lie on the applicant for such identity card, or the person to whom such identity card has been issued, or on any other person alleging the Any Alterations or Erasures Render This Certificate Invalid truth of such contents. ROP 57"
}