{
  "anumber": "A40040848",
  "id": "A40040848_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40040848_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/25/2023, N-460 ( (10/26/89) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1988,
        1989,
        1987,
        2023,
        1978,
        1991,
        1944,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 22. What IS your present marital status? Married Widowed Divorced Single 23. Complete the following regarding your husband or wife if you are currently married. First (given) name Date married (Month/Day/Year) Date of birth (Month/Day/Year) Country of birth Place he or she entered the U.S. Date entered the U.S. (Month/Day/Year) His or her Alien Registration Number Present immigration status Date naturalized (Month/Day/Year) Place naturalized Present address (street and number) City and State or country 24. Complete the following if you were previously married Total number of times you have been married 1 Name of prior husband or wile Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Year) How marriage ended INS Status Alien CHIANG, Shi Ying Feb. 15, 1939 Apr. 19 1991 Deceased Citizen Alien Citizen 3 Alien Citizen 25. Complete the following if your present husband or wile was previously married. Total number of times your husband or wife has been married Name of prior husband or wife Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Year) How marriage ended INS Status Alien Citizen Alien Citizen Alien Citizen 26. Complete all columns for each of your children. (If child lives with you. state \"with me\" in Location column; otherwise, give the City and State of that child's residence.) Indicate your total number of children 3 Given name Date of birth Country of birth Date of entry Port of entry Location Alien Registration No Sex SHEN, Chung-ming China Naperville FOIA (b)(6) Male 12-12-1944 09-16-1989 Los Angeles Illinois Female Monterey Park Male SHEN, Chung-teh 12-26-1946 China 02-13-1978 Honolulu California U.S. Citizen Female FOIA (b)(6) Male the Female Male Female Male Female Male Female 27. Complete the following with regard to each absence you have had from the United States for a period of SIX months or less since you entered for permanent residence. (If none, write \"None\".) Ship. airline, railroad, or bus company, or other means used to return 10 the United States Returned at (Place or port of entry) Date departed Date returned Northwest Airline Los Angeles 12-30-1987 06-20-1988 speek 6-90 28. Complete the following with regard to each absence you have had from the United States for a period of SIX months or more since you entered for permanent residence. (If none, write \"None\") Ship. airline, railroad, or bus company or other means used to return to the United States Returned at (Place or port of entry) Date departed Date returned Korean Airline Los Angeles 03-12-1989 09-24-1989 Form N-400 (10/26/89) N mg Page 2"
}