{
	"anumber": "A40199244",
	"id": "A40199244_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "SHORT FORM DEED OF TRUST AND ASSIGNMENT OF RENTS, TD-2"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1968, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "RECORDING REQUESTED BY Screened by NARA, 6/8/2023 AND WHEN RECORDED MAIL TO Name RLR INVESTMENT GROUP 2819 E. Lincoln Ave. Street Address Anaheim, California City & State SPACE ABOVE THIS LINE FOR RECORDER'S USE TD-2 SHORT FORM DEED OF TRUST AND ASSIGNMENT OF RENTS This Deed of Trust, made this 10th day of March, 1978 , between ROSA E. BOBBIO, an unnarried woman as her sole and separate herein called TRUSTOR, property whose address is, 5016 Holbrook Street, Anaheim, California (number and street) (city) (zone) (state) GROVER ESCROW CORPORATION, a California corporation, herein called TRUSTEE, and RLR INVESTMENT GROUP, A PARTNERSHIP , herein called BENEFICIARY, Witnesseth: That Trustor IRREVOCABLY GRANTS, TRANSFERS AND ASSIGNS to TRUSTEE IN TRUST, WITH POWER OF SALE, that property in Orange County, California, described as: The Westerly 35 feet of Lot 4 and all of Lot 5 of Tract No. 1120 as per map recorded in Book 41, Page 12 of Miscellaneous Maps, in the office of the recorder of said County. Upon conveyance of said property by trustor or upon divestment in any manner of his title thereto, all sums secured hereby shall immediately become due and payable at the option of the beneficiary. TOGETHER WITH the rents, issues and profits thereof, SUBJECT, HOWEVER, to the right, power and authority given to and conferred upon Beneficiary by paragraph (10) of the provisions incorporated herein by reference to collect and apply such rents, issues and profits. For the Purpose of Securing: 1. Performance of each agreement of Trustor incorporated by reference or contained herein. 2. Payment of the indebtedness evidenced by one promissory note of even date herewith, and any extension or renewal thereof, in the principal sum of $ 5,000.00 executed by Trustor in favor of Beneficiary or order. To Protect the Security of This Deed of Trust, Trustor Agrees: By the execution and delivery of this Deed of Trust and the note secured hereby, that provisions (1) to (14), inclusive, of the fictitious deed of trust recorded in the counties set forth below, and in the book and at the page of Official Records in the office of the county recorder where said property is located, noted below opposite the name of such county, viz.: COUNTY DATE BOOK PAGE COUNTY DATE BOOK PAGE COUNTY DATE BOOK PAGE COUNTY DATE BOOK PAGE IMPERIAL 9/10/68 1267 574 ORANGE 9/6/68 8714 147 SAN BERNARDINO 9/6/68 7090 14 SANTA BARBARA 9/6/68 2244 922 KERN 9/6/68 4195 363 VENTURA 9/6/68 3363 84 SAN LUIS OBISPO 9/10/68 1489 429 LOS ANGELES 8/29/68 T5910 842 RIVERSIDE 9/10/68 ACCOUNT #87097 YEAR 1968 SAN DIEGO 9/10/68 SERIES 9 BOOK 1968 PAGE 155820 (which provisions, identical in all counties, are printed on the reverse hereof) hereby are adopted and incorporated herein and made a part hereof as fully as though set forth herein at length; that he will observe and perform said provisions; and that the references to property, obligations, and parties in said provisions shall be construed to refer to the property, obligations, and parties set forth in this Deed of Trust. The undersigned Trustor requests that a copy of any Notice of Default and of any Notice of Sale hereunder be mailed to him at his address hereinbefore set forth. STATE OF CALIFORNIA, SS. COUNTY OF On before me, the under- Rosa E. Bobbio signed, a Notary Public in and for said State, personally appeared , known to mc to be the person whose name subscribed to the within instrument and acknowledged that executed the same. WITNESS my hand and official seal. Signature Escrow No. 11932-07 Name (Typed or Printed) FOR USE IN LOS ANGELES, ORANGE, RIVERSIDE, SAN BERNARDINO, AND VENTURA COUNTIES ONLY"
}
