{
  "anumber": "A40199244",
  "id": "A40199244_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTE SECURED BY DEED OF TRUST (INSTALLMENT-INTEREST INCLUDED), 117"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 DO NOT DESTROY THIS NOTE: When paid, this note, with Deed of Trust securing same, must be surrendered to Trustee for cancellation before reconveyance will be made. NOTE SECURED BY DEED OF TRUST (INSTALLMENT-INTEREST INCLUDED) $ 52,000.00 Anaheim California, March 22nd 1977 In installments as herein stated. for value received We FOIA (b)(6) promise to pay to FOIA (b) (6) or order, at Huntington Beach, Calif. the principal sum of FIFTY TWO THOUSAND AND NO/100 1th dollars, with interest from April 22. 1977 on unpaid principal at the rate of Nine per cent per annum; principal and interest payable in installments of FOUR HUNDRED EIGHTEEN AND 41/100 ($438.41) #/2 dollars or more on the same day of each calendar month, beginning on the 22nd day of May 1977 and continuing on the 22nd day of each and every month thereafter until the 22nd day of April, 1987, at which time the entire balance of principal and interest then due, if any shall become due and payal The Maker of this Note agrees to pay the beneficiary a late charge of $10 for each month OI default IN the and continuing until saids principal and interest have :been (paid:) payment of any installment no: paid within 10 days after the date such installment is due. Each payment shall be credited first on interest then due; and the remainder on principal; and the interest shall thereupon cease upon the principal so credited. Should default be made in payment of any installment of principal and interest, the whole sum of principal and interest shall, at the option of the holder of this note, become immediately due. Principal and interest pay- able in lawful money of the United States. If action be instituted on this note, the undersigned promise to pay such sum as the Court may adjudge as attorney's fees. This note is secured by a DEED OF TRUST to GROVER ESCROW CORPORATION, a corporation. UPON CONVEYANCE BY THE TRUSTOR CF SAID PROPERTY, OR UPON DIVESTMENT IN ANY MANNER OF HIS TITLE THERETO, ALL SUMS SECURED HEREBY SHALL BECOME DUE AND PAYABLE IMMEDIATELY AT THE OPTION OF THE BENEFICIARY. RLR INVESTMENT GROUP, a Partnership By Luiter H. Junner Lester H. Turner by: Vary Roger I. Rice By: Result Russell L. Phelos DO NOT DESTROY THIS NOTE 117"
}