{
  "anumber": "A40199244",
  "id": "A40199244_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRANSLATION OF MARRIAGE CERTIFICATE"
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1980,
        2023,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 USI & NS LOS ANGELES, CA TRANSLATION OF MARRIAGE CERTIFICATE 1) MR. : TEOFILO MAIRENA-COREA (first name) (middle name) (last) & MS. : AURELIA ORTIZ-JIMENEZ (first name) (middle name) (last) 2) WERE MARRIED: ON NOVEMBER / 17/ 1961 (month) (day) (year) 3) IN LA TRINIDAD NICARAGUA (city or town) (state or province) (country) 4) BY EDMUNDO COREA-GARCIA (Judge or Minister's full name) 5) WITNESSES: 1. FRANCISCO FELIX MOLINA (first name) (middle) (last) 2. SALVADOR BRIONES-H. (first name) (middle) (last) 6) CERTIFICATE ISSUED: BY RAMON ELEAZAR SALINAS PASTORA (Magistrate or Minister) 7) ON JULY / 29/ 1980 (month) (day) (year) 8) IN MANAGUA NICARAGUA (city or town) (state or province) (country) 9) CERTIFICATE FOUND: Archive or Register: LA TRINIDAD Page 07 No. 100 10) IMPORTANT NOTATIONS: LEGITIMATED CHILDREN: ROSA EMILIA 24 YRS OF AGE, MARIA NIDIA 22 YRS OF AGE, FRANCISCO ADAN 22 YRS OF AGE, DENIS 17 YRS OF AGE, RUDYS 15 YRS OF AGE, SERGIO URIEL 10 YRS OF AGE AND MARCIO ANTONIO 03 YRS OF AGE. CERTIFICATION OF TRANSLATOR'S COMPETENCE I, CECILIA CRUZ , hereby certify that the above is an accurate translation of the original Marriage Certificate in SPANISH and that I am competent in both English and SPANISH to render such translation. DATE: November 29, 1982 (signature of translator) AGENCY Immigration and Citizenship Division of the Catholic Welfare Bureau/Los Angeles ADDRESS: 1400 W.9th St., Los Angeles, CA 90015, P.O. Box 15095 PHONE: (213) 385-7211, Ext. 271"
}