{
	"anumber": "A40199244",
	"id": "A40199244_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Joint Tenancy Grant Deed"
		},
		"years": {
			"ms_years_nlp_v1": [1978, 2023, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/8/2023 FOIA (b)(6) =ECORDING REQUESTED BY FOIA (b)(6) RECORDING REQUESTED BY STEWART TITLE COMPANY FOIA (b)(6) 50 Min. Past 3 P.M. AND WHEN RECORDED MAIL TO $4.00 JUL 25 1974 FOIA (b)(6) Rosa Bobbio C1 WYLIE CARLYLE, County Recorder NAME 5016 Holbrook ADDRESS Anaheim, California CITY & STATE SPACE ABOVE THIS LINE FOR RECORDER'S USE MAIL TAX STATEMENTS TO Midland Mortgage Documentary transfer tax $ 14.30 NAME P.O. Box 26648 Computed on full value of property conveyed, or ADDRESS Oklahoma City, Oklahoma xxxComputed on full value less liens & encumbrances Loan No. 0902292 remaining thereon it time of sale. CITY & STATE Escrow Signature or agent tax name Unincorporated of declarant area City determining of Grover Anaheim firm Joint Tenancy Grant Deed FOIA (b)(6) THIS FORM FURNISHED BY SECURITY TITLE INSURANCE COMPANY FOR A VALUABLE CONSIDERATION, receipt of which is hereby acknowledged, FOIA (b) (6) hereby GRANT(S) to FOIA (b) (6) and Rosa E. Bobbio, husband and wife, AS JOINT TENANTS, FOIA (b)(6) the real property in the FOIA (b)(6) County of FOIA (b)(6) State of California, described as: FOIA (b)(6) FOIA (b)(6) as per map thereof recorded in FOIA (b)(6) of Miscellaneous Maps, records of FOIA (b)(6) FOIA (b)(6) California SUBJECT TO: 1. Taxes for the fiscal year 1974-75, a lien not yet payable. 2. Covenants, conditions, restrictions, reservations, rights, rights of way and easements, now of record, if any. 3. A Deed of Trust of record CANCELLECOUNTY DOCUMENTARY TAX 5 JUL 23 1974 Jul 25'74 4.30 on P.B. 10883 FOIA (b)(6) Dated June 13th, 1974 STATE OF CALIFORNIA, SS. Orange COUNTY OF 1204PG I 864 CURITY TITLE On June 13, 1974 before me, the undersigned, a Notary Public in and for said County and State, personally appeared FOIA (b) (6) FOR NOTARY SEAL OR STAMP known to me to be the person whose name is subscribed to the within instrument, as a witness thereto, who being by me duly sworn, deposed and said: That he resides at Anaheim and he present and saw FOIA (b)(6) FOIA (b) (6) him personally known to to be the same person described in, and whose name is subscribed to the within annexed instrument, 2th, 1978 execute the same; and that affiant subscribed his name thereto as witness. Signature Songelmi in and for said County Damm and State Notary Public STATEMENTS AS DIRECTED ABOVE"
}
