{
  "anumber": "A40199244",
  "id": "A40199244_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MODIFICATION OF NOTE, FOIA ( (b)(6)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1987,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 MODIFICATION OF NOTE THIS AGREEMENT made this 27th day of March, 1978. by and between FOIA (b)(6) FOIA (b)(6) as joint tenants, as beneficiary, and RLR INVESTMENT GROUP, a Partnership, as Trustor. WHEREAS, FOIA (b)(6) FOIA (b)(6) are the owners and holder of a certain trust deed and note, dated March 22nd, 1977, in the original amount of $52,000.00, executed by RLR INVESTMENT GROUP, A Partnership. NOW THEREFORE, the terms of said note are hereby modified in the following manner: 1. The principal unpaid balance shall remain payable in monthly installments of $418.41 or more, including interest at Nine percent per annum, the next installment being due and payable May first, 1978 and continuing on the 1st day of each and every month thereafter until the 1st day of May, 1987, at which time the entire balance of principal and interest, then due, if any, shall become payable. Monthly payments of $418.41 or more per month, will become due and payable on the first day of each month, beginning with payment due May 1st, 1978. 2. Except as herein provided, all of the terms and conditions of said note and trust deed executed under date of March 22nd, 1977, shall remain in full force and effect and trustor agrees to perform each and all the obligations provided in said trust deed in the manner and in all respects as therein provided. IN WITNESS WHEREOF the parties hereto have set their hands this 31st day of March , 1978. FOIA (b)(6) Rina E Billio Rosa E. Bobbio"
}