{
	"anumber": "A40199244",
	"id": "A40199244_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICA:, 33070"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "NIEXRAGUA Screened by NARA, 6/8/2023 LITOH 33070 98 SERIE \"D\" REPUBLICA DE NICARAGUA 200D CORDOBAS 00 1513158 1981 An RAMON ELEAZAR SALINAS PASTORA CORDOBAS CORDOB ABOGADO RESPONSABLE DEL REGISTRO CENTRAL DE NICARAGUA.* CERTIFICA DICA Que en los archivos del Registro Central del Estado Civil de las Personas a folio No. Ano 33,del Tomo No. 18, del Libro de NACIMIENTOS, que llevo el Registro de La Trinidas,se 1981 encuentra Microfilmada la partids que dice:Partida No. 106. - En La Trinidad, a las F CORDOBAS cinco de la tarde, del veintiuno de julio de mil novecientos catorce. Ante el Regis- trador del Estado Civil y secretario, compareció, don Macario Ortis, mayor de edad, agri- cultor, de este vecindario, dijo: que el quince del corriente, dia viernes, y como a las doce del dia, sin señal particular y en el lugar del Rosario de esta jurisdicción, nació la niña, 9 AURELIA, h. 1. del presentado y la señora Rafaela Jimenes, ambos mayores de edad, #2 de oficios domésticos, nicaraguense y de este vecindario. Lei la presente acta al compa- reciente, la aprobo con migo y secretario.- Macario Ortis.- Firmas ilegibles.- Es conforme con el Microfilm archivado en el Registro Central del Estado Civil de las Personas con el 15 cual ha sido debidamente cotejado.-Managua a los trece dias del mes de agosto de mil nove- cientos ochenta y uno. -\"ANO DE LA DEFENSA Y LA PRODUCCION\". *NOTA: LA EMISION DE ESTA CERTI* 16 FICACION ES COMPLETAMENTE GRATUITA CON EXCEPCION DEI VALOR RESPECTIVO DEL PAPEL SELLADO Y 17 TIMBRES Enmendado. 0.-M.-VALE. 18 19 Clerner RAMON ELEAZAR SALINAS PASTORA DE @SPONSABLE DEL REGISTRO CENTRAL DEL ESTADO CLEMEN CANO CIVIL DE LAS PERSONAS DE NICARAGUA.* 20 SRIA. * 21 RECISTRU 22 de Nic-rogue 23 24 25 26 27 28 29 30"
}
