{
  "anumber": "A40199244",
  "id": "A40199244_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GRANT DEED, FOIA ( (b)(6)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1982,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "RECORDING REQUESTED BY Screened by NARA, 6/8/2023 AMERICAN TITLE CO. FOIA (b)(6) AND WHEN RECORDED MAIL THIS DEED AND. UNLESS OTHER. RECORDED IN WISE SHOWN BELOW. MAIL TAX STATEMENTS TO: OFFICIAL RECORDS FOIA (b)(6) NAME Rosa Bobbio Etal 1982 NOV 24 PH 2: 30 ADDRESS 108 S. East St., Anaheim, Calif., 92805 CITY & FOIA (b)(6) STATE ZIP 3.00 FOIA (b)(6) FOIA (b)(6) B. Title Order No. Escrow No. FOIA (b)(6) SPACE ABOVE THIS LINE FOR RECORDER'S USE GRANT DEED 26.95 The undersigned declares that the documentary transfer tax is $ and is computed on the full value of the interest or property conveyed, or is XX computed on the full value less the value of liens or encumbrances remaining thereon at the time of sale. The land, tenements or realty is located in FOIA (b)(6) unincorporated area XXX city of and FOR A VALUABLE CONSIDERATION, receipt of which is hereby acknowledged, FOIA (b)(6) hereby GRANT(S) to ROSA BOBBIO, an unmarried woman FOIA (b)(6) FOIA (b) (6) FOIA (b)(6) , all as tenants in common the following described real property in the FOIA (b)(6) county of FOIA (b)(6) state of California: FOIA (b) (6) as per map recorded in FOIA (b)( (6) FOIA (b)(6) inclusive of Miscellaneous Maps, in the office of the recorder of said County. SUBJECT TO: 1. Taxes for the fiscal year 1982-83, 2. Covenants, conditions, restrictions, reservations, rights, rights of way and easements now of record, if any. 3. Trust deed of record. Property address: FOIA (b)(6) Dated Oct. 8th, 1982 FOIA (b)(6) STATE OF CALIFORNIA COUNTY OR Las Angeles } SS. On October 12, 1982 before me, the under- signed, a Nolary Public in and for said County and State, personally FOIA (b)(6) FOR NOTARY SEAL OR STAMP appeared OFFICIAL SEAL TAMI J. CLARK , known to me NOTARY PUBLIC CALIFORNIA is to be the person whose name subscribed to the within PRINCIPAL OFFICE IN instrument and acknowledged that she executed the same. LOS ANGELES COUNTY My Commission Exp. Feb. 12. 1983 Jami Signature J of Clark Notary Assessor's Parcel No. MAIL TAX STATEMENTS TO PARTY SHOWN ON FOLLOWING LINE; IF NO PARTY SO SHOWN, MAIL AS DIRECTED ABOVE Name Street Address City & State CAL-1 (Rev. 3-79)"
}