{
  "anumber": "A40199244",
  "id": "A40199244_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40199244_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATE OF CALIFORNIA, COUNTY OF ORANGE, F0182-97.3 (R8/83)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/8/2023 STATE OF CALIFORNIA, SS. County of Orange I, GARY L. GRANVILLE, County Clerk and Clerk of the Superior Court of the State of California, in and for said County, the same being a court of record of the aforesaid County, having by law a seal, do hereby certify that LANDON S. MORRIS whose name is subscribed to the attached certificate of acknowledgment, proof of affidavit, was at the time of taking such acknowledgment, proof or affidavit, a Notary Public IN AND FOR ORANGE COUNTY, duly commissioned and sworn and residing in said County, and was, as such, an officer of said State, duly authorized by the laws thereof to take and certify the same, as well as to take and certify the proof and acknowledgment of deeds and other instruments in writing to be recorded in said State, and that full faith and credit are and ought to be given to his official acts; that the impression of his official seal is not required by law to be filed in the office of the County Clerk. I further certify that I am well acquainted with his hand writing and verily believe that the signa- ture to the attached certificate is his genuine signature, and further that the annexed instrument is executed and acknowledged according to the laws of the State of California. IN WITNESS WHEREOF, I have hereunto set my hand and affixed the seal of said Superior Court this 7th day of MAY , 19 86 GARY L. GRANVILLE County Clerk and Clerk of the Superior Court of the State of California, in and for the County of Orange. By , Deputy. F0182-97.3 (R8/83) SALLY WHITE"
}