{
  "anumber": "A40280965",
  "id": "A40280965_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40280965_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 2230 ( (English-Chinese) Rev. 5/27/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1926,
        1940,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPTIONAL FORM 230 (English-Chinese) (Rev. Screened by NARA, 7/27/2023 Page 2 25. Father's name, address, and date and place of birth (If deceased, so state giving year of death) tett. WangXiaoFong date of birth forgotten, died in 1945 26. Mother's maiden name, address, and date and place of birth (If deceased, so state giving year of death) this Wang Tao Shi, date of birth forgotten died in 1940 27. Name and address and relationship of next of kin in home country (If neither parent is living) Wang shi Min, add 28. List all places of residence for 6 months or more since your sixteenth birthday Country, Province, County Commune Village, Street address, Dates (From-To) Calling or occupation *t () china Hubei Wuhan 1926 Suptonan housewife 29. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Name and address Dates (From-To) Type of membership and office held, if any ) NONE 30. List all languages, including your own, that you can speak, read and write Language Speak i# Read Write Chinre chinese little Chines 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) ) never 32. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction of alcoholism? (If answer is Yes, explain) YES 11 NO 33. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) YES NO 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) YES NO 35. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) YES AL NO nonimmigrant BJ but not approved 36. Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) YES NO 37. Have you ever registered with a draft board under United States Selective Service laws? (If answer is Yes, explain) YES NO K 38. Have you ever applied for relief from training and service in the United States armed forces or departed from or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) YES NO 39. Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island) YES NO 40 ted States laws governing the issuance of visas require each applicant to state whether or not he is a member of any class of individuals cluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understanding of their content and the answers you give to the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa."
}