{
	"anumber": "A40201165",
	"id": "A40201165_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40201165_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2, OPTIONAL FORMULARIO 230"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 OPTIONAL FORM 230 FORMULARIO OPCIONAL 230 BNS-(Eng. Span. 5/83) PAGE 3 PAGINA 3 40. Las leyes de los Estados Unidos que rigen la emisión de visas, requieren- cada solicitante declare si pertenece 0 no a alguna clase de persona inadmisible a los Estados Unidos. A continuación se describen las clases excluibles. Lea con cuidado los siguientes párrafos; su comprension del contenido los mismos y las respuestas que Ud. dé a las preguntas que le siguen podrán ayudar al funcio- nario consular a tomar una decisión con respecto a su elegibilidad para recibir una visa. (United States laws governing the issuance of visas require each applicant to state whether or not he or she is a member of any class of individual excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understanding of their content and the answers you give the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa.) SALVO CUANDO LA LEY DISPONGA LO CONTRARIO, LOS EXTRANJEROS COMPRENDIDOS EN CUALQUIERA DE LAS SIGUIENTES CLASES SON INELEGIBLES PARA RECIBIR UNA VISA DE INMIGRANTE EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA a) Extranjeros que sean retardados mentales, dementes, 0 que hayan sufrido uno 0 más ataques de demencia; extranjeros que sufran de personalidad psicopática, desviacion sexual, defecto mental, adic- cion a drogas narcóticas, alcoholismo crónico 0 cualquier enfermedad contagiosa peligrosa; extranjeros que tengan un defecto físico, enfermedad 0 incapacidad que afecta su capacidad de ganarse el sustento; extranjeros que sean indigentes, mendigos profesionales 0 vagos; extranjeros convictos por un delito que implique depravación moral 0 quienes admitan haber cometido los elementos esenciales de tal delito, 0 quienes hayan sido sentenciados a prisión por lo menos por cinco años, por sentencias sumadas de dos 0 mas delitos; extranjeros que sean polígamos, 0 quienes practiquen 0 prediquen la poligamia; extranjeras que sean prostitutas, 0 extranjeros que hayan negociado en prostitucion,o beneficiado financieramente de la prostitución, procuradoo importado personas con el propósito de pros- titución, 0 que intentan ingresar a los Estados Unidos para negociar en prostitución u otro vicio comercializado, 0 cualquier acto sexual inmoral; extranjeros que intentan ingresar para llevar a cabo tra- bajos calificados 0 semi-calificados y que no hayan sido certificados por el secretario de trabajo; extranjeros que probablemente se conviertan en carga pública en los Estados Unidos. (a) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity; aliens afflicted with psychopathic personality, sexual deviation, a mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn a living; aliens who are paupers, professional beggars, or vagrants; aliens convicted of a crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to confinement for at least 5 years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in prostitution, benefited financially from prostitution, procured or imported persons for the purpose of prostitution, or who seek entry to the United States to engage in prostitution or other comercialized vice, or any immoral sexual act, aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor; and aliens likely to become a public charge in the United States). ¿Se aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI. explique. (If reply is YES, explain.) SI NO (Yes) (No) b) Extranjeros que pretendan reingresar dentro de un año desde que fueron excluidos de los Estados Unidos, 0 quienes, dentro de los últimos cinco años, hayan sido arrestados y deportados de los Estados Unidos, 0 expulsados a costa del gobierno en lugar de deportación, 0 expulsados como un extranjero indigente 0 como un extranjero enemigo; extranjeros que obtengan 0 tratan de obtener una visa u otra documentación por medio de fraude 0 por tergiversación intencional; extranjeros que no sean elegibles para adquirir la ciudadanía de los Estados Unidos, 0 quienes hayan salido de 0 permanecido fuera de los Estados Unidos para evadir el servicio militar de los Estados Unidos en tiempo de guerra 0 emergencia nacional: extranjeros que hayan sido convictos por violar 0 por conspirar para violar ciertas leyes 0 reglamentos relativos a drogas narcóticas 0 mariguana/marihuana; 0 quienes se sepa que sean 0 se crea que sean 0 que fueron traficantes ilegales de drogas narcóticas 0 mariguana; extranjeros que tratan de ingresar desde territorio extranjero contiguo 0 islas adyacentes dentro de los dos años de su arribo de esa procedencia en un transporte no-signatario; extranjeros que no puedan leer 0 comprender algún idioma 0 dialecto, extranjeros que, a sabiendas y por remuneración, hayan alentado 0 asistido a cualquier otro extranjero a ingresar, tratar de ingresar a los Estados Unidos infringiendo la Ley; ex- tranjeros que siendo anteriormente visitantes de intercambio no hayan cumplido con el requisito de residencia de dos años en el exterior; y extranjeros que sean graduados de colegios médicos extranjeros destinados a los Estados Unidos a brindar servicios médicos son inelegibles para una visa a menos que hayan aprobado las partes I y II del examen NBMEE (National Board of Medical Examiner's Exami- nation), 0 el examen equivalente como lo determine el Departamento de Servicios Humanos y de la Salud. (b) Aliens who week re-entry within 1 year of their exclusion from the United States, or who, within the past 5 years, have been arrested and deported from the United States, or removed at government expense in lieu of deportation or removed as an alien in distress or as an alien enemy; aliens who procure or attempt to procure a visa or other documentation by fraud or willful misrepresentation; aliens who are not eligible to acquire United States citizenship, or who have departed or remained outside the United States to avoid United States military service in time of war or national emergency; aliens who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or marihuana, or who are known or believed to be, or to have been, an illicit traf- ficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within 2 years of their arrival therein on a non-signatory carrier; aliens who are unable to read and understand some language or dialect; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law: aliens who are former exchange visitors who have not fulfilled the 2 year foreign residence requirement; and aliens who are graduates of foreign medical schools destined to the United States to perform medical services are ineligible for a visa unless they have passed parts I and II of the NBME Exam (National Board of Medical Examiner's Examination) or an equivalent exam as determined by the Department of Health and Human Services.) ¿Se aplica a Ud. alguna de las clases anteriores?. (Do any of the foregoing classes apply tu you?) Si contesta SI, explique. (If reply is YES, explain.) SI NO (Yes) (No) c) Extranjeros que sean, 0 en cualquier momento hayan sido, anarquistas, 0 miembros de 0 afiliados a cualquier partido comunista U otro partido totalitario, inclusive cualquier subdivisión u organismo afiliado del mismo: extranjeros que prediquen 0 ensenen 0 hayan predicado 0 enseñado, ya sea por declaración personal 0 por medio de material escrito 0 impreso, 0 por afiliación a alguna organización; (1) oposición al gobierno organizado, (2) derrocamiento del gobierno por fuerza 0 la violencia, (3) el asalto 0 asesinato de funcionarios del gobierno por su carácter oficial, (4) la destrucción ilegal de bienes, (5) sabotaje, (6) las doctrinas del comunismo mundial 0 el establecimiento de una dictadura totalitaria en los Estados Unidos; extranjeros que intentan ingresar a los Estados Unidos para llevar a cabo actividades perjudiciales 0 ilegales de naturaleza subversiva. (c) Aliens who are, or at any time have been, anarchists, or members of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who advocate or teach, or who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (2) opposition to organized government, (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official character, (4) the unlawful destruction of property, (5) sabotage, or (6) the doctrines of world communism or the establishment of a totalitarian dictatorship in the United States; aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of a subversive nature.) ¿Se aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI. explique. (If reply is YES, explain.) SI NO (Yes) (No) d) Extranjeros que durante el período comenzando el 23 de marzo de 1933 y concluyendo el 8 de mayo de 1945, bajo el control, directo 0 indirecto, del gobierno nazi de Alemania 0 del gobierno de cualquier área ocupada por, 0 aliada con, el gobierno nazi de Alemania, ordenó, incito, asistió, 0 que de cualquier otra manera participó en la persecución de cualquier persona por su raza, religion, origen nacional u opinion pública. (d) Aliens who during the period beginning of March 23, 1933, and ending on May 8, 1945, under the control, direct or indirect, of the Nazi Government of Germany or of the government of any area occupied by, or allied with, the Nazi Government of Germany, ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion.) (Se aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI, explique. (If reply is YES, explain.) SI NO (Yes) (No) 41.Le ayudó alguien a completar esta solicitud? Si la respuesta es SI, indique nombre y dirección de la persona que lo asistió, indicando si es pariente, amigo, agente de viajes, abo- SI NO gado, u otro. (Were you assisted in completing this application? If answer is YES, give name and address of person assisting you indicating whether relative, friend, travel agent, (Yes) (No) attorney. or other.) Nombre (Name) Dirección (Address) Relación (Relationship)"
}
