{
  "anumber": "A40269175",
  "id": "A40269175_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "KINH ĐỊA - UV BÀN NĂM ĐẦU TÂY MÁI QUỐC, FOIA (b)(6)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1942,
        1928,
        1986,
        1992,
        1931,
        1906,
        1940,
        1967,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "GONG HOA XA nôr cab NORTA VIST NAM Doc 1 pp - Tu do - Henh phuc DV Kinn :- UY BAN NHAM DAN XA NHI QUI Kinh thus quy iy Ban, Tôi ky ten duói day là LIFO THONG. sinh nam 1906 tai Quang Dong Trung Quoc - Giaj Thông Bach so : FOIA (b)(6) Hien ngu tai Ap Qúi Thanh, Xa Tan HO1, Huyen Cai Lay, Tion Tien Giang. Eguyen toi có thank non hdp phop cung ba TANG THI KKO Vao ngay 01- 01-1928 tai Saigon va da sanh dude 1 dus con trai ten 18 LU'O HOAI THU Vao ngay 15-12-1931 tai An Xuyen (Ca Mau) vi VC chong toi mi ch lgi sath con trong thdi loan pen chung toi khong có lep khai sinh cho con (LOU HCAI THU) Dén nam 1940 VO toi (TANG THE KEO) bi benh ma mat . Den agay 15-02-1942 tô1 06 tuc buyen hop phap cung ba TO THI KHA tgi lang Mhi Qui Va da sanb them dude 6 dua con CO ten sau day : 1, FOIA (b)(6) 3/ 4/ 5/ 6/ Ngudi vd ke cua tô1 thudng yeu LUT HOAI THE ahu la con ruot nên da cung tôt 16p giay the v1 khai sanh cho LUU HOAI THU khai min LIVU HOAI THU la con tai Toe Hoa Giai rong quyen AD Xuyen vao ngay 02- 03-1967 Cho nên mái có s if obénh 1 ch näm sanb gi us LUO HOAI THU va LUU DONG KAE qua xa, Va giua LUU HOAI THU va me lai qúa gan Tôi Kin Cam dogn abung 1di khai tron day hoan boan dung su that, tô1 xin chiu trach chiem neu CO man khai Lam tai NHI QUI, agay 28 thang 3 nam 1986 Kina ddn 31/30 LUU whan chung thu 1 : Nhan chung thu 2 : - Ho ten : Phan vain Bian - Ho ten : So-day. Aao - Sinh nam : 1915 - Sinh nam : 1992 - CMND so : FOIA (b)(6) - CMND so : FOIA (6) - Dia chi : ap Qui Than 4a Nhigui - Dia chi : of I've thank Xanthing Cailay (Singious) hugan laiking (Gin george) UBND Xa NHI QÚI Chung that Harm Loi khai tren day cua ong LUU THONG v s hai man chung hoan toan dung su that NH QUI, ngay 28 thang 3 nam 1986 CHUTICH my"
}