{
	"anumber": "A40269175",
	"id": "A40269175_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0038/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: FOIA ( (b)(6), Form Number: Not specified in the image provided."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1990, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/22/2023 I have stocks and bonds with the following market value, as indicated on the attached list which I certify to be true and correct to the best of my knowledge and belief. $ 0 I have life insurance in the sum of $ 130,000.00 With a cash surrender value of $ 5,000.00 I own real estate valued at $ 220,000.00 With mortgages or other encumbrances thereon amounting to $ 165,000.00 Which is located at 82 Summerstone, Irvine, CA 92714 (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me Hinh Su Duong X 44 wife FOIA (b)(6) 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted Luu Thong 1985 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted Luu Thong father May 20, 1986 (Complete this block only if the person named in item 3 will be in the United States temporarily.) That I do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly, or for how long.) OFFICIAL SEAL SUNLY PING WINKLES Notary Public-California ORANGE COUNTY O TH OR AFFIRMATION OF DEPONENT My Comm. Exp. Dec. 28, 1990, I the Instructions, Sponsor and Alien Liability, and am aware of my responsibilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that I know the contents of this affidavit signed by me and the statements are true and correct. Signature of deponent We Andy Subscribed and sworn to (affirmed) before me this 18th day of May 19 87 at ignature Santa of Officer Ana Administering CA Oath Lundy Ping the .My commission Winkle I declare expires that this Title document 29 Notary Dec 1990 Public on If affidavit prepared by other than deponent, please complete fo llowing: was prepared by me at the request of the deponent and is based on all information of which have knowledge. (Signature) (Address) (Date)"
}
