{
	"anumber": "A40201165",
	"id": "A40201165_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40201165_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MINISTERIO DEL DISTRITO NACIONAL, 26626"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1884, 2023, 1963]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 trive MINISTERIO DEL DISTRITO NACIONAL MANAGUA, D. N. REGISTRO DEL ESTADO CIVIL DE LAS PERSONAS No. 26626 VALOR: Cinco Córdobas (C$ 5.00) MATRIMONIO CERTIFICACION DE: ULISES FONSECA TALAVERA Abogado y Registrador Público del Estado Civil de Managua, CERTIFICA 1884, III, Que bajo No Página 739, Tomo del Libro de MATRIMONIOS que llevó esta oficina en el año de 1963, se encuentra el Acta que literalmente dice Pet \"No. 1884. - PAUL STADING THOMAS y ANGELA MARIA MEJIA SOLIS. En Managua, a veinticuatro de diodembre de mil novecientos sesenta y tres.- Ante el infrascrito Registrador del Estado Civil y Sécretario que autoriza, H. G. Libby, Juez 20. Civil del Distrito de Managua, por oficio informa: quea las diez y treinta de la mañana del día 08- torce de este mes, autorizó en esta ciudad el matrimonio civil'd los señores: PAUL STADING THOMAS, de veintidos años, estudiante de Socio- logía y ANGELA MARIA MEJIA SOLIS, de veintitres años, tecnóloga Médi, ca, ambos solteros y de este domicilio.- Fueron testigos del acto: Gonzalo Castellón Pérez, oficinista y Rolando Gutiérrez Cortes, Minis tro Bautista, los dos mayores de edad, casados y de este domicilio.- El conyuge nacido en Fairbark, Iowa, Estados Unidos de America, hijo de George Thomas y Edwa Stading de Thomas y la cónyage nacida en Ma- nagua, Nicaragua, hija de Rodolfo Mejía Ubilla y María Solis de Mejia. Leída que fue esta acta, se encuentra conforme, Be aprueba, ratifica y firmamos.- ULISES KONSECA T. LUIS A. TORRES MASIS. SRIO.\" Es conforme.- Manaona n. N diciembre de mil novecientos sesenta y tres. was ULISES FONSECA T. REGISTRADOR DEL ESTADO CIVIL DE NICUAL STATE Luis A. Torres Masis. SECRETARIO doorment my MANAGUA, ALRICA CENTER adoutment DIN. with erising. original contained returned true to NATZ. Dat."
}
