{
  "anumber": "A40269175",
  "id": "A40269175_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATEMENT, 90713"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1928,
        1942,
        1988,
        1906,
        1931,
        2023,
        1940
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/22/2023 STATEMENT\" I, the undersigned, LUU, THU HOAI, born on 12/15/1931 at Vietnam, a Lawful Permanent Resident Alien # FOIA (b)(6) - LOS, IC6, residing at 5718 Wolfe Street, Lakewood, California 90713, depose and say that: My father is Mr. LUU THONG, born in 1906 at Canton, China, married to my mother named TANG THI KEO in 1928, and gave birth to me on 12/15/1931 in An Xuyen, Vietnam. Due to the fact that my parents were illiterate-person, living in war time, therefore no certificate has been established in those days for my birth. In 1940, my mother got ill and passed away. I was still a small child, my father needed some one to take care of me. He re-married Mrs. VO THI KHA in 1942, afterwards they had the following children: 1- FOIA (b)(6) 2- 3- 4- 5- 6- My stepmother loved me as if I was her blood child. She gave me her name and an affidavit in lieu of Birth Certificate has been established at the Court on my behalf. Since then all my Civil Status records bear the name VO THI KHA as mother with father's name LUU THONG. That is the reason for a large distance between my birth date and the birth dates of my step-brothers and sisters. Two close friends of my parents, who were living at the time and have their own personal knowledge on the said facts, set their hands to this statement as witnesses. Under penalty of perjury, I declare that, to the best of my belief and knowledge, the above statement is true and accurate. Witnesses: At Los Angeles, on November 07, 1985 1) Full name: Duong Khai Minh The declarant, Date & place of birth: AnXuyen, Vietnam 09/17/17 Immigration status: LPR. AFOIA (b)(6), Los-IC6 Signature: Minh K Juony have Hoai Um (signature) 2) Full name: Ta Le Date & place of birth: AnXuven. Vietnam 01/08/20. Signature: case Immigration status: LPR. A FOIA (b) )(6) Los-IC6 Los Angeles County ) SS Enclosed are certified original copies State of California) and translations of my personal papers: NOTARY PUBLIC: - 01 Affidavit in lieu of Birth On this 07th day of November , 1985 Certificate issued by An Xuyen Court. before me Van Tuong Nguyen personally - 01 Pre-75 ID Card. appeared(1) Luu Hoai Thu , - 01 Marriage Certificate. (2) Duong Khai Minh and - 01 Tax Payer ID Card. copy, (3) Ta Le personally - 01 copy of I-551. I.C.D. Catholic Welfare Bureau and Telephone and DISTRICT known to me to be the persons whose names are subscribed to this instrument, and acknownledged that they executed it. OFFICIAL SF Contact a Re: VAN TUONG NGUYEN NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY My comm. expires NOV 12, 1988"
}