{
	"anumber": "A40201165",
	"id": "A40201165_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40201165_0009/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "JUNTA DE RECURSSION DE MANAGUA, 3676"
		},
		"years": {
			"ms_years_nlp_v1": [1937, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. 7/25/2023 MARRISH@ 58542 SERIE \"D\" Mejia Solis BOOT 20 DOS 1046584 T-37 144 STATE SECURITY JUNTA DE RECONSTRUCCION DE MANAGUA Tasas por servicio, de conformidad con el Art. 14 de t: 2 la Ley Orgánica de la \"Junta de Reconstrucción de 2 Managua\" y Municipalidades, el Arto. 32, (inc. 2) del No 3676 Plan de Arbitrios vigente y Arto. 574 del Código Civil. 3 CERTIFICADO DE: + NACIMIENTOS, DEFUNCIONES, MATRIMONIOS, RECONOCIMIENTOS DE HIJOS. 5 VALOR C$ 15.00 LA 6 OLGA ISABEL MONCADA DE NAVARRO.= 7 ABOGADO Y REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE MANAGUA No es Válido sin el 8 Sello de la Contro- loria general de la CERTIFICA : República. 9 Que bajo No. 138 Tomo I Folio 144 del LIBRO DE , 10 MATRIMONIO.- que llevó esta Oficina en el año de 1937 se encuentra 11 el Acta que literalmente dice: 12 Ben 13 \"No. 138. RODOLFO MEJIA. Y JOSEFA MARIA SOLIS.= En Managua a tres de Mayo de mil 1-1- novecientos treinta y siete, E1 Juez 20 Local Civil Bachiller Rodolfo Abaunza, por oficio informa, que a las doce y media de la tarde del veinte de Marzo último ve- 15 rificó en esta ciudad el Matrimonio Civil de Rodolfo Mejia de veintitres años, de 16 17 edad, \"ontador, Mercantil, con Josefa Maria Solis, de diecinueve años, de edad,de oficio domesticoa, ambos solteros, y de este domicilio, en presencia de los seño- 18 19 res testigos, don Arturo Parajon, Pastor Evangelico, y don Damian Cruz, Maestro 20 de Enseñanza, ambos Casados, mayores de edad, y de este domicilio, con lo que con- cluye este acta que firmo con el Secretario que autoriza, ALBERTO SELVA. N.CAS= 21 TRO.E. Srio.- 22 Es conforme Managua siete de Enero de mil novecientos ochentiuno.- 23 2+ 25 OLDA ISABEL MUNCADA DE NAVARRO.= REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE MANAGUA.= 26 27 Ante mi; ICM.= 28 29 30 \" AÑO DE LA ALFABETIZACION"
}
