{
	"anumber": "A40269175",
	"id": "A40269175_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LOẠI ĐĂN VÀ LÊ KHAI GIA–DIỆN CÔNG NHỚ DE THI–HANH"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/22/2023 LO'I CHI DAN VE THE LÊ KHAI GIA-DINH C CÁC GIA-TRIJO'NG GHI NHO DÈ THI-HANH - 1.- Khi di chuyen ca nhan hay tron gia.dinh di & noi khác, Gia-truong pha. khai báo ch Lien-gia-Truong và xin giay chung nhan di-chuyen tai Van-phong Phuong.Truong noi cu-ngu. 2.- Khi den noi cu-ngu mói phai trinh bão cho Lien-gia-Truong và Phuòng- Truong dè lap to khai gia-dinh mói va nôp cho Vän-phong Phurng. 3.- Khi có thân nhan dén Iam trú. a) Tur 15 ngay trò lai : Gia-truong phai làm 2 bon don theo mau, triph Lién-gia-Trurong chieu nhan xong giù bon nay de xuat trinh moi khi nha chuc-trách xét höi. Có the nap ban sao giay phép di duong cua nha chúc-trach noi di cáp thay don khai tam trú. (Trong giay phép di duong phai ghi dia chi tam trú tai Saigon). b) Tu 16 ngay dén 2 tháng : Gia-trurng phai làm don 3 bon trinh Lien-gia-Trurng kien thi xong mang den trinh Vän-phong Phung- Trurng so tai kiem nhan. Co-quan nay se giù 2 bon (1 bon luru ho- so, 1 bon goi Ty Canh-Sát Quoc-Gia lien-hè), trao lai cho durong-su 1 bon de xuat trinh moi khi nha chúc trách xét hôi. Có the he sao giay phép di duong cua nhà chirc trách noi di cáp don khai tam trú. Có the durce gia han tam trú toi da oi lan tháng). c) Trên 6 tháng Gia.truring phai làm to khai xin ghi ten dur su vao khai linh theo the le nhu en (xin 4.- Khi có . khai them nig nhan di.chuyen winh-vien cua nha Lien-gia-Truong kien thi truróc khi dem dén Phuong-Trurong so tai kiem nhan cho ghi them ten nguoi den vão to khai gia-dinh. 5.- Khi thâu nhan 1 nguoi giup viec trong nha: Gia-truong phai làm to khai thanh 4 bon ghi rô ly lich cua nguroi giúp viec dem trinh Lien-Gia- Truong và Phrong-Trurn so tai de kién thi. Phung-Trurong giù 1 bon, chuyèn Ty Canh-Sat Quoc-Gia s tai 1 bon; Lien-gia-Truong 1 bon va Gia-Truong 1 bon. Tuy nhién, néu Gia-trurong biet chãc chan gia nhan se giúp viec lâu dài cho minh, thi Gia-trurg có the xin ghi them ten gia-nhan dó vao to khai gia dinh nhu trurng hop có thân nhan dén cu trú vinh vien (diem 4). 6:- Gia-truong hoàn toàn chiu trách nhiêm ve sur khai them tên hoãc bot ten trong To khai gia-dinh hoãc khai them hay bot nhürng gia dinh & dâu cung nhà, Nhing gia-truóng khong khai báo khi có sur thay doi so nguoi trong gia-dinh hoãc khai bão khong thành thât se bi tring phat và có the bi truy to theo hinh luát chieu Nghi-Dinh so 353-BNV/HC/NB ngay 30-6-1958."
}
