{
  "anumber": "A40269175",
  "id": "A40269175_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PO TIONAL FORM 30 ( (English/Vietnamese) (Rev. 6-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/22/2023 POTIONAL F ) (Er 30 (English/Vietnamese) (Rev. 6-82) 5 DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44 6 ba (XIN DUNG VIET Gi Duoi HANG NAY) 1 chi (Vien chuc lanh-su se giup duong don tra loi phan 43 va 44) 43. I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 40 for the following reasons: (Toi xin thinh-cau duoc Ic-mien Khoi su thieu tu-cach lanh chieu-khan va bi loai-tru nhu qui-dinh duoi Khoan phan 40 vi cac ly do sau day) 212(a)(14) Beneficiary of Waiver under 212(a)(28)(I)(i) 212(b)(1) (Dude huong dac mien theo). 212(a)(28)(1)(ii) 212(b)(2) Not applicable 212(e) 212(h) (Khong ap dung) 212(g) 212(i) Attached I_I (Dmh Kem) 44. I claim to be a (Ti thinh cau duoc) preference immigrant subject to the numerical limitation for (Foreign state or dependent area) Xep hang nhap- cu tuy-thuoc gi8i-ha tuc-so danh cho (ngoai xu hay vung phy can não) Special immigrant not subject to limitation (Nhap-cu cách Khong tuy thuoc giói-han) Immediate relative of a United States citizen (Nhap-cu voi tu-cách than-nhan ruot cua mot cong-dan Hoa-Ky) My claim is based on the following facts: (L3i thinh cau cua tdi duoc can cu các su kien sau day) I am (my is) the beneficiary of a petition. [Toi là ( cua toi là) nguoi duoc huong] (mot don xin ) I am a returning resident alien. (Toi la mot ngoai Kieu thuong-tru tro' I derive foreign state chargeability under Section 202(b) through my (Ti duoc Ke vao tuc-so nhap-cu danh cho ngoai qui-dinh doan 202 (b) qua cua toi) Other (specify) Dieu gi Khac (xin noi ro) I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigra- tion laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answers to parts 32 through 41 inclusive, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United states, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in otehr activities subversive to the national security; in amy activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the Unites States, by force, violence, or other unconstitutional means. Toi hieu ro rang toi phai nop chieu-Khan lai cho Vien-chuc Nhap-Cuf Hoa-Ky tai ia-diem ma toi xin nhap-canh Hoa-Ky, va hieu rang du cho có chieu- Khan tôi cung Khong co quyen nhap-canh Hoa-Ky, neu Khi do cac vien-chuc nhan thay rang toi Khong co the duoc theo luât phap nhap-cu? Ti hieu ro rang moi co y Khai man, Khai lac hay CO mot su kien nao deu co the lam cho toi bi loai-tr vinh-vien Khoi Hoa-Ky, va neu da duoc roi thi co the lam toi bi truy-to hay truc-xuat, hay ca hai. Toi Ky ten duoi day, duong don xin chieu Khan nhap- Hoa-Ky, xin long-trong tuyen-th (hay am-Ket) rang moi loi Khai ghi tren don nay do toi lam, gom ca nhung cau tra ldi cho cac phan tu 32 den 41, va nhu toi biet va xac tinh thi nhung loi khai nay deu la su that va day du. Toi cung tuyen-t the (hay cam-ket) them rang, neu duoc nhap vao Hoa-Ky, toi Se Khong hoat-dong gi lam thiet-hai cho cong-ich hay nguy-hai cho nen an-ninh, an-toan hay an-ninh cua Hoa-Ky; nhung bi cam chi Hoa-Ky lien-hê den pha-hoai ngam, pha roi trat-tu\" cong cong hay nhung hoat-dong Khac co phuong-hai cho an-ninh quoc-gia; nhung não nham chong doi, hay Kiem-soat, hay lât do 'chinh-phu' Hoa-Ky bang vo-luc, bao-dong, hay bang cac phuong-tien vi-hien khac. I understand all the foregoing statements, having asked for and obtained an explamation on every point which was not clear to me. (Toi hieu ró tat ca nhung Loi khai tren day sau khi da hói va duoc giai-thich ve moi diem ma toi chua hieu ró). 2-12 (Signature of Applicant) (chu ky duong don)"
}