{
  "anumber": "A40269175",
  "id": "A40269175_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0034/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Republic of Viet-Nam Ministry of Justice Judiciary Service of Southern Viet-Nam Decree Substituting for the Birth Certificate of Justice of the Peace of Long Xuyen."
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        1931,
        2023,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/22/2023 Republic of Viet-Nam Ministry of Justice Jud iary Service of Southern Viet-Nam Jus se of the Peace of An-Xuyen Date:Mar. 02, 1967 Court Decree substi- EXCERPT FROM THE ORIGINAL ON FILE AT THE OFFICE tuting for the birth OF THE COURT CLERK OF THE COURT OF THE FIRST INS- certificate of Luu TANCE OF JUSTICE OF THE PEACE OF LONG XUYEN. Hoai Thu An original Attestation substituting for the birth certifi- cate was issued td: Luu Hoai Thu by Mr. Chau Tu Phat of the First Instance bf , Presiding Judge of the Court acting as a Magistrate of the Justice of the Peace, on Mar. 02, 1967 and registered; This is the excerpt: Truong Van Hen, Phan Thanh Truong and Doan Thanh Tung These witnesses, after being read Article 16 of Decree of November 17, 1947 of the Chief, Provisional Government of Southern Viet-Nam, and Article 363 and successive Articles of the Modified Penal Code, amended from Decree- Law of Dec. 31, 1912, and after being duly sworn according to law, de- clare and affirm with certitude that they have known that: Luu Hoai Thu, male, was born in 1931 in Tan -Hung-Tay, An- Xuyen Province to Luu Thong and Vo Thi Kha. Certified true copy of the original: At An-Xuyen on March 09, 1967 Signed: Dang Van Sanh Chief Court Clerk With seal he-undersigned Hoa Thi Nguyen, a Vietnamese-born U.S. ci- tizen, of the Family Reunification, Immigration & Naturali- Westminster, California 92683, being duly sworn according zation Info Service Center at 10451 Bolsa Ave., Suite 210, to law, deposes and says that she is thoroughly conversant with the English, French and Vietnamese languages and that Vietnamese to document and that it is an accurate and true copy she has made the above translation of the attached original the best of her knowledge and belief. Hoalhing Signed: Noa Thi Ngüyen State of California SS County of Orange Subscribed and sworn to before me this 12th day of May 198 6. OFFICIAL SEAL DAO VAN NGUYEN NOTARY PUBLIC a CALIFORNIA Notary Public ORANGE COUNTY My comm. expires JUN 17. 1988"
}