{
  "anumber": "A40201165",
  "id": "A40201165_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40201165_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE FOR ISSUANCE OF IMMIGRANT VISA, FORM I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 U.S. Department of Justice OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-86 PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp FOR ISSUANCE OF IMMIGRANT VISA manager 11-81906 (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY SPM 048692 35 7/8/86 TO THE SECRETARY OF STATE: 9-8-86 REMARKS The petition was filed on APPROVED The petition is approved for status under LAS RAC DIRECTOR PERSONAL INTERVIEW CONDUCTED section: JPM DOCUMENT CHECK ONLY SPOUSE, 201 (b) CHILD 203 (a) (2) OF JAN 29 1987 FIELD INVESTIGATION COMPLETED DATE APPROVAL PREVIOUSLY FORWARDED ACTION 20 (b) PARENT Clailto 203 (a) (4) Recommen and DD LIN 3388 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: METiA Rodolko 0 Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? Nicaragua 08 1/12/14 YES NO 9. Petitioner's name is (Last, in CAPS) (First) (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) THOMAS Angela Maria 612-275-3563 Father 12. Other names used by petitioner (including maiden name if married woman) AngelaM.(Mejia)Thomas 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item it petition is for your spouse) 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Paul S.Thomas U.S.A 04/13/42 J. Maria (Solis/Mejia Apartado 2128 15 Managua, Nicaragua O.A Names, birthdates and countries of birth of beneficiary's children: Rodreto 4/18/39 Lester - 3/0.146 Nitarian Anaela 12/9/60 - Nicamic FOIA (b)(6) Ivan - 11/10/42 FOIA (b)(6) 16. Check the appropriate box below and furnish the information required for the NUA 5 Beneficiary will apply for a visa abroad at the American Consulate in Nicaragaa (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) P.O. Box 246 Dasuel MW 51325 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) Apartado 2128 (Province or State) (ZIP Code) Managua Nicaragua e 4 . 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) Same as above (b) If the beneficiary's native alphabet is other than Roman letters. write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) Completed 1998 OVER Received s De- Ap- turned preved Sent FORM 1-130 Received RECEIVED RET'D. TRANS. OUT COMPLETED (Rev. 5-5-83) N"
}