{
  "anumber": "A40280965",
  "id": "A40280965_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40280965_0029/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "女"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA MEDICAL EXAMINATION OF VISA APPLICANTS, OPTIONAL FORM 157 ( (Formerly FS-398)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 DEPARTMENT OF STATE PLACE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA Red Cross Hospital MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION 1987 4124฿ At the request of the American Consul at CITY Guangzhou COUNTRY I certify that on the ve date I examined NAME (in English and Chinese , AGE SEX WANG BI WEN 77 # WHO BEARS PASSPORT NO. ISSUED BY ON 568848 1986.12.10 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid yes #, no Lymphogranuloma venereum yes no Gonorrhea yes . no H Syphilis, infectious stage yes no Granuloma inguinale ) yes #. no Turerculosis, active yes no Leprosy, infectious ) yes # no MENTAL CONDITIONS: : Mental retardation yes . no E Previous occurrence of one or more attacks yes . no Mental defect yes . no (mental deficiency) ) of insanity Narcotic drug addiction yes #. no Psychopathic personality yes no H Chronic alcoholism yes ts. no H Insanity yes Ts. no Sexual deviation yes #. no H (see proviso, sec. 34.7, USPHS Regs.) CLASS B: yes no Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-being. CLASS C: yes . no Ametropia Minor Conditions. ** Rizzo CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2) (1) (2) My examination, including the X-ray and other reports below, revealed: : (1) NO defect, disease, or disability. . . (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A,B, or C- diagnosis, and pertinent details*): A, BEC. Ordminiscataract class B Chang Chest X-ray report Chest X-ray number 8701615 146 NO EVIDENCE OF DESEASE cm 54 YAHN REACTION NEGATIVE kg from Dr. Blood serological report from Dr. Other special rsport(s) (when needed) UTFRES from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT 45258 OPTIONAL FORM 157 Continue on reverse side if necessay. (Formerly FS-398) ."
}