{
	"anumber": "A40269175",
	"id": "A40269175_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Công tác xã hộiizing các hoạt động về văn hóa và văn hóa xã hội trong các trung tâm văn hóa xã hội, Luu-Thong"
		},
		"years": {
			"ms_years_nlp_v1": [1906, 1984, 2023, 1968]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/22/2023 CERTIFICATION ONG HOA XA HQI CHU NGHTA VIET NAM THAT THEIR Home BURNED DGC L - Ty Do - Hgnh Phuc DOWN. T-) ON XIN XÃC NKAN 0000000--- /-(INH GOI : - BY BAM XA NHI quf HUYON CAI LAY TINH TIEN GIANG. 2 Toi ten la LU'U THONG - sanh nam 1906 tai Quang Dong (Trung- Hoa). Giay thong hanh so 28.988-TH2 cap tai Noi ngay 15-06-a983. Hien ngu tai Ap Qui Thank, xa Tan HOi, Huyen Cai Lay, Tinh TienGiang Kinh thua Quy Ong, Nguyen gia dinh toi ngu tai Ap Qui Hiep, xa Nhi Quf, nha toi nam doc quoc 18 4 (nay la Quoc 1g I). Vao nam 1968, khi cuce tong tien cong cua Quân giai phong (nam Mau -Than). Thuong CO nhieu tran danh nhau giua quân giai p hong va quân che do cu. Nen gia dinh toi cung so ba con cung xom, phai tan cu len nha the Huyen Cai Lay, de lanh nan. Dem 14 al Mam -Than (1968). Nha toi cung so nha lan can bi tring dan chay. Khi hay tin toi try ve chi con lai dong tro nha bi cháy 100 % Nen các giay to cu ti nam 1968 tra ve trucc khong con núa. Vita qua, gia dinn toi dudc s& Ngoai V4 gior thieu gap Phai- Doan HCR phong van ngay 30.05.1984, khi gap, Dai dien HCR you cau xuat trinh cac giay to cu nhu khai sinh va cac giay to lien he. Tat ca cac giay to do deu bi cháy nhu da ke a trên. Nay toi lam don nay xin Quy Cap chinn quyen chung nhan cho toi nhu da trinh bay a trên. De toi lam bang khi co SV you cau. Trong khi cho doi sy chap thuan cua Quy Cap Chinn quyen. Toi kinh goi 101 chan thank biet on.- Vacanam /)/gay 4 thang 06 nam 1984. ubuola Nhi Qui Vae Whain #/s Cit ngw Kinh don, ap Qui Hip kn due Guylay My Tho -Nay Lai la ap Que thans yes ate Que Hey in Cay lay Tith giang - Nam man Than LUTU - THONG - 19 68 giatine Cua ts W thing stan phas wia tics toan to July oh nam 1984 The New"
}
