{
  "anumber": "A40269175",
  "id": "A40269175_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40269175_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR VERIFICATION SUBSTITUTE FOR THE MARRIAGE CERTIFICATE, Nhi Qui on March 28, 1986"
    },
    "years": {
      "ms_years_nlp_v1": [
        1942,
        1968,
        1986,
        1918,
        1906,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/22/2023 SOCIALIST REPUBLIC OF VIET NAM Independence Liberty Happiness Nhi Qui on March 28, 1986 To: People's Committee of Nhi Qui Village Subject Request For Verification T Substitute For The Marriage Certificate. Dear Sirs: I, the undersigned Luu Thong, born in 1906 in Guangdong, China, bearing exit permit No.28.988.TH2 and presently re- siding in Qui Thanh Hamlet, Tan Hoi Village, Cai Lay District, Tien Giang Province. In former times Mrs. Vo Thi Kha born in 1918 in Cai Lay and I had been legally married to each other since Feb. 15, 1942 in Nhi Qui Village. In May 1968 my house was completely burned down due to war. There- fore all civil status documents of my family such as the mar- riage certificate between me and Mrs. Tang Thi Keo, her death certificate and the marriage certificate between me and Mrs. Vo Thi Kha, were totally burned; and I have been unable to obtain certified copies of these documents because the original registers were destroyed due to war. It respectfully requested that I be given a certification for future use as a substitute for my marriage certificate Signed: Luu Thong Certified correct by the People's Committee: Mr. Luu Thong's house was totally destroyed in May 1968. A certified copy of his marriage certificate cannot issued to him because the original marriage register of the current year does not exit anymore. This Certification is issued by our People's Committee to subject for his appropriate use. Nhi Qui on March 28, 1986 Signed: Nguyen Van Moi Chairman With seal The undersigned Hoa Thi Nguyen, a Vietnamese-born U.S. citizen, of the Family Reunification, Immigration & Naturalization Info Service Center at 10451 Bolsa Ave. Suite 210, Westminster, CA 92683 being duly sworn according to law, deposes and says that she is thoroughly conversant with the English, French and Viet- Over"
}