{
	"anumber": "A40280965",
	"id": "A40280965_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40280965_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-42028965"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 OPTIONAL FORM 155A, 6-82 (Formerly OF-155) DEPT. OF STATE NSN 7540-01 126 7761 50155-202 IV-4Q280,965 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name). INS FILE #, IF KNOWN WANG Bi Wen ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S. IMMIGRATION 130 SFR 1066 CA 983 212(e) 212(h) MAY 2.9 1987 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY YR OF BIRTH JR-S Wuhan, China 2/2/10 ADMITTED (CLASS) CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY UNTIL Wuhan, China PRC MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S XX D SEP Taoshi Xiaofang FINAL ADDRESS STREET ADDRESS, INCLUDE IN CARE OF & APT# IF APPLICABLE CITY, STATE AND ZIP CODE, IF AVAILABLE IN THE UNITED 3043 Berkeley Ave Los Angeles CA 90026 STATES SEC. 212(a)(14) OCCUPATION LABOR CERTIFICATION NOT APPLICABLE ATTACHED UNR SEX M NOT REQUIRED Unemployed F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN Consulate General IR-5 FOREIGN STATE/OTHER AREA LIMITATION AT Guangzhou, China IMMIGRANT VISA NO. 1024 L.Y. o Donnell ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 30/4/87 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 30/8/87 PASSPORT NO. 568848 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO WANG Bi Wen PHOTOGRAP ATTACHED BY The Ministry of Public Security PRC FOREION SERVICE Tariff No. 21 ON 12/10/86 Fee Paid $75 Local Cy, Equiv. UNITED STATES AMERICA EXPIRES 12/9/91 IV- 40280,965 , ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. GPO : 1985 o - 473-303"
}
