{
	"anumber": "A40485417",
	"id": "A40485417_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PRIMERA CLASE UN LEMPIRA 1984-1987, 2996276"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 MEMO ONE C PRIMERA CLASE UN LEMPIRA 1984-1987 CERTIFICACION No 2996276 0405 5-37-00064 - - 1 El Suscrito Registrador Civil Municipal de este término CERTIFICA 2 que en el libro original de Nacimientos del archivo de esta ofici- 3 na Tomo 23, folio 162 se encuentra el acta No 00064 que a la letra 4 dice: ALBA ARGENTINA MUÑOZ. = h. leg.- En la Ciudad de Corquín a 5 los quince dias del mes de Junio de mil novecientos treinta y sie- 6 te.= Ante mí Jeremias Mejia M. Secretario Municipal y ante los - 7 testigos don Aquilino Lara, escribiente y don Salvador Mejia, la- 8 brador, mayores de edad, casados, hondureños y de este vecindario GENERAL DE compareció don Eduardo Munoz de treinta y siete años de edad, ca- 10s sado escribiente, hondureño, originario de Erandique Departamento AND CONTRALOR HONDURAS. de Gracias y recidente en esta ciudad, dando cuenta que el Domin- 12 go seis del corriente mes, a las siete a.m. en su casa de habita- GENERAL AND ción que tiene en esta misma, nació una niña a la que le pusieron de Nondumn por nombre \"ALBA ARGENTINA MUÑOZ\". = Es hija legitima del denunci- 15 ante y de su esposa Isabel Orellana, de treinta años de edad, de CENTRAL oficios domesticos y de este domicilio. - Son abuelos paternos de la recien nacida, Eduardo Munoz y Mercedes Cruz de Munoz ya difun- 18 tos y maternos Rafael Orellana y Melecia Reyes, tambien ya difun- 19 tos y fueron de este domicilio.- - Lei lo escrito al denunciante y 20 encontrandolo conforme con su manifestación lo ratificó y firmó 21 conmigo y testigos.- Eduardo Munoz. - Aquilino Lara.- Salvador Me 22 jia. - Sello secretaría Municipal Jeremías Mejía M. srio. 23 ES CONFORME A SU ORIGINAL. 24 Extendida en Corquín Copán a los cinco dias del mes de 25 Febrero de mil novecientos ochenta y siete."
}
