{
	"anumber": "A40485417",
	"id": "A40485417_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORM DSP 70, 2-66, 18"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "Panama"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023, 1987, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 FORM DSP 70, 2-66 18.- LIST BELOW INDATE ORDER ALL PLACES WHERE YOU, YOUR SPOUSE AND UNMARRIED CHILDREN NAMED HE OTHER SID HAVE LIVED SINCE REACHING THE AGE OF 16. (It is not necessary to list the places where you have lived less than six 1. ENUMERE ABAJO ENORDEN DE FECHA TODOS LOS LUGARES DONDE UD., su ESPOSO(A) E HIJOS SOLTEROS IONADC TERIORMENTE VIVIERON DESDE LA EDAD DE 16 AÑOS. (No es necesario anotar los lugares en donde han vivido menosae seis meses, FROM-DESDE TO-HASTA FIRST NAME OF FAMILY MEMBER CITY OR TOWN, PROVINCE, COUNTRY OCUPATION month, year month, year NOMBRE DE LA PERSONA CIUDAD, PROVINCIA, PAIS Ocupacion mes, año mes, año ISABEL 6 Calle 10-11 Ave. , #95 (S.0) Ama de San Pedro Sula, Honduras Enero 1987 Presente casa Apartado Postal 1049, Zona 1 \" Panama, Rep. de Panama Turista Marzo 1986 Encro 1987 \" PANAMA Corquin, Copan, Honduras Ama de 1906 Marzo 1986 casa DSLTD 02/20/87 SENT 19. - MEMBERSHIP OF AFFILIATION IN ORGANIZATIONS IN EACH COUNTRY NAMED IN ITEM 18. CULTURAL, SOCIAL, LABOR OR POLITICAL MIEMBRO O AFILIADO A ORGANIZACIONES EN CADA UNO DE LOS PAISES MENCIONADOS EN EL No. 18: CULTURAL, SOCIAL, POLITICA. ORGANIZATION-ORGANIZACION FROM-DESDE TO-HASTA No es pertinente I certify that all information given is complete and correct. Certifico que toda la informacion dada es completa y correcta. DATE-FECHA SIGNATURE AND PRESENT ADDRESS: FIRMA Y DIRECCION ACTUAL: Seaming NOTE: If space above is insufficient to answer any questions properly, the additional information may be printed on a separete sheet of paper and attached to this from. NOTA: Si el espacio de arriba es insuficiente para contestar las preguntas adecuadamente, puede hacerlo en hoja separada la cual deberá adjuntar- se a este formulario. Offset Bulnes"
}
