{
	"anumber": "A40485417",
	"id": "A40485417_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PRIMERA CLASE UN LEMPIRA 1984-1987, No 2990561"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984, 1987, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 MEASUA OMAC PRIMERA CLASE CERTIFICACION UN LEMPIRA 1984-1987 DE DEFUNCION No 2990561 1 El Suscrito Registrador Civil Municipal de este termino \"CERTIFICA\" 2 que en el libro original de DEFUNCIONES DEL archivo de esta ofici- 3 na tomo No 1 en el folio No 90 se encuentra el acta No 00004 que 4 literalmente dice \"EDUARDO MUÑOZ CRUZ\" En Corquín Copán el dia Lu- 5 nes diez y siete de febrero de mil novecientos ochenta y séis An- - 6 te mi OscarsRolando Cuellar Registrdor Civil Municipal, Comparecio 7 Roberto Antonio Muñoz Orellana, hondureño, Maestro de Educacion 8 Primaria, Casado, Identidad. 0405-45-00105 mayor de edad y vecino GENERAL DE de Corquín Copán En su condicion de hijo Con la presencia de los 10gestigos siguientes: 1° Jacinto Gonzales López, hondureño, estudian CONTRALOR HONDURAS. te, Soltero, Identidad No 0501-65-00133. 20Cesar Augusto Gonzales GENERAL 12 López hondureño, Zapatero, Casado, Identidad 0405-50-00071 Ambos 15-mayores 10g de edad y vecinos de Corquín Copán. La Informacion de esta Defuncion es la Siguiente \"EDUARDO MUNOZ CRUZ\" hondureño, Sexo -- de Honduard 15 Masculino, Edad 88 Años Lugar de la defuncion departamento Copán CENTRAL Mpio Corquin Barrio las Delicias Fecha de la defuncion seis de -- Febrero de 1986 Hora 2: P.M. Domicilio Corquín Copan Estado del cadaver Reciente Causa del Fallecimiento \"LA PROSTOTA\" Nacio en Grandique Lempira Identidad No 1305-98-00004, datos del hogar and sobreviviente Nombre y apellidos de la esposa Isabel Orellana Nom- are de los hijos Mercedes, Argentina, Isabel, Saul, y Roberto Mu- 22 foz Orellana. Progenitores del Inscrito Padre: Eduardo Muñoz Hon- jureño, con domicilio en Erandique Lempira, Labrador, Madre: Mer- 24 cedes Cruz hondureña, domicilio Frandique Lempira, de oficios Do. - Mesticos. No testo. Permiso de Entierro Fecha 17-02-86 Cementerio-- Pasa"
}
