{
	"anumber": "A40485417",
	"id": "A40485417_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-4 40,485,417"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 OPTIONAL FORM 155A, 6-82 (Formerly OF-155) DEPT. OF STATE NSN 7540-01-126-7761 50155-202 IV-40485,417 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN AKA: ORELLANA, ISABEL THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN MUNOZ, ISABEL ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA U. S. IMMIGRATION STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION NEW ORLEANS, LA. 37 MAY CR670 212(e) 212(h) 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH ADMITTED (CLASS) CORQUIN, HONDURAS 06DEC06 UNTIL CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY SAN PEDRO SULA, HONDURAS HONDURAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP MELECIA RAFAEL FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE AND ZIP CODE, IF AVAILABLE IN THE UNITED BOX 94 RIVER PARK DR. STATES HAHNVILLE, LA 70057 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED Hor HOUSEWIFE F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AJ TEGUCIGALPA, HONDURAS HONDURAS IMMIGRANT VISA NO. Eugonia D. Walker TGG 863 3202 801 VICE CONSUL OF THE UNITED STATES ISSUED ON (Day) (Month) (Year) Consolde Officer of the United States of America 14MAY87 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 10SEP87 PASSPORT NO. 239460 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO ISABEL ORELLANA DE MUNOZ PHOTOGRAPH ATTACHED BY MINISTRY OF FOREIGN AFFAIRS Tariff No. 21 FOREIGN SERVICE ON 07MAR86 Fee Paid $75 EXPIRES Local Cy, Equiv. UNITED STATES OF AMERICA 06MAR91 v-40485,417 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. GPO : 1985 o - 473-303"
}
