{
  "anumber": "A40485417",
  "id": "A40485417_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0025/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "femenino"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE BIOGRAPHIC DATA FOR VISA PURPOSE, DSP-70"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 CONSULAR SECTION DEPARTAMENT OF STATE AMERICAN ASSY TEGUCIGALPA DURAS BIOGRAPHIC DATA FOR VISA PURPOSE INSTRUCTIONS - INSTRUCCIONES plete one of these forms for each adult member of your family and for each child 16 years of age or older. Additional copies may be obtained from this office. Liene un formulario para cada miembro adulto de su familia y para cada hijo de 16 años o mas. Pueden obternerse copias adicionales en esta oficina. NAME NOMBRE (Family Name-Apellidos) (First Name-Nombres) (Middle Name-Segundo Nombre). MUNOZ ISABEL OTHER NAMES, ALIASES (If married woman, maiden name and surname of any previous spouses). OTROS NOMBRES, ALIAS SEUDONIMOS U OTROS NOMBRES QUE HAYA USADO. (Si es mujer casada, dar apellido de soltera). ISABEL ORELLANA NAME IN NATIVE LETTERS OR CHARACTERS IF DIFFERENT FROM ABOVE NOMBRE EN LETRAS o CARACTERES NATIVOS DIFERENTES DE LOS INDICADOS ARRIBA. NO ES PERTINENTE 2. PLACE OF BIRTH: (City) (State or province) (Country) DATE OF BIRTH: LUGAR DE NACIMIENTO: (Month) (Day) (Year) (Ciudad) (Estado O provincia) (Pais) FECHA DE NACIMIENTO: (Mes) (Dfa) (Año) CORQUIN COPAN HONDURAS DECEMBER 6, 1906 Male masculino PRESENT NATIONALITY PAST NATIONALITY SEXO: NACIONALIDAD ACTUAL NACIONALIDAD ANTERIOR Female - femenino HONDURENA HONDURENA 3. NAME OF FATHER: NOMBRE Y APELLIDO DEL PADRE: 4. MAIDEN NAME OF MOTHER: APELLIDO DE SOLTERA DE RAFAEL ORELLANA LA MADRE: MELECIA REYES 5. FATHER'S BIRTHPLACE: (City) LUGAR DE NACIMIENTO DEL PADRE: (State or province) (Country) (Ciudad) (Estado O provincia) (Pais) CORQUIN COPAN HONDURAS 6. MOTHER'S BIRTHPLACE: (City) (State or province) LUGAR DE NACIMIENTO DE LA MADRE: (Country) (Ciudad) (Estado O provincia) (Pais) CORQUIN COPAN HONDURAS NAME OF SPOUSE (Maiden or family name) (First Name) (Middle Name-Segundo Nombre) NOMBRE DEL ESPOSO(A) (Apellido de soltera) (Nombres) FECHA DE MATRIMONIO: NO ES PERTINENTE 8. SPOUSE'S BIRTHPLACE: (City, State or Province, Country) 9. SPOUSE'S BIRTHDATE: (Month, 10.-WILL SPOUSE INMIGRATE LUGAR DE NACIMIENTO day, year) WITH YOU? DEL ESPOSO(A): (Ciudad, Estado O Provincia, Pars) FECHA DE NACIMIENTO (Mes, i su ESPOSO(A EMIGRA NO ES PERTINENTE DEL CONYUGE: día y año) CON UD? Yes No SI No 11. - NAME OF SPOUSE'S FATHER: 12. - NAME OF SPOUSE'S MOTHER: NOMBRE DEL PADRE DE su ESPOSO(A): NOMBRE DE LA MADRE DE su ESPOSO(A): NO ES PERTINENTE 13.- BIRTHPLACE OF SPOUSE'S FATHER: 14. BIRTHPLACE OF SPOUSE'S MOTHER: LUGAR DE NACIMIENTO DEL (City, State or province, LUGAR DE NACIMIENTO DE LA (City, State or Province, PADRE DE su ESPOSO(A) Country) MADRE DE su ESPOSO(A Country) (Ciudad, Estado O Pro- (Ciudad, Estado o Pro- NO ES PERTINENTE vincia, País) NO ES PERTINENTE vincia, Pars) 15.- LIST UNMARRIED CHILDREN UNDER 21 YEARS. NOT U. S. CITIZENS, WHO WILL ACCOMPANY YOU. ENUMERE LOS HIJOS SOLTEROS MENORES DE 21 AÑOS, QUE NO SEAN CIUDADANOS AMERICANOS Y QUE VIAJEN CON UD. NAME OF CHILD PLACE OF BIRTH (City, State or Province, Country) BIRTHDATE NOMBRE DEL HIJO LUGAR DE NACIMIENTO (Ciudad, Estado O Provincia, País) FECHA DE NACIMIENTO: NINGUNO 16.- IF YOU OR YOUR SPOUSE ARE NOW, OR HAVE BEEN IN THE UNITED STATES, STATE: SI UD. O su ESPOSO(A) ESTAN ACTUALMENTE O HAN ESTADO EN LOS EE. UU., INDIQUE: WHERE WAS VISA OBTAINED: WHEN WAS VISA GRANTED (month, year) Applicant-solicitante DONDE OBTUVO LA VISA: CUANDO FUE EXPEDIDA LA VISA (mes, año) Spouse-esposo(a) TEGUCIGALPA 1979 CHECK TYPE OF VISA USED FOR SUCH ENTRY: CHEQUEE EL TIPO DE VISA USADO PARA LA ENTRADA: Immigrant Government or International organization official or employee: Exchange visitor Inmigrante Organizacion gubernamental O internacional, oficial O empleado: Visa de Intercambio Other nonimmigrant Specify: Otro tipo de visa TURISTA Especifique: de No inmigrante 17.- IF YOU OR YOUR SPOUSE PREVIOUSLY LIVED IN THE UNITED STATES AS IMMIGRANT. STATE: SI UD. o su ESPOSO(A) VIVIO ANTERIORMENTE EN LOS EE. UU. COMO INMIGRANTE. INDIQUE: DATE ADMITTED DATE DEPARTED REASON FOR DISCONTINUING RESIDENCE FECHA DE ADMISION FECHA DE SALIDA RAZON PARA DESCONTINUAR su RESIDENCIA NO ES PERTINENTE DSP-70 Over (Véase al dorso)"
}