{
	"anumber": "A40427106",
	"id": "A40427106_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40427106_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PETITION TO CLASSIFY STATUS OF ALIEN PELATIVE FOR ISSUANCE OF IMMIGRANT VISA, FORM 1-30"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1886, 1986, 2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 6/6/2023 Immigration and Naturalization Service Approval expires 4-86 PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE AGS 19 I 10 PM 00 Fee Stamp FOR ISSUANCE OF IMMIGRANT VISA Jegs egalpa (PLEASE NOTE - YOU ARE THE PETITIONER AND 431250 YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: The petition was filed on 8/19/86 REMARKS The petition is approved for status under U.S. APPROVED INS PERSONAL INTERVIEW CONDUCTED section: RAC DIRECTOR DOCUMENT CHECK ONLY RECEIVED LINCOLN, NE FIELD INVESTIGATION COMPLETED SPOUSE, DATE CONSULAR SECTION 201 (b) CHILD 203 (a) (2) OF RECOMMENDED BY: APPROVAL PREVIOUSLY FORWARDEDEMBASYS ACTION Wattson 201 (b) PARENT 203 (a) (4) DD DATE OCT 1986 03 NOV. 203 (a) (1) 203 (a) (5) DISTRICT Tegucigalpa, D. (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) Honduras 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: PACHECO, Teresa Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? None YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption Honduras, C. A. May 3, 1907 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) PACHECO, Samuel 312-762-5693 Mother 12. Other names used by petitioner (including maiden name if married woman) None 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) None 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Son- Samuel Pacheco ( 04-15-1940 Honduras CA ) 2742 South Christiana, Chicago, Illinois 60623 USA 15. Names, birthdates and countries of birth of beneficiary's children: Son- Samuel Pacheco ( 04-15-1940 Honduras, CA ) 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in Tegucigalpa Honduras CA (CITY IN FOREIGN COUNTRY) FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at FOIA (b)(6 If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in n/a (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 2742 South Christiana, Chicago, Illinois 60623 USA 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) 4 Ave. entre 4 y 5 Calle, Barrio Concepcion Casa #27, San Pedro Sula, Honduras 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) C.A. LIAIT n/a (b) If the beneficiary's native alahabet Stothe than Roman/letters, writehisther name and address in the native alphabet: (Name) RECEIVED (Number and (Town or City) (Province) (Country) DATE 2 0 1986 BY n/a OVER SENT OUT OF MAIL UNIT 2 2 1986 DATE 2 0 1986 BY RECEIVED TRANS. IN RET'D TRANS. OUT COMPLETED FORM I-130 (Rev. 5-5-83) N 001 x7 1886"
}
