{
	"anumber": "A40485417",
	"id": "A40485417_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0038/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR VERIFICATION OF DEPOSIT, 01-0057 ( (10/82)"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 MGIC Federal National Mortgage Association REQUEST FOR VERIFICATION OF DEPOSIT Instructions: Lender - Complete items 1 thru 8. Have applicant(s) complete Item 9. Forward directly to depository named in Item 1. Depository - Please complete items 10 thru 15 and return DIRECTLY to lender named in Item 2. PART 1 - REQUEST 1. TO (Name and address of depository) 2. FROM (Name and address of lender) ASI FEDERAL CREDIT UNION P.O. BOX 50280 NEW ORLEANS, LA. 70150 3. SIGNATURE OF LENDER 4. TITLE 5. DATE 6. LENDER'S NUMBER (Optional) CHRISTINE DEHNER LOAN OFFICER 12/29/86 7. INFORMATION TO BE VERIFIED TYPE OF ACCOUNT ACCOUNT IN NAME OF ACCOUNT NUMBER BALANCE $ $ $ $ TO DEPOSITORY / have applied for a mortgage loan and stated in my financial statement that the balance on deposit with you is as shown above. You are authorized to verify this information and to supply the lender identified above with the information requested in items 10 thru 12. Your response is solely a matter of courtesy for which no responsibility is attached to your institution or any of your officers. 8. NAME AND ADDRESS OF APPLICANT(s) 9. SIGNATURE OF APPLICANT(s) MR. AND MRS. JOSE F. COCHRAN P.O. BOX 94 HAHNVILLE, LA. 70057 TO BE COMPLETED BY DEPOSITORY PART II - VERIFICATION OF DEPOSITORY 10. DEPOSIT ACCOUNTS OF APPLICANT(s) AVERAGE BALANCE TYPE OF ACCOUNT ACCOUNT NUMBER CURRENT BALANCE FOR PREVIOUS DATE OPENED TWO MONTHS SAVING 38080-1 $ 1467.48 $ 1500.00 8-1-79 CHECKING 38080-2 $ 1022.38 $ 700.00 1-27-84 $ $ $ $ 11. LOANS OUTSTANDING TO APPLICANT(s) LOAN NUMBER DATE OF LOAN ORIGINAL CURRENT INSTALLMENTS SECURED BY NUMBER OF AMOUNT BALANCE (Monthly/Quarterly) LATE PAYMENTS $ $ $ per $ $ $ per $ $ $ per 12. ADDITIONAL INFORMATION WHICH MAY BE OF ASSISTANCE IN DETERMINATION OF CREDIT WORTHINESS (Please include information on loans paid-in-full as in Item 11 above) 13. SIGNATURE OF DEPOSITORY 14. TITLE 15. DATE Loon The confidentiality of the information you have furnished except of information is required by applicable law will be be preserved transmitted through where official the disclosure applicant this 12/28/86 The form is to be transmitted directly to the lender and is not to or any other party. Form #01-0057 (10/82) Previous edition will be used until stock is exhausted FNMA Form 1006 Rev. June 78"
}
