{
  "anumber": "A40427106",
  "id": "A40427106_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40427106_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Optional Form 2, 230B"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1982,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/6/2023 Optional Form 230B Page 6 Entiendo que estoy obligado a entregar mi visa al funcionario de Inmigración de los Estados Unidos en el lugar donde solicite entrada a dicho país, y además entiendo que el poseer una visa no me da derecho a entrar a los Estados Unidos si en ese momento se determina que soy inadmisible de acuerdo con las leyes de inmigracion. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) También entiendo que cualquier declaración hecha por mi en esta solicitud, que sea intencionalmente falsa o tergiversada, o el haber ocultado inten- cionalmente algún hecho esencial, puede ser causa de que se me rehuse permanentemente la entrada a los Estados Unidos, y de que, si ya hubiere entrado a los Estados Unidos, podría estar sujeto a enjuiciamiento penal, deportación, o ambos. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) Yo, el suscrito, solicitante de una visa de inmigrante para los Estados Unidos, juro solemnemente (o afirmo) que todas las declaraciones que aparecen en esta solicitud fueron hechas por mi incluyendo las respuestas a los parrafos del 32 al 41 inclusive, y que éstas son veridicas y completas a mi mejor saber y entender. Ademas, juro (o afirmo) que en caso de ser admitido en los Estados Unidos, no llevare a cabo actividades que serian perjudiciales al interés público o podrian en peligro el bienestar, la seguridad 0 la tranquilidad de los Estados Unidos, ni me dedicare a actividades probibidas por las leyes de los Estados Unidos en lo relacionado con espionaje, sabotaje o desorden público, ni a otras actividades subversivas a la seguridad nacional, ni a ninguna actividad que tenga por objeto oponerse, dominar o derrocar el Gobierno de los Estados Unidos por medio de la fuerza, la violencia u otros medios anticonstitucionales. Comprendo perfectamente las aeclaraciones que anteceden, habiendo pedido y obtenido una explicación de cada una de las cláusulas que no habia entendido con claridad. [I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answer to parts 32 through 41 inclusive, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overtbrow of, the Government of the United States, by force, violence, or other unconstitutional means. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me.] XTuewa Part Firma del solicitante (Signature of Applicant) El parentesco alegado por el solicitante en los números 12 y 13 y verificado mediante documentación sometida al funcionario consular excepto según se indica: (The relationships claimed in items 12 and 13 verified by documentation submitted to consular officer except as noted:) Firmado y juramentado ante mí, el día del mes de del año de en la ciudad de (Subscribed and sworn to before me this 8 day of DEC 1987 ) Meler Firma del Funcionario Consular (Consular Officer) PETER Vice Consul of the United States of America TARIFF ITEM No. 20 PRINTINC 1982 0 - 361-526 (7427)"
}