{
	"anumber": "A40485417",
	"id": "A40485417_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0035/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 6/2023, United States of America State of Louisiana Parish of Orleans"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1937, 2023, 1957]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 UNITED STATES OF AMERICA STATE OF LOUISIANA PARISH OF ORLEANS I, Jose Cochran , residing at Box 94, 20 River Park Dr., Hahnville, Louisiana 70057 BEING DULY SWORN, DEPOSE and SAY: 1. (a) I am a citizen of United States of America having been born at La Lima, Cortes, Honduras on July 29, 1937 (Iwas registered as a U.S. citizen at the U.S. Embassy in Tegucigalpa, Honduras) (b) I hold U. S. Naturalization Certificate # Not applicable (c) I am an alien permanently residing in the U. S. and holding U. S. Immigration and Naturalization \"A\" Card # Not applicable 2. I am 49 years of age and have resided in the U. S. since 1957 3. That this affidavit is executed on behalf of the following person(s) residing at 6 Calle 10-11 Ave., #95 (S.O.) San Pedro Sula, Cortes, Honduras COUNTRY OF MARRIED RELATIONSHIP NAME SEX AGE BIRTH OR SINGLE TO DEPONENT Isabel Munoz F 80 Honduras Widowed Mother in law 4. (a) That I am employed as Office Manager with Avondale Shipyards Division P.O. Box 50280, New Orleans, LA. 70150-0280 and derive a net xxxxxdx income of $ 2,296.00/ month. monthly (b) That I have on deposit in savings banks in this country $ 1,500.00 (c) That I have other personal property, the reasonable value of which is $ 25,000.00 (d) That I own real estate at 20 River Park Dr., Hahnville, LA, 70057 valued at $ 65,000.00 with mortgages or other encumbrances thereon amounting to $ 18,000.00 (e) Other Deposit condominium valued in $7,000.00. Thay my wife Mrs. Alva Cochran also extends this affidavit of support as she is permanently employed at Avon Co., See attached letter. 5. The following persons are dependent on me for support: WHOLLY PARTIALLY NAME AGE RELATIONSHIP DEPENDENT DEPENDENT None 6. I have previously submitted Affidavits of Support on behalf of: Name Date Submitted None 7. That this affidavit is made by me for the purpose of assuring the Immigration and Naturalization Service that the above named persons will not become a public charges in the U.S.A. My reasons for giving this affidavit are: Because she is my wife's mother. DAVID A. KATTAN ATTORNEY PHONE 523-3803 419 GRAVIER ST. NEW ORLEANS. LA. 70130 SWORN TO AND SUBSCRIBED BEFORE ME Joe Coelnam alva Cachian THIS 20TH. DAY OF JANUARY , 197.87 AT NEW ORLEANS, LA. Daved a Math DAVID A. KATTAN Notary Public, Parish of Orleans, State of La. My Commission is issued for life."
}
