{
  "anumber": "A40485417",
  "id": "A40485417_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0009/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        1886,
        1986,
        1906,
        2023,
        1963
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 6/2/2023 OMB No. 1115-0054 Immi tion and alization Service (IN Petition for Alien Relative Expires 4-86 DO NOT WRITE IN THIS BLOCK Case ID# Action slamps INS Fee Stamp FEE A# APPROVED 35.00 PAID 039922 NOLD IMMIGRATION AND NATURALIZATION SERVICE G-28 or Volag# AUG 18 1886 C E IVE CONSULAR SECTION DATE 6/17/86 NEW COLLECTED LOUISIANACIYC BY. OhLEANS, Section of Law: 201 (b) spouse 203 (a)(1) AMERICAN EMBASYS Petition was filed on 6/17/86 iority date) 201 (b) child 203 (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) DIRECTOR, SRC-11 7 NOV. 1986 Document Check Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: REMARKS Tegucigalpa, D. a. Honduras A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) COCHRAN ALVA MUNOZ ISABEL 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) #20 River Park 3 6 Calle 10-11 Avenida # 95 (S.O.) (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Hahnville, Louisiana 70057 San Pedro Sula, Cortes, Honduras 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Corquin, Copan, Honduras Corquin, Copan, Honduras 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male (Married Single Male Married Single June 6, 1937 Female Widowed Divorced Dec. 6, 1906 Female XiX Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Alva Munoz Isabel Orellana 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) December 18, 1963; New Orleans, LA. Not applicable 9. Social Security Num ber 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) A FOIA (b)(6 None 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended None Eduardo Munoz (Deceased) February 6, 1986 13. If you are a U.S. My citizenship was acquired through (check one) citizen, complete the following Kamp 13. Has your relative ever been in the U.S.? Yes No Birth in the U.S. CONTACT REPRESENTATIVE - NOL 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, exchange alien, crewman, Give number of certificate date and place it was issued stowaway, temporary worker, without inspection, etc.) 12583839 - April 30, 1986; New Orleans, LA. Not applicable Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? (21910) Yes No If \"Yes\", give number of certificate, date and place it was issued Date authorized stay expired, or will expire as shown on Form 1-94 or 1-95 Not applicable Not applicable 15. Name and address of present employer (if any) 14. If you are a lawful permanent resident alien, complete the following. Date and place of admission for, or adjustment to, lawful permanent Not applicable Date this employment began (month/day/year) residence: Not applicable Not applicable INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED 06-17-86 Rec'd Sent Approved Denied Returned 06/9/16 Form I-130 (08-01-85) N Aont"
}