{
	"anumber": "A40427106",
	"id": "A40427106_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40427106_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PRIMERA CLASE UN LEMPIRA 1984-1987, NO. 2503345"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 PRIMERA CLASE UN LEMPIRA 1984-1987 No 2593345 La Infrascrita Registradora Civil Municipal de este termino, certifica que: 2 en el libro original denacimientos No 72, a la pagina 187,se encuentra el- 3 acta No 00112 que dice :Teresa Pacheco. \"Reposición\"En el pueblo de Cucuya- gua de Copán,a los veinticho dias del mes de Abril de mil novecientos ochen 5 ta y tres.-Ante mi Salvador López P.secreta rio municipal y Encargado del - 6 Registro civil de este termino y ante los testigos Reyna Amparo Romero y - 7 Marina Estrella Tabora, mayores de edad, casadas, escribientes, hondureñas y de 8 este vecindario, se recibió una comunicación librada a esta secretaria muni- 9 cipal, por el Juzgado Primero de Letras de lo Civil de la Sección Judicial-- GENERAL DEAGO de la ciudad de San Pedro Sula Cortes, de fecha veinte del mes que corre del 11 presente año;por medio de la cual en atención a lo previsto en los articulos DC HONDURAS 12 lo y 40 No 2 de la Ley de Organización y Atribuciones de los Tribunales, -- GENERAL 371del Código Civil,968-969-978 y979 del Código de Procedimientos ;Ordena :- al señor secretario municipal Encargado del Registro civil de este termino Proceda a reponer la partida de nacimiento de \"Teresa Pacheco\" ;quien nació en este municimio el dia 3 de mayo de 1,907 ;siendo hija de Micaéla Pacheco hondureña y de este vecindario:Comparé lo escrito con lo comuniccado, lo ra tifiqué y firmé con los testigos. Reyna A.Romero=Marina E.Tábora=Sello= - Salvador López PSrio= Es conforme.- 20 Extendida en Cucuya gua de Copán a 25 de Julio de 1,986 21 22 Hilda Margarita López 23 OFICINA Cuguyagua MUNICIPAL Registradora Civil Municipal.- - Gepan 24 Honduros, CA. 25N."
}
