{
  "anumber": "A40485417",
  "id": "A40485417_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Form Approved O.M.B. 4-7-R0150"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 Optional Form 230B (Spanish) 7540-00-149-0918 Form Approved (Rev. 7-79 (Formerly FS-510) Previous Editions Not Useable O.M.B. 47-RO150 Dept. of State-50230-303 DEPARTAMENTO DE ESTADO SOLI DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTI IONES: Este cuestionario debe llenarse por DUPLICADO a máquina o, de hacerlo a mano, en letras de molde legibles. Deben contestarse TODAS las preguntas pertinentes. Cuando una pregunta no es pertinente, indíquese N.P. (no pertinente). Si el espacio previsto en el cuestionario para la respuesta a alguna pregunta fuere insuficiente, sirvase contestar en hojas aparte, por duplicado, indicando los mismos números de las preguntas del cuestionario a las que corresponden las respuestas. Anexe las hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular le indique que lo haga. Los derechos para la presentacion de esta solicitud de visa de inmigrante son de U.S. $25.00 Estos derechos deben abonarse en dólares de los Estados Unidos o en su equivalente en moneda nacional, o mediante giro bancario, en oportunidad de presentar la solicitud al funcionario consular. Ct VNEVICY AICE cowann ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente, treemanente de Los Estados Unidos. DE 1986 Aun cuando el peticionario ya bubiere sido admitido a los Estados Unidos, una pr fraudulenian puede LA ser motivo de su enjurcramiento, PARA deportación, u ambos. PRESENTACIÓN DE ESTA SOLICITUD DE VISA DE INMIGRANTE SOM DEPARTMENT OF STATE DE US$ 125.00 (LPS. 250.00) APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00 The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the Unitea States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) MUNOZ ISABEL 2. Otros nombres que haya usado o por los cuales se le conozca (si es mujer casada, indique aqui el apellido de soltera) (Other names used or by which known (if married woman, give maiden name) ) Isabel Orellana 3. Nombre completo en alfabeto nacional, si no se usan caracteres romanos (r.g.: árabe) (Full name in native alphabet (if Roman letters not used) No es pertinente 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Día (Day) Mes (Month) Año (Year) Ciudad 0 pueblo (City or town) (Prov. o Dpto.) (Province) Pais (Country) 6 Diciembre 1906 80 Corquin, Copan, Honduras 7. Nacionalidad 8. Sexo (Sex) 9. Estado civil (Marital Status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) (Single (never married) Hondurena Incluyendo mi matrimonio actual, me he casado 1 veces. (Including my present marriage, I have been married times.) 10. Ocupacion (Occupation) 11. Domicilio actual (Present address) Ama de casa 6 Calle 10-11 Ave., #95(S.0.) San Pedro Sula, Cortes,Honduras 12. Nombre completo, domicilio, lugar y fecha de nacimiento del cónyuge (dé el apellido de soltera de la esposa) (Name, address, date and place of birth of wife/husband (Give maiden name of wife)) No es pertinente Fecha 8 lugar en que se celebró el matrimonio (Date and place of marriage) 13. Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos. (Names, addresses, dates and places of birth of all children) 14. Personas nombradas en los números 12 y 13 que me acompañarán O me 15. Domicilio definitivo en los EE.UU. seguirán a los Estados Unidos: Final address in the U.S.) (Person named in 12 and 13 who will accompany or follow me to the United States) Box 94, 20 River Park Drive Ninguna Hahnville, Louisiana 70057 ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}