{
  "anumber": "A40485417",
  "id": "A40485417_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Entry of Appearance as Attorney or Representative, G-28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1974,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 NO ICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE In re: DATE Isabel Munoz (Beneficiary) May 20, 1986 FILE No. Alva Cochran (Petitioner) I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): NAME Petitioner Applicant Isabel Munoz Beneficiary ADDRESS (Apc. No.) (Number & Street) (City) (State) (ZIP Code) c/o David A. Kattan, 419 Gravier Street, New Orleans, Louisiana 70130 NAME Petitioner Applicant Alva Cochan Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) c/o David A. Kattan, 419 Gravier Street, New Orleans, Louisiana 70130 Check Applicable Item(s) below: I am on attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia La. Supreme Court and U.S. Supreme Court and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2. I am on accredited representative of the following named religious, charitable, social service, or similar organization ablished in the United States and which is so ecognized by the Board: 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully. IN ACCORDANCE WITH PUBLIC LAW 90-83, 5 USC 500 (f) , 8CFR 292. 5 (a) AND SECTION 2, ACT OF NOVEMBER 8, 1965, PUBLIC LAW 82-232, PLEASE FORWARD ALL DOCUMENTS, NOTICES OR OTHER WRITTEN COMMUNTICATIONS DIRECTLY TO THE ATTORNEY OF RECORD. SIGNATURE COMPLETE ADDRESS David white 419 Gravier Street New Orleans, Louisiana 70130 NAME (Type or Print) TELEPHONE NUMBER DAVID A. KATTAN 523-3803 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: DAVID A. KATTAN (Name of Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: ANY AND ALL IMMIGRATION AND CONSULAR MATTERS AND FOLLOW UP. NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE Alva A. Cochran Kalva. a Cachian 5/25/86 ( NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented 23 a citizen of the United States or an alien lawfully admitted for permanent residence.) FORM G-28 UNITED STATES DEPARTMENT OF JUSTICE (Rev. 9-27-75) N Board of Immigration Appeals and Immigration and Naturalization Service"
}