{
	"anumber": "A40427106",
	"id": "A40427106_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40427106_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACION, Nº 1168540"
		},
		"years": {
			"ms_years_nlp_v1": [1975, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/6/2023 mean PRIMERA CLASE CINCUENTA CENTAVOS 1972-1975 No 1168540 1 ELE RTIFICACION 2 El Infrascrito Encargado del Registro Civil de este termino CERTIFICA: Que 3 en el Libro original de Nacimientos No.81 y a la pagina 3, se encuentra la 4 partida que literalmente dice; \"SAMUELPACHECO\" -En San Pedro Sula, a las GENERAL DE 5 tres de la tarde del día miercoles veinticuatro de Abril de mil novecientos cuarenta. Ante mi, Ernesto Cruz García, Secretario Municipal y ante los - HONDURAS testigos Delia Paz H. y Lily Guillén, mayores de edad, hondureños y de es- ADUANAS te domicilio, compareció la señora Irene de Hernandez, mayor de edad, hon- A dureña y de este vecindario, dando cuenta:que el día lunes quince del pre- de Handwrite 10 sente mes, a las tres de la maña-a en el barrio de Concepción de esta cin- GENTRAL * dad, nació un varón quien llevará por nombre; \"SAMUEL\". -Manifiesta la decla- * 912 AMOUND rante que es hijo natural de la señora Maria Teresa Pacheco, mayor de edad, 13 soltera, hondureña y de este vecindario.- -Son abuelos maternos: Carlos Alfre- 14 do Núñez y Micaela Pacheco ya difunto.- -Lei lo escrito alacompareciente lo 15 ratificó y no firmó por ignorar.-DELIA PAZ H .=LILY GUILLEN. =SELLO: ERNESTO 16 CRUZ GARCIA.= ES CONFORME CON SU ORIGINAL 17 Extendida en la ciudad de San Pedro Sula, a los veintiún días del mes de 18 Febrero de mil movecientos setenta y cuatro. 19 Junior RAFAEL RODRIGUEZ MONDRAGON 20 ENCARGADO DEL REGISTRO CIVIL POR LEY.= 21 22 23 24 25"
}
