{
	"anumber": "A40485417",
	"id": "A40485417_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40485417_0039/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PRIMERA CLASE UN LEMPIRA 1984 - 1987, 0157268"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 ORA PRIMERA CLASE UN LEMPIRA DIRECCION REGIONAL DE INVESTIGACIONES 1984-1987 SEGUNDA REGION SAN PEDRO SULA, CORTES No 0157268 CERTIFICACION DE BUENA CONDUCTA El Suscrito, Secretario de la Dirección Regional de In- vostigaciones de la Segunda Region con sede on ésta Ciudad CERTIFICA: Que ha si Capital do identificada dactiloscopicamente ISABEL ORELLANA Vda. DE MUNOZ mayor de odad, y viuda ,de oficios domésticos, honduroña y vecina de Corquín Dept o o opán ;después de haberse buscado detenidamente on los archivos que para tal efecto llova ésta de oficina; se ha comperobado que NO registra antecodentes policiacos de ninguna justifie naturaleza. 8 Extendida en la Ciudad de San Pedro Sula, a los scis dias DE GR del mes de marzo de mil novecientes ochonto y sicte. Dr 10 : STATE FUE HONDURAS L.BUSTILLO the SECRETARI SECRETARIO Podro SECRE COMBA Sula, BENEFAT DE 12 15 GION DELECAO SEGURID CORTES CENTRAL Vo Bo.- MAYOR DE INF RODOLFO RAIL DIAZ VELASQUEZ. DELEGADO SEGUNDA REGION * DE INVESTICACIONES, 18 CERTIFICACION 19 El Suscrito Director Nacional de Investigaciones Certifica:Que la firma que antecede y dice \"R.R.DIAZ VELASQUEZ.\", es autentica por haber sido - 20 21 puesta de su puño y letra siendo la misma que usa el Mayor de INF.RODOLFO 22 RAUL DIAZ VELASQUEZ, en el desempeño de sus funciones como Delegado de la 23 Segunda Region de Investigaciones de la ciudad de San Pedro Sula Departa- 24 mento de Cortes. 25 Extendida en la ciudad de Tegucigalpa,D.C.. a los veintiun dia del mes de Pa..."
}
