{
  "anumber": "A40551579",
  "id": "A40551579_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Tobin Park United Methodist Church"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Thailand",
        "Vietnam"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 2/10/2023 Tobin Park United Methodist Church 9410 ROANOKE EL PASO. TEXAS 79924 ROBERT E. WHITIS. MINISTER CHURCH: 755.7146 5104 ORLEANS PARSONAGE: 755-7237 July 12, 1988 Embassy of the United States of America Bangkok, Thailand Box 58 APO San Francisco, California 96346 Att: U. S. Department of Justice Immigration and Naturalization Service \"Orderly Departure Program\" To Whom It May Concern: This is to indicate the support and concern of the leadership and congregation of Tobin Park United Methodist Church of El Paso, Texas, regarding certain persons related to one of our members, Ms. Thanh Daniel, of El Paso, who is anxious that her mother and brother and his family, indi- cated below, should be allowed to immigrate to the United States of America. They have already been approved as candidates for the \"Orderly Departure Program.\" They are Ms. Daniel's mother: Ngo Thi Cau (alias Loan) IV # 11421 and her brother and his family, Pham Nguyen Hong and family IV # 11422. Their address is: 56 Thieu Tri, Phu Nhuan Ho Chi Minh City, Vietnam Our church will serve as a sponsor to these persons in helping them to find housing and employment. If there are any other questions which we may answer or any other way in which we may be of service, please be sure to contact us. Thank you very much. Sincerely, Robert E. Whitis, Pastor"
}