{
	"anumber": "A40551579",
	"id": "A40551579_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Căm HOA ĐỘI THƯ NGHIA VIỆT NAM, UBND PHUONG 10"
		},
		"years": {
			"ms_years_nlp_v1": [1946, 1948, 1901, 2023, 1902, 1983, 1944, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 CO G HOA KA HO1 CHU NGHIA VIET NAM DOC lap - The do - Harh phuc Thanh pho Ho Chi Minh, ngay 10 thang 02 nan 1983 Kinh g~i: by Ban Nhan dan Phuning 11, Quan Phi Nhuan. Thansing Kila AILO Toi TND ky Bien nhan day 020415217 CAU, cap ngay tu LOAN, 28.00.1978. sinh num ten dubi là NGO THI 1902. tai so: Hien cu ngu tai so nha 56 during Thisu Tri, Phuring 11, Quân Phú Nhuan, Ip, Ho Chi Minh. Lam dan nay kinh by ban nhan dan chung thuc cho toi not viec nhu sau: Nguyen truc kia toi CO chong ten la PHAT VAN HS Sinh nam 1901, an chet nam 1946. Trong th~i ginn chien tranh, giay in hô tich lien he bi that lac, t~i nay khong the xuat trinh awn. Nen nay toi lam ann nay CO hai ngud+ chung biet ro t6i. Qua trinh la tu khi chong toi chet wi nay, tôi van hoan toon song doc than, va 27 vay nuoi con toi cho tái ngay nay va 2 dia chi ke tren NOUL CHING THU NHAT: - NGO DINH TUY, sinh nam 1944 tai Phan Düng, Kien An. CMTND so: 020164577, cap ngay 20.6.1978 tai Quan Phú Nhuân, To. Ho Chi Minh. Hien cu ngu tad so nha 53/12A during Hoang Dieu, Quan Phú Nhuan, Tp. Ho Chi Minh. NGUOI CHUNG THU MAL: - NGUYEN THI HOA, sinh nam 1948 tai Saigon. Bien nhan CMTND so: 020052696, cap ngay 02.6.1978 tai Quân Phú Nhuan, tp. Ho Chi ninh. Hien cuf ngu tai so nha: 53/12A during Hoang Dieu, Quân Phú- Nhuan, tp. Ho Chi Ninh, Vay toi lar an nay kinh g?1 too By ban nhan dan cuu xet va chuna thuc chu ky cua hai ngu-1 chung ke tren. Trong khi ch~i adj, toi xin thi By ban su biet an cua toi. Ngun chung thu nhat, Nguwi chung thu hai, Nay kinh are, the how NGO DINH TUY NGUYEN THI HOA NGO THI CAU.Ci Lown HBNDS10/PNO Yae main ehic ky have TOZLOR to teis tion hourthing ties tree diff PHUONS NGUYEN VAN HUNG"
}
