{
  "anumber": "A40551579",
  "id": "A40551579_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 2/10/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Thailand",
        "Vietnam"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1979,
        1955,
        1980,
        2023,
        1902
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 2/10/2023 SO TU' PHAP VIET NAM CONG HOA TRUNG-VIET TOA SO THAM QUÁNGNAM-QUANG-NGAI Nam môt ngan chin trám nam muri bay tai DA-NANG ngay Mong ba thárg tu hol muoi gio CHUNG THU THAY GIAY Truác m t chung toi là TU-DONG Chanh An Too So Thàm Quang-Nam va Quang-Ng3i tqi Da.Nang, ng31 KHAI-SINH tqi van phong có Ong MAI-XAUN-THIET- só 1665 lyc sy giúp viec Có DÉN HAU TOA : 10/ TRAN THI CHUT 25 tuoi, tru ngy tqi Trai binh: -si K.B.C 4584 Có kiem tra so 32B00244I Cáp :ci Baria ngay 9.8.1955 2c/ NGUYEN VAN TOI 22 tuoi, trú ngu tgi K.B.C.45.84 Có kiem tra só 35A00689I cáp tci Quinhon ngay I3.10.1955. 3c/ VU VAN XOANG tudi, trú ngu tgl K.B.C. 458I Có kiem tra só 33A00685I cáp tqi Quinhon ngby I3.I0.1955 Nhüng nguai chung nói trên, SCU khi the nói tót ca su that và chi có SU that, de khai vc chung nhan biet ro: NG-O THI CAU tu NG-O .THI LOAN Quoc tich Viet-Nam sinh rgay Mong nam thang tam nonMot ngan chin tram le hai (1902) tai lang Phan-Dung quan Kien-thuy tinn Kien-An (BV) la con cuaOng Ngo Van Tro va Ba Pham Thi Chu Máy ngual nãy qua quyet rang NGO THI CAU tu NGO THI LOAN khang the xuat ncp gioy khai-Sinh y duge vi re só hô-tich chanh-quán bj phá huy bai nhüng bién có chien tranh, hoãe ban chénh bi that loc. Máy ngual chung da nhan that nhüng lei khai & trên, nên chung tôi chieu cdc dieu 46 BAC Viet Hô-Luct lôp to chung the ndy thay the giéy Khai-Sinh top cho NGO THI CAU tu NGO THI LOAN de ngp ho so. Nhüng chung. sau khi nghe doc ban van nãy, d5 ky ten cung chung to: v3 lyc sif Nguoi during khai : Nhung nguiri ching : Chanh-An : Luc-Str.: Tem bán chinh: Sao Y chanh bän I CHANH LUC.SY Trude be thau Truct bq tgi Damang, ngay 16-4.57 Quyen 9 to 35 só CHU-SY, ky ten: .2132 2in Thank Aamel This is an exact copy of the original. Sworn to and subscribed before me this 29th day of August, 1979. Notary Public DIANE E. WATTERS, Notary Public In and for the County of EI Paso, Texas My Commission Expires Sept. 13, 1980 American Embassy Censular Section Bangkek. Thailand"
}