{
  "anumber": "A40551579",
  "id": "A40551579_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-40551579"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Thailand",
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1985,
        2023,
        1902
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 2/10/2023 OPTIONAL FORM 155A, 6-82 (Formerly OF-155) DEPT. OF STATE NSN 7540-01-126-7761 50155-202 IV-40551579 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN NGO CAU THI ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S IMMIGRATION 129 SEA 605 A 150 212(e) 212(h) JA125 1989 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH KIEN AN VIETNAM 08/05/1902 ADMITTED (CLASS) CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY UNTIL THAILAND VIETNAMESE MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME CHU M S W D SEP TRO FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 10516 PALOMINO EL PASO TX 79924 SEC. 212(a)(14) OCCUPATION SEX X UNR M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED NONE F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL EMBASSY IR5 AMERICAN FOREIGN STATE OTHER AREA LIMITATION AT ANY BANGKOK, THAILAND VIETNAM IMMIGRANT VISA NO. ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 17 JAN 1989 William D. Fleming THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 16 MAY 1989 PASSPORT NO. WAIVED PER 22 CFR 42.6 (A) OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO Nao BATDGRAPH ATTACHED BY FOREIGN SERVICE Tariff No. 31 $75($25 UNITED 650.00 STATES SAHT OF AMERICA ON Fee Paid EXPIRES Local Cy, Equiv. IV-40,551579 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. CLASS A OR- CLASS B BUBLIC REQUIRES ATTENTION OF 25.1989 USPHS AT POE PASSED JAN WA * U.S. GOVERNMENT PRINTING OFFICE 1985 482-593"
}