{
	"anumber": "A40551579",
	"id": "A40551579_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "GIAY The-The Vi KhaI-SanH Cho, nvn/5"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "Vietnam"]
		},
		"years": {
			"ms_years_nlp_v1": [1943, 1962, 1980, 2023, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 VIET-NAM GANG-HOA Lyc sao y ban chanh de tai phong Lyc-Sy*Toa Hoa-Gia Seigon BÔ TUMPHAP SS : 3996 nvn/5 sà TU - PHAP NAM-FHÄN Ngay 12 thang 5 nam 1962 : HOA GIAI 90-THANH SAIGON GIÁY THÉ-VI KHAI-SANH CHO PHAM THI HUE Nam mot ngan chin träm 62 ngay 12 thang 5 hol 7 già 30. Trude mät chung toi là NGUYEN VAN DOANH, Chánh-án Toa Hod-Gial Do-Thänh Saigon, tai van-phong chung tôi, 115, Dqi-1ô Nguyen-Huê có lyc-sy PHAM THI MUI, phy-tá DÁ TRINH DIEN: 1.- C8 NGUYEN THI HA LIEN 2.- Ba BUI THI THUAN 3.- Ba DO THI QUY Nhong nhan-chung ndy da tuyên-thô và khai qua-quyér biet chãc PHAM - THI - HUE (nii) sanh ngay - 5 - 1943 tai Phan-Dung, Kien-An, con cua O. PHAM VAN HE (c) va ba NGO THI LOAN ./. Va duyên CG ma O. NGUYEN HUY KHIEN khong có the xin sao-lyc khai-sanh duqc, là vi su giao-thông gian-doan.- May nhan-chung da xác nhan trên day, nên chung tôi phát giáy thé-vi khai-sanh nay cho duang-sy de xu durg theo luât, chieu theo Ngh!-Dinh ngay 17 tháng 11 n 15m 1947 cua Thu-Tuang Chánh-l Phu Lâm-Thai Nam-Phan Viet-Nam. Các dieu 363 và tiép theo cua bô hinh- luât canh-cai phat tôi ngvy-chung vè viêc Hô tis 2 dén 5 nam tu va phat bac tis 200 dén 8.000 dong d dugc doc cho các nhan-chung và nguyên-dan nghe. Va các inhan-chung có ky ton voi chung toi và Lyc-sy sau khi doc lgl. 3 Kg ten khang TO : lyc-sao y, Salgon ngay 21 tháng 5 nam 1962 Chanh - Lpc-Sis, b GIA TIEN : 500 TDA Thank STATE OF TEXAS COUNTY OF EL PASO This is to certify that the original of this photostatic copy-was presented to me this day, and I further certify that it is an exact print of the original. Given under my hand and seal of office this The day of Cyst A. D., 19 77 Smoon ELYA MORALES. Notary Public is and for the County of El Paso, Texas American Embassy My commission expires Dec. 31. 1980 Consular Section Bangkok. Thailand"
}
