{
	"anumber": "A40551579",
	"id": "A40551579_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A40551579_0007/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2203 (English/Vietnamese"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1925, 1988, 1954, 2023, 1944]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 OPTIONAL FORM 230 (English/Vietnamese) (Rev. 6-32) 2 18. Personal description (Tuong mao) : 19. Marks of identification Dau-tich nhan-da (a) Color of hair (mau toc) Grey (b) Color of eyes (mau mat) Black (c) Height (cao) 40 feet (bo) (d) Complexion Med inches (dot) 20. Purpose in going to the United States Muc c-dich di Hoa-Ky Farm Rev. 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? [Dinh s lai bao lau? (Neu luon, xin ghi R8)] 22.-23. (Da có vé di ti noi cuoi cung chua) Perm. 24. Personal financial resources Tai san rieng (a) Cash Tien mät (c) Real estate (value) [Nha dat (trj-gia)] (b) Bank deposits Tien Ky-thac ngah-hang) (d) Other describe) [Täi-san Khac (mo tà)] 25. Father's name, address, date and place of birth (if deceased, so state giving year of death) [Ten cha, dia-chi, noi sinh, ngay sin (Xin ghi ro nam chet, neu da qua doi)] NGO VAN TRO, deceased / 1925 26. Mother's maiden name, address, date and place of birth (if deceased, so state giving year of death) [Ten nhu-danh cua me, dia chi, noi sinh ngay sinh (xin ghi ro nam chet neu da qua doi)] PHAM THI CHU deceased / 1944 27. Name, address, and relationship of next of kin in home country (if neither parent is living) [Ten va dia chi cua than-thuoc gan nhat tai nguyen-xu (neu ca cha lan me deu da qua doi)] 28. List all places of residence for 6 months or more since your 16th birthday City or town Provice Country Date (From-To) Calling or occupation (Thanh-pho hay thj-xa) (Tinh) (X) (Td'ngay cen ngay) (Tungay-deh ngay) KIEN AN UN 1954 SGN II 1954 1988 29. List all organizations you are now or have been a member of or affiliated with since your 16th birthday (Include professional, vocational, social, and political organizations) Name and address Dates(From-To) Type of membership and office held, if any (Ten và dia-chi) (Tu ngay-den ngay) (Loai hoi-vien, chuc-vu neu co) 30. List all languages, including your own, that you can speak, read, and write (Ke Khai moi sinh ngú, Ke ca tieng me de, ma duong don nói, doc, va viet duoc) Language Speak Read Write (Sinh-Ngu) VN (nói) (Doc) (Viet) 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) Yes No [Ghi ngay den toi ngay di nhung lan truoc day duong don cu-ngu hay qua Hoa-Ky chi (Cho biet loai chieu-khan I (Có) (Khong) hay qui-chê nhap-canh)] 32. Have you ever been treated in a hospital, institution, or elsewhere for a mental disorder, drug addiction, or Yes No alcohoiism? (If answer is Yes, explain) [Co bao gio duong-don dua vao benh-vien hay co-quan não (Co) (Khong) loan tri, nghien ma-tuy, hay nghien ruou Khong? (Neu CO xin giai-thich)] 33. Have you ever been arrested, convicted, or confined in a prison, or have you ever been placed in a poorhouse Yes No or other charitable institution? (If answer is Yes, explain) I (Có) I (Khong) [Có bao gio duong ₫on bi bat giu, Ket an, bd tu, dudc dua vao nha te-ban hay mot co-quan tu-thien nao Khac Khong? 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency, or Yes No similar action? (If answer is Yes, explain) I__I (Có) (Khong) [Co bao gi3 duong don dude huong an-xa, dai xa, phuc-hôi, Khoan-hong, hay mot in-hue tuong-ti Khong?"
}
