{
  "anumber": "A41366425",
  "id": "A41366425_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366425_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 3RS PINDIANA you GIFT GIGT STORE AUT LOO IKOA ARTHA THREE RUPEESE THREE RUPEES AFFIDAVIT I, Manohar Singh Son of S. Sahib Singh, having been first duly sworn, depose and say :- That I wasborn on 4th of November I9I7 at Chakwal, Distt. Jhelum, Punjab, India. That I am a citizen of India by birth and I am currently residing au 3-3/III-A, D.D.A. Flats (MIG), Lawrence Road, Delhi, India. That I have known HarbansKaur, who is married to Inder MARY Singh, and her family alImy life. That through personal knowledge I know Harsais Kaur was born on 7th May, I9I8 at Gujarkhai, Dist. Rawalpindi, Punjab, India and, she is the mother of Gurcharan Singh Jolly. That I KNOW for fact that Gurcharan Singh Jolly was born on 3rd June, I939 at Chakwal, now i.1 Pakistan, and his mother(s name is Harban's Kaur and his father's name is Inder Singh. That Haroais Kaur is my aunt, I being nephew of her husbaid Inder Singh. That I have personal knowledge of the above facts as we are close relatives. That I am executing this affidavit freely and voluntarily without any promise or compensation, In witness whereof I here unto set my signatures on this a 14 day of Feb. I987. Manohardingh Deponient Verification 16/2/87 I, Matobar Singh, son of S. Sahib Singh, hereby solemnly declare and affirm that the above facts are true to the best of my knowledge and belief and no thing has been concealed therein. ManchasSingh Verified at Deponent on Dt. 14.2.87 and returned. and correct CODY original seen true"
}