{
	"anumber": "A41366425",
	"id": "A41366425_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366425_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1934, 1918, 1914, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 Arke FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION 50230-105 INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name JOLLY First name INDER Middle name SINGH 2. Other names used or by which known (If married woman, give maiden name) NOT APPLICABLE 3. Full name in native alphabet (If Roman letters not used) RETT fathy for 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) NOV. 731-years (City or town) (Province) (Country) 07 1914 AMRITSAR PUNJAB INDIA 7. Nationality 8. Sex 9. Marital status INDIAN Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married ONCE times. 10. Occupation RETIRED TEACHER 11. Present address 473-L, MODEL TOWN, LUDHIANA PUNJAB 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) HARBANS KAUR JOLLY 473-L MODEL TOWN LUDHIANA, PUNJAB 07, May, 1918. GUJARKHAN (PAKISTAN) Date and place of marriage 21 st SEPT. 1934 GUJARKHAN (PAKISTAN) name. Maiden REKHI 13. Names, addresses, dates and places of birth of all children NOT APPLI GABLE 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States NOT APPLICABLE 1966 LOS ALAMITOS DRIVE HARBANS KAUR JOLLY mentioned in 12 PLACENTIA, CA 92670. will accompanyme 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If if any) different from 16) GURCHARN SINGH JOLLY SAME AS IN 16 1966 LOS ALAMITOS DRIVE, PLACENTIA, SON CA 92670 18. Personal description 19. Marks of identification MOLE ON NOSE (a) Color of hair GREY (c) Height 5 feet 6 inches (b) Color of eyes BLACK (d) Complexion WHEATISH 20. Purpose in going to the United States IMMIGRANT 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? PERMANENTLY LOS ANGELES YES THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}
