{
	"anumber": "A41319010",
	"id": "A41319010_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORMULARIO OPCIONAL 230 (Spanish) / FORMULARIO OPTIONAL 230 (English)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 FORMULARIO OPCIONAL 230 (Spanish) (Rev. 6-82) Página 4 OPTIONAL FORM 230 (English) (Rev. 6-82) 39. ¿Es su intención entrar a los Estados Unidos desde Canadá, México 0 alguna isla adyacente a los Estados Unidos, antes de dos años de haber llegado Sí No a dicho país 0 isla adyacente? (Si la respuesta es afirmativa, consigne el nombre de la empresa de transportes que usó para (Yes) (No) entrar o por la cual piensa entrar a México, Canadá o a tal isla adyacente) (Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States within 2 years after arrival in Canada, Mexico. or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico, or such island) ) 40. Las leyes de los Estados Unidos que rigen la emisión de visados requieren que cada solicitante declare si pertenece 0 no a cualquiera de las categorias de personas inadmisibles a los Estados Unidos. Las categorías inadmisibles se describen a continuación. Lea cuidadosamente los párrafos que siguen: la comprensión de su significado y las respuestas que usted dé a las preguntas siguientes le ayudarán al funcionario consular a tomar una decisión respecto a su elegibilidad para obtener un visado. United States laws governing the issuance of visas require each applicant to state whether or not he or she is a member of any class of individuals excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs: your understanding of their content and the answers you give- the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa. EXCEPTO CUANDO LA LEY DISPONGA LO CONTRARIO. LOS EXTRANJEROS COMPRENDIDOS EN CUALQUIERA DE LAS SIGUIENTES CATEGORIAS NO SON ELEGIBLES PARA OBTENER UN VISADO DE INMIGRANTE: (EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA: a) Los retardados mentales, los dementes 0 quienes hayan sufrido uno 0 más ataques de locura; quienes sufran de personalidad psicopatica. desviación sexual 0 perturbación mental; quienes sean adictos al uso de drogas, los alcohólicos crónicos 0 quienes sufran de alguna enfermedad contagiosa peligrosa; quienes tengan algún defecto físico, enfermedad 0 deficiencia que afecte su capacidad para ganarse la vida; los indigentes, los mendigos profesionales y vagabundos; quienes hayan sido convictos de algún delito que indique depravación moral 0 quienes admitan haber cometido los elementos esenciales de tal delito, 0 quienes hayan sido sentenciados a reclusión por 5 años 0 más, en total, por haber sido declarados culpables de dos 0 más delitos; los poligamos 0 quienes practiquen 0 prediquen la poligamia; las prostitutas 0 quienes hayan participado 0 se hayan beneficiado financieramente con la prostitución: quienes hayan entregado 0 importado personas para dedicarlas a la prostitución: quienes pretendan entrar a los Estados Unidos para negociar con la prostitución 0 cualquier otro vicio comercializado 0 para llevar a efecto cualquier acto sexual inmoral; las personas que intenten entrar a los Estados Unidos para trabajar en ocupaciones calificadas 0 no calificadas y que no hayan obtenido previamente la certificación respectiva del Secretario del Trabajo de los Estados Unidos; y aquellas personas que posiblemente se convertirian en una carga pública en los Estados Unidos. a) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity; aliens afflicted with psychopathic personality, sexual deviation a mental defect. narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease, or disability affecting their ability is earn a living: aliens who are paupers. professional beggars, or vagrants; aliens convicted of a crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to continement for at least 5 years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in, benefited financially from, procured, or imported persons for the purpose of prostitution, or who seek entry to the United States in engage in prostitution or other commecialized vice, or any immoral sexual act; aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor: and aliens likely to become a public charge in the United States.) ¿Pertenece usted a alguna de las categorías arriba mencionadas? (Do any of the foregoing classes apply to you?) Si No (Si la respuesta es afirmativa. explique) (Yes) (No) (If answer is Yes, explain) b) Los extranjeros que pretendan regresar a los Estados Unidos antes de haber transcurrido un año desde que fueron excluidos de dicho país 0 quienes, en los últimos 5 años, hubieren sido arrestados y deportados de los EE.UU. 0 expulsados a expensas del Gobierno en lugar de ser deportados; 0 sacados del país como extranjeros indigentes 0 como extranjeros enemigos; los extranjeros que hayan obtenido 0 tratado de obtener un visado u otra documentación mediante fraude 0 tergiversación intencional de los hechos; aquellos que no sean elegibles para la ciudadanía estadounidense 0 quienes hayan salido y permanecido fuera de los Estados Unidos para evadir el servicio militar de los EE.UU. en tiempo de guerra 0 emergencia nacional; quienes hayan sido convictos por violar 0 conspirar para violar leyes 0 reglamentos referentes a drogas narcóticas 0 mariguana, 0 quienes sean conocidos como sospechosos de ser 0 haber sido traficantes de drogas narcóticas 0 mariguana; quienes traten de entrar a los Estados Unicos provenientes de islas 0 territorios adyacentes, dentro de los dos años de su arribo a éstos, SI su entrada a los mismos se verificó usando los servicios de una empresa de transportes no signataria de convenciones internacionales; quienes no lean y comprendan algún idioma 0 dialecto; quienes, a sabiendas y por remuneración, hayan alentado 0 ayudado a cualquier otro extranjero a entrar 0 tratar de entrar a los Estados Unidos infringiendo las leyes; quienes habiendo estado en los Estados Unidos en calidad de visitantes de intercambio no hayan llenado el requisito de los 2 años de residencia fuera del país; y los extranjeros, graduados de escuelas de medicina extranjeras, que tienen el propósito de entrar a los Estados Unidos para prestar servicios médicos, no son elegibles para recibir un visado, a menos que hayan aprobado las partes y II del examen NBME u otro equivalente, como lo ordena la Secretaría de Salud y Servicios Humanos. b) Aliens who seek re-entry within 1 year of their exclusion from the United States, or who, within the past 5 years. have been arrested and deported from the United States, or removed at Government expense in lieu of deportation. or removed as an alien in distress or as an alien enemy; aliens who procure or attempt to procure a visa or other documentation by fraud or willful misrepresentation; aliens who are not eligible to acquire United States citizenship, or who have departed from or remained outside the United States to avoid United States military service in time of war or national emergency: aliens who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or marihuana, or who are known or believed to be, or to have been. an illicit trafficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within 2 years of their arrival therein on a non-signatory carrier: aliens who are unable to read and understand some language or dialect: aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law: aliens who are former exchange visitors who have not fulfilled the 2 year foreign residence requirement; and aliens who are graduates of foreign medical schools destined to the United States to perform medical services are ineligible for a visa unless they have passed parts I and II of the NBME Exam or an equivalent exam as determined by the Department of Health and Human Services.) ¿Pertenece usted a alguna de las categorías arriba mencionadas? (Do any of the foregoing classes apply to you?) Si No (Si la respuesta es afirmativa. explique) (Yes) (No) (If answer is Yes, explain) c) Quienes sean 0 en cualquier momento hayan sido anarquistas, 0 miembros 0 afiliados a cualquier partido comunista u otro partido totalitario, incluso cualquier subdivision u organismo afiliado al mismo; quienes apoyen 0 ensenen 0 hayan apoyado 0 ensenado, ya sea personalmente 0 por medio de material escrito 0 impreso, 0 por afiliación a alguna organización: 1) la oposición al gobierno organizado, 2) el derrocamiento del gobierno por la fuerza 0 la violencia, 3) el asalto 0 asesinato de funcionarios del gobierno por el hecho de serlo, 4) la destrucción de bienes, 5) el sabotaje, 0 6) las doctrinas del comunismo mundial 0 el establecimiento de una dictadura totalitaria en los Estados Unidos: quienes pretendan entrar a los nidos para llevar a cabo actividades perjudiciales 0 ilegales de naturaleza subversiva. c) Aliens Wh or at any time have been, anarchists, or members of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof. aliens who adv ach. or who have advocated or taught, either by personal utterance. by means of any written or printed matter, or through affitiation with an organization, (1) opposit rized government (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official character, (4) the unlawn uction of property. (5) sabotage, or (6) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States: aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of a subversive nature.)"
}
