{
	"anumber": "A41319010",
	"id": "A41319010_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL 2230 ( (Spanish) Form Number: 6-82 Rev. 6-82, OPTIONAL 230 ( (English)"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 FORM PIO OPCIONAL 230 (Spanish) (Rev. 6-82) Página 5 OPi FORM 230 (English) (Rev. 6-82) ¿Pertenece usted na de las categorias arriba mencionadas? (Do any of the foregoing classes apply to you? Sí No respuesta es afirmativa, explique) (Yes) (No) (1) answer is Yes, explain) d) Los extranjeros que en cualquier fecha entre el 23 de marzo de 1933 el 8 de mayo de 1945, bajo órdenes directas 0 indirectas del gobierno nazi de Alemania, 0 del gobierno de cualquier región ocupada por éste 0 aliada con él. ordenaron, incitaron, ayudaron 0 de alguna manera participaron en la persecución de cualquier persona debido a su origen nacional, raza, religión U opinión política. d) Aliens who during the period beginning on March 23, 1933, and ending on May 8, 1945, under the control, direct or indirect, of the Nazi Government of Germany or of the government of any area occupied by, or allied with, the Nazi Government of Germany, ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion.) Pertenece usted a la categoría mencionada arriba? (Does the foregoing class apply to you?) Si No (Si la respuesta es afirmativa, explique) (Yes) (No (If answer is Yes, explain) 41. ¿Le ayudó alguien a llenar esta solicitud? (Si la respuesta es afirmativa, escriba el nombre y el domicilio de la persona que le ayudo, e indique si es pariente. amigo, agente de viajes, abogado, etc.) (Were you assisted in completing this application? (If answer. is Yes, give name and address of person assisting you indicating whether relative friend, travel agent, attorney, or other) ) Sí No Nombre completo Domicilio Relación con la persona que le ayudo (Yes) (No) (Name) MISSION COMMUNITY LEGAL DEFENSE, IN (Relationship) C/O MIGUEL QUIROZ 2940 16th ST., SUITE 301 Ninguna IMMIGRATION COORDINATOR SAN FRANCISCO, CALIFORNIA 94103 42. A esta solicitud se anexan los siguientes documentos: (The following documents are submitted in support of this application) Pasaporte Certificado de Comprobante de Certificado(s) (Passport) defunción medios económicos médico(s) Certificado de nacimiento (Death certificate) propios (Medical (Birth certificate) Certificado de (Evidence of record(s) ) Certificado(s) de policia divorcio own assets) Fotografías (Police Certificate(s) ) (Divorce Decree) Declaración jurada (Photographs) Certificado de matrimonio Hoja de servicio de manutención Otros (describanse) (Marriage Certificate) militar (Affidavit of (Other (describe) / (Military Record) support) Certificado de Oferta de empleo nacimiento del (Offer of employment) cónyuge (Birth Certificate of Spouse) Certificado de nacimiento de los hijos solteros menores de 21 años que no inmigrarán en esta ocasión (enumere aquellos que no tienen dicho certificado o cuyo certificado de nacimiento se ha presentado en esta oportunidad en relación con una solicitud de visado). (Birth certificates of unmarried children under age 21 who will not be immigrating at this time (List those for whom birth certificates are not available or whose birth certificates are being submitted at this time in connection with a visa application).) NO ESCRIBA EN LOS ESPACIOS DEBAJO DE ESTA LINEA El funcionario consular le ayudará a contestar los párrafos 43 y 44 (DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44) 43. Declaro estar exento de ineligibilidad para recibir el visado y exclusión bajo el rubro del párrafo 40, por las siguientes razones: (I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 40 for the following reasons:) 212 (a) (14) Beneficiario de una 212 (a) (28) (1) (i) 212 (e) No pertinente exención bajo 212 (a) (28) (1) (ii) 212 (g) (Not applicable) (Beneficiary of waiver under) 212 (b) (1) 212 (h) 212 (b) (2) 212 (i) Se adjunta (Attached)"
}
