{
  "anumber": "A41366069",
  "id": "A41366069_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366069_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INDIA FIVE RUPEES, AFFIDAVIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 5RS WINDIAGE You CITI CAFE AO NOTARIA HRTHRI FIVE RU FIVE RUPEES AFFIDAVIT. I, Joginder Singh Jawandha aged 65 years son of Shri Mahan Singh Jawandha, resident of Jawandha Colony, Rampura Phul, Distt. Bhatinda, Punjab, India, do hereby soleanly affirm and declare on oath as under:- 1. That I have personally known Smt. Jagdish Sheila Sru(formerly known as Jagdish Kaur Sra) maiden name Jagdish Kaur Jawandha, since her birth. To best of my knowledge she was born at Ranpura Phul, District Bhatinda, Punjab, India, from Smt. Kartar Kaur the only wife of Shri Hardit Singh Jawandha. 2. That the date of birth of Smt. Jagdish Sheila Sra (maiden name Jagdish Kaur Jawandha) daughter of Shri Hardit Singh Jawandha is 24th August 1937 (Twenty fourth August One Thousand nine hundred thirty seven). 3, That Smt. Jagdish Sheila Sra is real daughter of Shri Hardit Singh Jawandha, wife of Shri Harbans Singh Sra, resident of 99-47, 63rd Ave,, Forest Hills, N.Y. 11375 U.S.A. 4. That the fathers name of said Smt. Jagdish Sheila Sra is Shri Hardit Singh Jawandha. 5. That Shri Hardit Singh Jawandha is related to me, he is my brother. DEPONENT, Dated 14th December, 1987. (JOGINDER SINGH JAWANDHA) DECLARATION: I, Joginder Singh Jawandha, the above named deponent do hereby verify that the contents made in the above affidavit are true, that it conceals nothing & that no part of it is false, so help me Ggd. Dated: 14th December, 1987. DEPONENT, (JOGINDER SINGH JAWANDHA) rigusion 141,12"
}