{
  "anumber": "A41366425",
  "id": "A41366425_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366425_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1987,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 5RS WINDIASA and are TORO STURE RRLE GUR FIVE RUPEES FIVE RUPEES Affidavit I, B.S.Kanwar, son of S. Man Singh, having been first duly sworn, depose and say:- That I was born on 25th August, 1927at Amritsar, Punjab, India. That I am a citizen of India by birth and I am currently residing at stx 12, Narang Colony, Janakpuri, New Delhi. That I have known Inder Singh, who is married to Harbans Kaur, and his family all my life. His father's name is S. Tara Singh and his mother's name is Dharopati. 2 HIGH 2 RS That through personal knowledge I know Inder Singh was born on November 7, 1914 at Amritsar Punjab, India, and Netar he is the father of Gurcharan Singh Jolly. NOTARIAL That I know for fact that Gurcharan Singh Jolly was born son 3rd June 1939, at Chakwal, now in pakistan, and his Approbance father's name is Inder Singh and his mother's name is Harbans Kaur. Delhi That Inder Singh is my uncle, I being his nephew, That I have personal knowledge of the above facts as we are NUTHRIAL close relat ives. That I am executing this affidavit freely and voluntabily without any promise oe compensation. In witness where of Ihere unto set my signatures on this 23 day of Dec 1987 k.s.kauma Notary Deponent. 1616 Verification: App be I, B S.Kanwar, son of S. Man Singh, hereby Solemnly ( D. thi Adma declare and affirm that the above facts are true to the best Della 11 dia of my knowledge and belief and nothing has been concealed therein. Swrinder Kone Deponent Verified at on dated:- 23-12_1987 ATTESTED for Notary Public 24 Delhi DEC1987"
}