{
  "anumber": "A41319010",
  "id": "A41319010_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 2 6-82), FORMULARIO OPCIONAL 230 ( (Spanish) (Rev. 6-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 FORMULARIO OPCIONAL 230 (Spanish) (Rev. 6-82) Página 6 OPTIONAL FORM 230 (English) (Rev. 6-82) 44. Declaro ser: (I claim to be a) Inmigrante de preferencia. sujeto a la limitación numérica de (País extranjero o zona dependiente) preference immigrant subject to the numerical limitation for (Foreign state or dependent area) Inmigrante especial no sujeto a limitación numérica (Special immigrant not subject to limitation) Pariente inmediato de ciudadano norteamericano (Immediate relative of a United States citizen) Mi declaración se basa en los siguientes hechos: (My claim is based on the following facts:) Yo soy (mi es) el (la) beneficiario(a) de una petición (I am (my is) the beneficiary of a petition) Yo soy un residente extranjero que retorna (I am a returning resident alien) Derivo imputación a nación extranjera conforme a la Sec. 202 (b) por mi (I derive foreign state chargeability under Section 202 (b) through my ) Otros (especifique) (Other (specify) Entiendo que estoy obligado a entregar mi visado al Funcionario de Inmigración de los Estados Unidos en el lugar donde solicite la entrada a dicho país y, además, entiendo que el poseer un visado no me da derecho a entrar a los Estados Unidos si en ese momento se determina que soy inadmisible de acuerdo con las leyes de inmigración. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States. and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws.) También entiendo que cualquier declaración hecha por mí en esta solicitud, que sea intencionalmente falsa 0 tergiversada, 0 el haber ocultado intencionalmente algún hecho esencial, puede ser causa de que se me niegue permanentemente la entrada a los Estados Unidos, y de que, si ya hubiere entrado a los Estados Unidos, podría estar sujeto a enjuiciamiento penal, deportación 0 ambos. (I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation.) Yo, el suscrito, solicitante del visado de inmigrante para los Estados Unidos, juro solemnemente (o afirmo) que todas las declaraciones que aparecen en esta solicitud fueron hechas por mi, incluso las respuestas a los párrafos 32 a 41 inclusive, y que éstas son verídicas y completas a mi mejor saber y entender. Además, juro (o afirmo) que, en caso de ser admitido en los Estados Unidos, no emprenderé actividades que puedan ser perjudiciales al interés público o pongan en peligro el bienestar, la seguridad o la tranquilidad de los Estados Unidos, ni me dedicaré a actividades prohibidas por las leyes de los Estados Unidos en lo relacionado con espionaje, sabotaje o desorden público, ni a otras actividades subversivas a la seguridad nacional, ni a ninguna actividad que tenga por objeto oponerse, dominar o derrocar el Gobierno de los Estados Unidos por medio de la fuerza, la violencia y otros medios anticonstitucionales. Comprendo perfectamente las declaraciones que anteceden, después de haber pedido y recibido una explicación de cada una de las cláusulas que no había entendido con claridad. (1. the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answer to parts 32 through 41 inclusive, and are true and complete to the best of my knowledge and belief. / do further swear (or affirm) that, if admitted into the United States. / will not engage in activities which would be prejudicial to the public interest, or endanger the welfare. safety, or security of the United States: in activities which would be prohibited by the laws of the United States relating to espionage, sabotage. public disorder, or in other activities subversive to the national security; in any activity a purpose of which si the opposition to, or the control, or overthrow of. the Government of the United States, by force, violence, or other unconstitutional means.) / understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me.) Firma del solicitante (Signature of Applicant) El parentesco declarado por el solicitante en los números 12 y 13 fue verificado mediante documentación sometida al funcionario consular, excepto por lo siguiente: (The relationships claimed in items 12 and 13 verified by documentation submitted to consular officer except as noted) EMERGENCY 09 JAN 1987 TIJUANA Firmado y juramentado ante mí, el día del mes de del año en la ciudad de CONSULATE (Subscribed and sworn to before me this day of 19 at MADEGENERAL Funcionario -Consular (Consular Officer) TARIFF ITEM No. 20 138-MX-85-088 10/84"
}