{
	"anumber": "A41319010",
	"id": "A41319010_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICADO DE MATRIMONIO, 0193210"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Tulio Screened by NARA 7/25/2023 a castillo SERIE \"E\" 00 CUATRO CORDOBAS 00 No 0193210 1 CERTIFICADO DE MATRIMONIO 2 ROSA NAVAS DE FLORES: REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS 3 DE CORINTO CERTIFICA Que en el libro No. 1, folio No. 32, se encuen- tra inscrita la partida de Matrimonio No. 63, en el año de 1976, la que literalmente dice: En la Ciudad deCorinto. Departamento de Chinandega a las once y treinta de la mañana del dia 6 31 del mes de Mayo del año de mil novecientos setenta y seis. Ante el infrascrito Regis- trador del Estado Civil de las personas y Secretario que autoriza el señor Juez Local Ci- 8 vil de Corinto. Avisa que a las doce meridians del día veinte y nueve del mes de Mayo del 9 año de mil novecientos setenta y seis. Contrajeron Matrimonio 11 JULIO CESAR GARCIA CASTILLO 10 y MARIA TERESA MARADIAGA AMAYA \" ambos mayores de edad, solteros el primero oficinista y 11 la segunda domestica y de este domicilio. Presenciaron el Acto como testigos los Señores: 12 Eduardo González Alemán, oficinista y Francisco Somarriba Rodriguez Estibador los dos ma- 13 yores de edad, casados y de este domicilio. Endicho acto legitimaron a los siguientes hi- 14 jos. Julio Cesar de veinte y cuatro años Rosa rio de Fatima, de veinte y dos años y Juana 15 Araceli, de diez y nueve años, a quienes legitiman para que gocen de los derechos que la 16 ley les otorgan. Leída que fue el acta se eneucnetra conforme se aprueba y firma. (c) Ile- gielb. eUn sello. - Ilegible.- Ilegible.Sria. Un sello. 17 18 Es conforme con su original del que fue debidamente cotejado y a solicitud de parte inte- 19 resada y para fines de ley se extiende la presente CERTIFICACION. a los veintiun días del 20 mes de Enero de mil novecientos ochenta y cinco 21 fora sp-de More Rosa Navas de Flores Registrador del Estado Civil DEL ESTAOD CIVIL 22 las personas. /Beecheim Nydia Beecher M. 23 Sria. del Registro de las personas. de Corinto. Nicaragua, 24 25 26 27 28 29 30"
}
