{
	"anumber": "A41319010",
	"id": "A41319010_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE OF MARRIAGE, 0193210"
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1989, 1986, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 TRANSLATION SEAL Emblem: SERIES \"E\" 4.00 WORTH FOUR CORDOBAS 4.00 No. 0193210 CERTIFICATE OF MARRIAGE ROSA NAVAS DE FLORES: REGISTRAR OF THE CIVIL STATUS OF THE PERSONS OF CORINTO CERTIFIES: that in book No. 1, folio No. 32, is found inscribed the certificate of Marriage No. 63, of the year 1976, which literally says: In the City of Corinto, Department of Chinandega at eleven thirty in the morning of the 31 day of May of 1976. Before the undersigned Registrar of the Civil Status of the persons and Secretary who authorizes the Local Civil Judge of Corinto. Informs that at twelve in the afternoon of the 29th day of May of the year 1976, Contracted Marriage Mr. \"JULIO CESAR GARCIA CASTILLO and MARIA TERESA MARADIAGA AMAYA' both adults, both single the first one office worker and the second one housewife and from this domicile. Witnesses of this act were Mr. Eduardo Gonzalez Aleman, office employee and Francisco Somarriba Rodriguez Longshoreman both adults, married and from this domicile. In said act they legitimized the minor children: Julio Cesar 24 years old, Rosario de Fatima 22 years old and Juana Araceli 19 years old, whom they legitimize SO they may enjoy all rights which the law extends them. Read was this certificate they are confirmed and signed. Illegible One Seal Illegible=Illegible=Secretary. One Seal It is confirmed with its original which was confronted and as solicited by the interested party and for purposes of the law I extend the present CERTIFICATION. on the 21st day of January 1985 signature SEAL Rosa Navas de Flores signature REGISTRAR OF THE CIVIL Nydia Beecher M. STATUS OF THE PERSONS Secretary of the Registry of the Persons of Corinto SIGNED AND SEALED This is to certify that the translation above is a true and complete rendition into English of the Spanish-language Certificate of Marriage for: JULIO CESAR GARCIA CASTILLO and MARIA TERESA MARADIAGA AMAYA to the best of my knowledge and belief. Carolina Cats CAROLINA COT0-Translator Subscribed to before me this 22nd day of May, 1986 at San Francisco, California. OFFICIAL SEAL MIGUEL QUIROZ his fluing NOTARY PUBLIC-CALIFORNIA City and County of SAN FRANCISCO My Comm. Expires Aug. 21. 1989 MIGUEL QUIROZ - Notary Public // // // // // //"
}
