{
	"anumber": "A41364961",
	"id": "A41364961_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41364961_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Georgia", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1900, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department 01 Screened by NARA, 8/14/2023 OMB No. 1115-0054 Immigration and Naturalia Justérvice (INS Petition for Relative Expires 4-86 DO NOT WRITE IN THIS BLOCK Cas Action Stamp Fee Stamp A# APPROVED INS RAC DIRECTOR G-28 or Volag# CHI Section of Law: JUN 18 1987 430014 Petition was filed on 8-7-85 201 (b) spouse 203 (a)(1) (priority date) 201 (b) child 203 (a)(2) Personal Interview 201 (b) parent 203 (a)(4) by: a. Flour Previously Forwarded Document Check Stateside Criteria AM CON new Delhi 203 (a)(5) LIN 3389 Field Investigations I-485 Simultaneously REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No Georgia Bit B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) BHAGAT ARJUN P BHAGAT PHEROOKAL G 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 7835 NORMANDY DRIVE C-333 DEFENCE COLONY (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) SPRING GROUE IL 60081 NEW DELHI 24 INDIA. 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) 8/17/33 CALCUTTA INDIA. PADHIDAN SIND INDIA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Single 8/19/33 Female Widowed Divorced 9/19/1900 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 2/22/59 CALCUTTA INDIA. 7/12/32 CALCUTTA INDIA 9. Social Security Number 10. Alien Registration 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) CITIZEN NONE HOVE 11. Names OT Prior nusuanus 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended NONE NONE U.S. PASSPORT FOIA (b)(6) 13. Expurs If you are a U.S. `citizen, 630-96 complete the following: seens Cannot Ret'd 2029 13. He Has Contact your relative been in the Rep U.S.? My citizenship acquired through (check one) verify Yes ever was Birth in the U.S. by CIS. No BJA 14. If your relative is currently in the U.S., complete the following: Naturalization Give number of certificate date and place it was issued 9-8-86 He or she last arrived as a (visitor, student, exchange alien, crewman, stowaway, temporary worker, without inspection etc.) 12249888 5/9/86 CHICAGO Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in YOUR own nam RECEIVED IN MAIL UNIT If \"Yes\" give number of certificate place if was issued ate authorized stay expired, or will expire as shown on Form I-94 or I-95 DATE: AUG 8 BY NONE Name and address of present employer (if any) 14. If you are a resident alien, complete the following UNIT NONE Date and place lawful ennanent DATE: admission for AUG BY Date this employment began (month/day/year) residence 9 8 INITIAL RECEIPT APR - 2,7 , 19879 9 RESUBMITTED COMPLETED 8 JAN X 9 1987 Rec'd Sent Approved Denied Returned AUD Form I-130 (08-01-85) N Aont Jun SEP"
}
