{
  "anumber": "A41366069",
  "id": "A41366069_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366069_0046/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, 157 (Rev. 06/89"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS 166, Jor Bagh, New Delhi FOR UNITED STATES VISAS DATE OF EXAMINATION 10 May 1988 CITY COUNTRY At the request of the American Consul at New Delhi India NAME AGE SEX Hardit Singh Jawandha 83 y. Male I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON C 085418 Delhi 30 June 1987 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid ) Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental (mental deficiency) attacks of insanity defect drong addiction THE PURPOSE UNIVERSITY Narcotic Insanity Psychopathic personality Sexual deviation CLASS B: CERTIFY THAT EDICAL UNITIONIC MamiNA STO TOHIS FORM alephelism sec. -34.7, IMPLETED, TO ME. Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: OF THE INFORMATION Minor Conditions. THE Hardit Singh (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A, B, or C-diagnosis, and pertinent details*): Class B: Hypertension. Blood pressure is 180/100 mmHg Right arm supine. Normal chest. Chest X-ray report G. S. Garkal from Dr. V.D.R.L.: Non-reactive A. Lal Blood serological report from Dr. Antibodies to HIV-I: Non-reactive Other special report(s) (when needed) A. Lal from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT Report Continue Dr. on reverse Rajiv side if Khosla necessary. M.D. , M.R.C.P. 11 May 1988 OPTIONAL FORM 157 50157-102 (Rev. 5-78) GPO : 19850- 479-003 - Dept. of State"
}