{
  "anumber": "A41319010",
  "id": "A41319010_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information about your residences and employment., N-4 (000"
    },
    "years": {
      "ms_years_nlp_v1": [
        1919,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever IS less. Begin with your current address. If you need more space, continue on separate paper: Street Number and Name, City, State, Country, and Zip Code Dates (month/day/year) From To LAGUNA HONDA HOSPITAL, 375 LAGUNA HONDA BLVD. S. F. CA 94116 8/94 PRESENT 794 BRUNSWICK S.F. CA 94112 3193 8194 1335 SOUTHVANNESS S.F. CA 94110 6192 3/93 B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write \"None\". If you need more space, continue on separate paper. Employer's Name Employer's Address Dates Employed (month/day/year) Occupation/position Street Name and Number - City, State and ZIP Code From To none Part 5. Information about your marital history. A. Total number of times you have been married once If you are now married, complete the following regarding your husband or wife. Family name Given name Middle initial GARCIA MARIA THERESA M. Address 711 BRUNSWICK S. F. CA 94112 Date of birth Country of birth Citizenship (month/day/year) JUNE18 1919 HONDURAS N/A Social A# (if applicable) Immigration status Security# 566-89-2823 23574645 (If not a U.S. citizen) PERMANENT RESIDENT Naturalization (If applicable) (month/day/year) Place (City, State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. B. Total Number of Children 3 . Complete the following information for each of your children. If the child lives with you. state \"with me\" in the address column; otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" in the address column. If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenshin A Number Address FOIA (b)(6) Form N-400 (Rev 07/17/91)N Continued on next page"
}