{
  "anumber": "A41319010",
  "id": "A41319010_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE FOR ISSUANCE OF IMMIGRANT VISA, FORM I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "Mexico",
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1919,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 7/25/2023 OMB No. 1145-005 Immigration and Naturalization Service \"Approval expires PETITION TO CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp OR ISSUANCE OF IMMIGRANT VISA from information invo ave this beneficiary appears to bo inc for adjustment of status benefits CHECKED all #kelihood will be permitted to JUL 27 1986 (PLEASE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) main in the United States pending the of a visa. TO THE SECRETARY OF STATE: The petition was filed on June 9,1986 REMARKS The petition is approved for status under PERSONAL INTERVIEW CONDUCTED 91 section: it. 2. APPROVED INS. DOCUMENT CHECK ONLY SPOUSE, DATE JUL 27 1986 FIELD INVESTIGATION COMPLETEDRECEIVED 201 (b) CHILD 203 (a) (2) OF APPROVAL PREVIOUSLY FORWARDED ACTION David Illedest 26 AUG 198 201 (b) PARENT 203 (a) (4) community Securat of the DD set america 203 (a) (1) 203 (a) (5) DISTRICT NEC Master (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: MISTIEST GARCIA JULIO CESAR Married Widowed Divorce Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the Julio Cesar Garcia Castillo G-620 YES NO 6. Country of beneficiary's birth FOIA (b)(6) lary's birth (Month, day, year) FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) beneficiani and peritioceprelated by adopt Nicaragua 12-10-1907 YES NO 9. Petitioner's name is: (Last in CAPS) (First) (Middle) 10. petitioner's phone No 11. The beneficiary is my: (relationship FOIA (b)(6) FOIA (b)(6) Father 12. Other names used hv netitioner (including maiden name if married woman) In FOIA (b)(6) FOIA (b)(6) 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) Maria Teresa Garcia 06-18-1919 Honduras C.A. 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 1335-S. Van Ness Ave San Francisco, California 94110 15. Names, birthdates and countries of birth of beneficiary's children: FOIA (b)(6) 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in Tijuana B.C. Mexico (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at FOIA (b)(6) (CITY) (STATE) If the application for adjustment of status is denied. the beneficiary will apply for a visa abroad at the American Consulate in FOIA (b)(6) Y FOIA (b)(6) (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 1335-S. Van Ness Ave San Francisco, California 94110 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) m FOIA (b)( (6) 1335-S. Van Ness Ave San Francisco, CA 94110 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) or City) (Province) (Country) 102-Barrio Carlos Tinoco Corinto Nicargua C.A. (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet (Name) HOUS (Number and Street) own or City) (Province) (Country) None 04-58-1080 OVER RECEIVED TRANS RET'D TRANS. OUT COMPLETED FORM 1-130 (Rev. 9-1-82) Y"
}