{
	"anumber": "A41319010",
	"id": "A41319010_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Please keep this appointment, even if you do not have all the items noted above or on the front., Screened by NARA, 7/25/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 You must ALSO BRING with you what is noted below: The proceeding will take about two hours. If for any reason you cannot keep this appointment, If applying for NATURALIZATION AS THE SPOUSE of a United States Citizen; return this letter immediately with Your marriage certificate. your explanation and a request for a Proof of death or divorce for each prior marriage of yourself or spouse. new appointment; otherwise, no Your spouse's birth or naturalization certificate or certificate of citizenship. further action will be taken on your application. If applying for Naturalization on behalf of your child (children); If you are applying for citizenship The child (children) for whom you filed application for naturalization. for yourself you will be tested Birth certificate(s) for the child (children). your knowledge of the governn Adoption decree(s), and English translation(s) if in a foreign language. and history of the United States. Your United States birth certificate or certificate of naturalization or citizenship. You will also be tested on reading, Your marriage certificate. writing, and speaking English, unless you have been living in the If applying for NATURALIZATION as a member of the United States ARMED FORCES; United States for a total of at least 20 Your discharge certificate, or form DD 214. years as a lawful permanent resident and are over 50 years old, or have been living in the United States for a total of 15 years as a lawful perma- nent resident and are over 55 years old, or unless you are physically Please keep this appointment, unable to read, write, or speak even if you do not have all the items noted above or on the front. English."
}
