{
	"anumber": "A41366069",
	"id": "A41366069_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366069_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1937, 2023, 1905]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department Justice Screened by NARA, 8/17/2023 OMB No. 1115-0054 Immigration a atur tion Service (IN Petition for Alien Relative Expires 4.86 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp A# APPROVED LALSIDISTRICT DIR: CTOR G-28 or Volag# TRO-NUC Section of Law: JAN 2.7 1988 Petition was filed on 10/8/87 (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) Responsemented by: drussin Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Document Check Stateside Criteria 203 (a)(5) BUF 0281 Field Investigations I-485 Simultaneously AM CON: NewDelhi REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) SRA JAGDISH SHEILA JAWANDHA HARDIT SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 99-47 63rd Ave. A-34 Priyadarshni Vihar, I.P. Extension (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOREST HILLS 11374 KHUREJI DELHI INDIA 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Rampura Phul, Distt. Bhatinda, India Rampura Phul, Distt. Bhatinda, India 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Single 08-24-1937 Female Widowed Divorced 04-10-1905 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Jagdish Kaur Sra/Jagdish Kaur Jawandha None 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) Rampura Phul, Distt. Bhatinda, India V. Guredi, Distt. Bhatinda, India 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) LOTTCSPIG N.A. N.A. N.A. 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended N.A. N.A. N,A. N,A. 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. COUNT AJUSI I \"b\" Neuromen 14. your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, exchange alien, crewman, Give number of certificate, date and place it was issued slowaway, temporary worker, without inspection, etc.) No. 11840623 dt. 2/15/83, Brooklyn, New York N.A. Parents RE XOLK Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Loys on Form 1-94 or 1.95 FOIA (b)(6) residence Not Applicable N.A. K90I stadufor KSDE MISE INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (08-01-85) N"
}
