{
	"anumber": "A41319010",
	"id": "A41319010_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "ninguna"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORMULARIO OPCIONAL 2230 ( (Spanish) ( (Rev. 6-82)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1960, 1964]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 FORMULARIO OPCIONAL 230 (Spanish) (Rev. 6-82) Página 2 OPTIONAL FORM 230 (English) (Rev. 6-82) 13. Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos. (Names addresses dates and places of birth of all children) FOIA (b)(6) 14. Persona(s) nombrada(s) en los números 12 y 13 que me acompañará(n) 15. Domicilio definitivo en los Estados Unidos 0 me seguirá(n) a los Estados Unidos: (Final address in the United States) (Person(s) named in 12 and 13 who will accompany or follow me to the United States) 1335-South Van Ness Ave Ninguna San Francisco, CA 94110 X150 EASTER COURT VALLEJO, CA 94589 16. Nombre, parentesco (de haberlo) y domicilio de la persona con 17. Nombre y domicilio de la persona U organización que lo patro- quien se reunirá en los Estados Unidos. cina (si no es la misma indicada en el número 16) (Person you intend to join (Give name, address and relation- (Name and address of sponsoring person or organization (If ship. if any) different from 16) ) Mi esposa Maria Teresa Garcia y nuesros Hijos (Todos arriba Mesionados) FOIA (b)(6) 18. Filiación personal (Personal description) 19. Señas particulares (Marks of identification) FOIA (b)(6) a) Color del cabello c) Estatura (Color of hair) (Height) 5 I 6\" Cano m (ft.) cm (in.) Ninguna b) Color de los ojos d) Tez (Color of eyes) (Complexion) Cafes Blanca 20. Motivo del viaje a los Estados Unidos 21. ¿Cuánto tiempo piensa permanecer en los Estados Unidos? (Si permanente. (Purpose in going to the United States) indíquelo) (Length of intended stay (If permanently, so state) ) Residir Permanente Permanente 22. Puerto de entrada 23. ¿Tiene usted pasaje hasta SU destino final? (Intended port of entry) (Do you have a ticket to final destination?) Si 24. Recursos financieros personales (Personal financial resources) $500.000 a) Efectivo (Cash) c) Bienes raices (su valor) (Real Estate (value) ) b) Depósitos bancarios (Bank deposits) d) Otros (describanse) (Other (describe) ) 25. Nombre completo, domicilio, fecha y lugar de nacimiento del padre (si ha fallecido, indiquese en qué año murió) Julian Antonio Garcia (Father's name, address, date and place of birth (If deceased, so state giving year of death) ) (Difunto 1960 26. Nomi impleto de soltera, domicilio, fecha y lugar de nacimiento de la madre (si ha fallecido, indíquese en qué año murió (M aiden name, address, date and place of birth (If deceased, so state giving year of death) Ester Lina Castillo (Difunta 1964)"
}
