{
  "anumber": "A41364961",
  "id": "A41364961_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41364961_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "The StatesMAN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/14/2023 WOODWORK The BARRYEE (With which THE FRIEND OF INDIA is incorporated.) CALGUTTA THE MOST EFFECTIVE ADVERTISING MEDIUM IN INDIA. Vol. XCVIII No. 18439. REG. No. C193 CALCUTTA:-SATURE Y, JULY 9, 1932. 14 Pages The charge for notices of Births, Marriages Additional lines As 8 per line extra Verses SWASTIKA SELECT and Deaths not exceeding six lines is Rs. 2. UNDER THE HOOGHLY MERITO'S \" THREE CASTLES and quotations not exceeding four lines if accepted Re. 7 per line extra. A remittance WELD IT INSURE must accompany the announcement. OLD OLOROSO CIGARETTES. and The photograph on the back page of IT OR BIRTHS. to-day's issue shows a view of the SAVE MONEY de la Hoyde- On the 2nd July, at Nagpur, Cable Tunnel from the Calcutta to MERITO'S SOLERA Backed by over fifty years WITH C.P., to Irene (née Hart), the wife of the Howrah side of the Hooghly, Rev. John de la Hoyde. the gift of a built by Messrs. John Cochrane Ltd., If you wish to hav the finest reputation, as guarantee son (Casarian). Both doing well. for the Calcutta Electric Supply of Sherries of unchanging quality, they Dey-On the 2nd July, to Niharika, wife of We have the largest GILLANDERS Mr. N. C. Dey. Supervisor, Singer Sewing Corporation. Six feet in diameter AGENTS are still the cigarette of Machine Company, Gauhati (Assam), a ARC-WELDING PLANT son. Both well. and 1,730 ft. long, it is built of cast iron segments bolted together and SPENCER & Co., Ltd. the connoisseur. BETROTHALS. surrounded by a grout of Swastika in India and also up-to-date No. 1 The engagement is announced and the cement forced through holes in the OXY-ACETYLENE WELDING METHYLATEI marriage will take place on the 12th July, at Galstaun Park, 231/5, Lower Circular casing at a pressure of 100 lbs. per HOT WATER Re. 1/8 per 50s Tin. PLANT. SPIRIT Road. Calcutta. between P. G. Bhagat. B.Sc. square inch. One hundred and (Glasgow). of the Indian Stores Depart- ment. son of the late G. Bhagat, of thirty-five tons of Swastika have BOILERS W. D. & H, O. WILLS, For Licensed Vendors. Repairs at short notice. Karachi, and Sudhira, daughter of Dr. and been thus used, completely enclosing the casing in a cylindrical housing & Free on Rail, exclusive of conta Mrs. K. Sen, of Burdwan. BRISTOL & LONDON. The marriage will take place at Inspection and advice without at Marhowrah Distillery Chandlers Pord. Heris, on the 27th August, of cement from one to three inches charge. CYLINDERS B. & N. W. Ry, between Captain Edward Deloraine Tims, in thickness. 5th Battalion. 13th Frontier Force Rifles, Expert European Supervision. Large Stocks CLENSEL As. 12 per Gallon. son of the late E. M. Tims. R.N., and Mrs. Tims, of Crowthorne, Berks. and Geraldine BALMER LAWRIE & Co., Ld., Purefoy younger daughter of the Rev. H. CONCENTRATED Less Trade Discount. B. Norton & Sons Purefoy and Mrs. FitzGerald. of Chandlers Agents for Further particulars from the F. Ford. Hants LIQUID SOAP Manager, The engagement is announced between Swastika and Katni Cements. Jessop & Co., Ltd. LD, CAWNPORE SUGA Mr. Hugh de Lancy Walters. The Buffs, 13/399 CALCUTTA, DELHI SIMLA. (Cleansing, Disinfecting, Insecticidal.) WORKS Ltd., son of the late Captain H. de L. Walters (The South Lancashire Regiment) and of (Incorporated in England.) 63 Used extensively by Railway, Marhowrah P. 0., B. & N. W Mrs. Poè, Le Valnord, Guernsey. and Steamer and Tramway Companies, Pamela Florence. second daughter Or 93, Clive Street, Calcutta. Managing Agents Lieutenant-Colonel M. F. Halford (late The Schools, Hospitals, Hotels etc. Begg, Sutherland & Company York and Lancaster Regiment) and Mrs. HOUSE BRITANNIA CAWNPORE. Halford, Creslow. Guernsey. JOHN PATERSON & Co. (INDIA), Ld. No. MARRIAGE. BUILDING & IRON Co., Ltd. CLENSEL WORKS,\" Villiers-Godwin-0n the 9th June, at St. and 103A, Foreshore Road, Shibpore, Howrah. GERMISOP Paul's Knightsbridge, Lieutenant R. M. Have just completed the ex- 'Phone No. 657, Howrah. Villiers, The Cameronians (Scottish No. 2 \"LIQUID DISINFECTANT S Rifles). youngest son of John R. and OFFICE BURN & Co., Ltd., tension to the Great Eastern An Excellent preparation f Mrs. Villiers. 49. Hans-place. to Nancy, Hotel including Air-cooled elder daughter of Lieutenant-Gener Sir ADCOL REDECORATION HOWRAH. Dining Room and Lounge LINOLEUMS, WOOD FLOO harles and Lady Godwin FOR and eighty new Bedrooms British Motor Oils TILES, PAINT AND WARN DEATHS. and Suites. and Greases DESTROYS INFECTION he 14th June. suddenly, follow. We keep a staff of TANKS 'PHONE GERMS omas Alexander, of Ada Kerr. of Welded. Calcutta 3376 Lines). are specified by over SOLE MANUFACTURERS: is Norwood. and expert workmen and Captain Thomas Rivetted, No. 3 90% IVAN JONES I will give you results ine. suddeuly of Cast Iron, ANALYTICAL of British Car Makers CALCUTTA, ridge Wells, Alice Consulting & Technical Chemists. rer of the late equal to Home finishes Pressed Steel. icher Marsack, of Soil, Water (including Bacterio- Sole Distributors in India: 8 every time. logical), Minerals, Oils, Fertiliz- RAMACKERS & Co., Ltd., SHALIMAR th June at St ers. Shellac. Foods and Drugs- nin Court House Street, Calcutta. PATTE TN"
}