{
	"anumber": "A41366425",
	"id": "A41366425_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41366425_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1987, 1914, 2023, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 7/27/2023 OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Relative Expires 4-86 (2 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp 3500 A# APPROVED APR 02 1987 G-28 or Volag# GAA 663310 Section of Law: MAY 27 1987 Petition was filed on 4.02.87 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) 201 (b) parent Document Check Stateside Criteria 203 AM CON: NewDelhi 203 (a)(5) WACH 3444 Field Investigations I-485 Simultaneously REMARKS: A. Relationship 1. The alien relative is my; 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) JOLLY GURCHARN SINGH JOLLY INDER SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 11920 E FLORENCE AVE. # B 473 L. MODEL TOWN (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) SANTAIFE SPRINGS 9 CA 90670 LUDHIANA PANJAB - INDIA 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) CHAKWAL w PAKISTAN AMRITSAR PANJAB - INDIA 4. Date of Birth S. Sex Marital Status 4. Date of Birth B. Sex 6 Marital Status (Mo/Dayly (Mo/Day/Yr) Male Married Single Male Married Single 6.3.1939 Female Widowed Divorced 11.7. 1914 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 3.21.1965 LUDHIANA - INDIA 9.21.1934 GUJARKHAN-PAKISTAN 9. Social Security Number 10 Alien Registration Number (if anv) 9. Social Security Number 10. Alien Registration Number (if any) 102 FOIA (b)(6) 11. Names of Prior Husbands/Wives FOIA (b)(6) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended NONE NONE ZO mz white Cost and USING 13. If you are a U.S. citizen, complete the following: MINO 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No N Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, exchange alien, crawman, Naturalization Give number of certificate date and place it was issued stowaway, temporary worker, without inspection, etc.) 12266722, 11.15.1985 LOS ANGELES Arrival/Departure Record (1.94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? (21916) Yes No If \"Yes\", give number of certificate date and place it was issued Date authorized stay expired, or will expire as shown on Form I-94 or I-95 15. Name and address of present employer (if any) 14. If you are a lawful permanent resident alien, complete the following. Date and place of admission for, or adjustment to, lawful permanent Date this employment began (month/day/year) residence: INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec's Sent Approved Denied Returned 0 JUN 987 For 30 (08-01-85) N upon Aoni Ad"
}
