{
  "anumber": "A41319010",
  "id": "A41319010_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 7/25/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 20. If beneficiary is in the United States. give the following information concerning beneficiary: (a) Last arrived in U.S. as Enter without inspection (b) Date beneficiary's stay expired or will (c) Beneficiary's File number (Visitor, student, exchange alien, crewman, stowaway, etc.) on expire as shown on his Form 1-94 or I-95. if any (Month) (Day) (Year) (Month) (Day) (Year) A- 04-28-1986 (d) Name and address of beneficiary's present employer (e) Date beneficiary began this None employment 21. was born: (Month) (Day) (Year) in: (Town or city) (State or Province) (Country) FOIA (b)(6) FOIA (b)(6) 22. If you are a citizen of the United States, give the following: Citizenship was acquired: (Check one) NAME CHANGED AT TIME OF NATURALIZATIONEROM through birth in the U.S. through parents through naturalization throu FOIA (b)(6) (1) If acquired through naturalization; give name under which naturalized or name used prior to naturalization 11 unread from your present name, number OF naturalization certificate, and date and place of naturalization: FOIA (b)(6) N/C SEEN & RETURNED (2) If known, my former alien registration number was A FOIA (b)(6) 6-2-86 (3) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? (a) If so, give number of certificate and date and place of issuance: (b) if not, submit evidence of citizenship in accordance with instruction 3 a (2) B'C WEXICO 23 VALI are ive the following: FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) means of admission for lawful permanent residence FOIA (b)(6)Not Applicable not Applicable 24 this petition is for your spouse or child, give the following: a. Date and place of your present marriage Not Applicable b. Names of your prior spouses None C. Names of spouse's prior spouses None 00-I9-Taxa 25. My residence in the United States is: (C/O, if appropriate) (Ant No (Number and Street (Town or cityl /State 1710 Code) FOIA (b)(6) FOIA (b)(6) 26. My address abroad (if any) is: (Number and street) (Town or city) (Province) (Country) FOIA (b)(6) None FOIA (b)(6) FOIA (b)(6) 27. Last address at which I and my spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) FOIA (b)(6) 28. If this petition is for a child, (a). is the child married? no (b). is the child your adopted child? no If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state. 29. If this petition is for a brother or sister, are both your parents the same as the alien's parents? no If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 30. If separate petitions are also being submitted for other relatives give names of each and relationship to petitioner (I-130-G-325- 485- NI-134 Maria Veresa Garcia my Mother Ad Justment of Status 05-29-1986 San Francisco CA U.S 31. Have you ever filed a petition for this alien before? no Itaso givallp and date of filing and result. YCJION ss 32. CERTIFICATIONOR PETITIONER I certify, under penalty of perjury under the laws of the United States of America that the foregoing is true and correct. LO 05-29-1986 Executed on (date) Signature Rfayea 33. SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER dec hat this document was prepared by me at the request of the petitioner and is based on all information of which 1 have any knowledge. (SIGNATURE) (ADDRESS) (DATE) querice"
}