{
  "anumber": "A41364961",
  "id": "A41364961_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41364961_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 1405-0015"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1900,
        1937,
        1911,
        2023,
        1932,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/14/2023 class \"B\" T.B. FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION 50230-105 INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name First name Middle name BHAGAT PHEROOMAL GHANSHAMDAS. 2. Other names used or by which known (If married woman, give maiden name) NOT APPLICABLE. 3. Full name in native alphabet (If Roman letters not used) NOT APPLICABLE. 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) (City or town) (Province) (Country) 19 9 1900 87. PADIDAN. SIND. INDIA. 7. Nationality 8. Sex 9. Marital status INDIAN. Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married. NOT APPLICABLE 10. Occupation 11. Present address RETIRED. C 383, DEFENCE COLONY. NEW DELHI. 110024. INDIA, 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) SUDHIRA - SEN. SUDHIRA BHAGAT C 383, DEFENCE COLONY: NEW DELHI. 110024. INDIA. BORN ON MARCH 8th. 1911, AT KHATMANDU NEPAL. Date and place of marriage JULY 12th. 1932: AT CALCUTTA. INDIA. 13. Names, addresses, dates and places of birth of all children CALCUTTA. 1) ARJUN. P. BHAGAT (SON)- 675, HILLSIDE LANE : CEDARBURG: WIS; 53012/ AUGUST 2) LOLITA MAYADAS ( DAUGHTER) 151, E PALLISADE AV: ENGLEWOOD 19th.1933. NEW JERSEY. 07631/ JANUARY 23rd' 3) SHANTI VARMA : B 12, SECTOR 30: NOIDA. INDIA. CALCUTTA. 1936. (DAUGHTER). NOVEMBER 13th. 1937. NEW DELHI. 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States c/o. A.P. BHAGAT; WIFE; SUDHIRA BHAGAT. 675, HILLSIDE LANE; CEDARBURG. WISCONSIN. 53012. U.S.A. 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If if any) A.P. BHAGAT (SON). different from 16) 675, HILLSIDE LANE: CEDARBURG, NOT APPLICABLE, WIS. 53012. U.S.A. 18. Personal description 19. Marks of identification (a) Color of hair, GREY. (c) Height PERMANENT INJURY ON RIGHT HAND 5 feet 61 inches THUMB. (b) Color of eyes (d) Complexion 20. Purpose in going to the United States BLACK BROWN TO LIVE WITH SON AND DAUGHTER. 21. Length of intended stay (If permanently, SO state) 22. Intended port of entry 23. Do you have a ticket to final destination? MOST OF THE TIME. NEW YORK. NO. THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}