{
	"anumber": "A41364961",
	"id": "A41364961_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41364961_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1911, 2023, 1932, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/14/2023 5RS WINDIASA UTD and STORES GOOD yours adidas and FIVE RUPEES HRA FIVE RUPEES AFFIDAVIT I Sujata Von-der-Recke nee Sen widowed Das of Pollagh House, Woodstock, P.O. Moycullen, Co Galway, Republic of Ireland at present residing at C-383 Defence Colony, New Delhi, India herewith declare that : 1) My younger sister Sudhira Bhagat nee Sen was born on the eigth day of March in the year 1911 at Khatmandu Nepal of our parents Dr Surendra Kumar Sen and Suraj Bala Sen. At the time f my sister's birth, no official birth certificate existed in ndia. My brother-in.law Pheroomal Ghanshamdas Bhagat son of G.R. Bhagat and husband of my sister Sudhira Bhagat was born at Pad-Idan Sind India on the 19th day of September in the year 1900. At the time of my borther-in-law's birth, no official birth certificate existed in India. 3) My sister Sudhira and my brother-in-law P G Bhagat were married on the twelvth day of July 1932 at Galstan Mansions, Lower Circular Road, Calcutta, India and at time of their marriage no official marriage certificate existed in India. Sujata DEPONENT reader Peeke VERIFICATION I, the Deponent abovenamed do hereby verify that the contents of the above affidavit are true to my knowledge, no part of it is false and nothing material has been concealed herefrom. Verified at New. Delicious (day of may 1985. the Witness Signature Sujath you der Rocke DEPONENT TIT TED Name SUTINSAR KUMAR VARMA Ram Krishan yaeg Address N-242 G.K.I. MOTARY PUBLIS Name Delhi. 110048, India 1/5/85 VALID OUTSIDE INDIA I hereby certify that I have examined this document and that it is a true and correct copy of the original. Barry House BARRY H. SHERMAN, Attorney at Law 1S376 Summit Ave., Oakbrook Terrace, IL 60181 312/629-3203"
}
