{
	"anumber": "A41319010",
	"id": "A41319010_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41319010_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICADO DE REPOSICION DE PARTIDA, Nº 125246"
		},
		"years": {
			"ms_years_nlp_v1": [1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Julia Screened Castillo the 83 pep 83 SERIE \"F\" CUATRO CORDOBAS 00 and No 1252426 1 CERTIFICADO DE REPOSICION DE PARTIDA 2 NYDIA BEECHER MORALES: REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE CORINTO CERTIFICA. Que en el libro No. 1, folio No. 63, se encuen 3 4 tra inscrita la partida de Nacimiento en Reposición de partida No. 125, en el año de 1983 la que literalmente dice: En la Ciudad de Porinto.Departamento de Chinandega a las ocho I 5 treinta de la mañana del dia diez del mes de Octubre del año de mil novecientos ochenta 3 6 tres. Ante el infrascrito Registrador del Estado Civil y Secretario que autoriza comparece z Julio Cesar Garcia Castillo, mayor de edad, casado Jubilado y de este domicilio y presen- 8 ta para su inscripción la Resolución de Reposicion de partida dictada por el señor Juez 9 Local de lo Civil de Corinto a las doce meridiana del día siete del mes de Octubre de Mil 10 novecientos ochenta y tres en la que ordena reponer la partida de nacimiento de \" JULIO 11 12 CESAR GARCIA CASTILLO 11 quien nació en esta Ciudad a las cuatro de la tarde deldia diez del mes de Diciembre de Mil novecientos siete Siendo hijo de JulianAntonio Garcia y Esther- 13 lina Castillo de Garcia. Yo, el Registrador doy fe de haber tenido a la vista la sentencia 14 de Reposición habiendose anotado al margen del lugar que fue omitida. Las diligencias ori- 15 16 ginales fueron archivadas en esta oficina, poniéndose constancia al pie de ella de la ins- 17 cripcion con señalamiento del numero y fecha de la partida y la pagina del libro en que se 18 asento, Leída la presente se encuentra conforme se aprueba, ratifica y firma.Testado Sen- tencia- de Distrito=no vale Entre linea- Resolucion- Local= vale. () Rosa N. de Flores. 19 Ilegible.- NBeecher M.Sria.Un sello. 20 Es conforme con su original del que fue debidamente cotejado y a solicitud de parte inte- 21 resada y para fines de ley se extiende la presente CERTIFICACION a los dieciocho días del 22 mes de Diciembre de mil novecientos ochenta y cinco. 23 24 Nydia Beecher Morales. Registrador del Estado Civil 25 SECURITY DEL ESTADO michael CIVIL Rosario O.de Gercia las personas. Rosario Padilla de García. 26 INDRICA CENTRAL Sria. del Registro del Estado Civil de las personas. c. 27 Nicarague, 28 29 30"
}
