{
	"anumber": "A41488327",
	"id": "A41488327_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Acquisition of Immigrant Visa, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 1984, 1948, 1941, 2023, 1944, 1920]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 U.S. Department of Justice The following documents seen OMB No. 1115-0054 Im and Naturalization Service and returne Approval expires 4-86 e IT'ON T LASSIFY STATUS OF ALIEN RELATIVE Fee Stamp Marriage certificate FO GUANCE OF IMMIGRANT VISA Birth certificate petitioner Birth certificate beneficiary Divorce decree, petitioner I-130 130 (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) Divorce decree, beneficiary EMPI 99 09/25/84 Passport TO THE SECRETARY OF STATE: 9-25-84 APPROVED REMARKS The petition was filed on U.S. HAMIGRATION The petition is approved for status under PERSONAL INTERVIEW CONDUCTED section: OCT 20 1984 DOCUMENT CHECK ONLY FIELD INVESTIGATION COMPLETED SPOUSE, 201 (b) CHILD 203 (a) (2) ACTION DATE OF Emerts Must for APPROVAL PREVIOUSLY FORWARDED 201 (b) PARENT 203 (a) (4) DD by Park Montgomey (II) CHECKED 203 (a) (1) 203 (a) (5) DISTRICT LOS/AMB 10-10-84 (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: KASUBHAI EBRAHIM MOHAMADALI 4. Other names used by beneficiary (including maiden name if married) UP-K Married Widowed Divorced Single 5. Has this beneficiary ever been in the U.S.? NONE K-210 YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? INDIA 9-5-1912 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) KASUBHAI TAHER EBRAHIM (818) 340-2437 FATHER 12. Other names used by petitioner (including maiden name if married woman) NONE 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) SUGRA, EBRAHIM KASUBHAI, 6-15-1920, INDIA 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) c/o. HASAN JHINA 64 WOUDEHOUSE ROAD, RATAN MANZIL 4 th is FLOOR, 10 COLABA, BOMBAY 5, INDIA 15. Names, birthdates and countries of birth of beneficiary's children: TAHER E. KASUBHAI 9-15-1941 INDIA NAFISA H. JHIMAH 4-14-1944 INDIA JABIR E. KASUBHAI. 6-15-1948 INDIA FOIA (b)(6) 10. ORIGON wio appropriate UVA USION INTERNATION required FOR use UVA Beneficiary will apply for a visa abroad at the American Consulate in BOMBAY INDIA (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 7220 DENNIS LN, CANOGA PARK, CALIFORNIA 91307 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) 64 WOUDE HOUSE ROAD, RATAN MANZIL, 4th FLOOR, #10, COLABA BUMBAY-5 IN DAA 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) 8 MATARPATHADI ROAD, MAZAGON TOWER FLAT # 4, 16th FLOUR, MAZGON BOMBAY 40.6010, (b) If the beneficiary's native alphabet is other than Roman letters. write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) OVER Received Work Relocated Completed RECEIVED TRANS IN RET'D TRANS OUT COMPLETED FORM 1-130 (Rev. 5-5-83) N (siosy Initial Resubmit Received Sent proved nied turned"
}
