{
  "anumber": "A41448302",
  "id": "A41448302_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448302_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL Examination of Applicants for United States Visas, 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1981,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS Calle Arce 908- FOR UNITED STATES VISAS DATE OF EXAMINATION Septe29, 1988- CITY COUNTRY At the request of the American Consul at San Salvador- E1 Salvador- C.A. NAME AGE SEX Manuel de Jesús RIV AS- 75 M I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON -0324351- El Salvador- Feb. 15/86- I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: AIDS- Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature mounting to a Substantial Departure from Normal Physical Well-Being. THE MEDICAL EXA -INATION, 1 AUTHORIZE THE CLASS C: REQUIRED TRUSTS TO BY COMPLETED AND THE Minor Conditions. INFORMATION ON THE roak REFERM no I (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. Manul Rwant,4 (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A, B, or C-diagnosis, and pertinent details*): Has received treatment with benzathine penicillin G.i.m. , two doses of 2. 400. 000 units, because of reactive serology. History and Clinical examination are negative. After treatment applicant can be considered not contagious. (Currens Medical Diagnosis & Treatment 1981, page 852). - Chest X-ray report negative to pulmonary tuberculosis- Brito-Mejía Peña- from Dr. VDRL: Reactive 1:1. - XX Lab. Barrientos Blood serological report from Dr. HIV Test: No reactive- Other special report(s) (when needed) from DY. Lab. Barrientos- SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT Dr. A. Avila F. (MD)-135- Oct.4/88- 50157-102 *Continue on reverse side if necessary OPTIONAL FORM 157 (Rev. 5-78) U.S. GOVERNMENT PRINTING OFFICE : 1987 Q 2 188-920 Salvader C.A. Dept. of State"
}