{
	"anumber": "A41448302",
	"id": "A41448302_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448302_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 1946, 2023, 1913, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 Optional Form 230 B (Rev, 6/82) APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION Formulario Opcional 23 (Rev. 6/82) SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCTI a form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so If there is insufficient room on the form, answer on separate sheets, in duplicate, using the same numbers as appear on the form. Attach the sheets to the forms. 00 NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING Any false statement or concealment of a material fact may result in your permanent exclusion from the United States Even though you should be admitted-to the United States. a fraudulent entry could be grounds for your prosecution and for deportation INSTRUCCIONES: Este formulario debe ser completado por duplicado a máquina 0 de hacerlo a mano, en letras de imprenta legibles. Deben contestarse todas las preguntas si corresponden. Cuando una pregunta no es pertinente debe indicarse Si no hay suficiente espacio en el formulario, conteste en hojas separadas, por duplicado, utilizando los mismos números tal como figuran en el formulario Adjunte esas hojas a los formularios. No firme este formulario hasta que se lo indique el funcionario consular. La tarifa para presentar esta solicitud de visa de inmigrante es de USS 25,00. La tarifa debe abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda local, 0 por transferencia bancaria, cuando se presente al funcionario consular. ADVERTENCIA: TODA DECLARACION FALSA 0 ENCUBRIMIENTO DE UN HECHO MATERIAL PUEDE RESULTAR EN su EXCLUSION PERMANENTE DE LOS ESTADOS UNIDOS. AUN CUANDO USTED HAYA SIDO ADMITIDO A LOS ESTADOS UNIDOS, UNA DECLARACION FRAUDULENTA PUEDE SER CAUSA DE SU PROCESAMIENTO Y/O DEPORTACION. 1. Apellido(s) (Family name) Nombre (First Name) Segundo Nombre (Middle Name) RIVAS MANUEL Jeres 2. Otros nombres por los cuales se le conozca (si es mujer casada, indique el apellido de soltera). Other names used or by which known. If married woman. give maiden name) MANUEL DE JESUS RIVAS 3. Nombre completo en alfabeto nativo (si no se utilizan carac teres romanos). (Full name in native alphabet. If Roman letters not used). N/A 4. Fechade Nasimiento (Date of birth 5. Edadolamed 6. Lugar de Nacimiento (Place of birth) Alto Year Ciudad o pueblo (City or town) Proticia/Departantento/Estado(Province/State) País (Country) 17-6-1913 75 SESUNTEPEQ EL SALVADOR 7. Nacionalidad (Nationality) 8. Sexo (Sex) 9. Estado Civil (Marital Status) Masculino Femenino Soltero (Que nunca se ha casado) Casado Viudo Divorciado Separado SALVADORIAN (Male) (Female) (Single) (Never married) (Married) (Widowed) (Divorced) (Separated) Incluyendo mi matrimonio actual, me he casado veces. 10. Ocupación (Oncubation) Retired /UNR (Including my present marriage, I have been married times.) 11. Domicilio actual (en El Salvador) Present Address (in Salvador) CALLE FRANKLIN \"D\" ROOSEVELT PONIENTE # 37 SOYAPANGH SAN SALVADOR 12. Nombre, domicilio, fecha y lugar de nacimiento del/de la esposo/a (Name, address, date and place of birth of wife/husband.) (Dar apellido de soltera de la esposa) (Give maiden name of wife) TRANSITE RIVAS, SAME AS 11, SAN ISIDRO. CABANAS 4/6/1917 Fecha y lugar de matrimonio. (Date and place of marriage) 9/29-1946 SAN ISIDRO, 13. Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos (Names, addresses, dates and places of birth of all children.) SARA RIUAS DE RIVAS, NO. HOLLYHOOD CA. U.S.A 10-18-1947 VILLA VICTORIA, CABA FOIA (b)(6) 14. La/s persona/s nombrada/s en 12 y 13 que me acompañará/n 0 se reunirá/n conmigo en los Estados Unidos. 15. Domicilio definitivo que tendrá en los Estados Unidos. (Person/s named in 12 and 13 who will accompany or follow me to the United States.) (Final address in the United States) FOIA (b) (6) FOIA (b)(6) 16. Persona con quien tiene intención de reunirse. Indique nombre, dirección y parentesco. si alguno. 17. Nombrey domicilio de la persona u organización que es su fiador (garante), ifiere del punto in (Person you intend to join. Give name address and relationship if anv.) (Name and address of sponsoring person or organization 11 different from 16). FOIA (b)(6) SAME AS # 16 18. Descripción personal (Personal description) 19. Señas particulares (Marks of identification) 20. Propósito del viaje a los Estados Unidos. a) Color de cabello (Color of hair) GRAY BROWN NONE (Purpose in going to the United States) b) Color de ojos (Color of eyes) c) Altura (Height): Pies (Feet) Pulgadas (Inches) 34\" d) Tez (Complexion) CAMEASIAN EMIGRATE 21. Duracion de su estadía propuesta Si permanentemente. indiquelo 22. Puerto de entrada propuesto. 23. ¿Tiene Ud. pasaje para su destino final? (Length of intended stay If permanently so state) (Intended port of entry) (Do you have a ticket to final destination?) PERMANENT LOS ANGELES (LAX) YES. 24. Recursos financieros personales. (Personal financial resources) a) Efectivo (Cash) $ 5,000 c) Bienes Raíces Valor $ 200,000 b) Depósitos bancarios $ 50,000 (Real estate Value) Otros Describa (Bank deposits) (Others Describe) ESTE FORMULARIO PUEDE OBTENERSE GRATIS EN LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA No se puede utilizar la versión anterior. SNS: 9/83 THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA Previous edition not usable."
}
