{
	"anumber": "A41489225",
	"id": "A41489225_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41489225_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, FORM 1-131 ( (REV. 4-1-84)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "Mexico", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1989]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice OMB No. 1115-0005 Immigration and Naturalization Service FEE STAMP APPLICATION FOR ISSUANCE OF PERMIT TO REENTER THE UNITED STATES FEE PAID $45.00 PHI 328612 as provided in section 223 of the Immigration and Nationality Act 13/06/89 Use typewriter or print in block letters with ball-point pen. (date) off Initials) 1. YOUR NAME FAMILY NAME (Capital Letters) FIRST MIDDLE IRANI FRENY HORMUSI IN CARE OF C/O MAILING (No. and Street) (Apt. No.) ADDRESS 5219 RIDGE AV. FPT.#3 ALIEN REGISTRATION NUMBER IN U.S. (City) PHILADELPHIA (State) PA 19/28 (ZIP Code) 41489225 SHI 2. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 12-04 -190 INDIA INDIAN 160cms BROWN BLACK HEIGHT 5 FEET 4 INCHES VISIBLE MARKS AND SCARS SCAR ON RIGHT WRIST. 3. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH IRS WHICH ADJUSTMENT OF STATUS IRANT, FRENY HORMUST GRANTED ADJUSTMENT WAS GRANTED INSUICE NEW YORK NYC SEP 15,1988 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIREIPERMANENT RESIDENCE THROUGH ADJUSTMENT YOU MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) AIR INDIA FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME MEHERWAN RUSTOM IRANI MOTIBAI HIZ BEHRAM IRANI 4. FILL IN THE ITEMS IN THIS BLOCK AS TO LASTARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL / RANI FRENY HORMUSJI PHILADELPHIA SEPT: 7 1989 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 5. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD NEW YORK DEC. 31 1,(1989) 2 YEARS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL T.W.A. N/A 6. FILL IN ITEM 6 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT DIOC LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED, STATE EXPIRATION DATE 7. PRESENT OCCUPATION: HOUSE WIFE NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER TELEPHONE NUMBER 8. MAILING ADDRESS ABROAD (Number and Street) (City/ Town) (State/Province/District) (Country) 9. ,PATEL CHAMBERS GUNBOW STEET, FORT, 9. REASONS FOR GOING ABROAD (Be concise and complete): 1. DISPOSAL OF PROPERTIES AND ASSETS COMINGE : MAHARASHTRA, ot me zerative EDIANES intervision RECEIVED TRANS. IN RET'D-TRANS OUT COMPLETED FORM 1-131 (REV. 4-1-84)Y OVER 12/12/89 1-8-98"
}
