{
	"anumber": "A41488327",
	"id": "A41488327_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEMBER STATEMENT, 1"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "SEND INQUIRIES TO MEMBER STATEMENT Screened by 8/15/2023 TRW Systems Federal Credit Onion One Space Park Redondo Beach, CA 90278 DIRECT INQUIRIES REGARDING DIRECT BILLING ERROR ELECTRONIC TRANSFERS TO: INQUIRIES TO: TRW Systems Federal Credit Union TRW Systems Federal Credit Union One Space Park One Space Park Redondo Beach, CA 90278 Redondo Beach, CA 90278 NOTICE: SEE REVERSE SIDE FOR IMPORTANT INFORMATION MEMBER NO. SOCIAL SECURITY NO. PAGE 402950 090-40-9770 1 TAHER E KASUBHA I STATEMENT RECORD 7220 DENNIS LN FROM 01JUL87 TO 30SEP87 CANOGA PARK, CA 91307 Branch 2 EACH TRANSACTION WITH A # IN THIS COLUMN IS EFFECTIVE DATE PERIODIC TRANSACTION LATE DATE FILTER FINANCE PAYMENT DEBITS CREDITS NEW BALANCE DESCRIPTION CHARGE CHARGE S1 SHARE A/C - REGULAR SHARES (Joint with NEFISA KASUBHA JUL1 Previous Balance 3724.61 JUL9 PAYROLL JUL09 153.48 3878.09 JUL23 PAYROLL JUL23 153.48 4031.57 JUL31 CHECK DEPOSIT 144.00 4175.57 AUG6 PAYROLL AUG06 153.48 4329.05 AUG7 CHECK DEPOSIT 573.00 4902.05 AUG20 PAYROLL AUG20 153.48 5055.53 AUG20 CHECK TO - TAHER E KASUBHA I 1000.00 4055.53 AUG31 CHECK TO - TAHER E KASUBHA I 1000.00 3055.53 SEP3 PAYROLL SEP03 153.48 3209.01 SEP17 PAYROLL SEP17 153.48 3362.49 SEP30 DIVIDEND CREDIT 47.24 3409.73 SEP30 Closing Date . New Balance 3409.73 YEAR TO DATE DIVIDENDS S1 101.96 Total 101.96 ATTENTION VISA CARDHOLDERS! Your new VISA P.I.N.* is on its way!! Your TRW Credit Union VISA card and new P.I.N. will allow you to make cash advances from your VISA account at thousands of ATM's worldwide displaying the VISA logo. * Personal Identification Number ALL ACCOUNTS, EXCEPT SHARE DRAFT ACCOUNTS, ARE TRANSFERABLE AS DEFINED IN REGULATION D. EACH LOAN MARKED IS OPEN END CREDIT THE UNPAID BALANCE IS THE AMOUNT OF THE LOAN OUTSTANDING AND UNPAID AT THE CLOSE OF EACH DAY AFTER TRANSACTIONS HAVE BEEN ENTERED THE FINANCE CHARGE IS COMPUTED BY MULTIPLYING THE UNPAID BALANCE EACH DAY BY THE DAILY PERIODIC RATE AND THEN ADDING ALL THOSE AMOUNTS TOGETHER TO ARRIVE AT A TOTAL FINANCE CHARGE REGULAR SHARE ACCOUNTS ARE NON-TRANSFERRABLE EXCEPT ON THE RECORDS OF THIS CREDIT UNION"
}
