{
  "anumber": "A41448083",
  "id": "A41448083_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448083_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRANSLATION OF MARRIAGE CERTIFICATE, 187"
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/10/2023 COPY / TRANSLATION OF MARRIAGE CERTIFICATE IN THE CIVIL REGISTRY OF UNITED STATES OF AMERICA SAN SALVADOR, ITEMS # 187 IN THE BOOK #2. STATE OF CALIFORNIA COUNTY LOS ANGELES CITY INGLEWOOD I, ADRIANNA E. PINOS ,the undersigned Authority, an Officer duly commissioned by the Laws of the State California, to Administer oaths take acknowledgement and a qualified translator of documents from Spanish into English, as conversant with both languages does hereby certify that the foregoing document is a true and correct translation of the annexed document, to-wit; THIS IS.A PERSONAL DATA OF A MARRIAGE CERTIFICATE OF: NAME OF MALE: HECTOR SALVADOR ZELAYA FUNES (RACE) HISPANIC SAN SALVADOR PLACE OF BIRTH: DOSE NOT APPEAR 55 DATE OF BIRTH: (AGE): SALVADOR DE JESUS ZELAYA LUCIA FUNES FATHER'S NAME: MOTHER'S NAME: MARIA ERLINDA GARCIA NAME OF FEMALE: (RACE) HISPANIC SANTIAGO NONUALCO PLACE OF BIRTH: DATE OF BIRTH: DOSE NOT APPEAR (AGE) 55 FATHER'S NAME: DOMINGO GARCIA MOTHER'S NAME; CAMILA AYALA PLACE OF MARRIAGE: ALCALDIA MUNICIPAL DATE OF MARRIAGE: 05/22/69 SAN SALVADOR NAME OF PERSON PERFORMING CEREMONY: JOAQUIN ROBERTO MEZA DELGADO AND CARLOS ANTONIO HERRERA ROBOLLO. WITNESSES TO CEREMONY: ANDRES CARLOS GONZALEZ & HAL ROYCE ALLEN PERSON IN CHARGE OF THE REGISTRY IS BALMOR CRUZ URQUILLA OTHER: THERE IS A RUBBER STAMP FROM THE REGISTRY IN THE BACK OF THE CERTIFICATE AND AN ILLEGIBLE SIGNATURE FROM THE REGISTR 14th SEPTEMBER WITNESS MY HAND AND OFFICIAL SEAL, this day of A.D. 19.87 In the City of Inglewood County of Los Angeles State of California United States of America. Aduana Elivio NOTARY RUBLIC, STATE OF AT LARGE AND TRANSLATOR @@@@@@@@@@@@ OFFICIAL SEAL Original seen and returned ADRIANNA E PINOS Certified a true and correct GOPEX NOTARY PUBLIC-CALIFORNIA LOS ANGELES COUNTY MY COMM. EXP. NOV. 12,1990 contact Representative, USINS"
}