{
  "anumber": "A41446957",
  "id": "A41446957_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41446957_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Decision, N336"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 UN ED STATES DEPARTMENT OF JT ICE Immigration and Naturalization Service 300 N. Los Angeles Street Los Angeles, CA 90012 OTILIA CARCAMO Refer to this file No. 5262 ITHACA AVE A 41 446 957 LOS ANGELES, CA 90032 Prepared by: R. JOHNSON Date: NOV 12,1996 EC Decision Jan-16.1997 On AUG 14, 1996 you appeared for an examination on your application for naturalization, and on OCT 16, 1996 you failed to appear for reexamination. Pursuant to the investigation and examination on your application, it is determined that you are ineligible for naturalization. Section 312 of the Immigration and Nationality Act, 8 USC 1423, provides in pertinent part that \"[no] person except as otherwise provided shall hereafter be naturalized who cannot demonstrate an understanding of the English language, including an ability to read, write and speak wording in ordinary usage in the English language [and] a knowledge and understanding of the fundamentals of the history, and of the principles and form of government, of the United States. You have failed to meet the requirements of Section 312 in that: [X] You have failed to demonstrate ability to speak and understand the English language sufficiently to answer the questions in your interview and on your application, and are not exempt from the requirement. [X] You have failed to demonstrate ability to write words in ordinary usage in the English language which were presented to you to write, and are not exempt from the requirement. P 321 616 767 [X] You have failed to demonstrated knowledge of the hists and form of government, of the United States. US Postal Service Receipt for Certified Mail This decision is made without prejudice toward the filing o No Insurance Coverage Provided. future. Do Sent to not use for International Mail (See reverse) Street & Number OTILIA CARCAMO If you decide to request a review hearing on this decision 5262 THACA AVE of the Act, you must file a request for a hearing within 3: Post,Office State, & ZIP Code notice. If no request for hearing is filed within the tim LA, S 90032 final. A request for hearing may be made to the District Postage and Naturalization Service at the above address on Form N- Certified Fee Hearing on a Decision in Naturalization Proceedings unde together with a fee of $110.00. A brief or other writt Special Delivery Fee your request may be submitted with the Request for Hearing Restricted Delivery Fee Return Receipt Showing to Sincerely yours, Whom & Date Delivered Return Receipt Showing to Whom, Date, & Addressee's Address TOTAL Postage & Fees $ Richard K. Rogers Postmark or Date District Director Enclosure N336"
}