{
  "anumber": "A41488327",
  "id": "A41488327_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Draft Account Reconciliation Form, DRAFT ACCOUNT RECONCILIATION FORM"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 e FINANCE CHARGE will be computed on the outstanding unpaid balance at the ANNUAL RCENTAGE R shown for the actual time the balance remains unpaid. DRAFT ACCOUNT RECONCILIATION FORM following summary explanation of your rights to dispute or question statements applies List below all drafts to th loan(s) designated as an Open End Loan type(s) on the front of this statement outstanding (not yet paid DATE / / CCO by the Credit Union): IN CASE OF ERRORS OR QUESTIONS ABOUT YOUR STATEMENT For your own protection, please verify NO. AMOUNT If you think your statement is wrong, or if you need more information about a transaction on your Share Draft Account balance. your statement, write us on a separate sheet at the address shown on your statement as soon as IMPORTANT! Before you begin, make possible. We must hear from you no later than 60 days after we sent you the first statement sure you have made the following on which the error or problem appeared. You can telephone us, but doing so will not preserve adjustments to your records: your rights. In your letter, give us the following information: To Prove The Ending Balance As Your name and account number. Statement Shows: The dollar amount of the suspected error. 1. Go through your drafts (or draft stubs draft register) Describe the error and explain, if you can, why you believe there is an error. If you need and check off each draft or other debit listed on this more information, describe the item you are unsure about. statement If you have an entry for which you do not have the paid item on this statement, list the You do not have to pay any amount in question while we are investigating, but you are still amount in drafts outstanding column obligated to pay the parts of your statement that are not in question. While we investigate your question, we cannot report you as delinquent or take any action to collect the amount you Enter Ending Balance From question. 2. $ Front Of Statement Add Any Deposits Made In Your Draft Register After IN CASE OF ERRORS OR QUESTIONS ABOUT YOUR ELECTRONIC TRANSFERS Period Ending Date Shown 3. $ On Front Telephone us at: (213) 772-0357 Los Angeles (800) 262-1545 TOLL FREE CALIFORNIA 4. $ Subtotal (800) 421-6818 TOLL FREE CONTINENTAL U.S. Subtract Total Of Outstanding OR Write us at: TRW Systems Federal Credit Union 5. $ Drafts (Line 11) One Space Park 6. $ Account Balance Redondo Beach, CA 90278 Your Register Balance as soon as you can, if you think your statement or receipt is wrong or if you need more 7. $ (Before Dividend). information about a transfer listed on the statement or receipt. We must hear from you no later than 60 days after we sent the FIRST statement on which the problem or error appeared. Add Transfers From Other Accounts Or Loan Advances (1) Tell us your name and account number (if any). And Dividends To Your Register Balance And Enter (2) Describe the error or the transfer you are unsure about, and explain as clearly as 8. $ New Balance you can why you believe it is an error or why you need more information. Deduct Charges For Reorders (3) Tell us the dollar amount of the suspected error. Of Share Draft Forms, if you tell us orally, we may require that you send us your complaint or question in writing within Automatic Loan Payments, 9. $ Fees, Etc. 10 business days. We will tell you the results of our investigation within 10 business days after we hear from you 10. $ Adjusted Book Balance and will correct any error promptly. If we need more time, however, we may take up to 45 days to investigate your complaint or question. If we decide to do this, we will recredit your account within 10 business days for the amount you think is in error, so that you will have the use of the money during the time it takes us to complete your investigation. If we ask you to put your complaint or question in writing and we do not receive it within 10 business days, we may not LINE 11 TOTAL AMOUNT recredit your account. DRAFTS OUTSTANDING If we decide that there was no error, we will send you a written explanation within 3 business days after we finish our investigation. You may ask for copies of the documents that we used NOTE: LINE 6 AND 10 SHOULD AGREE in our investigation."
}