{
	"anumber": "A41448302",
	"id": "A41448302_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448302_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2, 230 B"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 OPTIONAL FORM 230 B FORMULARIO OPCIONAL 230 B PAGE PAGINA 4 42. adjuntan los siguientes documentos para avalar esta solicitud: (The following documents are submitted in support of this application:) Pasaporte Antecedentes militares Otro Describa (Passport) (Military record) (Other Describe) Certificado de nacimiento Evidencia de medios económicos propios Certificado nacimiento de cónyuge (Birth certificate) (Evidence of own assets) (Birth certificate of spouse) Certificado/s policial/es Declaración de sostenimiento Certificado/s de nacimiento/s de los hijos no casados menores de 21 años de edad que no inmi- (Police certificate/s) (Affidavit of Support) grarán en este momento. Enumere aquellos para los cuales los certificados de nacimiento no son Certificado de matrimonio Oferta de empleo obtenibles 0 cuyos certificados de nacimiento se están presentando en este momento en conexión (Marriage certificate) (Offer of employment) a una solicitud de visa. Certificado de defunción Certificado/s médico/s (Birth certificates of unmarried children under age 21 who will not be immigrating at this time (Death certificate) (Medical records) List those for whom birth certificates are not available or whose birth certificates are being sub. Certificado de divorcio Fotografias mitted at this time in connection with a visa application.) (Divorce decree) (Photographs) NO ESCRIBA DEBAJO DE LA SIGUIENTE LINEA EL FUNCIONARIO CONSULAR LE AYUDARA A CONTESTAR LAS PARTES 43 Y 44 (DO NOT WRITE BELOW THE FOLLOWING LINE) (THE CONSULAR OFFICER WILL ASSIST YOU IN ANSWERING PARTS 43 AND 44.) 43. Declaro estar exento de inegibilidad para recibir una visa y exclusión bajo el rubro Section 212 (a) (14) not statutoriky en la parte 40 por las siguientes razones: (1 claim to be exempt from ineligibility to receive a visa and exclusion under item required in part 40 for the following reasons:) 212 (a) (14) No pertinente (Not applicable) Beneficiario de un Permiso Especial bajo: 212 (a) (28) (1) (i) 212 (e) Adjunto (Attached) (Beneficiary of a waiver under:) 212 (a) (28) (1) (ii) 212 (g) 212 (b) (1) 212 (h) 212 (b) (2) 212 (i) 44. Declaro ser un: (I claim to be a:) EL SALVADOR Inmigrante de IR-5 preferencia sujeto a limitación numérica de Nación extranjera o zona dependiente preference immigrant subject to the numerical limitacion of ) (Foreign state or dependent area) Inmigrante especial no sujeto a limitación, (Special immigrant not subject to limitation). Pariente inmediato de un ciudadano de los Estados Unidos. (Immediate relative of a United States citizen). Mi declaración se basa en los siguientes hechos: (My claim is based on the following facts:) Soy/mi es el beneficiario de una petición de (1 am/my is the beneficiary of a petition.) Soy un residente. extranjero que regresa. (I am a returning resident alien.) Derivo la limitación numérica de bajo la Sección 202 (b) ( ) a través de mí (I derive chargeability under Section 202 (b) ) through my ) Otro/Especifique (Other Specify) Entiendo que se me exige entregar mi visa al funcionario de inmigración de los Estados Unidos en el lugar donde yo solicité ingresar a los Estados Unidos, y que el poseer una visa no me da derecho a ingresar a los Estados Unidos si en ese momento se me encuentra inadmisible bajo las leyes de inmigración. Entiendo que cualquier declaración intencionalmente falsa 0 tergiversación de un hecho material efectuada por mi en esta solicitud puede ser causa de mi exclusión permanente de los Estados Unidos y, si soy admitido a los Estados Unidos, puede ser causa de mi procesamiento penal y/o deportacion. Yo, el subscrito solicitante de una visa de inmigrante para los Estados Unidos, juro (o afirmo) solemnemente que todas las declaraciones que figuran en esta solicitud han sido efectuadas por mi, inclu- yendo las respuestas a las partes 32 hasta la 41 inclusive, y que son verdaderas y completas a mi mejor saber y entender. Tambien juro (o afirmo) que, si soy admitido a los Estados Unidos, no llevaré, a cabo actividades que podrian ser perjudiciales al interés público, 0 poner en peligro el bienestar, protección, 0 seguridad de los Estados Unidos; en actividades que serian prohibidas por las leyes de los Estados Unidos en relación a espionaje, sabotaje, desorden público, 0 en cualquier otra actividad subversiva a la seguridad nacional; en cualquier actividad cuyo propósito sea el de oposición a, 0 el control, 0 derrucamiento de, el gobierno de los Estados Unidos, por medio de la fuerza, violencia, U otros medios anticonstitucionales. Entiendo todas las declaraciones anteriores, habiendo solicitado y obtenido una explicación de cada punto que no me haya sido claro. (I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, il am admitted to the United States, may subject me to criminal prosecution and/or deportation. 1, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answers to parts 32 through 41 inclusive, and are true and complete to the best of my knowledge and belief, I do further swear (or affirm) that, if admitted to the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means. Lunderstand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me.) (The relationships claimed in items 12 and 13 have been verified hy documentation submitted to consular officer except as noted (Signature of Applicant OCT 13 1988 Subscribed an a to before me this day of 19 at american Embassy (Consular Section) San Salvador, El Salvader (Consular Officer) GERALDINE L. KAM Vice Consul of the United States of America"
}
