{
  "anumber": "A41488327",
  "id": "A41488327_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0042/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Balance Your Account Worksheet,, UNI 701 ( (02/87)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 THIS WORKSHEET IS PROVIDED TO HELP YOU BALANCE YOUR ACCOUNT 1. Go through your register and mark each check, withdrawal, Express Stop® transaction, payment, deposit or other credit listed on this statement. Be sure that your register shows any interest paid into your account, and any service charges, automatic payments or Express Transfers withdrawn from your account during this statement period. 2. Using the chart below, list any outstanding checks, Express Stop withdrawals, payments or any other withdrawals (including any from previous months) which are listed in your register but are not shown on this statement. 3. Balance your account by filling in the spaces below. ITEMS OUTSTANDING NUMBER AMOUNT ENTER The NEW BALANCE shown on this statement $ ADD Any deposits listed in your $ register or transfers into your $ account which are not shown on $ this statement. + $ TOTAL + $ CALCULATE THE SUBTOTAL $ SUBTRACT The total outstanding checks and withdrawals from the chart at left - $ CALCULATE THE ENDING BALANCE This amount should be the same as the current balance shown in your check register $ TOTAL $ IF YOU SUSPECT ERRORS OR HAVE QUESTIONS ABOUT ELECTRONIC TRANSFERS (Express Stop®, MasterTeller®, or Interlink Transactions) If you believe there is an error on your statement or Express Stop receipt, or if you need more information about a transaction listed on this statement or an Express Stop receipt, please contact us immediately. You must report suspected errors to us no later than 60 days after we sent you the first statement on which the problem appeared. If you are within California, please telephone us toll free at 800-622-0880 from 8:00 a.m. to 5:00 p.m. seven days a week. Or, you may write to us at Wells Fargo Bank, P. O. Box 63107, San Francisco, CA 94163. 1) Tell us your name and account number or Express Banking card number. 2) As clearly as you can, describe the error or the transfer you are unsure about, and explain why you believe there is an error or why you need more information. 3) Tell us the dollar amount of the suspected error. We will investigate your complaint and will correct any error promptly. If our investigation takes longer than 10 business days (or 20 days in the case of electronic purchases), we will temporarily credit your account for the amount you believe is in error, so that you may have use of the money until the investigation is completed. UNI 701 (02/87)"
}