{
  "anumber": "A41488327",
  "id": "A41488327_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "HOW TO READ YOUR STATEMENT, 70109"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 HOW TO READ YOUR STATEMENT SOCIAL SECURITY OR DEALER ACCOUNT NUMBER TAXPAYER IDENTIFICATION NO REPRESENTATIVE NUMBER 12A-1 JONES 96011236548 999-12-3758 00003000 INVESTOR DEALER JOHN DOE F ADVISORS INC 155 BOVET ROAD 155 BOVET RD SAN MATEO CA 94402 SAN MAYEO CA 94402 SUMMARY OF YOUR ACCOUNT STATEMENT INCOME DIVIDENDS CAPITAL GAINS CERTIFICATE SHARES SHARES HELD TOTAL SHARES 5 DATE PAID THIS YEAR PAID THIS YEAR HELD BY YOU BY THE BANK YOU OWN 10/18/84 $72.67 $363.37 1,000.000 489,722 1,489,722 *REINV INCOXVANEINV CAPGH 12 FEDTAXWT 87.20 INDIVIDUAL TRANSACTIONS FOR YEAR TO DATE DATE OF TYPE OF PRICE SHARES THIS TRANSACTION TRANSACTION DOLLAR AMOUNT SHARE TRANSACTION TOTAL SHARES BALANCE FORWARD 01/01/84 0.000 01/15/84 CONFIRMED PURCHASE 11700.00 11.70 1000.000 1000.000 01/15/84 ISSUE CERT 0.00 1000.000 1000.000 02/14/84 DIRECT PURCHASE 2500.00 12.67 197.316 1197.316 03/01/84 TRANSFER SHARES IN 0.00 200.000 1397.316 04/03/84 PARTIAL REDEAPTION 600.00 12.36 48.544- 1348.772 06/18/84 EXCHANGE/PURCHASE 1245.00 11.89 104.710 1453.482 10/18/84 INC DIVIDENO RATE $0.0500 58.14 10.25 5.672 1459.154 10/18/84 CAPGAIN DIST RATE $0.2500 290.70 9.51 30.568 1489.722 1) Account Number: Always be sure to include your Franklin 15) Direct Purchase: Purchase of fund shares through the mail. account number in all correspondence 16) Transfer Shares in: These are shares that have been trans- 2) Social Security/Taxpay Identification Number: Be sure your ferred from one Fund account to another Brokers often transfer number is correct shares from \"house\" or \"street name\" accounts to shareholder 3) Representative: Your sales representative registered accounts 4) Dealer Number: Franklin's internally assigned number for the 17) Partial Redemption: The sale of shares from an account dealer shown on the statement. Sometimes this is referred to as 8 liquidation of shares 5) Statement Date: The preparation date of your statement 18) Exchange/Purchase: A purchase of shares from one Franklin 6) income Dividends Paid This Year: Net investment income paid Fund with the proceeds from the sale of shares of another Franklin Fund. by the Fund to you in the current year. 7) Capital Gains Paid This Year: The net gains from portfolio 19) Inc. Dividend-Rate: The amount of a particular income securities transactions paid by the Fund to you in the current dividend paid by the Fund and the appropriate rate per share year. 20) Capgain Dist-Rate: The amount of a particular capital gain 8) Certificate Shares Held By You: Fund shares which you own distribution paid by the Fund and the appropriate rate per share for which stock certificate(s) have been issued 21) Date of Transaction: The effective date of the transaction 9) Sheres Held by the Bank: Fund shares which you own and being described which are registered on the records of the Fund, but for which 22) Type of Transaction: Description of the transaction no stock certificate has been issued 23) Dollar Amount: The dollar amount of a particular transaction 10) Total Shares You Own: Your total shares owned including 24) Price Per Share: Represents the price per share at which certificate shares plus book entry shares transaction was effected. 11) Dividend Instruction: Indicates whether dividends/capital 25) Shares This Transaction: The number of shares that pertain to gains will be reinvested or paid in cash a particular transaction 12) Federal Tax Withheld If your social security/taxpayer identifi- 26) Total Shares: The total shares owned following a given trans- cation number has not been properly certified as being correct, action you may be subject to backup withholding imposed by the IRS, 27) How to Determine the Value of Your Account: This can be at a rate of 20% on dividends, capital gains and/or redemption done by multiplying your total shares (10) by the Fund's current proceeds If your statement Is blank, nothing has been withheld net asset value (NAV), as reported in your local newspaper The 13) Confirmed Purchase Shares that are purchased through a NAV is often referred to 85 the bid price. broker/dealer by a telephone order with Franklin 14) Certificate Issuance: A stock certificate was issued represent- If you have any questions concerning your statement please call our ing certain of your shares Shareholder Services Department toll-free at 800/632-2301. One of our Service Representatives will gladty assist you. By completing and signing this stub, you may correct the Social Security/TIN and the spelling of the name(s) in the registration shown on the reverse side. You may also correct or change the address or distribution option shown ADDRESS CHANGE/CORRECTION SUBSTITUTE W-9/SOCIAL SECURITY OR TIN (circle one of the above) NAME (to correct spelling only*) Circle One-Joint Owner, Custodian, Trustee 1. As required by the IRS, I certify that the number shown (to correct spelling only*) above is my correct Taxpayer Identification Number 2. As required by the IRS, I certify under penalties of perjury that I am not subject to backup withholding STREET either because no notification has been received from the IRS or because the IRS has notified me that I am no longer subject to backup withholding CITY STATE ZIP NOTE: Strike out item 2 above If you have been notified that you are subject to backup withholding by the IRS and you \"If you want to change the name(s) of the owner(s), call have not received a notice from the IRS advising you that us for instructions, Shareholder Services 800/632-2301 withholding has been terminated CHANGE OF DISTRIBUTION OPTION SIGNATURE RD Dividends and capital gains reinvested PD Dividends and-capital gains in cash AC Dividends in cash capital gains reinvested JOINT OWNER (if any) 70108"
}