{
	"anumber": "A41490559",
	"id": "A41490559_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41490559_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OF PERMIT TO REENTER THE UNITED STATES, FORM 1-131 ( (REV. 4-1-84Y)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada", "United States", "Mexico", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 2023, 1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/4/2023 UNITED STATES DEPARTMENT OF JUSTICE U. S. Department of Justice Immigration and Naturalization Service hicago, Illinois Immigration and Naturalization Service FEE PAID NUMBER CHI 07949 APPLICATION FOR ISSUANCE OF PERMIT TO REENTER THE UNITED STATES APPLICANT as provided in section 223 of the Shah Masanlal Immigration and Nationality Act Use typewriter or print in block letters with ball-point pen. KASHANCHAND FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME SHAH, MAGANLAL KASHANCHAND IN CARE OF C/O MAILING (No. and Street) (Apt. No.) 9252 CEPAR LANE ALIEN REGISTRATION NUMBER ADDRESS (City) (State) (ZIP Code) IN U.S. DES-PLAINES IL 60016 A4190559 una 2. DATE OF BIRTH (Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 12-07-1907 INDIA INDIA BLAde WHITE HEIGHT e FEET 0 INCHES VISIBLE MARKS AND SCARS No 3. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED SHAH, MAGANLAL CHICAGO A44. 19 , 1988 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) BY BRITISH AIRWAYS FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME KASHAN CHAND SHAH AMBABEN 4. FILL IN THE ITEMS IN THIS BLOCK AS TO LAST ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL SHAH, MAGANLAL CHICAGO Aug,19,1988 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 5. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD CHICAGO NOV. 8, 1988 TWO TEARS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL BRITISH AIRWAYS BRITISH AIRWAYS 6. FILL IN ITEM 6 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER N/A ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED, STATE EXPIRATION DATE 7. PRESENT OCCUPATION: NONE NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER TELEPHONE NUMBER NONE 356-80-1270 312-699-7778 8. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) AT to POST MAHUWA, PIST- SURAT, STATES- GUJARAT, INDIA 9. REASONS FOR GOING ABROAD concise and complete): FOR SELLING AND SETTLEMENT OF PROPERTIES, HOUSE AND OTHER GOODS. ALSO COMPLET SOCIAL OBLIGATIONS TO SOCIETY RECEIVED my IN FAMILYNIT BY MAIL DATE: SENT OUT OF MAIL 1988 UNIT RECEIVED TRANS. IN RET D-TRANS COMPLETED FORM 1-131 (REV. 4-1-84)Y OVER"
}
