{
	"anumber": "A41488327",
	"id": "A41488327_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41488327_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 PAGE 1 Year to Date Franklin U. S. Government Confirmation Statement SEE REVERSE SIDE FOR Securities Fund INFORMATION ABOUT YOUR STATEMENT SOCIAL SECURITY OR DEALER ACCOUNT NUMBER TAXPAYER IDENTIFICATION NO. REPRESENTATIVE NUMBER 10155902645 FOIA (b)(6) 390-000 08190390 INVESTOR DEALER HOME SAVINGS OF AMERICA TTEE WEDBUSH SECURITIES INC FBO TAHER KASUBHAI IRA A/C GRIFFIN FINANCIAL SERVICES 7220 DENNIS LANE P 0 BOX 25255 CANOGA PARK CA 91307 SANTA ANA CA 92799-5255 SUMMARY OF YOUR ACCOUNT STATEMENT INCOME DIVIDENDS CAPITAL GAINS CERTIFICATE SHARES + SHARES HELD TOTAL SHARES = DATE PAID THIS YEAR PAID THIS YEAR HELD BY YOU BY THE BANK YOU OWN 09/15/87 $549.45 $0.00 0.000 1,070.636 1,070.636 *REINV INCDIV*REINV CAPGN INDIVIDUAL TRANSACTIONS FOR YEAR TO DATE DATE OF TYPE OF DOLLAR PRICE SHARES THIS TOTAL TRANSACTION TRANSACTION AMOUNT PER SHARE TRANSACTION SHARES BALANCE FORWARD 01/01/87 997.204 01/05/87 INC DIVIDEND RATE $0.060000 59.83 7.69 7.780 1004.984 02/04/87 INC DIVIDEND RATE $0.060000 60.30 7.71 7.821 1012.805 03/04/87 INC DIVIDEND RATE $0.060000 60.77 7.73 7.862 1020.667 04/02/87 INC DIVIDEND RATE $0.060000 61.24 7.65 8.005 1028.672 05/04/87 INC DIVIDEND RATE $0.060000 61.72 7.34 8.409 1037.081 06/03/87 INC DIVIDEND RATE $0.060000 62.22 7.29 8.535 1045.616 07/02/87 INC DIVIDEND RATE $0.058000 60.65 7.41 8.185 1053.801 08/04/87 INC DIVIDEND RATE $0.058000 61.12 7.34 8.327 1062.128 09/02/87 INC DIVIDEND RATE $0.058000 61.60 7.24 8.508 1070.636 DIVIDENDS ARE PAYABLE 9/15 TO OWNERS OF RECORD 9/1 PLAN FOR YOUR RETIREMENT WITH FRANKLIN'S IRA PLEASE REFER TO ACCOUNT NUMBER ABOVE FRANKLIN U.S. GOVERNMENT SECURITIES FUND 777 MARINERS ISLAND BLVD. IN ALL CORRESPONDENCE AND ADDRESS TO SAN MATEO, CALIFORNIA 94404 FUND NO.: 0110 ACCOUNT NO.: 10155902645 $ HOME SAVINGS OF AMERICA TTEE AMOUNT ENCLOSED NAME FBO TAHER KASUBHAI IRA THIS STUB SHOULD BE 7220 DENNIS LANE ADDRESS DETACHED CANOGA PARK CA 91307 PLEASE MAKE CHECKS PAYABLE TO AND MAILED WITH YOUR FRANKLIN U.S. GOVERNMENT NEXT SECURITIES FUND INVESTMENT CHECK THIS BOX AND 777 MARINERS ISLAND BLVD. COMPLETE REVERSE SIDE SAN MATEO, CA 94404 IF CORRECTIONS ARE 241532 NECESSARY FOR: ADDRESS SOCIAL SECURITY/TIN DISTRIBUTION OPTION 0110 10155902645"
}
