{
  "anumber": "A41448302",
  "id": "A41448302_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448302_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, 88075072"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1007,
        1946,
        1988,
        1987,
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "menu or Justice Screened by NARA, 4/18/2023 / ER OMB No. 1115-00 tion and Naturalization Service (IN Petitic for Alien Relative RIVAS' xpires 4-86 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp A# APPROVED DIRECTOR 902046 G-28 ,ag# LOS Section of Law: JAN 8 1988 Petition was filed on 123.87 date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) Driven Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Document Check Stateside Criteria 203 (a)(5) PHO AM CON 2951 Field Investigations I-485 Simultaneously REMABK SAN SAL VADON Case # 88075072 A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) FOIA (b) (6) RIVAS MANUEL 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) FOIA (b)(6) Roosevelt Pte. #37 (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOIA (b) (6) El Soyapango, El Salvador 3 Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) FOIA (b)(6) San Isidro 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) FOIA (b)(6 FOIA (b)(6 FOIA (b (Mo/Day/Yr) Male Married Single Male Married Single FOIA (b)(6) 06-17-1913 Female Widowed Divorced Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) FOIA (b)(6) AKA Manuel de Jesus RIVAS 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) FOIA (b)(6) 09-30-1946 San Isidro, El Salvador 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA )(6) FOIA (b)(6) na 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended na 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No 14. If your relative is currently in the U.S., complete the following: FOIA (b)(6) He or she last arrived as a (visitor, student, exchange alien, crewman, stowaway, temporary worker, without inspection, etc.) none Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire as shown on Form I-94 or I-95 15. Name and address of present employer (if any) in El Salvador Date this employment began (month/day/year) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED original seen and returned. Certified a true and correct copy DEC 3 1987.25 Rec'd Sent Approved Denied Returned FOIA (b)(6) OCT11/1007"
}