{
  "anumber": "A41490559",
  "id": "A41490559_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41490559_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES EPARTMENT OF JUSTICE Screened by NARA. 8/4/2023 Form Approved NOV 16 1983 Immigration and Naturalization Service FOIA (b)(6) OMB NO. 43- PETMONT Fee Stamp PLEASE NOTE CL/ Y STAT F YOU ARE THE PETITIONER ALIE.. RELATIVE FOR AND YOUR RELATIVE ISSUANCE OF IS THE IMMIGRANT VISA BENEFICIARY SLB CHECKED 308758 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write In This Space 3. Names, birthdates and countries of birth of SHAH MAGANLAL K. beneficiary's children: 4. Other names used: (including maiden name if married) 15000 SAROJ-Oct.7,46 IN NONE 5. Country of beneficiary's birth 6. Date of beneficiary's birth (Month day, year) INDIA 12-07-1907 FOIA (b)(6) 7 My name is (Last, in CARS) (First) (Middle) 8. My phone number is: FOIA (b)(6) FOIA (b)(6) 9. Other names used: (including maiden name if married woman) 10 Relationship of beneficiary to myselly NONE FATHER 11. I was born: (Month (Dav) (Year) in: (Town or city) (State or Province) (Country) FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) 13. If you are a lawful permanent resident alien of the United States give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A- 14. Beneficiary's marital status: 15. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is Married Widowed Divorced Single for your spouse) SAVITABEN, 3-31-1928, IND 16. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) SHAH, SAVITABEN, AT & POST - MAHUWA , DIST- SURAT ST. GUJARAT; INDIA ZIP 346-250 17. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage N/A b. Names of my prior spouses c. Names of spouse's prior spouses 18. Has this beneficiary ever been in the U.S.? YES NO 19. Are beneficiary and petitioner related by adoption? YES NO (CONTINUE WITH ITEM 20 ON REVERSE)- OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by FOIA (b)(6 in are true and correct. Signature of petitioner (See Instruction No. 5) Subscribed and sworn to (affirmed) before me this 13th day of 133 (SEAL) My commission expires houma Unlyn at. chicogo, Illinois CONTACT (SIGNATURE OF OFFICER ADMINISTERING OATH) (TITLE) IREPRESENTATIVE SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. 20A 2 1883 DE (SIGNATURE) (ADDRESS) (DATE) RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM -130 (Rev. 10-26-79) N 11-1-83 11-5-33"
}