{
	"anumber": "A41448083",
	"id": "A41448083_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41448083_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit, NARA-0123456789"
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1991, 2023, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/10/2023 Anfac Hotel Los Angeles International Airport AFFIDAVIT RE: Employment in behalf of SALVADOR ZELAYA City of Los Angeles - County of Los Angeles - State of California I, Kathy Molina, hereby state and declare: I am the Assistant Personnel Director of Amfac Hotel-LAX, located at 8601 Lincoln Boulevard, Los Angeles, California, 90045. Salvador Zelaya , whose complete address is 6370 W. 80th Place, Los Angeles, CA 90045, and whose Social Security number is FOIA (b) (6) , was hired on January 11, 1981 as a dishwasher and terminated 10/28/85 and rehired on 6/10/86 as a Second Cook. Salvador Zelaya , is still an employee of our company. Since 6/10/86 date of re- hire, he has not been laid off and continues to be employed with our company at the present time. I certify that the above information was taken directly from our employee records which are maintained at the following address and are available for inspection by the United States Immigration and Naturalization Service, if necessary. Address: Amfac Hotel - Los Angeles 8601 Lincoln Boulevard Los Angeles, California 90045 I swear, under penalty of perjury, that the foregoing is true and correct and that this affidavit was executed on this 5th day of APRIL , 1988 at the Amfac Hotel, Los Angeles. Kathleen Multina Affiant's complete legal signature State of California - County of Los Angeles Subscribed and sworn to before me this 5th day of april , 1988. OFFICIAL SEAL DIANE BAKER LE SAGE NOTARY PUBLIC CALIFORNIA Diani Baper Lo Sage LOS ANGELES COUNTY My Comm Expires Aug 9. 1991 Notary Public My commission expires August 9,1991 8601 Lincoln Blvd. Los Angeles, CA 90045 (213) 670 8111"
}
