{
  "anumber": "A41536355",
  "id": "A41536355_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41536355_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT"
    },
    "years": {
      "ms_years_nlp_v1": [
        1935,
        1931,
        2023,
        1922,
        1983,
        1944,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 AFFIDAVIT I, CHANDRI JITENDRAKUMAR KAR, born on 23rd December, 1922 at Khairpurmirs, Undivided India, currently residing at 7722 Lehigh Place, Westminster, California 92683, U.S.A. , aunt of MANOJ CHIMANLAL MAPARA of 775 Fairway Lane, Anaheim, California, 92807, U.S.A., do hereby state on oath that my friend LILAVATI CHIMANLAL MAPARA of Kadod, Dist: Surat, Gujarat State, India formerly residing at Bombay, India and was residing at Feeder Road, Bilimora, Gujarat State, India, gave birth to four children, the first three children at Kadod, Dist: Surat, Gujarat State, India and the fourth and the last child was born at FOIA (b)(6) as a result of her first and only marriage in May, 1931 with her husband CHIMANLAL VITHALDAS MAPARA, formerly residing at Bombay, India and currently residing at Bilimora, Gujarat State, India. Based on my personal and close family relationship with my friend, LILAVATI CHIMANLAL MAPARA and her entire family, I declare on oath, that my friend LILAVATI CHIMANLAL MAPARA is the mother of MANOJ CHIMANLAL MAPARA who is her third child born on September 16. 1944. I also declare on oath that my friend LILAVATI'S first child, a son named ARUN was born on September 26, 1935; her second child, a daughter named JAYAMATI was born on October 24 1936 and her fourth and the last child, a son named FOIA (b) )(6) as born on FOIA (b)(6) I further declare on oath that ARUN and FOIA (b)(6) are th brothers of MANOJ CHIMANLAL MAPARA and JAYAMATI is the sister of MANOJ CHIMANLAL MAPARA. I solemnly declare and affirm under the penalty of perjury that above particulars given by me in respect of this affidavit are true and correct to the best of my knowledge. Signature of the Deponent Was TO 1944 CA (0.74) (CHANDRI JITENDRAKUMAR KAR) (Individual) STATE OF CALIFORNIA TITLE INSURANCE AND TRUST COUNTY OF ORANGE SS. ATICOR COMPANY On NOVEMBER 30 195. State, personally appeared CHANDRA JITENARA before me, the undersigned, a Notary Public in and for said KAR PROVED To ME on THE OF SATISFACTORY BASIS to be the person EUMINIE known me whose name is executed the same. to the within instrument and acknowledged that subscribed SHE WITNESS my hand and official seal. NOTAHANS OFFICIAL PUBLIC Signature My comm. Date LINDNER CALIFORNIA with 18, 1983 (This area for official notarial seal) Original seen and returned. Certified a true and correct copy. on 11-30-84 Contact Representative, USINS"
}