{
	"anumber": "A41539277",
	"id": "A41539277_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539277_0010/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1921, 2023, 1967, 1927, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 7/31/2023 the FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION 50230-105 INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name THEO DORE First name Middle name KATHERINE 2. Other names used or by which known (If married woman, give maiden name) MRSRAMSEYTHEODORE. AB4LRAZZAD KuLSuM AHMA D(MAIDEN) 3. Full name in native alphabet (If Roman letters not used) MRS RAMSEY THEO DORE 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) (City or town) (Province) (Country) 11- - 8 1900 88 YRS DHIANA PUNJAB INDIA 7. Nationality 8. Sex 9. Marital status, INDIAN Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married times. 10. Occupation 11. Present address HOUSEND 3 OLD TELEGRAPHOMARTERS, RETIRED ELDERLYLADY . METHODIST MISSION COMPOUND SARAIPHOOS, WiDow, SUPFORTEDBYCHILDREN (CIVILINES) DELHI- 110054. INDIA 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) MR. RAMSEYTHEODORE (DECESEASED) 1967 Date and place of marriage YEAR 1921 DONOT REMEMBER DATE GURDAS PUR. PUNJAB. 13. Names, addresses, dates and places of birth of all children 1. SAKINA, FLORA RAZZAQID BORNAT BRiNDA BAN, UTTAR PARDES+1. INDIAON 22nd July1922 2 SUGHRA HENRIETTA RAZZAB(D)/GORNAT MUTHURA UTTAR PARDESH INDIA ON 15th NOV. 1927 3 SIKANDER HENRY RAZZAD(S))TWINS BORN AiMATHURA UTIAR PARDESH-INDIA. 15th NOV. 1927 4. ZOHRA VIRGINIA RAZZAO CD) BORN AT BRINDABAN. UTTAR PARDESH INDIAON AUGT. 30.1929 5. SYLEMAN HERBERT RAZZAQ.CS BORN AT BRiNDABAN UTJARPARDESH INDIA.ON APP116Th 1932 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States C/o HENRiETTA SAMUDRE (Q)HENRiETTA SAMUDRE (DAUGHTER) 7076 CULVER LANE, LouisvillE KENTUCKY. 40219 U.S.A. 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If if any) different from 16) HENRiETTA SAMUDRE (DAUGHTER) NOT APPLICABLE 7076, CULVER LANE LouisvillE Ky 40219.4.3. 18. Personal description HS ERROR 19. Marks of identification us ELL.R. MOLEINCENTREOP (a) Color of hair Black (c) Height LACK OffIGMENTATION 4s. ERROR CHIN. GREY 5 feet 2 inches SKIN is CHANGING (b) Color of eyes BROWN (d) Complexion BROWN 20. Purpose in going to the United States MYDAUGHTERWilLLOOKAFTERME,AS INSONEININDIA FOLOOKATTE ME 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? PERMANENTLY NEW YOR, J.f.K. DIDNOT Buy YET THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}
