{
  "anumber": "A41533737",
  "id": "A41533737_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41533737_0009/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE FOR OATH CEREMONY AT TEXAS STADIUM"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 ALIEN NUMBER: A41 533 737 SECTION NAME: Haryibhai naranble Sater 29 NOTICE FOR OATH CEREMONY AT TEXAS STADIUM PLEASE READ THIS NOTICE IN ITS ENTIRETY. IT CONTAINS NECESSARY INFORMATION REGARDING YOUR NATURALIZATION OATH CEREMONY, WHICH IS THE LARGEST EVER HELD IN THE STATE OF TEXAS. THIS NOTICE TELLS YOU WHAT TO DO AND WHERE TO GO ON THE DAY OF THIS HISTORIC EVENT. DO NOT LOSE THIS NOTICE!!!!! IT IS YOUR ADMISSION TICKET TO TEXAS STADIUM. If you lose it you may obtain a duplicate from our office until September 12, 1996. NO DUPLICATE NOTICES WILL BE ISSUED AFTER SEPTEMBER 12, 1996. IF YOU DO NOT HAVE THIS NOTICE ON THE DAY OF THE CEREMONY, DO NOT REPORT. WHERE TO REPORT: TEXAS STADIUM, IRVING TEXAS NATURALIZATION CANDIDATES GATE 8 GUESTS OF THE CANDIDATES - GATE 6 OR GATE 10 WHEN TO REPORT: TUESDAY, SEPTEMBER 17 1996 BY 10:00 A.M. VISITORS AND GUESTS: Guests will be seated in a separate area from the naturalization candidates. MAKE ARRANGEMENTS BEFORE THE CEREMONY WITH YOUR GUESTS WHERE YOU WILL MEET AFTER THE CEREMONY. LENGTH OF THE ENTIRE EVENT: Over 10,000 persons have been scheduled so it will take several hours to check each person in. Check in begins at 10:00 A.M. THE CEREMONY ITSELF IS SCHEDULED FOR 1:00 P.M. The entire event should be completed by approximately 2:30 P.M. WHAT TO BRING WITH YOU: This notice; your alien registration card OR police report and picture ID if you have lost your card; $5.00 for parking fee charged by Texas Stadium. Concession stands will be open. WHAT TO WEAR: Dresses for women. White shirts and ties for men. Remember that it may be rather warm on that date. The naturalization candidates will be seated in a shaded area. The guests will be in the sun so they may wish to bring some type of hat or umbrella to help block the sun. NATURALIZATION CERTIFICATES: The naturalization certificates will be distributed AFTER the conclusion of the ceremony. You will be directed by ushers to the table where you will receive your certificate. SEE THE SEVEN QUESTIONS ON ATTACHED FORM. THESE QUESTIONS SHOULD BE ANSWERED AND THE FORM SHOULD BE SIGNED ON THE DAY OF THE CEREMONY BEFORE YOU ARRIVE AT TEXAS STADIUM. IF YOU DO NOT HAVE THESE QUESTIONS ANSWERED IT WILL DELAY YOUR ADMISSION. FORM CR-265 (05/24/96)"
}