{
	"anumber": "A41553587",
	"id": "A41553587_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41553587_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2230 (English-Thai)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 OPTIONAL FORM 230 (English-Thai) (Rev. 6-82) Page 8 I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear this application have been made by me, including the answers to parts 33 through 42 inclusive, and are true and complete to the best of my kno and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to me public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United states relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means. 2 lu INTERNATIONAL A 5 2 UNIVERSITY 109 33 is 42 INTERNATIONAL noun I r a I JUGIOR iam with A2721 5266653 oy I understand all the foregoing statements, having asked for and obtained Miami an explanation on every point which was not clear to me. x 19dm si. (Signature of Applicant) The relationships claimed in items 12 and 13 verified by documentation submitted to consular officer except as noted: 12 13 American Embassy Consular Section 28 MAY 1987 Bangkok Metropolis Subscribed and sworn to before me this day of 19 at 1l Dennis (Consular Officer) ( W. thing"
}
