{
  "anumber": "A41539277",
  "id": "A41539277_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539277_0041/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 Cream Planted California Control Clinical Laboratory Control Clinical Laboratory Central Climical Laboratory Centrick Clinical Laboratory Cohnal Clinical Classic Clinical Laboratory Century Clinical Laboratory Contract Clinical Laboratory Country Clinical Control time Coursel clinical Laboratory Contract Clinical Laboratory Conal Clinical Liberatory Cannial Clinical Laboratory Country Clinical Country Clinical Laborately Central Clinical Central Clinical Colorado Central Climital Contrat Clinical Contral Clinical Laboratory Central Clinical Ledoxatory Central Clinical Laboratory Control Clinical Liberary Central Clinical event Clinical GRAMS: TESTLAB Central Climical Conner Clinical Central Clinical PHONES: 312046, 311329, 311638 Central Clinical Laterality Coloramy Central Clinical Laboratory Claimant Minical Cretent Clinical Caboratory Control Clinical Dr.S.K.LAL'S Good Queen California Cannot Clinical Laboratory Control Illinical Cinnal Clinical Laboratory Cantral Clinical Control Clinical Created Clinical Laboratory Coursel Clinical Control Climit Central Clinical Coberatory Clinical Laboretony Central Clinical Laboratory Conner Clinical Liberarity Central Clinical Created Climical Badocaroly Central Clinical Laboratory Gratest Laboretony Central Cliant Clinical Central Clinical Libertary Contral Clinical Conner Clinical Cannot Clinical Literatory Control Clinical Laboratory Reunal Central Clinical Cabasaway Clinical Central Clinical Came Plintert every Clinical Laboratory Centre Coural Clinical Central Control Clinical Laboratory Central Efficient Laboratory Central Laboratory Minical Laboratory Conner Clinical Canner Climital Canad Clinicel Created Clinical Laboratory Central Clinical Redeteraty Contract Clinical Labording Central Clinical Laboratory Clinical Laboratory Central Clinical Laboratory Country Clinical Central Minical Liberatory Central Clinical Laboratory Control Clinical Laboratory 'ESKAY HOUSE 54 HANUMAN ROAD, NEW DELHI-110 Central Clinical Control Charget Laboratory Pound Minical Beneral Clinical Central Elinical Control Clinical Central Clinical Central Clinical BHAYANA PLOYCLINIC Central Clinical Conner Liberature Contract Clinic Laboratory Control Charled Control Clinical J-5, GREEN PARK (MAIN) Country Clinical Central Clinical Celebratory Central Clinical Company Extension Countral Clinical Laboratory Control Clinical Centent Clinical Libers NEW DELHI-110-016 Central Citizen Central Clinical S-565 Original Control twind dad Lobasarary Vandana lal Laboratory June Center Clinical TEL: 661095, 669562 Council Clinical 8 Costal Climited GREATER KAILASH Crestral Central Clinical Literatary Control Clinical Cantral Clinical Clinical Laboratory Country Central Cliated Clinical California Control Central Clinical Liberarily Comel Central Clintent Central Cristral (PART-II Clinical Laboratory Central DR. ARVIND LAL DR. VANDANA LAL Laborators DR. O.N. SAIGAL Climical Counsel D.I.C.R.F. Control Clinical Central Clinical NEW DELHI-110048 Coated Laboratory Clinical H Laboratory Clinical M.B.B.S; D.C.P. (PATH) M.B.B.S;M.D. (PATH) M.B.B.S;B.Sc. (PATH) A-40, SWASTHYA VIHAR Control Clinical Content Clinical Control Loboratory Control Relatarity Central Central Clinical Camel Climical TEL: 6439364 Libertalyty Contral Clinical Center Clinical Laboratory Cannot Clinical Clinical Caloratory Control Clinical Control DELHI-110 092 TEL 2201761 Central Blinded Control Clinted Laboratory Control Climical Reberatory Central Clinical Central Clinical Laboratory Cantral Clinical Classed Control Clinical Central Clinical Loboratory Control Clinical Laboratory Cannot Minical Coattal Climate Control Climical Central Clinical Calaway Connor Clinical 88 Central Clinical Lelaterary Central Climital Central Climical Carnal Clinical Loboratory Contral Colorators Central Cherry Education Canoral Climical Clinical Sentent Clinical Center Children Liberary Clinical Control Clinical Lobotality Care Clinical Control Charged Created Contral Clinical Leloyamin Camel Climan Castal Chairant Council Clinical THEODORE [Q-503328] Central Climital 7325 Caloramy Control Birthel Control Primes Cannot Climical NAME Clinicel MRS KATHERINE LAB. NO Control Clinical Control Clinical Lebovatory Central Eliminat Central Central Clisicil Caboratory Cested Clinical Central Clinical Liberatory Central Clinical Laboratory Control Clinical Central Elinical Beatral Cented Animal Country Clinical Country Clinical Dr. Harish Khosla FRCP Control PD Planet Laborating Central Climical Loborancy Conner Country Clinical REFERRED BY Central ACCT. STATUS dound Clinical Comi Clinical Climical Liberature Central Clinical Laboroung Come Olimical Control Clinical Central Clinical Reboratory Clinical Columbia and charged Country Onest Clinical fubrier 15/11/88 Central Climical Cannot Clinicel Central Class Central Alimeat Liberpracy Central etimeal Referring Contract Clinical Cameral Central DATE Clinical Central Clinical Central Elinical Laboratory Canel Chancel Liberetary Country Clinical Country Canada Climinal Leboratory Clinical Courrel Claimant Laboratory Control Clinical Leboratory Country Clinical Cannot Clinical Covered Clinical Contral Clinical Central Clinical Laboratory Connel Clinical Cantast Clinical Libertapply Liberatory Canval Climital Libotately Revisel Cincel Libertary Cannal Criminal Countries Climical Bennel Clinical Based Clinical Laboratory Contral Clinical Existency Control Clinical Contral Clinical Liberatory Coursel Climatel Asnical Contrat Clinical Liberatory Creation Clinical Climical Center Clinical Liberetary Central Clinical Control Clinical Central Clinical Sincerel Control Abirat Conner Central Clinical Liberary Central Climical Claimal Coboramay Central Conner Clinical Literetary Minist Clinical Test Name Chinical Central Central Clinical Control Carted Name Central Result Central Units Ref. Centert Clinical Count Central Range Queen SEROLOGY & IMMUNOLOGY V.D.R.L. NON REACTIVE RADIO ENZYME IMMUNO ASSAY Antibody To HIV-I NON REACTIVE"
}