{
  "anumber": "A41537598",
  "id": "A41537598_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41537598_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        1989,
        1941,
        2023,
        1904
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NO I WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# APPROVED INS DIRECTOR Stl 037738 G-28 of # Section of Law: JAN 18 1989 201 (b) spouse 203(a)(1) 201 (b) child 203(a)(2) Ritea Petition was filed on 10/6/88 (priority date) Personal Interview Previously Forwarded 201 (b) parent 203(a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 33(a)(5) ILTIN 3425 Field Investigations I-485 Simultaneously AM CON: Bomba 204 (a)(2)(A) Resolved 204 (h) Resolved REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) PATEL GUVANBHAI KHUSHALBHAI 2. Address (Number and Street) (Apartment Number) JAGIRDAR St (Town or City) (State/Country) (ZIP/Postal Code) ENA TAPALSANA SURAT GOJARAT INDIA 3. Place of Birth (Town or City) (State/Country) 394310 ENA GUJARAT INDIA 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single K 9/19/1904 Female Widowed Divorced 7. Other Names Used (including maiden name) 8. Date and Place of Present Marriage (if married) 02/10/47 BALESHVER INDIA 9. Social Security number 10. Alien Registration Number (if any) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended GANGABEN 02/20/1941 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire as shown on Form I-94 or I-95 15. Name and address of present employer (if any) Date this employment began (Month/Day/Year) 16. Has your relative ever been under immigration proceedings? Yes No Where - When Exclusion Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMIT TEDA RELOCATED COMPLETED Rec'd approved Denied Returned Form I-130 (Rev. 02-28-87) N OCT 06 1988"
}