{
  "anumber": "A41536355",
  "id": "A41536355_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41536355_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 230 ( (English) ( (Rev. 6-82), 230"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1979,
        1958,
        1982,
        1981,
        1987,
        1973,
        1980,
        2023,
        1922,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 OPTIONAL FORM 230 (English) (Rev. 6-82) Page 2 24. Personal financial resources (a) Cash Rs. 5000/F (c) Real estate (value) Residential FLAT in BONBAY Rs 10/005 less (b) Bank deposits (d) Other (describe) Fixed Deposits in Public companies Bl.24 Shares &-Debentance Bondo 0.25 Natral Samp 0.30 25. Father's name, address, date and place of birth (If deceased, SO state giving year of death) be MAPARA ViTHALDAS NAGINDAS (DECBASED in 1958) 26. Mother's maiden name, address, date and place of birth (If deceased, SO state giving year of death) SHAH C H. CHHA BEN LALLISBHAI ( DECEASED in 1981) 27. Name, address, and relationship of next of kin in home country (If neither parent is living) NoT APPLICABLE 28. List all places of residence for 6 months or more since your 16th birthday City cr town Province Country Dates (From-To) Calling or occupation BARODA GUJARAT INDIA 1922 to 1924 StUDENT BOYBAY HAHARA SHIRA INDIA 1924 to 1979 STUDENT & cordange BILINORS GYFAROT INDIA high date. - Misitor Retired AHgSICAAN PHYSICSAN 29. List all organizations you are now or have been a member of or affiliated with since your 16th birthday (Include professional, vocational, social, and political organizations) Type of membership and Name and address Dates (From-To) office held, if any NONE 30. List all languages, including your own, that you can speak, read, and write Language Speak Read Write GUJARATI V ENGLISH 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) TOURIST VISAS 1973, 1980-81, 1982, 1985, 1987, 32. Have you ever been treated in a hospital, institution, or elsewhere for a mental disorder, drug addiction, or Yes No alcoholism? (If answer is Yes, explain) 33. Have you ever been arrested, convicted, or confined in a prison, or have you ever been placed in a poorhouse Yes No or other charitable institution? (If answer is Yes, explain) 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency, or Yes No similar action? (If answer is Yes, explain) 35. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether Yes No you applied for a nonimmigrant or.an immigrant visa, and whether the visa was issued or refused) TOURIST VISA BOMBAY INDIA / 1973, 1980, 1982, 1984, VISA VISAS ISSUED 36. Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) Yes No 37. Have you ever registered with a draft board under United States Selective Service Laws? Yes No (If answer is Yes, explain) 38. Have you ever applied for relief from training and service in the United States Armed Forces or departed from Yes No or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) 39. Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States Yes No within 2 years after arrival in Canada, Mexico, or such adjacent island? (If answer is Yes, give the name of transportation company by which you entered or intend to enter Canada, Mexico. or such island)"
}