{
  "anumber": "A41537598",
  "id": "A41537598_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41537598_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-41537598"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 OPTIONAL FORM 155A, (Rev. 6-056 DEPT. OF STATE NGN 7840-01-124-7761 50155-203 IV-41537598 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN TME UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN PATEL, GOVANBHAI KHUSHALBHAI ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no of arrival) WAIVED UNDER SECTION U. S. IMMIGRATION TWA T53 212(e) 212(h) 020-BOS. 22 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH JUN 13 1989 ENA, INDIA 19SFP04 ADMITTED IR-S CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ENA, IND INDIAN (class) MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME UNTIL M S W D SEP BHIKHIBEN KHUSHALBHAI FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES FOIA (b)(6) HANNIBAL, MO 63401 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED FFF FARMER F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL IR5 FOREIGN STATE/OTHER AREA LIMITATION AT BOMBAY INDIA IMMIGRANT VISA NO. Thousand BMB8904501201 41537598 forthomas K Huffaker ISSUED ON (Day) (Month) (Year) Consulter Officer of the United States of America 19MAY89 U. S. Vice Consult THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month (Year) 15SEP89 PASSPORT NO. F 207371 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED ATTACHED TO SERVICE BY UNITED AMERICA ON Tariff No. 21 Fee Paid $75 EXPIRES Local Cy, Equiv. IV- 41537598 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. PROCESSING FOR I-553, CEMPORARY EVIDENCE OF ADMISSION POP PURMANENT RESIDENCE 76318 METOPS SEP 1& 1989 *U.S. GOVERNMENT PRINTING OFFICE: 1986-152-362"
}