{
  "anumber": "A41536355",
  "id": "A41536355_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41536355_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 TO THE SECRETARY OF STATE: The petition was filed on 11-30-84 REMARKS PERSONAL INTERVIEW CONDUCTED The petition is approved for status under U.S. APPROVED INS section: DOCUMENT CHECK ONLY WESTERN ADJ. CENTER FIELD INVESTIGATION COMPLETED SPOUSE, DATE 201 (b) CHILD 203-(a) (2) OF MAR 7 1985 APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD 203 (a) (1) 203 (a) (5) DISTRICT WAS/LOS/#183 REMARKS (Continued) (PETITIONER IS NOT TO WRITE ABOVE THIS INE) 20. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in (BOMBAY INDIA (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Natural ization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 21 My residence in the United States is: (C/O. if appropriate) (Apt. No.) (Number and Street) (Town or city) (State) (ZIP Code) 775 FAIRWAY LANE, ANAHEIM HILLS, CAL 92807 22. My address abroad (if any) is: (Number and street) (Town or city) (Province) (Country) NONE 23. Last address at which I and my spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) 92807 A NAHEIM HILLS, CAL, I.J.S.A, 775 FAIRWAY LANE JUN 79 NOW 24. Address in the United States where beneficiary will reside (City) (State) 775 FAIRWAY LANE, ANAHEIM HILLS, CAL. 92807 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) c/o DR. A.C. MAPARA,FEEDER ROAD, BILIMORA, W.RLY. GUJARAT STATE INDIA 26. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) c/o DR. A.C.MAPARAFEEDER ROAD, BILIMORA, W.RLY GUJARAT STATE, INDIA (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) 27. If this petition is for a child, (a). is the child married? (b). is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state. NOT APPLICABLE 28. If this petition is for a brother or sister, are both your parents the same as the alien's parents? NOT APPLICABLE If not, submit a separate statement giving full details as to parentage, dates of marriage of parents. and the number of previous marriages of each parent. 29. If separate petitions are also being submitted for other relatives. give names of each and relationship to petitioner. NONE 30. Have you ever filed a petition for this alien before? NO If so, give place and date of filing and result. 31. If beneficiary is in the United States. give the following information concerning beneficiary (a) Last arrived in U.S. as (b) Date beneficiary's stay expired or will (c) Beneficiary's File number (Visitor, student, exchange alien, crewman, stowaway, etc.) on expire as shown on his Form I-94 or I-95. if any (Month) (Day) (Year) A- (Month) (Day) (Year) (d) Name and address of present employer (e) Date alien began this employment"
}