{
	"anumber": "A41553587",
	"id": "A41553587_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41553587_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-41553587"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 OPTIONAL FORM 155A, (Rev. 6-85) DEPT. OF STATE NSN 7540-01-126-7761 50155-203 IV-41553587 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN AKA: JARUGITPITAYAKUL, CHAREON THE UNITED STATES AKA: SAE LAO, YEE CHONG OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN CHARUKIJPHITTHAYAKUL, CHAROEN ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S. IMMIGRATION 130 UA806 212(e) 212(h) 212(g) 212(i) MAY 3.1.1987 CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH ADMITTED 112.5 TAE CHEW, CHINA 02JAN14 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY UNTIL BANGKOK, THAILAND THAI MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S w D SEP MUAY TENY LAO PAI FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED 333 S. ARROYO DRIVE #D STATES SAN GABRIEL, CA 91776 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED MERCHANT SLS F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT BANGKOK, THAILAND CHINA Dennis W. hung IMMIGRANT VISA NO. BNK 862 1200 101 DENNIS W. MERZ ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 28MAY87 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 24SEP87 PASSPORT NO. CO76561 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO BY UNITED STATES OF ON Tariff No. 21 Fee Paid $X5X$25 BAHT. 650.00 DWM: VP EXPIRES Local Cy, Equiv. IV- 41553587 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. *U.S. GOVERNMENT PRINTING OFFICE: 1986-152-562"
}
