{
  "anumber": "A41537196",
  "id": "A41537196_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41537196_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 7/31/2023 OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Relative DO NOT WRITE IN THIS BLOCK Ca Action Stamp Fee Stamp INS DISTRICT DIRECTOR APPROVED A# G-28 or Volag# APR 24 1988 Section of Law: Petition was filed on 11/05/86 (prjority date) 201 (b) spouse 203 (a)(1) 35.00 201 (b) child 203 (a)(2) Personal Interview FMP Previously Forwarded 201 (b) parent HEL 11/03/8 203 (a)(4) 203 (a)(5) 2155 Document Check Stateside Criteria Field Investigations I-485 Simontaneously 533*78 AM CON: BOMBAY 11 below REMARKS: 2. Affidamity 3 Dres from Indian Court that records met available A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) DESAI REKHA MAHENDRA DESAI MOHANLAL DAYALJI 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 446 S. ST. ANDREWS PL 8 AVADHUT SOCIETY - TITHAL ROAD (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) LOS ANGELES CA. 90020 VALSAD GUJARAT - FINDIA 39600 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) SURAT GUJARAT - INDIA PARUJAN OQJJARAT - INDIA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Single 8-24-38 7-7-1912 3 Female Widowed Divorced Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) REKHA - REKHABEN MOHANBHAI CE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 2-15-1963 BILIMORA GUJARAT - INDIA - N/A 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)( (6) FOIA (b)(6 N / A - - N / A - 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended NONE NONE NONE NONE - N / A - - N/A - 13. If you are a U.S. FOIA (b)(6) 13. Has your relative ever been in the U.S.? My citizenship was Yes No Birth in the 14. If your relative is currently in the U.S., complete the following: Naturalizatic He or she last arrived as a (visitor, student. exchange alien, crewman, Give number stowaway. temporary worker, without inspection etc.) NONE - N/A - Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No If \"Yes\", give number of certificate date and place it was issued Date authorized stay expired, or will expire as shown on Form I-94 or I-95 12134651 6-20-85 Los ANGELES NONE - -N/A - - 15. Name and address of present employer (if any) 14. If you are a lawful permanent resident alien, complete the following. NONE - N/A - Date and place of admission for, or adjustment to. lawful permanent Date this employment began (month/day/year) residence NONE NONE INITIAL RECEIPT RESUBMITTED RELOCATED 20 COMPLETED DEC. Q JUL 06 1987 Rec'd Sent Approved Denied Returned NOV 191986 Form I-130 (Rev. 06-23-86) Y MAR. 03"
}