{
  "anumber": "A41532476",
  "id": "A41532476_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41532476_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 2230 ( (English) ( (Rev. 6-82), OPTIONAL FORM 2230 ( (English) ( (Rev. 6-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1863,
        1935,
        2023,
        1977,
        1872,
        1978,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 OPTIONAL FORM 230 (English) (Rev. 6-82) Page 2 24. Personal financial resources (a) Cash NII, (c) Real estate (value) NIL (b) Bank deposits NIL (d) Other (describe) NIL 25. Father's name, address, date and place of birth (If deceased, so state giving year of. death) DESAI DAHYABHAI KOOVERJI BORN AT ABERAM ON SEPTEMBER 11TH, 1863. EXPIRED ON DECEMBER 12TH, 1935. 26. Mother's maiden name, address, date and place of birth (If deceased so state giving year of death). DESAI JIJIBEN DURLABHBHAI BORN AT ABERMA ON JULY 27TH, 1872. EXPIRED ON MAY 15TH, 1959. 27. Name, address, and relationship of next of kin in home country (If neither parent is living) DESAI SHANTABEN HARIBHAI (WIFE) 33. ATTIL SOCTETV.VAGHOTTT DOAD num GUJARAT. INDIA. MAY. SEP.38 STUDENT. ABRAMA GUJARAT. INDIA. OCT.38 NOV.42 SERVICE. NAVSARI. GUJARAT. INDIA. NOV.42 OCT.45 SERVICE. SAWAIMADHOPUR NAVSARI. GUJARAT. INDIA. OCT.45 SEP.47 SERVICE. NARDANA. MAHARASHTRA. INDIA. SEPT.47 NOV.52 SERVICE. MAROLI. GUJARAT. INDIA. NOV.52 JUN.55 SERVICE. SAPHALA. MAHARASHTRA. INDIA. JUN.55 JUN.59 SERVICE. MAHARASHTRA. INDIA. JUN.59 SEP.69 SERVICE. AMALNER. BILLIMORA. GUJARAT. INDIA. SEP.69 APR.71 SERVICE. MAHARASHTRA. INDIA. APR.71 MAY. 72 SERVICE. NANDURBAR. BARODA. GUJARAT. INDIA. MAY.72 TILL NOW. RETIRED. 1*J never, so state) JUNE 20TH,1977 TO JANUARY 3RD, 1978, NON IMMIGRANT VISA. 32. Have you ever been treated in a hospital, institution, or elsewhere for a mental disorder, drug addiction, or Yes No alcoholism? (If answer is Yes, explain) 33. Have you ever been arrested, convicted, or confined in a prison, or have you ever been placed in a poorhouse Yes No or other charitable institution? (If answer is Yes, explain) 34. Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency, or Yes No similar action? (If answer is Yes, explain) 35. Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether Yes No you applied for a nonimmigrant or an immigrant visa, and whether the visa was issued or refused) BOMBAY, INDIA IN JUNE, 1977, NON IMMIGRANT VISA, VISA WAS ISSUED. 36. Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) Yes No 37. Have you ever registered with a draft board under United States Selective Service Laws? Yes No (If answer is Yes, explain) 38. Have you ever applied for relief from training and service in the United States Armed Forces or departed from Yes No or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) 39. Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States Yes No within 2 years after arrival in Canada, Mexico, or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico, or such island)"
}