{
	"anumber": "A41537419",
	"id": "A41537419_0015",
	"page_index": 15,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41537419_0015/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "NO. 190 GEORGE E. COLE GENERAL AFFIDAVIT Screened ADYNARA 8/2/2023 LEGAL FORMS State of linois SS. County of Cook Sharadkumar R. Shah of the City of Chicago , County of Cook and State of Illinois , being duly sworn, deposes and says that he is a naturalized citizen of the United States, with U.S. District Court Number # 1205 8644 and he was born in India on September 5, l957 and his social security number is FOIA (b)(6) and he lives at 6248 B North Hoyne Avenue, Chicago and he was present in Bombay, India on May 13, 1948 when Suman T. Desai married Prabha D. Desai on that date and that he took part in the Hindu Religious ceaemony which united Suman and Prabha Desai as man and wife in the eyes of God and the State. ShaRADKUMAR R. SHAN also affirms and swears that he is not a blood relative of the Desai famlly and that he was a friend of the groom at the date of the marriage. Sharadkumar R. Shah also affirms that he is aware of the severe penalties for perjury or suborning purjury in regards to affidavits used by and attested to by the United States Immigration Service or the Justice Department and of And further this affiant says not. Shared kumar Rsher (1) Sharadkumar R. Shah 30 Subscribed and sworn to before me this day of \"OFFICIAL SEAL\" Edward A. Wasnak, Jr. March 88 Notary Public, State of Illinois Cock County. Illinois (2) Ected My Commission Expires Feb. 18. 1989 Notary Public (1) This line is for signature of Affiant. (2) These two lines are for signature and title of officer administering oath."
}
