{
  "anumber": "A41538268",
  "id": "A41538268_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41538268_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT IN PLACE OF MARRIAGE CERTIFICATE, 35164"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1930
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/14/2023 7RS STEP PINDIAN RIGH RIGH MORE SURT 500 look RRA and SEVENRUPEES HRH SEVENRUPEES S 35164 Date 19-10-1988 ALI KHAN S/o. vijaya Kumar % STAMP VENDER S/o. for Whom Sri/Sent Smit. Sr. jiveras Item anth Mustly lal Bhai Ranaich Jive R/o ras panaich L. No. 54.84, Ren. No. 13,85 HOUSING BOARD, GROHAKALPA HYA SHINAM NOTARY PARSA. Begupet. AFFIDAVIT IN PLACE OF MARRIAGE CERTIFICATE REVENUE DISTRICT OF HYDERABAD I, Mr. Kanthilal Jiveraj Parikh s/o late Jiveraj Bhai Parikh aged 81 years, Residing at H.No. 1-11-222/4, Begumpet, Hyde- SITI, KACHIGUDA rabad-16, A.P., India, do hereby solemnly and sincerely declare as follows : - My Cousin namely Mr. Ramanlal Amritlal Kadakia got married to is RAMTIBEN \". The details of the marriage are : - 1. Name of the Bride : RAMTIBEN. 2. Name of the Bride's mother : MAHAIAKSHMI MODY (Late) 3. Name of the Bride's father : LALLUBHAI MODY (Late) 4. Name of the Bridegroom : RAMANIAL AMRITIAL KADAKIA. 5. Name of the Bridegroom's mother : DIWALI BEN (Late) ARSA 6. Name of the Bridegroom's father : AMRITIAL MOTICHAND KADAKIA (late) 7. Date & place of marriage : 30th October, 1930 BALASINOR, GUJARATH STATE, INDIA. NOTE 8. Name of the person performing FIFTYPAISE NOTODIO the marriage : Pandit. BHANU SHANKER. 9. Custom under which the marriage was performed : HINDU CUSTOM. The above declaration is true and correct to the best of my knowledge and belief. Sworn and signed before me on this Kanfilel grain October 19, 1988. Deponent. K.J.PARIKH NOTARY B. PAPAIAH PARSA 3-1-317/1, Nimboli Adda, Hyd-27. 19/10/88 Stamped in the B.Sc. LL.B. Register OR Appointed by Govt. of A.P. Page No 29 INDIA"
}