{
	"anumber": "A41553587",
	"id": "A41553587_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41553587_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 230 (English-Thai) Rev. 6/82, OPTIONAL FORM 230"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1954, 1937, 1974, 1948, 2023, 1964, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 OPTIONAL FORM 230 (English Thai) /Rev. 6-82) Page 2 OPTIONAL FORM 230 (English-Thai) (Rev. 6-82) Page 3 13. Names, addresses, dates and places of birth of all children. EVERY ONES BORN IN THAILAND to & nos THINO 28. List all places of residence for 6 months or more since your sixteenth birthday. An FBI name check has been conducted. 23-9-1940 111/5 T. SANSUK CHONBURI I 6 16 Nalwood 1. MR. BOONCHAI CHARUKIJ 2. MR. BUNPOT 16-5-1946 333 S. ARREYO DR # D SAN GABRILL CA. 91-16 City or town Province Country Dates (From-To) Calling or occupation 3. MISS. PAWINEG 10-1-1947 you 1 (ann-fis) 4. MRS BENJAMA 19-6-1948 5. FOIA (b)(6 1954-1974 6 soi JiNDATAWiN BANGKOK THAiLAND. BEFORE 1974 ) MERCHANT 14. Person named in 12 and 13 who will accompany or follow me to 15. Final address in the United States the United States. 210 NAEEAG BANGKOK THAiLAND 1964-1974 ) MERCHANT 12 was 13 was 333 S.ARREYO DR # D GABRILL 1/187 T. SOMPANTAWONG BANGKOK TOAILAND19141987 ) MERCHANT NO CA. 91776 29. List all organizations you are now or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) 16. Person you intend to join (Give name, address and relationship, 17. Name and address of sponsoring person or organization 4 name 16 1 any) (If different from 16) and I 20ia A ( vonso, to HAVE had Name and address Dates (From-To) Type of membership and office held, if any MRS. BENJAMA SULLIVANJ DAUGHTER 80 a inou 1 (anna 333 S. ARREYO DR#DSAN GABRILL CA-91776 NO NO 18. Personal description 19. Marks of identification (a) Color of hair THIS (c) Height annuminulara NONE BLACK 5 4 K feet we inches HD 20. Purpose in going to the United States 30. List all languages, including your own, that you can speak, read and write. dd do 4 (d) Complexion ANDINO PRODUCTION I 0716 (b) Color of eyes an ? BLACK YELLOW STAY WITH FAMILY Language MY Speak wallow (RUNN 36 waln) Read anula (nann RG wold) 2 Write (GUTA a wali) 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? CHINESE VERY GOOD YES. 1 WRITE) SPEAK GOOD (Read ox THAI VERY GOOD YES ( ) COOD 4 GOOL ENGLISH VERG LITTLE FOR EVER NO ) NO LITTER SANFRANCISCO YES 31. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) 24. 8 Insurance aano Personal financial resources 20,0,000 B ( (c) Real estate (value) NO (a) Cash NHAA 32. Have you ever been treated in a hospital, institution or elsewhere for a mental disorder, drug addiction or Yes No (b) Bank deposits 200,000 (d) Other (describe) alcoholism? (If answer is Yes, explain) LAE laines a 25. Father's name, address, date and place of birth (If deceased, SO state giving year of death) 4 do so nou NUMBER) PAST AWAY 1937 MR. LAO PAI TANG 26. Mother's maiden name, address, date and place of birth (If deceased, so state giving year of death) to na in Liña ) 33. Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poor-house Yes No or other charitable institution? (If answer is Yes, explain) PAST AWAY 1932 MRS SHER. MUAY TENY LAE laing noa 27. Name, address and relationship of next of kin in home country (If neither parent is living) HAND invanad () NO"
}
