{
	"anumber": "A41539277",
	"id": "A41539277_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539277_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "THE INDIAN WITNESS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 THE INDIAN WITNESS REST Dr. and Mrs. Hanson of Lucknew have received word from Minneapolis, Minnesota 4:30 and 7: if Church which indicates considerable improvement Malay, Dut in the condition of their son, Stanley. The and Siame a to India internal bleeding has stopped, but the While th their old full authori ct. They experts are considerably puzzled by the over VOU case as it presents some unique aspects. al, Berar, It still appears that the crucial operation are prepare re he has upon the brain will have to be undergone. can broade Timothy The letter which brought the above some- the Depart what encouraging news conveyed the sad proximatel it Confer- news of the deaths of Fred Hanson, Dr. paration h Hanson's youngest brother and of an aunt. Broadcasti members The continued prayers of the readers of the casting Cor is and not \"Witness\" would be very much appreciated. grams have commercial ported in In the Indian Witness, dated the 11th 'NBC 3 the last December, 1947, we had announced that Mr. In gener appoint- r Desig. Theodore Abdul Razzaq of Delhi changed fol? VS: ] his name to Mr. Rammey l'he dore. Mr. editorial Theodop wants it to be announced that his per cent: that the wife and children will be known by the per cent. e history following new names: Mrs. Catherine Dissemin was held Theodore Instead of Kalasum Razzaq, Vir wave tra al from Henrita Theodore instead of Saghira ranging f 1. Leroy Henrita Razzaq, Virginia Theodore instead power. T tspeaker of Zohra Virginia Razzaq, Henry Theodore and the otl ) \"Meet instead of Sikandar Henry Razzaq and on the Eas Herbert Theodore instead of Suleman Governmen Bareilly Herbert Razzaq. wave relay d thanks In an air letter written on January Mur 1. I for their Mrs. E Asirvatham writes that after through at 1, on the Christmas day Dr. Asirvatham and their casters of & Lilian eldest daughter, Vasanti, attended student in Great B Conference in Kansas. The readers of the Followin essages 1 helped Witness would remember that Dr. Asir- gram rela vatham who was at Lucknow some years 11,84 kil f Christ ago and later became Head of Political audible in Science Department in Madras University 2:30 p.m harbagh ica with went to U. S. A. as an Exchange Professor. 2:45 p.n urlough, Mrs. Asirvatham and their three daughters, Vasanti, Premi and Padmani followed him 3:00 p.n id crowd a year after. Dr. Asirvatham is now on the 3:25 p.n rty send rie took permanent staff of the Boston University 3:30 p.n and be and Mrs. Asirvatham have been 3:45 p.n d Mrs. Parish. taking keen interest in Church and social Cassels's activities in the U. S. A. Their daughter, 4:00 p.n Vasanti, will complete her B. A., in June Sunday in lish Literature, after which she will Monday"
}
