{
  "anumber": "A41536355",
  "id": "A41536355_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41536355_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INDIA, 5RS"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1921,
        1935,
        1931,
        2023,
        1944,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 5RS PINDIAN ENTER SET C STORE STOP FIVE RUPEES FIVE RUPEES e49.84 1.00 22121 622 set naihin AFFIDAVIT I, RAMANLAL SUNDERLAL PARIKH, born in November 1921 at Kadod, Dist: Surat, Gujarat State, India, currently residing at 181, Machhlimar Colony, Versova Road, Andheri (West) BOMBAY: 400 061, India, uncle of Manoj Chimanlal Mapara of 200 W. Colarado, Glendale, California 91204, U.S.A., do hereby state on oath that my sister, LILAVATI CHIMANLAL MAPARA of Kadod, Dist: Surat, Gujarat State, India, formely residing at Bombay, India and currently residing at Feeder Road Bilimora, Gujarat State, India, gave birth to four children, the first three children at Kadod, Dist: Surat, Gujarat State. India and the fourth and the last child was born at FOIA (b)(6) as a result of her first and only marriage in may, 1931 with her husband Chimanlal Vithaldas Mapara, foremly residing at Bombay, India and currently residing at Bilimora, Gujarat State, India. Based on my personal and close family relationship with my sister LILAVATI CHIMANLAL MAPARA and her entire family, I declare on oath that my sister Lilavati Chimanlal Mapara is the mother of my /third nephew Manoj Chimanlal Mapara who is her child born on September 16,1944. I also declare on oath that my sister Lilavati's first child, daughter named Jayamati was born on October 24, 1936 and her forth and a son named Arun was born on September 26,1935; her second child, a and the last child, a son named was born on FOIA (b)(6) FOIA (b)(6) I further declare on oath that Arun and FOIA (b)(6) are the brothers of Manoj Chimanlal Mapara and Jayamgti is the sister of Manoj Chimanlal Mapara. ( P.T.O.) ) Original Certified Contact"
}