{
  "anumber": "A41553587",
  "id": "A41553587_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41553587_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 230 (English-Thai) (Rev. 6-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 OPTIONAL FORM 230 (English-Thai) (Rev. 6-82) Page 7 OPTIONAL FORM 230 (English-Thai) (Rev. 6-82) Page 6 iuian and 42. The following documents are submitted in support of this application. molusession 2 1 the Institution A Passport Evidence of own assets Birth certificate Affidavit of support WoT# AlEm 2 1 A Police certificate (s) Offer of employment m NBME mn I HAZ mn II ii Marriage certificate WHITH Medical record (s) Death certificate Photographs manino 5 Divorce decree lunch Other (describe) I (Insurance) Do any of the foregoing classes apply to you? lno Military record Birth Certificate of Spouse SUBSTITUTION ON CERTIFICATE OF NATURALIZED Birth Certificates of children uninarried except under age 21 THAI NATIONALITY Yes No (If answer is Yes, explain) x (list those for whom birth certificates are not available or 2. HOUSE REGISTRATION ID (anla whose birth certificates are being submitted at this time in 3. CERTIFICATION ON ALIEN'S FIRSTNAME connection with a visa application.) CHANGE AND CO-JOINING LASTNAME 4 CERTIFICATE OF CHANGING THE FIRST NAME 21 1 (c) Aliens who are, or at any time have been anarchists, or members of or affiliated with any communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who advocate or teach, or who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (1) opposition to organized government (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official character, (4) the unlawful DO NOT WRITE BELOW THE FOLLOWING LINE destruction of property, (5) sabotage, or (6) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the The consular officer will assist you in answering parts 43 and 44 United States, aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of a subversive nature; (A) 9 nio aditional 43 44 I nifo 27W (1) (2) (3) rinths 43. I claim to be exempt from Ineligibility to receive a visa and exclusion under item in part 40 for the following reasons: (4 (5) (6) i noun 41 a 212 (a) (14) Beneficiary of Waiver under 212(a) (28) (1) (i) 212 (e) lun 212 (a) (14) 212 (a) (28) (I) (ii) 212 (g) Does the foregoing class apply to you? Not Applicable 212 (b) (1) 212 (h) linfolz? Attached 212 (b) (2) 212 (i) Yes No (If answer is Yes, explain) I'v' lair (iill' 44. I claim to be a preference immigrant subject to the numerical limitation for (d) Aliens who during the period beginning on March 23, 1933, and ending on May 8, 1945, under the control, direct or indirect, of the Nazi Government of Germany or of the governement of any area occupied by, or allied with, the Nazi Government of Germany, ordered, incites (foreign state or dependent area) assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion. (3) 23 2476 (n.A. 1933) 8 2488 (A.A. 1945) I I Special immigrant not subject to limitation themsunnala 9 manium w Immediate relative of a United States citizen IR- - 5 Does the foregoing class apply to you? (1m 277507 you m Yes No (If answer is Yes, explain) My claim is based on the following facts: ID (min I-130 I am (my is) the beneficiary of a petition. INTERNATIONAL ( 41. Were you assisted in completing this application? (If answer is Yes, give name and address of person yes No I am a returning resident alien. assisting you indicating whether relative, friend, travel agent, attorney or other) In lair the (mln and I deriver foreign state chargeability under Section 202 (b) ) through my now, , 202 (1) Inv Name Address Relationship Other (specify) to FAMILY OUTER DAUGHTER) BENJAMA S. JARIKITPITAYAKUL 333 S. ARROYODRIVE SAN GABRIEL e.A 91776"
}