{
	"anumber": "A41537196",
	"id": "A41537196_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41537196_0012/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF BIRTH, 302"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1938, 1986, 1931, 2023, 1486, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 AFFIDAVIT OF BIRTH PERSONAL AND STATISTICAL PARTICULARS ABOUT CHILD Full name of child REKHA. MAHENDRA DESAI [MRS] Date of birth 8 - 24 - 1938 A.M. At 6:30 P.M. Sex FEMALE Place of Birth SURAT - GUJARAT - INDIA PERSONAL AND STATISTICAL PARTICULARS ABOUT CHILD'S FATHER Full name of father MOHANLAL. DAYALJI DESAI Residence at child's birth BILIMORA - GUJARAT - INDIA Age at child's birth 26 years. Color or race INDIAN Birthplace PARUJAN - GUJARAT - INDIA Occupation at child's birth CLERK. PERSONAL AND STATISTICAL PARTICULARS ABOUT CHILD'S MOTHER Full maiden name of mother TARABEN MOHANLAL DESA) Residence at child's birth SURAT - GUJARAT - INDIA Age at child's birth 24 years. Color or race INDIAN Birthplace GANDEVI - GUJARAT - INDIA Occupation at child's birth HOUSEWIFE This is the SECOND child born to this mother. Including this child, there were then TWO children of this mother living. STATE OF CALIFORNIA Ramania chhimabhai Desal LOS ANGELES ss. County of RAMANLAL CHHIMABHAI DESAI I hereby certify that I am the UNCLE of the above mentioned child and that the facts and date as alleged are true and correct to the best of my knowledge and belief and that I am a nationalizen XK PERMANENT RESIDENT OF THE U.S.A. (CROSS OUT THE WORDS THAT DO NOT APPLY) My Alien Registration # 1 FOIA (b)(6) issued at NEWYORK on 7-13-86 PASSPORT # : A 561158 issued at AHMEDABAD on 4-17-86 BIRTHDATE : 2-4-1924 BIRTHPLACE : VALSAD - GUJARAT- INDIA Address in India : JAWAHAR NAGAR SOCIETY - VALSAD - 396001 - GUJARAT - INDIA AFFIANT HALAR ROAD ADDRESS Address in U.S.A. SUBSCRIBED AND SWORN TO before me V.R. DESAI on OctobER 16 1986 247TH STREET APT # 2117 LOMITA - CA. 90717 OFFICIAL SEAL ALLEN LEVOFF Notary Public in Panda for saidistate. LOS ANGELES COUNTY My comm expires DEC 22, 1986 STATE OF CALIFORNIA CHAINING County of LOS ANGELES I SS. LALITABEN RAMANLAL DESAI I hereby certify that I attended at the birth of the above mentioned child in the capacity of being the AUNT and that the facts and data are true and correct to the best of my knowledge and belief and that I am PERMANENT RESIDENT OF THE U.S.A. My Alien Registration # i FOIA (b)(6) (CROSS OUT THE WORDS THAT DO NOT APPLY) issued at NEWYORK on 7-13-86 PASSPORT # : A 561159 issued at AHMEDABAD on 4-17-86 BIRTHDATE : 3 - 24 - 1931 BIRTHPLACE : CHHARWADA VALSAD - GUYARAT INDIA Address in India : SHRI BUDDHA NAGAR SOCIETY - VALSAD -396001 - GUJARAT-INDIA AFFIANT HALAR ROAD ADDRESS Address in U.S.A. : SUBSCRIBED AND SWORN TO before me B.B. DESAI on October 16,1486 25920 NARBONNE AVE., APT # 21 LOMITA - CA. 90717 all Notary Public in and for said State This standard form covers most usual problems in the field indicated. Before you sign, read 11. OFFICIAL SEAL fill in all blanks, and make changes proper to your transaction. Consulta lawyer if you doubi the form's fitness for your purpose. ALLEN LEVOFF NOTARY PUBLIC - CALIFORNIA AFFIDAVIT OF BIRTH-WOLCOTTS FORM 302 REVISED 12-66-BLANK STATE (price class 3) LOS ANGELES-COURTY My comm. expires DEC 22, 1986"
}
