{
	"anumber": "A41536355",
	"id": "A41536355_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41536355_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 DIVORCE/DEATH DEGREE(S The original or certified copy of the divorce decree or death decree evidencing legal termination of the marriage between and must be submitted. Also submit the original divorce or death decree showing legal termination of marriage between and and ERROR ITEM #14: Block #14 on the visa petition indicates that the bene- ficiary is married. It appears to the Service that this box may have been incorrectly marked. If such is the case please mark the correct reponse and initial. OATH OR AFFIRMATION: The visa petition must be signed by the petitioner in his/her full, true, and correct name; and the signature must be affirmed or made under oath. The visa petition may be affirmed under oath by an Immigration Officer or Contact Representative of the Service, if you desire to personally visit the nearest Service office, or the petition may be notarized before a notary public. CONSULATE DESIGNATION: Please designate in Item #20, on the reverse side of the petition, the American Consulate/Embassy outside the United States where the beneficiary will apply for an immigrant visa. CONSULATE DESIGNATION: INELIGIBLE TO ADJUST: Please designate in Item #20, on the reverse side of the petition, the American Consulate/Embassy outside the United States where the beneficiary will apply for an immigrant visa. Upon review of the visa petition it has been determined that the beneficiary is ineligible to apply for adjustment of status within the United States at this time. The petition therefore must be forwarded abroad upon approval. ITEM #31 - COMPLETE: You must complete the visa petition to show how the beneficiary last entered the United States and what type of visa he (she) had in his (her) possession. An alien who cannot evidence he (she) was inspected and admitted to the United States is not eligible to apply for permanent resident status within the United States. If the beneficiary entered the United States without inspection, designate the American Consulate outside the United States where the beneficiary will apply for an immigrant visa. This office will then forward the petition (if approved) to the designated Consulate. Also, if the beneficiary of the visa petition is not the parent, spouse, or child of a United States citizen, and he/she has been employed illegally within the United States, such beneficiary is ineligible to apply for permanent residence within the United States. Please designate the American Consulate abroad where the beneficiary will apply for an immigrant visa, and we will forward the petition (if approved) to the indicated Consulate. REVERSE SIDE - COMPLETE: Please execute completely the reverse side of the visa petition. COMPLETE OMMITTED ITEMS: Please complete Block(s) # (encircled) on the visa petition. Please note the Petition must be aFFIRMED OR MADE UNDER OATH SYS/RAG 7-1/82 JK WAC 18"
}
