{
	"anumber": "A41539390",
	"id": "A41539390_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539390_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, 1115-0054"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# filing G-28 or Volag # Section of Law: 201 (b) spouse 203 (a)(1) JAN 14 1988 Petition was filed on 10/17/87 (priority date) 201 (b) child 203 (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203(a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria NewDelni 203 3 (a)(5) Field Investigations I-485 Simultaneously Weaver 204(a)(2)(A) Resolved 204 (h) Resolved AM CON: REMARKS: A. Relationship 1. The allen relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)( (6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) SANDHU, Bawa Singh 2. Address (Number and Street) (Apartment Number) House 12, Street 5, Basti Takenwali (Town or City) (State/Country) (ZIP/Postal Code) Ferozepur Punjab India 3. Place of Birth (Town or City) (State/Country) Granthgarh Pakistan 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single 1/12/16 Female Widowed Divorced 7 Other Names Used (including maiden name) Isu 138 30.00 None 10/13/07 8. Date and Place of Present Marriage (if married) 10002222873 U0.31 3/11/48 India 9. Social Security number 10. Allen Registration Number (if any) None None 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended Gian Kaur 2/46 13. Has your relative over been in the U.S.? Yes No 14. If your relative is currently In the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Not in U.S.A. Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) N/A Date authorized stay expired, or will expire as shown on Form I-94 or I-95 N/A 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) N/A 16. Has your relative ever been under Immigration proceedings? Yes No Where When Exclusion Deportation Rescission Judicial Proceedings FOIA (b)(6) T RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned OCT 2 7 1987"
}
