{
	"anumber": "A41533737",
	"id": "A41533737_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41533737_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Freedom of Information Act ((b)(6), FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2011, 2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "TOdeened OR NARA, 9/25/2023: 12-30-82 REMARKS The petition was filed on PERSONAL INTERVIEW CONDUCTED The pelltion is approved for status under section: DOCUMENT CHECK ONLY APPROVED SPOUSE, U.S. IMMIGRATION FIELD INVESTIGATION COMPLETED DATE 201 (b) CHILD 203 (a) (2) OF APPROVAL PREVIOUSLY FORWARDED ACTION MAR2 1983 201 (b) PARENT 203 (a) (4) DD CHICAGO, ID BELBES a.acmoyer 203 (a) (1) 203 (a) (5) DISTRICT REMARKS (Continued) BONEVA VBB (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 20. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for visa abroad at the American Consulate in BOMBAY (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) JINDIA Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Natural- ization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) FOIA (b)(6) 24. Address in the United States where beneficiary will reside (City) (State) 8925 D Robin Dd. Desplaines Ill 60015 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) At PO: Anandpura via Kherwadi Dist Baroda , Gujarat India 391760 26. (a) Beneficiary's address abroad (H any) is: (Number and Street) (Town or City) (Province) (Country) At-PO Anandpura Via Kherwadi Dist. Baroda Gujarat, India 391760 (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet (Name) (Number and Street). (Town or City) (Province) (Country) (22) MIES 01/2/2011 42H 3.47 211078y21 4141 Gaurs? D. USIE21 2/0521CT, 3G9950 (H12C7 27. If this petition is for a child, (a). is the child married? (b). is the child your adopted child? if so, give the names, dates, and places of birth of all other children adopted by you. If none, so state. N/A 28. If this petition is for a brother or sister, are both your parents the same as the alien's parents? N/A If not, submit a separate statement giving full details as to parentage dates of marriage of parents. and the number of previous marriages of each parent. 29. If separate petitions are also being submitted for other relatives give names of each and relationship to petitioner. Mahubhai (Brother) Naginbhai If (Brother) Revaben (mother) 30. Have you ever filed a petition for this alien before? so, give place and date of filing and result 31. If beneficiary is in the United States, give the following information concerning beneficiary: (a) Last arrived in U.S as N/A (b) Date beneficiary's stay expired or will (c) Beneficiary's File number (Visitor, student, exchange alien, crewman, stowaway, etc.) on expire as shown on his Form 1-94 or 1-95. if any (Month (Year) (Month) (Day) (Year) A- (d) Name an , present employer (e) Date alien began this employment"
}
