{
	"anumber": "A41533737",
	"id": "A41533737_0052",
	"page_index": 52,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41533737_0052/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEDICAL Examination of Applicants for United States Visas"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/25/2023 PLACE ME! AL EXAMINATION OF APPLICANTS BOMBAY FOR UNITED STATES VISAS DATE OF EXAMINATION 4.1.89/86035094 CITY COUNTRY At the request of the American Consul at BOMBAY INDIA NAME AGE SEX HARJIBHAI NARANBHAI PATEL 74 M I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON E 583015 AHMEDABAD 22.7.88 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. X CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A, B, o C--diagnosis, and pertinent details*): BLASS 'C' : Blood pressure 170/80. Chest X-ray report OR PLFURAL LESION SEEN. Dr. M. Tayabali from Dr. KAHN TEST: NEGATIVE. HTLV (IIT) ANTIBODIES. DR. (MRS.) F. E. PALIA Blood serological report NOT DETECTED from Dr. Other special report(s) (when needed) M.M. MERANEY from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT Mueramey MEDICAL EXAMINER 6.1.89 50157-102 Continue on reverse side if necessary. OPTIONAL FORM 157 (Rev. 5-78) U.S. GOVERNMENT PRINTING OFFICE : 1984 o - 443-720 Dept. of State"
}
