{
  "anumber": "A41553587",
  "id": "A41553587_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41553587_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ROYAL EMBLEM, 30/2530"
    },
    "years": {
      "ms_years_nlp_v1": [
        2491,
        2023,
        1987,
        1948
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 A ROYAL EMBLEM A.C. SERVICE LIMITED PARTNERSHIP No. 30/2530 Bang Rak District Office, 5 Nares Road, Kwaeng Si Phraya, BKK. 10500 This is to certify that Mrs. Benjama Jalukitpitayakul (Sullivan), person of Thai Nationality, age 39 years old, residing at House No. 111, Group No. 15, Tambol Sansook, Muang District, Cholburi Province, has sub- mitted a petition to Bang Rak District Official in request of an investi- gation to certify that Mrs. Benjama Jalukitpitayakul (Aihua Sae Lao) was born on 19th day of June B.E. 2491 (A.D. 1948) at House No. 457, Swang Road, Kwaeng Mahapruittaram, Bang Rak District, being the natural child of Mr. Charoen Charukijphitthayakul (Yee Chong Sae Lao) and Mrs. Bun Lerh. This to be used as an implicit evidence for consideration at the United States Embassy. The Bang Rak District Official has questioned the petitioner and the witness. The petitioner and the witness testified and confirmed that Mrs. Benjama Jalukitpitayakul (Aihua Sae Lao), alias (Sullivan), was born at House No. 457, Swang Road, Kwaeng Mahapruittaram, Bang Rak District, Bangkok Metropolis, on 19th day of June B.E. 2491 (A.D. 1948), being the natural child of Mr. Charoen Charukijphitthayakul (Yee Chong Sae Lao). Then issued this certificate in witness whereof. Given this 19th day of May 1987 - Signature - (Mr. Nien Ruanboon) Chief of Administration Affairs, acting for Bang Rak District Director. CERTIFIED CORRECT TRANSLATION PER DOCOMENT SEEK Administartion Affairs. Tel: 236-1395 SERI THAMPICHA MANAGER 20 MAY 1987"
}