{
  "anumber": "A41539277",
  "id": "A41539277_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539277_0015/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1988,
        1998,
        1921
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ent of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Action Stamp Fee Stamp A# APPROVED Receipt# 46560 INS DISTRICT DIRECTOR G-28 or Volag # 9+500 NEWD Section of Law: OCT 25 1988 201 (b) spouse 203 (a)(1) Petition was filed on 9/15/88 (priority date) 201 (b) child 203 (a)(2) 201 (b) parent 203 (a)(4) by Pakanto Personal Interview Previously Forwarded Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) AM CON Draw Delhi RIT Field Investigations I-485 Simultaneously 3658 204 (a)(2)(A) Resolved 204 (h) Resolved A. Relationship REMARKS: Mitha home one + care for here daughter came bate 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) SAMUDRE, HENRIETTA THEO DORE, KATHERINE - 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 1076, CULVERLA Louisville. KY 40219 HOUSEND 3, DiDTELEGRAPHOUARTERS (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) METHODIST mission CompD DELHI- 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State Country) MATHURA, UTTAR PARDESH. INDIA LUDHIANA, Dist.PUNJAB INDIA 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) 4. Date (Mo/Day/Year) of Birth (08/11/1998) 5. Sex Male 6. Marital Status Male Married Single Married Single 11-15-27 Female Widowed Divorced Female Widowed Divorced 7. Other Names Used (including maiden name) SUGKA HENRIETIA 7. Other Names Used (including maiden name) mes. HENRIETTA THEODORE. RAZZAD. MRS R AMSEY THEO DORE.. THEODORE ABD4l 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) RAZZAO 1921 GURDASPURE Disi PUNJAB 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) NONE 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended DAVID SAMUDRE 1980 RAMSDY THEODORE MAY 11, 67 (decease), FOIA (b)(6) 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. Cert.Seen 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 11790749 Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents Have you obtained acertificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, 'date and place it was issued 15. Name and address of present employer (if any) Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United States citizen or lawful permanent resident? Yes No Exclusion Deportation Rescission Judicial Proceedings Came to India INITIAL on RECEIPT 11 Aug 1988. Returned RELOCATED to India 10/24/88 COMPLETED RESUBMITTED plans to leave 10/26/88 Rec'd Sent Approved Denied Returned on Sept 24,1988 9/15/88 Form 1-130 (Rev. 02-28-87) N 10/26/88 One to hee beather's death she stayed back and wants to take hee mother with her."
}