{
  "anumber": "A41532476",
  "id": "A41532476_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41532476_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF MARRIAGE CELEBRATED IN OTHER FORMS, 23/77"
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 8/18/2023 23/77 CERTIFICATE OF MARRIAGE CELEBRATED IN OTHER FORMS ( See Section 16) oflon 31312 4113 If ) 1. RN Nanch Marking officer Baroda Disisia hereby certify that Shri Harithan Dahya than Desai and 5mt Shantaben Hari than Desai *appeard before me this 11th day of April 1977 and that each of them, in my presence and in the presence of three witnesses who have signed hereunder, have declared that a ceremony of marriage has been performed between them and that they have been living together as husband and wife since the time of their marriage, and that in accordance with their desire to have their marriage registered under this Act, the said marriage has, this 411th day of April 1977 been registered under this Act having effect as from 21.5.38 The marriage is registered in my office They have children as under V Sumitra st Harither 18-12-39 Age 38 daughter lsd) RN Nandi < Jayantilal Haribhan 35 san Marriage Officer for 87. 5.1942 40%-11 3 4 FOIA Bhupa (b)(6) rai Hari Ghen 32 son (sd) Halibhan 2 RRIS 51221mL R22 Husband I minor. mid. Efaming 2nw 4Fa Mohan Ghen Durla Ghohni Desai (sd) 2inion 2Rmis BnV 7 4thl society WaghodiaRd. Baroda Wife Suresh Fulchand Shar year 27 Kander vaga 17 Socth waghodia Road Baroda Three witnesses 10 21184241 Pradymmen withlesh Arya (5d) M.D Desan Vedmandir Bahucharaji Road Baroda (st) S.F. shah ( 5d) p. V. Arya , Dated the 11 th day of April 1977 412/24 7113 217 It OF THE Ma NATURAL Copied by me X *Herein give particulera of parties Read by me Ryr 4218(21-1) Favid 241441 Compared by me Erresires . Time Corrector Copy No! come) Marrage promotion Chica Sandya DISTRIB Saroda District"
}