{
	"anumber": "A41539277",
	"id": "A41539277_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41539277_0039/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1985, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/31/2023 PLACE ME AL EXAMINATION OF APPLICANTS New Delhi : 166, Jorbagh FOR UNITED STATES VISAS DATE OF EXAMINATION November 15, 1988 CITY COUNTRY At the request of the American Consul at New Delhi India NAME AGE SEX Mrs. KATHERINE THEODORE 88 F I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON 503328 Lucknow 12 Dec. 80 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more (mental deficiency) attacks of insanity Insanity Psychopathic personality Sexual deviation Chronic (See Narcotic Mental proviso,fsec. defect alcoholism drug addiction 3457, BE USPHS THE Fieres, PURPOSE AND TOMS. CLASS B: Physical Defect, Disease, or Disability Serious in Degree from Normal Physical Well-Being. CLASS C: Minor Conditions. of THE ATION Departure (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: THE INF Hotterme (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class-A B, or C-diagnosis, and pertinent details*): Class B : No hearing right, impaired hearing left ear Bilateral aphakia, vision partly corrected Taking treatment for hypertension. B.P. 170/90 Most teeth missing Osteo-artheritis knees Unfolding aorta. Chest normal Chest X-ray report G.S. Garkal from Dr. V.D.R.L : Non-reactive A.Lal Blood serological report from Dr. Antibody to HIV-I : Non-reactive Other special report(s) (when needed) A.Lal from Dr. SIGNATURE OF MEDICAL TECHNICAL ADVISOR Harish Khosla parion two TITLE DATE OF FINAL REPORT MBBS, FRCP, FCCP, FNCCP., Nov. 16, 1988 50157-102 *Continue on reverse side if necessary. OPTIONAL FORM 157 (Rev. 5-78) GPO : 1985 O - 479-003 Dept. of State"
}
