{
  "anumber": "A41623672",
  "id": "A41623672_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificación de la Alcaldía, T.R. 0161529"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 No 4600 1972 for SECURITY DE EL SCHOOL CORTE OF CUENTRS CUARENTA CENTAVOS T.R. 0161529 El Infrascrito Alcalde Municipal, , Certifica:que a fojas 43 del Libro de Partidas de Nacimientos que - 2 T3 esta Alcaldía llevó en el año de 1944 se encuentra la que literalmen B2R 1978 te dice: 5 \"Pa. No.9. - Alcaldía Municipal : Zaragoza, a las quince horas del día 6 primero de Febrero de mil novecientos cuarenta y cuatro. -ANA CLARI- 7 BEL CUBIAS ,hembra, mestiza, Salvadoreña ,hija legitima de Emilio Cu- 8 bías y Mercedes Santos, el primero Tejedor y actualmente Guardia Na- 9 cional y la segunda de oficios domésticos ,origin aria de San Loren- 10 zo y San Esteban Catarina del Departamento de San Vicente, ambos de - este domicilio , nació el veinticinco de Enero del mes próximo pasado 11 a las cuatro horas ,viva parto sencillo ,en el Barrio \"E1 Centro\"de 12 13 esta Villa .- Da parte el propio padre de la recien nacida presentó 14 su Cédula de Vecindad y firmó .-Testado -año- no vale.-I. Iraheta - 15 Emilio Cubías - Nicolás Artiga M, Srio.' \" RUBRICADAS Es conforme con su original con el cual se confrontó en la Al 16 17 caldía Munici pal : Zaragoza, a dieciocho de Abril de mil novecientos 18 setenta y dos 19 20 21 Refine pranced 22 Rufino Franco Angel. Alcalde Municipal 23 24 f 25 Date Erlinda Ramirez Artiga. Srio.Mpal. I certify that I have compared this copy with its original. and that it is a true and complete copy. 8-14-85 LUIS H. GARGIA Attorney at Law 304 S. Broadway. Ste. 222 Los Angeles, Ca. 90012 Admitted to Practice in the State of California"
}