{
  "anumber": "A41623672",
  "id": "A41623672_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0049/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Libro Divorciando, Folio 119"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 21906 Follo 119 Libro Divorcine PARTIDA NUMERO CIENTO DIECISIETE. - RONALD CASAMALHUAPA CABALLERO conooido por RONALD CASAMALHUAPA V ANA CLARIBEL CUBIAS, conocida por CLARIBEL CUBIAS, contrajeron matrimonio civil en esta ciudad, el die - sets de julio de mil novecientos sesenta y sets , ante los oficios del Aloalde Municipal Jose Napole6n Duarte secretario Carlos Antonio Herrera Rebollo y testigos Heator Alfredo Valladares Martinez y Milton Baltazar Hernández Las generales de los expresados contrayentes conforme la partida de matrimonio son las siguientes: el primero de veintistete años de edad, Dibujante Arguitectónico del domicilio de eata capital originario de la misma de nacionalidad salvadorefia hijo de Maria Luisa Caballero y de Atilio. Casamalhuapa ; y la se- gunda de veintidos años de edad, empleada del domicilio de esta ciudad originaria de Zaragoza de nacionalidad salvadoreña hija de. Emilio Cubias y de Meroedes Santos ; y en virtud de sentencia pronunciada por el Juez Segundo de lo Civil de este Distrito las nueve horas del dla siete del presente mes y año y ejecutoriada a las ooho horas y ouarenta V cinoo minutos del dia catoroe del mismo mes y año fue decretado el divorcio por la causal de separaction absoluta y en consecuencia disuelto el vínculo matrimonial que los unía. Se cancela la partida de matrimonio número seiscientos treinta V nueve folio seiscientos cuarenta y trea del libro Primero del año. mil novecientos sesenta y sets . Ambos o6nyuges se reputan inocentes, pudiendo contraer nuevas nupcias. Quedan los menores EDGAR Y ERIC, ambos de apellido Casamalhuapa Cubias, bajo el ouidado V guarda personal de la madre senora Ana Claribel Cubias, conooida por Claribel Cublas . ALCALDIA MUNICIPAL: San Salvador, veintiocho de abril de mil novecientos setenta V cinco Enmendado -Hernández -Distrito- inocentes - Vale. Many Jefe del Registro Civil ng 10605-T11 UNGO 1L 150h 10-74 I certify that I have compared this copy with its original, and that it is a true and complete copy. Aus 8-14-85 Date LUIS H. GARCIA. Attorney at Law 504 S. Broadway. Ste. 222 Los Angeles, Ca. 90012 emailed to Practice in the State of California"
}