{
	"anumber": "A41624049",
	"id": "A41624049_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41624049_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Information about your residences and employment., N-400 ( (Rev 07/17-91)N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 2023, 1991, 4214, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever IS less. Begin with your current address. If you need more space, continue on separate paper: Street Number and Name, City, State, Country, and Zip Code NO OTHER Dates (month/day/year) From To 15636 Amar Road, APtE, LA Puente, California 91744, USA 1-1-93 Present 324 South ELM Street, Alhambra, California 91801 USH 7-6-91 12-30-92 1226 EAST wanamaker Drive, APTB, Covingicalifornia 91720 12-13-90 7-6-91 15638 Amar Road, APTB, LA Puente, ,CA 91744, USA 6-27-87 12-12-90 B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write \"None\". If you need more space, continue on separate paper. Employer's Name Employer's Address Dates Employed (month/day/year) Occupation/position Street Name and Number . City, State and ZIP Code From To None S.S.I. 12/1991 Presalt Retired 4 NO OTHER Part 5. Information about your marital history. A. Total number of times you have been married / . If you are now the your husband or married, Crime over regarding 30 urs wife. of MARRIAGE Family name Given name Herrera Rosa Doesnt nememer Middle initial DATE Address 15636 Amar Road, APTE, LA Puente california 91744 Date (month/day/ of birth ear) 3-4214/1928 Country of birth Citizenship EL Salvador El SalvaDor Social FOIA (b)(6) A# (if applicable) Immigration status Permanent Security# 41624049 (If not a U.S. citizen) Resident Naturalization (If applicable) (month/day/year) Place (City. State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. B. Total Number of Children 4 Complete the following information for each of your children If the child lives with you, state \"with me\" in the address column: otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" ⑉ the address column. If you need more space. continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address FOIA (b)(6) Roberto HERRERA 1947 EL SALVADOR 2 No OTHER Form N-400 (Rev 07/17/91)N Continued on next page"
}
