{
	"anumber": "A41623672",
	"id": "A41623672_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "PETITION FOR NAME CHANGE, NARA-5/5/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1952, 1910, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 PETITION FOR NAME CHANGE UNITED STATES DISTRICT COURT CENTRAL DISTRICT OF CALIFORNIA INSTRUCTIONS TO THE PETITIONER: Under the Immigration and Nationality Act, of 1952, as amended by the Immigration Act of 1990 (Sec 336), an applicant who requests a change to his or her name must have the oath administered by a district court by decree of that court. The decree of name change will be issued at the same time as the administration of the oath of allegiance, and the certificate of naturalization shall be issued in accordance therewith. If you elect the United States district court ceremony and wish to change your name, please clearly print or type the information requested. I hereby petition this court to change my name. In support of my petition I truthfully state the following: (1) My full and correct name is Olaya Mercedes Santos Viuda de Cubias (2) My present place of residence is 4009 E. Gage Ave Bell Ca 90 201 (3) My country of birth is El Salvador (4) My date of birth is 12-14-1910 I (5) My INS registration number is 041-623-672 I certify that I am not seeking a change of name for any unlawful purpose such as the avoidance of debt or evasion of law enforcement. I petition the court to change my name to: OLAYA MERCEDES SAN Tos Witness wcheong 1-20-99 \"Mercedes Santos witness Luis Antiba Date Signature of petitioner CERTIFICATION OF NAME CHANGE I certify that the above petition was granted by the court on . Date Clerk (by Deputy Clerk)"
}
