{
  "anumber": "A41624049",
  "id": "A41624049_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41624049_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificación de Matrimonio, 678896"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 No 678896 SAIVADOR AM SECURITY HOMELAND eua / No. 01495 1967 CORTE DE CUENTAS CUARENTA CENTAVOS T.R. 221108 EL INFRASCRITO JEFE DEL REGISTRO CIVIL DE ESTA CIUDAD, 1 CERTIFICA: que a la página 225 del Libro lo. A. de- 2 Partidas de MATRIMONIOS queesta Oficina llev6 durante el- 3 año de 1959, se encuentra la que literalmente dice: 4 PARTIDA NUMERO noventa y ocho =98= Los senores 5 6 ADRIAN HERRERA, de cuarenta y cinco años de edad, zapatero, del- 7 domicilio de esta capital, originario de Santa Ana, de nacionali 8 dad Salvadoreña y CANDIDA ROSA GARCIA, de veintinueve años de 9 edad, de oficios domésticos, del domicilio de esta capital, ori- 10 ginaria de Acajutla, y denacionalidad Salvadoreña; el primero hi 25 11 jo de Brigida Herrera, y la segunda hija de Emilia García; con-- 12 trajeron matrimonio civil ante los oficios del señor Alcalde Mu- 0 13 nicipal, Ingeniero Alfredo Avila Figueroa, el día once del mes. 14 próximopasado, con asistencia de los testigos Rafael Rodríguez 15 Martinez y Miguel Molina, ambos zapateros. - Alcaldía Municipal 16 San Salvador, veintiuno de abril de mil novecientos cincuenta y 17 nueve.- En el acto del matrimonio los esposos reconocieron como hijos de ambos a Jorge Alberto, Rosa Emilia y Yolanda Eugenia. - 18 Enmendado-Acajutla. Vale.- S. Preza.-Jefe del Registro Civil. 19 RUBRICADA ES CONFORME CON SU ORIGINAL CON EL CUAL FUE 20 CONFRONTADA EN LA ALCALDIA MUNICIPAL: San Salvador, a diecinueve 21 22 de enero de mil novecientos sesenta y ocho. Enmendado-segunda- oficios-Vale- 23 JOSE RENE BÁRILLAS"
}