{
  "anumber": "A41623672",
  "id": "A41623672_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0061/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Suplemento al Formulario OF-167, OF-167"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 SUPLEMENTO AL FORMULARIO OF-167 IMPORTANTE Este documento debe leerse y firmarse por personas deseen presentar una carta de sostenimiento a favor de un extranjero que de cualquier carta de sostenimiento presentada a favor de un solicitante. a cada de residente. Una copia firmada de este documento debe adjuntarse solicitando copia visa E1 del la eligibilidad de personas para recibir beneficios de Ingresos para Acta enmendada del Seguro Social establece ciertos requisitos determinar Seguro Social (SSI) y Ayuda a familias cor Hijos Menores Suplementarios dependen de sus cualquier sostenimiento persona, (AFDC). quien Estas enmiendas requieren que los que ingresoss y recursos para Unidos como residente ha ejecutado como fiador una carta de un de extranjero sostenimiento que entra a los Estados fiador similar pueden a favor considerarse del extranjero, y que el ingreso y recursos del u cónyuge otro acuerdo del minar la eligibilidad para beneficios como el ingreso de SSI y recursos del extranjero para deter- guientes a la entrada del extranjero a los Estados y AFDC Unidos. durante los tres años si- de La eligibilidad los fiadores en de dar personas la información para SSI y AFDC será de acuerdo a la cooperación visión. Social y las Agencias Estatales para el necesaria Bienestar y pueda evidencia para que el Seguro la Administracion Un extranjero solicitando SSI o AFDC debe poner llevar a la a cabo esta pro- cualquier documentación del Seguro Social y/o Agencias Estatales para disposición el Bienestar de concerniente fiador, ajuste incluyendo los que presentó para a sus la ingresos solicitud y recursos de la o aquellos de su Servicios o de Humanos su estado dentro de los Estados Unidos. ET Secretario visa de residencia de otras agencias. está autorizado para obtener copias de cualquier documentación de Salud y deben E1 Acta juntamente del Seguro Social cada también indica que un extranjero y su; o beneficio del Seguro o Social uno en 0 AFDC particular que fue estas dispuestos a reembolsar sus fiadores cualquier será información retenida o de por omitir información. Cualquier incorrectamente cantidad que pagado no sea debido reembolsada a mal elegibles bajo las algún regulaciones pago subsecuente del Acta al del cual el extranjero o fiador sean Seguro Social. que Estas reglas no aplican a personas que hayan sido admitidos para se la les eligibilidad haya dado de asilo político por el Fiscal General Tampoco como refugiados o capacitado despues de entrar beneficios a los Estados del SSI si la persona ha quedado ciego no aplicarán o in- aplica fiador. a las personas que son hijos dependientes Unidos. del Las fiador provisiones o del cónyuge del AFDC del no Yo, ANA CLARIBEL MORRISON (nombre) residiendo en 2428 Grand Ave Huntington park, California 90255 (calle y número) (ciudad, estado y pais) certifico que he leido y estoy enterado enmendada. de mis responsabilidades Esta declaración como fiador de un residente bajo el Acta es NOMBRE presentada del favor Seguro a Social de las siguientes SEXO EDAD LUGAR personas: DE ESTADO RELACION NACIM FAMILIAR CIVIL OLAYA MERCEDES SANTOS VIUDA DE CUBIAS F 86 El Salvador Viuda CON EL FIADOR(ES) Madre And 6. marrison Firma del Fiador(es) ANA CLARIBEL MORRISÓN"
}