{
  "anumber": "A41624049",
  "id": "A41624049_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41624049_0053/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OATH OR AFFIRMATION OF DEPONENT, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/2/2023 8. That the following persons are dependent upon are for Support: (Place of check J in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) NAME or PERSON WHOLLY PARTFALLY DEPENDENT DEPENDENT AGE RELATIONSHIP TO ME FOIA (b)(6) 9. That I have previously submitted affidavit(s) of support for the following person(s) If none, state mode. Non Date submitted no 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following per. son(s). If none, state none. Date rebellted FOIA (b)(6) Rosa Garcia de Herrera mother Aug. 17, 1986 11. (Complete this block only if the person named in item 3 will be in the United States temporarily.) N/A Permanent That I do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend indicate the excect nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sura, weekly, or monthly. and for how long.) OFFICIAL SEAL AURELIO DE LOS SANTOS-ORTIZ OATH OR AFFIRMATION OF DEPONENT Notary Public-California LOS ANGELES COUNTY My Comm. Exp. Aug. 22. 1990 / swear (efform) that I know the contents of this affidavit signed 07 me and the sistersemes Signature of deponent FOIA (b)(6) Subscribed and sworn to (efferned) before the this 15th day of February $ 19 87 Los Angeles, California My commission expires on August 21, 1990 Signature of Officer Administering Oath Title Notary Public of affidavit prepared by other then deponent, please complete the following: I declare that this document was prepared by me # the request of the deponant and is based on all information of which { bave any knowledge. 532 S. Harvard Bl. #4, Los Angeles, CA 90020 (Signature) (Address) (Date)"
}