{
  "anumber": "A41623672",
  "id": "A41623672_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        1999
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "N.A"
      },
      "marital_status": {
        "marital_status_llm_v1": "WIDOWED"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1999
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "LOS ANGELES, CA"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "9 No. 22588834 Personal description of holder INS RegistrationNo. A 41 1 623 672 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: DECEMBER 14, 1910 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 0 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA EL SALVADOR The Attorney General having found that: OLAYA MERCEDES SANTOS then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: MARCH 9, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.S. LAW TO COPY. Daris minimum PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization XIZ FORM N-550 REV. 6-91"
}