{
	"anumber": "A41623672",
	"id": "A41623672_0062",
	"page_index": 62,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0062/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Attachment to OF-167, Screened by NARA, 5/5/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 Attachment to OF-167 affidavit IMPORTANT: This document must be read and signed by persons wishing to submit copy of this of support on behalf of an alien applying for an immigrant visa. A signed an submitted document must be attached to each copy of an affidavit of support on behalf of an applicant. and resources (AFDC) benefits. These amendments that Families with Dependent Children for Supplemental Security Income (SSI) and Aid to determining The the Social eligibility Security of aliens Act, as amended, establishes certain requirements for alien, and executed an affidavit of support or similar agreement entry behalf into the United states, of any person who as the sponsor an an alien's require the income the income and the income and resources of the sponsor's spouse, shall on be deemed of the for SSI resources of the alien under formulas for determining to be the United States. and AFDC benefits during the three years following the alien's eligibility entry into The the eligibility of aliens for SSI and AFDC will be contingent upon their obtaining evidence cooperation of their sponsors in providing the necessary information carry out to enable the Social Security Administration and State Welfare and to to the Social this provision. An alien applying for SSI or AFDC must make Agencies which concerning he his income or resources or those of his sponsors, documentation Security Administration and/or State Welfare Agency available of status. provided The in support of his application for an immigrant including visa information of any such documentation Secretary of from Health other and agencies. Human Services is authorized to or obtain adjustment copies jointly The Social and Security Act also provides that an alien and his or her paid because severally of liable to repay any SSI and AFDC benefits which sponsor are shall be withheld from information, and any incorrect payments which are not sponsor's to provide misinformation provided by sponsors or because of incorrectly failure eligible under any the subsequent Social Security payments Act. for which the alien or sponsors repaid are will otherwise be These asylum provisions by the do not apply to aliens admitted as refugees or AFDC provisions blind or disabled after entry into the United States. of aliens who Attorney become General. They also will not apply to the granted SSI eligibility political or spouse. sponsor's do not apply to aliens who are dependent children of the sponsor The I, (name) , residing at (street and number) (city and state) , acknowledge that I have read the above and as am amended. aware of my This responsibilities as an immigrant sponsor under the Social Security Act Name statement is submitted on behalf of the following persons: sex age country married of birth relationship or single to sponsor(s) Signature of Sponsor(s)"
}
