{
  "anumber": "A41623672",
  "id": "A41623672_0047",
  "page_index": 47,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0047/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificado de Nacimiento"
    },
    "years": {
      "ms_years_nlp_v1": [
        1910,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 E1 Infrascrito Alcalde Municipal. Certifica:que en el folio 48 del Libro de Partida de Nacimiento que e t a Alcaldia llevó durante el año de 1910,00 encuentra la Par tida que literalmente dice: Partida número 199, -Alcaldia Municipal: San \"steban, Diciembre a la ocho de la mañana del año de mil noveciento diez OLAYA MERCEDES SANTOS, mujer ladine Salvadoreña, h1 ja natural de Teresa Santos de eete vecindario, nac16 viva en esta jurisdicción a la nueve de la mañana del dia cátorce del corriente me viva y única en el parto \"u madrina de Bautiemo Guadlupe Olivar y don Octavio Navarrete. - Di6 eoto dato el ceñor Trángito Navarrete y no firma por no po der pero a \"u\" ruego lo hace el \"uncrito.-Juan .Acevedo--Modeoto N. Serrano Ante mi--Froilén Garcia Srio-- b r C a d a 8. num E- conforme con \"u original con el cual ce confronto, Y para lo efecto de colicitar Cédula de Identidad Personal, ce le extiende la precente en la Alcaldia Municipal de San us teban Catarina,a catorce de agosto de mil novecientos cetenta of uno.- CALDIA MUNICIPA Catarina Pedro aurício Durán. San Esteban Depta. de San Vicente Alcalde Municipal- C.A. SALVADOR MUNIGIPA Catarina Joo6 Hernan Villalta. Secretario. Into.- son Esteban de Salt Vicente / Depto. C.A EL SALVADOR 147213-B I certify that I have compared this copy with its original, and that and complete copy. LUIS H. GARCIA, Attorney at Law 304 S. Broadway Ste. 222 Los Angeles, Ca. 90012 Admitted to Practice in the State of California"
}