{
  "anumber": "A41623672",
  "id": "A41623672_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0059/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1972,
        2428,
        2023,
        1983,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 AFFIDAVIT OF SUPPORT State of California SS County of Los Angeles ANA CLARIBEL MORRISON I, 2428 , residing at Grand Avenue, Huntington Park, Cal. 90255 BEING FIRST DULY SWORN, DEPOSE AND SAY That I am a citizen of United States , born at La Libertad, El Salvador, C.A. 01/25/1944 I am separated That I am 43 years of age and have resided in the United States since 1972 as a Permanent Resident. My citizen # is 11581660 on October 21st 1983 at Los Angeles, California THAT it is my intention and desire to have the following person (s) at present residing at San Salvador, El Salvador, C.A. come to the United States. as a Permanent Resident Country Relationship Name Sex Age of Birth to deponent OLAYA MERCEDES SANTOS VIUDA F 76 El Salvador, C.A. Mother DE CUBIAS THAT I am employed or engaged in the business of X-RAY TECHNICIAN with MOS Inspection Inc at 6800 E. Washington Blvd.Los Angeles, Ca. and derive a net annual Income of $ 15.793. -- . THAT I have deposits in Banks in this country $ Letter attached THAT I own Real Estate at None valued at $ with mortgages or other encumbrances amounting $ . THAT I have other personal property with a reasonable value 23.000.00 of $ with encumbrances amounting $ . THAT I have Life Insurance in the sum of $ 35.000.00 with cash surrender value of $ . THAT the following persons are dependent upon me for support 2 children THAT I am willing and able to receive, maintain and support the prospective immigrants listed above. That I am ready and willing"
}