{
	"anumber": "A41623672",
	"id": "A41623672_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Information about your residences and employment., N-4 (000 ( Rev 07/19/91)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1884, 1996, 1987, 2023, 999, 1924]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever IS less. Begin with your current address. If you need more space, continue on separate paper Street Number and Name, City, State, Country, and Zip Code Dates (month/day/year) From To 4009 E. GAGE AU. BELL, QD. 90201 08-01-94 PRESENT 6717 King AU. BELL, on. 90201 10-01-90 08-01-94 8 No others 03/0999 YOURIBIO B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write None\" If you need more space, continue on separate paper. 000 05 KAL Employer's Name Employer's Address Dates Employed (month/day/year) Occupation/position 9 Street Name and Number - City, State and ZIP Code From To w Homemaker supported by daughter conception 1987 1884 employed 20J 10 on SSI 1996 now unemployed 11 No others Part 5. Information about your marital history. A. Total number of times you have been married / . If you are now married, complete the following regarding your husband or wife. 12 DOM 1924 Family name Given name Middle initial CUBIAS EMILIO Address Receased since 35 YEARS. (EL SALUADOR ) Date of birth Country of birth Citizenship (month/day/year) Social A# (if applicable) Immigration status Security# (If not a U.S. citizen) Naturalization (If applicable) (month/day/year) Place (City State) If you have ever previously been married OF if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. 13 No others Part 6. Information about your children. B. Total Number of Children 4 Complete the following information for each of your children If the child lives with you, state \"with me\" in the address column: otherwise give city/state/country of child's current residence If deceased write \"deceased\" in the address column If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address DEDRO CUBIAS 10-7-28 EL SALUADOR NONE EL SALUADOR MARTHAO. HERCODO 05-25-40 EL SOLURDOR NONE EL SALUADOR CONCEPERON RGUEZ 11-14-36 ELSOLUADOR FOIA (b)(6) BELL, es. ANA O. MORRISON 01-25-14 EL SALUADOR NATURALIZED N/A North CIROLINA (14)3 deceased in E Salvador 15 NO others Form N-400 (Rev 07/17/91)N Continued on next page"
}
