{
	"anumber": "A41623672",
	"id": "A41623672_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Establish Status of Alien Relative for Issuance of Immigrant Visa, FORM I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 1910, 2023, 1940, 1944, 1930, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 5/5/2023 OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-86 PETITION SSIFY ST US OF ALIEN RELATIVE Fee Stamp FOR IS ANCE o MIGRANT VISA (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: The petition was filed on The petition is approved for status under 8/19/85 REMARKS U.S. APPROVED INS. PERSONAL INTERVIEW CONDUCTED section: WESTERN ADJ. CENTER DOCUMENT CHECK ONLY SPOUSE, FIELD INVESTIGATION COMPLETED DATE 201 (b) CHILD 203 (a) (2) OF SEP 10 1985 APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD Smoke Rection WAC/LOS/#15 #16 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1 Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: CUBIAS- OLAYA MERCEDES Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? Olaya Mercedes Santos YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? El Salvador, C.A. 12/14/1910 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) MORRISON ANA CLARIBEL (213)5 81-1172 Mothero 12. Other names used by petitioner (including maiden name if married woman) Ana Claribel Cubias 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) n/a 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) n/a 15. Names, birthdates and countries of birth of beneficiary's children: Pedro Cubias 10/07/1930 Santa Ana ,El Salvador Concepcion Cubias-- 12/14/1936 Marta Cubias- 05/25/1940 El Salvador, C.A. (?hurcharan) El Salvador, C.A. (San calvador) Ana Claribel Cubias-- 01/25/1944- La Libertad, El Salvador 02102 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in SAN SALVADOR, EL SALVADOR, C.A. (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at FOIA (b)(6) (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 2551 1/2 Cole Place, Huntington Park, California 90255 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) Colonia IVU Edificio 27 Apt. #32, San Salvador, El Salvador, C.A. 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) none (b) If the beneficiary's native alphabet is other than Roman letters. write his/her name and address in the native alphabet: (Name) n/a (Number and Street) (Town or City) (Province) (Country) Initial Resubmitted Relocated Returned LOVERmpleted Receipt Received Sent RECEIVED TRANS. IN RET'D. TRANS OUT COMPLETED FORM I-130 (Rev. 5-5-83) N 22 AUG 195"
}
