{
	"anumber": "A41623672",
	"id": "A41623672_0052",
	"page_index": 52,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0052/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "La Inscribta Jefe del Registro Civil de Esta Ciudad, T.R. 0557017"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/5/2023 No 5521 ENLA Protejamos Nuestro Cultural SECURITY 984 HOMELAND 25 M CORTI DE CUENTIS CUARENTA CENTAVOS 25 T.R. 0557017 1 LA INFRASCRITA JEFE DEL REGISTRO CIVIL DE ESTA CIUDAD.- 2 CERTIFICA: que a la página número 55 del Libro de Partida de Defunción que- 3 esta oficina llevó durantes los años de Mil Novecientos Sesenta Uno a mil Nove-- 4 cientos Sesenta y Dos. Se encuentra asentada la que Literalmente Dice: Partida - 5 Número Trescientos Dos.- EMILIO CUBIAS, Varon, de cincuenta y seis años de edad- 6 Casado con MERCEDES SANTOS, originario de San Lorenzo Depto de San Vicente y de- 7 este domicilio y Nacionalidad Salvadoreña hijo de PEDRO CUBIAS Y PAULINA AGUILAR 8 falleció de Fiebre Tifoidea a las diez y ocho horas de ayer en el Cantón Platana- 9 res de ésta, con asistencia médica del Dr. Miranda, de la ciudad de San Vicente- 10 Dis estos datos, PEDRO DEL ROSARIO CUBIAS SANTOS, hijo del Fallecido y mostro su 11 cédula de Identidad Personal número cincuenta y cuatro mil, cuatrocientos veinti- 12 cuatro, expedida por las autoridades municipales de Sonsonate y no firms por no- 13 saber, haciéndolo a su ruego, Blanca Irma Yánez de Ramirez, Juntamente con el In- rascrito Jefe del Registro Civil. Jefatura del Registro Civil de la Alcaldia -- 14 15 Municipal. Zacatecoluca, a once de Agosto de Mil Novecientos Sesenta y Uno. J.R. 16 Argueta- B.Irma Yánez de Ramirez RUBRICADAS 17 ES CONFORME CON SU ORIGINAL CON EL CUAL SE CONFRONTO, Y para los efectos de 18 LEY, se le expide la presente en el Registro Civil de la Alcaldia Municipal de - 19 Zacatecoluca, Veintidos de Agosto de Mil Novecientos Ochenta y Cuatro, Sobreborra 20 do- DEFUNCION- OCHENTA_ALCALDIA- VALE.- 21 CONFRONTO: 1Bmm 22 BLANCA IRMA YANEZ 23 & PAZ LUCIA BANTOS CUBIAS JEFE REGISTRO CIVIL 24 AQX.DEL REGISTRO CIVIL.- and 25 I certify that I have compared this copy with its original. and that it is a true and complete copy. DIRECCION DE SERVICIOS GRAFICOS 8-14/85 LUIS H. GARCIA, Attorney at Law 304 S. Broadway. Ste. 222 Los Angeles, Ca. 90012 Admitted to Practice in the State of California"
}
