{
  "anumber": "A41826829",
  "id": "A41826829_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Visas de Inmigrante"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 SERVICE OF VISAS DE INMIGRANTE EMBAJADA DE LOS ESTADOS UNIDOS REFORMA 305. MEXICO, D.F. TEL. 211-00-42 SECURITY STATES OF FORMULARIO APROBADO O.M.B. No. 1405-0015 FORMULARIO OPCIONAL 230 (Spanish) (Rev. 6-82) SRIA. DE ESTADO 50230-104 SOLICITUD DE VISADO DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCCIONES: Este cuestionario debe llenarse por DUPLICADO a máquina o, a mano, en letra de molde legible. Deben contestarse todas las preguntas pertinentes. Cuando una pregunta no sea pertinente, indíquelo así. Si el espacio en el cuestionario no es suficiente. responda en hojas aparte, por duplicado, anotando los números de las preguntas del cuestionario a las que corresponden las respuestas. Anexe esas hojas al cuestionario. NO FIRME este cuestionario hasta que el funcionario consular se lo indique. Los derechos por la presentación de esta solicitud de visado de inmigrante son US $25.00. Esos derechos deben pagarse en dólares estadounidenses o su equivalente en moneda nacional, o con giro bancario cuando se presente usted ante el funcionario consular. ADVERTENCIA: Toda declaración falsa u ocultación de un hecho pertinente puede ser causa de exclusión permanente de los Estados Unidos. Aun cuando usted ya hubiera sido admitido en los Estados Unidos, una declaración fravdulenta puede ser motivo de enjuiciamiento, deportación, o ambos. FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE 50230-104 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in duplicate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. Apellido(s) (Family name) Nombre (First name) Segundo Nombre (Middle name) DIAZ CRESCENCIA GONZALEZ 2. Otros nombres que haya usado 0 por los cuales se le conozca (si es mujer casada, indique aquí el apellido de soltera) (Other names used or by which known (If married woman, give maiden name) GONZALEE CRESCENCIA. B 3. Nombre completo en alfabeto nacional si no se usan caracteres romanos (v. gr. árabe) (Full name in native alphabet (If Roman letters not used) ) NONE 4. Fecha de nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de nacimiento (Place of birth) Día (Day) Mes (Month) Año (Year) Ciudad o pueblo (City or town) (Estado o Dpto.) (Province) País (Country) 20-4-15 72 HuesuQuilla El A/To, SALISCO MEXICO 7. Nacionalidad 8. Sexo (sex) 9. Estado civil (Marital status) (Nationality) Masculino Femenino Soltero (Quien nunca se Casado Viudo Divorciado Separado (Male) (Female) haya casado) (Married) (Widowed) (Divorced) (Separated) MEXI (Single (never married) Incluyendo mi matrimonio actual, me he casado veces. (Including my present marriage, I have been married times.) 10. Ocupación (Occupation) 11. Domicilio actual (Present address) TIJUANZ. BC.MEX HOUSE WIFE / DONESTIC CA, DEl PAROUS #11 Amplacion GUAYCURA 12. Nombre completo, domicilio, Tugar y fecha de nacimiento del cónyuge (dé el apellido de soltera de la esposa) (Name, address, date and place of birth of wife/husband (Give maiden name of wife) ) Fecha y lugar en que se celebró el matrimonio (Date and place of marriage) 6-8-34 ESTE CUESTIONARIO SE OBTIENE GRATIS EN CUALQUIER OFICINA CONSULAR DE LOS ESTADOS UNIDOS THIS FORM MAY BE OBTAINED FREE AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}