{
  "anumber": "A41803955",
  "id": "A41803955_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization and Adjustment of Status, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/24/2023 AND ID 11EA OMITTED ITEMS: Complete Items on the petition. OATH/AFFIRMATION: Petition must be notarized (belonw item (19) by Notary Public. This service is available at the nearest INS Office. (applies to older I-130's only). ITEM 16/CONSULATE DESIGNATION: Fully complete this item, as beneficiary may not be eligible to adjust status within the United States. ITEM 13/MARRIED BENEFICIARY: This item may have been incorrectly marked. Please revi and make any correction. Initial any correction. IE the item was correctly marked, then be sure and also complete item #14. ERROR(S) ON PETITION: Please review the petition. It appears that item(s) have been marked in error. Resubmit after making any necessary correction Initial all corrections. TRANSLATION: All foreign language documents must be accompanied by English translation All English translations must be accompanied by foreign language documents. PHOTOSTATIC COPIES: Photostatic copies are not acceptable unless they have been seale- or stamped (certified) by the issuing office. Resubmit the petition with certified copies. If you wish for the copies to be returned to you, then also attach a set of photostatic copies for Service retention. VERIFICATION OF STATUS: This office has been unable to verify your present status, as being a lawfully admitted permanent resident or a naturalized United States citizen. Resubmit the petition in person at the nearest INS Office. Bring with you your naturalization certificate, or your alien registration receipt card. PRIORITY DATE: A claim is made with the petition that the beneficiary is entitled to a priority date other than the date of filing of this petition. Resubmit the petition with evidence to substantiate that claim. Such evidence may be in the form of an original copy of a letter of notification of priority date, as issued by an American Consulate. Any evidence provided must be in the original, or be a certified copy. SECONDARY EVIDENCE REQUIRED: It has been determined that the documents provided do not clearly establish the relationship alleged. Resubmit the petition together with further evidence regarding the For you: convenience a list of examples of acceptable evidence is attached. Any other evidence you submit will also be considered before a final decision is made. CERTIFICATE OF NON-EXISTENCE OF RECORD: For petition approval, the Service requires submission of primary evidence, where available. Primary evidence consists of birth/ marriage/divorce/death records, as issued by the appropriate state authority. Secondary evidence in the form of affidavits/school records/church records are not accepted when primary evidence is available. Service records indicate that such primary evidence is available from the state/country where the event in question took place. Therefore, resubmit tlie petition with a copy of the , or a LETTER OF NON-EXISTENCE OF RECORD for that event from the governmental authority having jurisdiction over those records. BIRTH CERTIFICATE: Submit a certified copy of the birth certificate of An English translation must be provided if the document is in a foreign language. DELAYED BIRTH CERTIFICATE: It is noted that the birth certificate of was a delayed registration, net recorded until years after the event. Therefore, further evidence is requested to establish the relationship. Please see the attached list for examples of evidence which may be submitted. NO MOTHER'S NAME: 1L. is noted that the name of the mother is not shown on the birth certificate of You are, therefore, requested to submit supporting evidence to establish the claimed relationship. BAPTISMAL CERTIFICATE: Submit a certified copy of the haptismal certificate of MARRIAGE CERTIFICATE: Submit a copy of the certificate showing the marriage between and If the document is in a foreign language, an English translation must lie attached. NATURALIZATION CERTIFICATE: Your certificate need not be resubmitted with the petition."
}