{
  "anumber": "A41804438",
  "id": "A41804438_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0063/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Dr Lal PathLabs Pvt Ltd, 51074"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 A Lat PathCabs Per Led Do Lal PathLads Pv Ltd Do Lee Pack Cals Pic Ltd zo Eat Pathlets Put Led a Eat Path Sabs Put Ltd a Lal PathCals Put Ltd D. Eas PathCals Pue Ltd a Lat a Last Pathdash Put led Dr Las Led a Lat PathCash Per the a Las Parkers Par and a Last Packlabe Pot Ltd Dr Eat Put Ltd D Eat Las Participa Do Pechlels Piz 20d D Lat Led 2 Las Park Cabs Put Ltd Is Let Par Led a Last Passents Pet Les Dr Ent Per the Do Lat the PashCabs Put eix Do Lat Park ltd 2. Red Pack Cals Pu Ltd 2 Lat Due ever a Lot ded a Packlabs Packages For dal Pedrate Particular Do dat Rest del Pass Pack Dr Lal PathLabs Put the Ltd a Last End cat Lat Lat Pathlets Pu Ltd a Cat Pathdate Put a PathLabe Pur Ltd D Put Led Dr Lat Particular Put Ltd a Lae Parkshake Put Da Eat Eat Public Put the D Ent 'ESKAY HOUSE' 54, HANUMAN ROAD, NEW DELHI-110 001 Put Ltd Dr cat Put Ltd Dr Lat Let Produce Pue the a tel Pur led a cat that Public to Bat Lat Pare PHONES 3746426 (4 Lines), FAX 91-11-3341638 Paticals a dat For End Patheth Path Cats the a Lat Do Las is Pathless Pic 200 a las Packlabs Pur to a Eat Pathlate Put Ltd a Lut Pathlate Put Pw Dr. set Patheta Cal Path Cals Put Ltd Dr Lat Put Ltd Dr Lat PathEd Par Red a Lat PackCake Pic Drie Da eat Par the Do Las Pet led a Lat Particular a Lat Animal Due 2d the Last Pic us Pie Ltd a Put the But Pathdate Por the Ltd Do eat Pack a Las Package Put Dr Lat Pur ltd a Eat Parking Put Vandana Dr del a Pie Pie Led a Lal Pathlabe Pie ded 24 Eat Packcost Por Let Pre Do Las Past Colo car DR. ARVIND LAL Por Ltd Dr Lat Put Lat Pachana Die DR. VANDANA LAL era a Eat Particular PathCade Pho M.B.B.S., D.C.P. Ltd ital Packleis Pus Lal Pashcals Put Ltd Zed Pathful M.B.B.S., M.D. (Path) But Ltd Da Col Phillips Dr Cod Do Ltal Put Detail Dr dal Da Las the Put Do Packdada Pue Ltd D Las Parking Pu tea Do Lat Put Lik Dr Lat Dr Do las Pue Lat Put the Cat Restate 20 Put Lat Lot Put a R Path Cals Photos Publidada DHIAN SINGH UPPAL [F-177823] [ G. PARK NAME 510741 Ltd LAB. NO. Lat Pathetabe Put Ltd Parking Put Lat Dr. Shakuntala Dawesar, MBBS Path Cabs Put Ltd Parents Eat REFERRED BY Path Eats Put Ltd CORP Ltd 2 248 PathLabs Pus Ltd ACCT. STATUS Pathlash Pur Put Lid D Last Put Led D Lae Putchdals 03-11-97 Due 2th Dr Lae Put Ltd 91 Years DATE Male Pur Led AGE SEX Di 201 Put Particular Test Name Result Lal Participa Units Patients lot Ref Range SEROLOGY & IMMUNOLOGY U.S. Visa V.D.R.L. Non Reactive Antibody to HIV-1 & 2 (ELISA) Non Reactive Interpretation : 1. A NON REACTIVE result implies that no Anti HIV-1 or Anti HIV-2 antibodies have been detected in the sample by this method. This means that either the patient has not been exposed to HIV-1 or HIV-2 infection or the sample has been tested during the \"WINDOW PHASE\" ( before the development of detectable levels of antibodies). 2. A PROVISIONALLY REACTIVE / BORDERLINE REACTIVE result suggests the possibility of HIV-1 or/and HIV-2 infection. However these results must be verified by a confirmatory WESTERN BLOT-1-2 test before pronouncing the patient positive for HIV-1 and/or HIV-2 infection. 3. Please Note that very high levels of IgM Antibodies or Anti-HLA ABC and DR Antibodies can give false positive reactions."
}