{
	"anumber": "A41803955",
	"id": "A41803955_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0002/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 14 20595"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/24/2023 OMB APPROVAL NO 1405-0015 EXPIRES: 8-31-92 ESTIMATED BURDEN 1 HOUR APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART I - BIOGRAPHIC DATA INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not Applicable should be so marked. If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent explusion from the United States. This form is Part I of two parts which, together with Optional Form OF-230 PART II, constitute the complete Application for Immigrant Visa and Alien Registration. 1. FAMILY NAME FIRST NAME MIDDLE NAME MOHINDER KAUR 2. OTHER NAMES USED OR BY WHICH KNOWN (If married woman, give maiden name) MOHINDER KAUR 3. FULL NAME IN NATIVE ALPHABET (If Roman letters not used) same as above 4. DATE OF BIRTH 5. AGE 6. PLACE OF BIRTH (Day) (Month) (Year) (City or town) (Province) (Country) 01 01 1907 85 Yrs. Mitha Tiwana Pakistan 7. NATIONALITY (If dual national, 8. SEX 9. MARITAL STATUS give both) INDIAN Male Single (Never married) Married Widowed Divorced Separated Female Including my present marriage, I have been married - times. 10. PERSONAL DESCRIPTION a. Color of hair Black c. Height 160 come 11. OCCUPATION Housewife b. Color of eyes Black d. Complexion fair 12. MARKS OF IDENTIFICATION 13. PRESENT ADDRESS Black scar on chin 325/16, civil lines Guegoan (Hasyana) Telephone number: Home 83-20373 Office 14. NAME OF SPOUSE (Maiden or family name) (First name) (Middle name) Late.GURDIT SINGH Date and place of birth of spouse: Pakis Address of spouse (If different from your own): NA 15. LIST NAME. DATE AND PLACE OF BIRTH, AND ADDRESSES OF ALL CHILDREN NAME DATE AND PLACE OF BIRTH (SM) FOIA (b) (6) (son) Hardit sample Pakistan Mohali / Chandigaes INDIA (Dayfull Indeejit Kaur (Regeaes) Pall Guegoon (Honjana)/ INDIA (do) Kastar Kaus Pak Preen Kaur Guegoon (Haryana) INDIA (do) Pak Delhi (Janak Puri)I INDIA (day jaggit caus Pall Punjas (Khanna) INDIA (do Pritam caus Pals Pahar Ganj / Deair INDIA THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA OPTIONAL FORM 2301 (ENGLISH) NSN 7540-00-149-0919 REVISED 4-91 50230-106 Previous editions obsolete DEPT. OF STATE"
}
