{
	"anumber": "A41826829",
	"id": "A41826829_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE # 198171, CERTIFICATE"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1939]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 TO WHOM MAY CONCERN: CERTIFICATE # 198171 SPAWISH BIRTH CERTIFICATE TRANSLATED IN THE ENGLISH LANGUAGE. BIRH CERTIFICATE STATES THE FOLLOWING INFORMATION. I JESUS MA. OCAMPO MUNICIPAL PRESIDENT AND OFICIAL OF THE CIVIL DEPT. OF THIS MUNICIPAL AREA. P.M.D.L. CERTIFIES THE FOLLOWING. THE ORIGINAL RECORDS INDICATE. TTO THE YEAR 1939 (BOOK) PAGE 31 NUMBER104 THAT A BIRTH TOOK PLACE AND OFICIALY SAY!S ,ON PAGE 104 THAT- IN HUEJUQUILLA EL ALTO JALISCO AT 9 OCLOCK IN THE MORNING 16 OF MAY 1939- CAME BEFORE ME JOSE NUNEZ OFICIAL OF THE CIVIL RECORDS CAME MR PAULIN DIAZ, A MARIED AGRICULTURER OF 56 YEARS OF AGE NEIGHBOR OF THE RANCH OF MARGARITA. WHICH HUEJUQUILLA EL ALTO JALISCO HAS JURISTICTION ON. STATED THE FOLLOWING. INFORMATION THAT ON THE 7TH OF MAY AT 0400 HOURS IN THE RANCH OF MARGARITA, WAS BORN IN 3RD PLACE A GIRL LIVE AT BIRTH WHO WAS NAMED PETRA DIAZ , DAUGHTER OF VICTORIO DIAZ AND MARIA GONZALEZ THE FATHER\"S AGE WAS 30YEARS OLD, AND THE MOTHER WAS 25 YEARS OLD BOTH LIVED IN RANCH OF MARGARITA . GRAND PARENTS OF NEWBORN CHILD WERE PAULIN DIAZ-AND RAMONA DE LA TORRE ON THE FATHERS SIDE AND ON THE MOTHERS SIDE WERE MATEO GONZALEZ AND - MARIA REFUGIO BONILLA. ALL GRAND PARENTS WERE OF METIZO COLLOR. DEVOTED MEXICAN COTHOLICS. THE NEW BORN CHILDS. DIGITAL PRINTS WERE TAKEN. AND REGISTERED. WITNESES WERE JUAN MEDINA AND RUMALDO CARILLO. BOTH WELL RESPECTED , AND MARIED MEN. SO WAS THIS THIS DOCUMENT WAS WRITEN AND COMFIRMED BY J. NUNEZ ENCHARGED OF HUEJUQUILLA EL ALTO JALISCO RECORDER AND CIVIL DEPT. THIS IS A TRUE AND CORRECT COPY OF THE ORIGIAL TAKEN OUT FOR LEGAL PORPUSES. TO WHOM IT MAY CORESPOND TO LEGAL MATERS. HUEJUQUILLA EL ALTO, JALISCO. MARCH 7 1975 THE MUNICIPAL PRESIDENT AND ENCHARGED OF CIVIL RECORDS JESUS MA. OCAMPO JAIME."
}
