{
	"anumber": "A41826829",
	"id": "A41826829_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (80-01-85) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981, 1936, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department or Justice Screened by NARA 4/18/2023 OMB No. 1115-0054 Immigration and Naturalization Service (IN Petition for Alien Relative Expires 4-86 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp FEE PAID U.S. APPROVED INS, JUN 04 1981 A# WESTERN ADA CENTER G-28 or Volag# # SAA 890295 $ 35 00 JUL 14 1986 Section of Law: Petition was filed on 6.4.80 (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) J.W. Wating Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Document Check Stateside Criteria 203 (a)(5) WAC #7 Field Investigations I-485 Simultaneously AM REMARKS: CON: Dynamic A. Relationship 1. The alien relative is my: 2. Are you related by adoption? Doure Husband/Wife Parent Brother/Sister Child Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name un CAPS) (First) (Middle) HERNANDEZ PETRA DIAZ GONSALEZ CRESCENCIA DIAZ 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 7272 9TH ST. 7272 9TH ST . (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) BUENA PARK, CALIFORNIA 90621 BUENA PARK, CALIFORNIA 90621 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) HUEJUQUILLA EL ALTO, JALISCO MEXICO HUEJUQUILLA EL ALTO, JALIS CO MEXICO Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) (Mo/Day/Yr) Male Married Single Male Married Single Female Widowed Divorced 4-20-15 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) PETRA DIAZ GONSALEZ MARIA CRESCENCIA BONILLA 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 8-28-56 HUEJUQUILLA EL ALTO, JAL. MEX 6-8-34 HUEJUQUILLA EL ALTO, JAL MEXICO 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) NONE NONE 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended NONE NONE NONE NONE but Naz segh and and returned. correct CODY 13. If you are a U.S. citizen, complete the following: truo 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) USINS 14. Yes No 24 JUL 1936 Birth in the U.S. If your relative is currently in the U.S., complete the following: Naturalization contact He or she last arrived as a (visitor, student. exchange allien, crewman, 8-1-85 Give number of certificate, date and place it was issued stowaway, temporary worker, without inspection (etc.) #12265497 PETITION #533561 L. A CALIF. N/A Parents Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No If \"Yes\" give number of certificate, date and place it was issued Date authorized stay expired, or will expire as shown on Form I-94 or I-95 15. Name and address of present employer (if any) 1717 S. we st st. 14. If you are a lawful permanent resident alien, complete the following. EMERALD OF ANAHEI EL.Anaheim Calif Date and place of admission for, or adjustment to, lawful permanent Date this employment began (month/day/year) residence: NONE 5-9-84 INITIAL RECEIPT RESUBMITTED RELOCATED IMPLETED Rec'd Sent Approved Denied Returned wing 1986 Form I-130 (08-01-85) N gel"
}
