{
	"anumber": "A41826829",
	"id": "A41826829_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICA QUE EN LOS LIBROS, 198177"
		},
		"years": {
			"ms_years_nlp_v1": [1956, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 198177 EJECUTIVO DEL EL C. Jesús Ma. Ocampo Jaime Preisidente Municipal y Oficial POOR del Registro Civil de éste lugar. P. M. D. L. CERTIFICA QUE EN LOS LIBROSOriginalespe ACTAS DEL REGISTRO CIVIL DE este lugar JALISCO CORRESPONDIENTE AL AÑO DE 1956 mil novecientos cincuenta y seis TESORERIA GENERAL A FOJAS 7 siete DEL Y BAJO EL NUMERO 12 doce ESTADO CONSTA UNA PARTIDA DE Matrimonio QUE TEXTUALMENTE DICE: A1 Margen.-Número 12.-Doce.-Matrdmonio Civil de Manuel Her- nández Ramirez y Petra Diaz Gonzalez.-Suatro huellas digita- les.-Dentro.- En Huejuquilla el 1 Alto, Jalisco a las 17 dieci- siete horas del día 28 veintiocho de Enero de 1956 mil nove- cientos cincuenta y seis se trasladó el C. Eufemio Rentería Oficial del Registro Civil de este lugar, a la casa número - 100 cien de la calle Allende de esta Población donde compare Limit ció Manuel Hernández Ramirez soltero agricultor, mexicano de 23 veintitres años de edad, sabe leer y escribir, originario y vecino del Rancho de Margarita de este Municipio hijo legí timo de Antonio Hernandez finador y Luz Ramirez que vive, y - DEPARTMENT Petra Dfaz Gonzalez, cel be sin profeción mexicana de 17 - per diecisite años de edad, originaria y vecina del Rancho TEMORE rita de este Municipio, hija lecitima de Victotio Diaz y Ma- Assorted GENERAL ADD ría González que viven, quienes manifestaron su voluntad de MACTENDA ALTO nirse en Matrimonio Civil optando conciente y deliberadamen te por el régimen de la Sociedas legal los interesados cum- plieron con todos los mandatos de Ley, se cumplió con lo or- denado por el artículo 91 noventa y uno del Codigo Civil COM mo consta en el expediente relativo a este Matrimonio marca- do con el número de esta acta y que obra en el archivo res-- pectivo a cuyos documentos se les dio lectura en presencia - de los interesados y testigos y no habiendoce denucado impe dimento alguno el C. Oficial del Registro Civil declaró uni- dos en nombre de la Sociedad y de la Ley en Legítimo Matrimo nio Civil a Manuel Hernández Ramirez y Petra Diaz González, quienes imprimieron sus huellas digitales al márgen de esta acta. Fueron testigos los C. C. Agustin Navarrete, Santos -- Ramirez y Camilo Ramirez, mayores de edad. Se ley6 y confor- VALOR $ 10.00 mes firmaron. E. Rentería. -Rúbrica. - Manuel Hernández. Rúbri-"
}
