{
	"anumber": "A41804894",
	"id": "A41804894_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804894_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Adjustment of Status,, I-412."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 TO THE SECRETARY OF STATE: JUL 10 1981 REMARKS The petition was filed on The petition is approved for status under UNITEAST. PERSONAL INTERVIEW CONDUCTED section: 10 DOCUMENT CHECK ONLY FIELD INVESTIGATION COMPLETED SPOUSE DATE 201 (b) CHILD 203 (a) (2) APPROVAL PREVIOUSLY FORWARDED OF ACTION 201 (b) PARENT 203(a)(4) NEW DELHI of DD NEW DELHI, INDIA. 203 (a) (1) 203 (a) (5) DISTRICT REMARKS (Continued) NOTEN No 11280388 last 1 to Harcharan Singh Judge S & & R 4/16/81 Pet Ben Other area notz on Riverside, Cq. of relatio uship Death 53 R SEEN & RETURNED Diverce (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 20 Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in DELHI, INDIA (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Natua- lization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 21. My residence in the United States is: (C/O. if appropriate) (Apt. No.) (Number and Street) (Town or city) (State) (ZIP Code) 4454 JUPITER DRIVE, RIVERSIDE, CALIFORNIA, 92505, USA. 22 My address abroad (if any) is: (Number and street) (Town or city) (Province) (Country) 23. Last address at which I and my spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) RiVERSIDE, CALIFORNIA 1 USA. 4454 JUPITER DRIVE JAN. 1979 - To DATE 24. Address in the United States where beneficiary will reside (City) (State) 4454 JUPITER DRIVE, RIVERSIDE CALIF 92505 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) ABOVE ARORBANS PRESS, KATRA SHERSINGH, AMRITSAR, PUNJAB, INDIA 26. Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) 27. If this petition is for a child, (a). Is the child married? (b). is the child your adopted child? If so, give the names, dates. and places of birth of all other children adopted by you. If none, so state. 28. If this petition is for a brother or sister, are both your parents the same as the allen's parents? YES If not, submit a separate statement giving full details as to parentage. dates of marriage of parents, and the number of previous marriages of each parent. 29. If separate petitions are also being submitted for other relatives, give names of each and relationship ta.petitioner. NOT WITH THIS PETITION 30. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result. 31. If beneficiary is in the United States, give the following information concerning beneficiary: (a) Last arrived in U.S. On (b) Last arrived in U.S. as (c) Date beneficiary's stay expired or will (Month) (Day) (Year) (Visitor, student, exchange alien, crewman. stowaway, etc.) expire as shown on his Form I-94 or I-95 Name and address of present employer (e) Date alien began this employment"
}
