{
	"anumber": "A41826802",
	"id": "A41826802_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826802_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICA QUE EN LOS LIBROS ORIGINALES DE ACTAS DEL REGISTRO CIVIL DESAN JUAN DE LOS LAGOS, JALISCO, 352584"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1984, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 2 No. 352584 FOLIO C ELC DR. JOSE DE JESUS GARCIA CUELLAR. OFICIAL DEL REGISTRO CIVIL DE ESTA CIUDAD CERTIFICA QUE EN LOS LIBROS ORIGINALES DE ACTAS DEL REGISTRO CIVIL DESAN JUAN DE LOS LAGOS, JALISCO CORRESPONDIENTE AL AÑO DE 1915 MIL NOVECIENTOS QUINCE A FOJAS 4 frente Y BAJO EL NUMERO 854 OCHOCIENTOS CINCUENTA Y CUATRO UNTAMIENTO CONSTA UNA PARTIDA DE NACIMIENTO TITUCIONAL QUE TEXTUALMENTE DICE: SAN JUAN DE LOS os, JALISCO A1 margen Número 854 ochocientos cincuenta y Cllatro.s Nacimien THO CDDS to: de ZACARIAS ORTEGA. DENTRO: En San Juan de los Lagos, a 9 nueve dé Noviembre de 1915 mil novecientos quince, a las 10-30 diez treinta minutos de 1a mañana compareció ante el Ciudadano LAGOS, Presidente Municipal Encargado del Registro Civil, el ciudada- no Hipolito Ortega viudo, albañil, vecino de este lugar, y di- E DOCUMENTO NO jo: que el 5 cinco del presente a las 5 cinco de la mañana en- VE VALIDEZ SIN SELLO OFICIAL REGISTRO CIVIL esta ciudad, nació un niño que 11eva por nombre ZACARIAS el -- RRESPONDIENTE cual presenta vivo en esta oficina, hijo legítimo de Ynes Orte ga y María Magdaleno.- Abuelos Paternos: el compareciente y Re fugio Martín, maternos: Martín Magdaleno y Camila Reyes. Fue-- ron testigos: los ciudadanos Porfirio Perez y Cayetano Martín- casados, comerciantes y vecinos de esta ciudad. Leída 1a pre-- sente fueron conformes y no firmaron por no saber.- - una firma. ES COPIA QUE CONCUERDA FIELMENTE CON SU ORIGINAL SAN JUAN DE LOS LAGOS, JALISCO DICIEMBRE 31 DE 1984 EL OFICIAL DEL REGISTRO CIVIL REGISTRO CIVIL LACOSI extrail DR. JOSE DE JESUS GARCIA CUELLAR ara Certificados el Registro Civil COTEJO BPA amha. Estado de Jalisco $0.00 I T FGJTI-17 B"
}
