{
	"anumber": "A41804438",
	"id": "A41804438_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( Rev 4 9/2019"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1942, 1972, 1992, 1906, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 U.S. Department of Justice OMB 1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# 11/02/92 LIN-93-022-51302 LJH001 G-28 or Volag Section of Law Petition was filed on (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) Pet 201 (b) parent Ben \"A\" File Reviewed 203 (a)(4) Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: A. Relationship 1. The alien relative is my 2 Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1 Name (Family name in|CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) UPPAL JOGINDER SINGH UPPAL DHIAN SINGH 2. Address (Number and Street) (Apartment Number) 2 Address (Number and Street) Apartment Number) 210 CIRCLE AVE (APARTMENT#201) A-3/15 JANAK PURI (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State Country) ZIP/Postal Code) FOREST PARK ILLINOIS - 60130 NEW DELHI INDIA-58 3. Place of Birth (Town di City) (State/Country) 3 Place of Birth (Town or City) (State Country) RAWALPINDI W. PAKISTAN VILLAGE DAULTALA, RAWALPINDI, W.PAKISTAN 4 Date of Birth 5 Sex 6. Marital Status 4 Date of Birth 5. Sex 6 Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 6-30-1942 Female Widowed Divorced 1-13-1906 Female Widowed Divorced 7 Other Names Used (including maiden name) 7. Other maiden NONE Names Used (including name) SING+ DHIAN 8 Date and Place of Present Marriage (if married) 8 Date and Place of Present Marriage (if manner!) NEW DELHI, INDIA, 6-29-1972 N/A a Social Security Number in Alian Registration Number 9 Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) 384-06-7367 A-91804436 11 Names of Prior Husbands/Wives 12 Date(s) Marriages(s) Ended 11 Names of Prior Husbands/Wives 12 Date(s) Marriages(s) Ended NOT APPLICABLE NOT APPLICABLE N/A N/A 13. If you are a U.S. citizen complete the following: 13. Has your relative ever been in the U.S My citizenship was acquired through (check one) Yes No Birth in the US 14 If your relative is currently in the U.S. complete the following: He or Naturalization (Give number of certificate date and place it was issued) she last arrived as a (visitor student stowaway without inspection etc ) N/A Parents Arrival/Departure Record (1-94) Number Date arrived (Month Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired or will expire as shown on Form 1-94 or 1-95 11 \"Yes\". give number of certificate date and place it was issued 11614770,2-9-82 SANFRANCISCO, CALIF. 15 Name and address of present employer 14a If you are a lawful permanent resident alien, complete the following NONE Date and place of admission for or adjustment to lawful permanent residence Date this employment began (Month Day Year and class of admission NOT APPLICABLE N/A 16 Has you relative ever been under immigration proceedings? 14b Did you gain permanent resident status through marriage to a United Yes No Where When PMA States citizen or lawful permanent resident? Yes No exclusion Net APPLICABLE Deportation Recission Judicial Proceedings RIA INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED MR. Res d so OCT 1992 Sent Approved Denied Returned Form 130 (Rev 41191) Y"
}
