{
	"anumber": "A41804438",
	"id": "A41804438_0058",
	"page_index": 58,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0058/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "by NARA. cat PackCabs Pue Led Do Lat Parkials Pue Ltd Dr Ltd Pack Cals Par Ltd a Put Ltd Dr Put Led a Eal PathCabs Pue Led Dr Lal Parkists PUE Ltd Dr Lat Participants Lat PathCabs Put Led Dr Lal PathCabe Due led Do Lal PathCabs PUE Ltd Dr Lal PathCabs Put Ltd Do Lal PathCabs Pue Led Dr Lat PathCabs Pue Led Dr Lal Pathless Fue Ltd Dr Las PathLabs a cat PackCabs Put Ltd Dr Lal Ltd Dr Ent Path Cabs Put Ltd Dr Lal Path Cabs Par Ltd Do cal PathClabs Pue Ltd Dr Lal Patkfals Put Ltd Dr Lae Pathlass Put Led Dr Lat Pacifals a Lat PathCabs Put are Dr Cal Pat Dr Eat PathClabs Put Led Dr Lal Pack Cabs Due Ltd Dr Lat Path Cabs Pue Ltd Dr Lal PathLabs Par Led Dr Lat PathCabs Por Ltd Dr Eat PathCabs Do Lat PathLabs Put Ltd Do Lal Path Lal Path PathCab ltd Dr Lal Pathicab Pus Ltd a Lal Pat Dr Lal Pack Cass Poe Led Dr Lat Pas Ltd Ltd Dr Lat PackCass Par Led Dr Lat PathClabs Ltd Dr Las PathEals Par Ltd Do Eat Path Cabs Ctd Dr Lat PathEals Par Ltd Dr Lal PathCads Dr Lat PathCabs Put Ltd a Lat Pat D Ltd Led Dr Lat Parkins Put Led Dr Lal PathCabs Do Lat PathLabs Put Ltd Do Lat Path Cabs Put Ltd Dr Lat Path.Cabs Pue Ded Dr Lal PathLabs Put Ltd Do Lal Pue Ltd Dr Eal PathLabs Pue Ltd Do Lal Put dtd Dr Lat PathLabs Dr Lat Path Cabs Put ltd a Lal Pack Cabs Pue Ltd a cal 'ESKAY HOUSE 54, HANUMANROAD NEW DELHI-110 PathCass Put Ltd Dr Lat Package Pue Ltd Do Eat PathCabs Dr cat PathCals Put Ltd Dr Lal PathCabs Put Ltd Dr Lat Path,Labs Put Ltd Lal Packdab Put Ltd Dr Lae Packlab For ded Dr Lal PathCads Dr Lal RathCads Put Ltd Dr Eal PathCabs Put Ltd Do Lat Path PHONES 3746426 (4 Lines), FAX: 91-11-3341638 Lal Packcads Put Ltd Dr Lue PathCabs For Ltd Dr Lal PathLabs Dr Lat PathCads Put Ltd 20 Lal PathCals Put Ltd Dr Lat PathCabs Due Led Dr Lat Path Cabs Pue Lal PathCabs Put Ltd Dr dae PathCabs Put Ltd Dr Lat Path Case Pur Ltd Do Lal PathCubs Do Lal Pacheads Pit Led Dr Lat PathLabs Pue Led Dr Lal PathCabs Pur Ltd Dr Lat Pack Cass Put Ltd Dr Lal Path Cads Por Ltd Dr Lat PathCubs Put Ltd Dr Lal Pathlish Put Ltd Dr Lat PathClabs a Lat PathCabs Put Ltd Dr Lat PathCabs Pac Ltd cat Pack Cabs Pue Ltd Dr Lal PathCabs Put Led a Lat Path Cabs Da Eal Pathlabs Put Ltd Dr Lat Parklabs Pot Ltd Dr Lal PathCabs a Lat Packcabs Pue Led a Lat PathClabs Put ccd Lal Pancals Put Ltd Dr Lat PathCabs Put Led Dr Lal PathClabs Da Eat Park Cabs Put Ltd Dr Lat Parkets Pue Led Dr Lat Patchans Dr Lat Picklabs Put Ltd Do Lal Path Cabs Put Put Led Dr Lal PathCabs Put Ltd a Lal Path Cabs Put PathCale PA Dr Eat PathClabs Put Ltd Do Lal PathLabs a Lat Packcabs Put Ltd Do cat PathCabs Put arwind Due Ltd Dr Lal PathCals Pul Ltd Dr Lal PathCabs Pac andana al Ltd Eat PackCals Put Ltd Dr Lal Path Cals a Lal PathCabs Put Ltd a Lae PathCads PathCabs Pue Led Dr Eat PathCabs Pue Ltd Dr Lat PathCabs Put Ltd Lal Pathdads Due Led Dr Lal Path East Dr Eat PathCabs Put Led Dr Lat Path Cabs DR. ARVIND LAL Pue Led Dr Lal PathLabs Put Led Dr Lat PathCabs Put DR. VANDANA LAL Ltd D Lat Due Led Dr Lat PathCals Do Lat PathCals Pue Ltd Dr Lat Path Cabs Pie Ltd M.B.B.S., D.C.P. Pue Led Dr Lal PathCabs Put Ltd Dr Lae PathCass Put Ltd M.B.B.S., (Path) Led Dr Last Pack Cabs Put Ltd Dr Lat PathCabs Do Cal PathCals Por Led Do Lat PathCads Put Ltd Dr Let PathCabs Put Ltd a Lal PathLab Put Ltd Dr Lat PathCals Put Ltd Dr Lat PathCabs Pur Ltd a Lal PathLabs Par Ltd Dr Lat Path Cabs Dr Lal PathCals Put Led Do Lat Pack Labs Put Led Dr Lat PathCabs Put Led Dr Lal PathCabs Pue Ltd Dr Lal PathCabs Put Ltd Dr Lal PathCads Put Ltd Dr Lae Pathlah Due Ltd Dr Lal PathLabs Dr Lat PathCabs Due Ltd Dr Lat Park Cabs Pue Ltd Dr Lat Path Cass Put Led Dr Lat PathClabs Put Ltd Dr Lat PathLabs Put Ltd Dr Lal PathCabs Put Ltd Dr Lat PashCabs Pus Led Dr Lae PathCals Dr Lal Pack Cabs Pue Led Dr cal Pathlaks Puc Ltd Lat PathCabs Put Ltd Dr Lat PathCabs Put Ltd Dr Lat PathCabs Put led Dr Lat PathCabs Put Ltd Dr Lal PathCabs Put led D2 Lal PathCabs Dr Lat Pathdade Put Ltd Dr Lat PathCabs Put Ltd Lnd Path Cabs Pur Ltd Dr Lat PathClabs Pue Ltd Dr Poe Led Dr Lat Pack Cabs Put Ltd Do Lat PathCabs Put Ltd Dr Lat PathCabs Dr Lat PathCabs Put Ltd the Put Lat PathLabs Put Dr Lat DHIAN SINGH UPPAL [F-177823] G. And Da Led Dr Lat Path Cabs Lat Led Dr PARK LAB. NO. 277934 Ltd NAME Due Mah Pin A Pack Cubs cat PathCals Dr Lal PathCabs Put Led Dr Lat PathCabs Put Ltd Dr Lal PathCabs Put Led Dr Lat PathCabs Put Ltd Dr Lat PathLabs Due Led Dr Lal Path Cabs Pue Ltd Dr Lat PathClabs Dr Lat PathLab Put Led Dr Lat PathCabs Put Led Dr Lat Path Cabs Due Ltd Dr Lal Path Cabs Pus Led Dr Lal PathCabs Put Ltd Dr Lat PathLabs Put Ltd Dr Lat Pasklabs Put Led Dr Lal PathCads Dr Lat Lat Path REFERRED BY Path Dr. Shakuntala Dawesar MBBS Put Dr Dr Lat Lal PathCars Put Put Led Ltd ACCT. STATUS Put CORP Danzal Pathfabs Put Due Led Ltd a Lat Lat Pathlabs Ltd PathCabs PathCase a Lat PathLabe Put Ltd Dr Lat PathClabs Par Ltd Dr Lat PathCals Put Led Dr Eat PathCaks Put Ltd Dr Lat Path Cabs Pue Ltd Dr cal PathCabs Put Led a Lat Pack East Put Led Dr Lat PathCass Dr Lat PathLabe Put Led Dr Lat Path 11-09-96 Path Cals Par Ltd Dr Lat Pash Labs Put Ltd Dr Lat PathLabs Pue Led Lat PathCabs Put Ltd PathClubs Lal PathCase a Lat DATE Pue Leid Dr Lat PathCabs Poe Led AGE SEX Male PathCabs Dr Lat Pack Cabs Put Ltd Dr Lat Path Labs Put Ltd Dr Lat PathCas Pue Led Dr Lat PathEals Put Ltd Dr Lat Path Cabs Put Led Dr Eat Pathlabs Put Led Dr cat Packlands Put ded Do Lat PathCabs Dr Lat Path Cabs Put Ltd Due Led Dr Lat Path Cabs Due Led Dr Lat PathCabs Put Ltd Dr Ltd Dr Lat Pathlah Do Eat PackCals Ltd Da Lal PathCabs Dr Lat PathCake Put Ltd Test Name Led Dr Lat PathCabs Put Ltd Dr Lat PathLabs Put Ltd Dr Result Ltd On Lat Park Units Dr Lat Path Cal Ref. Range a cat Path Cabs Put Ltd Dr Lat PathCabs Put Ltd Dr Lat Path Cabs Put Ltd Dr Last Path Cabs Pot Ltd Dr Eat PathCabs Put Ltd Dr Lat PathCabs Put Led Dr Lai PathClabs Put Ltd Dr Lat PackCabs Dr Last PackCabs Put Ltd Dr Lat PathCabs Pue Ltd Dr Lill PackLass Put Ltd Dr Lat PathCabs Put Ltd Dr Lat PathCabs Par Ltd Dr Eat PathCabs Put Ltd Dr cat Pathfab Put Ltd 2 Eat PathCad SEROLOGY IMMUNOLOGY U.S. Visa V.D.R.L. Non Reactive Antibody to HIV-I & II (ELISA) Non Reactive Interpretation : 1. A NON REACTIVE result implies that no Anti HIV-I or Anti HIV-II antibodies have been detected in the sample by this method. This means that either the patient has not been exposed to HIV-I or HIV-II infection or the sample has been tested during the \"WINDOW PHASE\" ( before the development of detectable levels of antibodies). 2. A PROVISIONALLY REACTIVE / BORDERL INE REACTIVE result suggests the possibility of HIV-I or/and HIV-II infection. However these results must be verified by a confirmatory WESTERN BLOT-I-II test before pronouncing the patient positive for HIV-I and/or HIV-II infection. 3. Please Note that very high levels of IgM Antibodies or Anti-HL ABC and DR Antibodies can give false positive reactions. Dhan Singh x"
}
