{
  "anumber": "A41803955",
  "id": "A41803955_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO DETERMINE RETURNING RESIDENT STATUS, DSP-117"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1907,
        1990,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/24/2023 A-41803955 N/R Mana EXPIRATION DATE: 00-00-00 ESTIMATED BURDEN: 30 MINUTES* U.S. DEPARTMENT OF STATE SBT APPLICATION TO DETERMINE RETURNING RESIDENT STATUS Oct-16/92 INSTRUCTIONS: This is an application for Special Immigrant Status under Section 101(a)(27)(A) of the Immigration and Nationality Act, for lawfully admitted permanent residents who are returning from a temporary visit abroad. To qualify you must submit evidence that: (1) You had the status of an alien lawfully admitted for permanent residence at the time of departure from the United States; (2) You departed from the United States with the intention of returning and you have not abandoned this intention; and (3) You are returning to the United States from a temporary visit abroad and, if the stay abroad was protracted, this was caused by reasons beyond your control and for which you are not responsible. Applicants must submit evidence with this application to support the above requirements, including proof of lawful permanent residence, (Examples: Form I-151, I-551, Reentry Permit, etc.), dates of travel abroad, (Example: airline tickets, passport stamps, etc.), proof of ties to the United States and intent to return, (Exam- ple: tax returns, and evidence of economic, family and social ties to the United States), and proof a protracted stay was for reasons beyond the applicant's control, (Examples: medical incapacitation, employment with a U.S. company, accompanying a U.S. citizen spouse, etc.). All documents will be returned to you. 1. NAME (Last name) (First name) (Middle name) MOHINDER KAUR 2. OTHER NAMES USED, ALIASES (If married woman, give maiden name) MOHINDER KAUR 3. CURRENT HOME ADDRESS AND TELEPHONE NUMBER 325/16 civil LiNES, Gurgoan, Haryana 4. PLACE OF BIRTH (City or Town, Province, Country) 5. DATE OF BIRTH (Month, Day, Year) Mitha Tiwana 1 Parcistan 1907 6. IF MARRIED. INFORMATION ABOUT SPOUSE (a) Name: LateGurdit singh (b) Address: Dead (c) Place of Birth: Parcistan (d) Date of Birth: (e) U.S. Residence Status, if any (U.S. citizen, LPR, etc.): MA 7. INFORMATION ABOUT LAST UNITED STATES VISA ISSUED TO YOU DATE OF ISSUE PLACE OF ISSUE TYPE OF VISA 21/6/1989 New york Resident Alien 8. INFORMATION ABOUT LAST ENTRY INTO THE UNITED STATES WITH ABOVE VISA DATE OF ENTRY PORT OF ENTRY PURPOSE OF ENTRY Santranisco Resident Ahen 21/7/89 9. IMMIGRATION AND NATURALIZATION SERVICE RECORD IN THE UNITED STATES INS \"A\" Number: 41803955 Immigration Category: Date of Adjustment of Status: Place of Adjustment of Status: 10. INFORMATION ABOUT MOST RECENT DEPARTURE FROM UNITED STATES Date of Departure: 13/10/1990 Destination: New Delhi / IND IA Reason: To meet my daughters 11. WHAT CONTINUING TIES HAVE YOU MAINTAINED WITH THE UNITED STATES? No such this FORM DSP-117 *Public reporting burden for this collection of Information is estimated to average 30 minutes per response. Including time required for searching of existing this estimate data sources. burden gathering and recommendations the necessary data. for providing reducing the It to: information Department required. of State and (OIS/RA/DR) reviewing the Washington final collection. D.C. 20520-0264 comments and on to the Office accuracy of information and Send the 1-92 of the Regulatory Affairs. Office of Management and Budget. Paperwork Reduction Project (1405-0000), Washington D. C. 20503."
}