{
  "anumber": "A41803955",
  "id": "A41803955_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "National Archives and Records Administration (Freedom of Information Act Request Form 20, NAARA FOIA Request Form 20"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/24/2023 PAGE 2 B. An állen who is permanently ineligible to U.S. citizenship: a person who has departed the United States to evade military service in time of war. (212(a)(8)) YES NO h. An alien who is coming to the United States to practice polygamy: an alien who is a guardian required to accompany an excluded alien: an alien who withholds custody of a child outside the United States from a United States citizen granted legal custody. (212(a)(9)] YES NO I. An alien who is a former exchange visitor who has not fulfilled the 2-year foreign residence requirement. [212(e)] YES NO If the answer to any of the foregoing questions Is YES or If unsure, explain in the following space or on a separate sheet of paper. 34. Have you ever been arrested, convicted or ever been In a prison or almshouse; have you ever been the beneficiary of & pardon or an amnesty: have you ever been treated in an Institution or hospital or other place for Unsanity or other mental disease. (222(a)] YES NO 35. I am unlikely to become a public charge because of the following: Personal finanolal resources (describe) Employment (attach) Affidavit of Support (attach) Already Given atine time of petition by My son. 36. Have you ever applied for a visa to enter the United States? YES NO (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an Immigrant visa, and whether the visa was issued or refused.) APPLIED To New Delhi American Embassy AND VISA WAS ISSUED MANY TIMES. 37. Have you been refused admission to the United States? YES NO (If answer is Yes, explain) 38. Were you assisted In completing this application? YES NO (If answer is Yes, give name and address of person assisting you, Indicating whether relative. friend trevel ament no Athari FOIA (b)(6) 39. The following documents are submitted in support of this application: Passport FOIA (b) (6) Military record Birth certificate FOIA (b)(6) Police certificate Marriage certificate Medical records Offer of employment Death certificate Photographs Divorce decree Other (describe) Birth certificates of all children who will not be Immigrating at this time. (List those for whom birth certificates are not available.) DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you In answering Items 40 and 41. 40. I claim to be exempt from Ineligibility to receive a visa and exclusion under Item In Part 33 for the following reasons: 212(a)(5) Beneficiary of a Walver under: Not Applicable 212(a)(3)(D)(II) Not Required 212(e) 212(h) 212(a)(3)(D)(iii) Attached 212(g)(1) 212(I) 212(a)(3)(D)(lv) 212(g)(2) 41. I claim to be: I am subject to the following: A Family-Sponsored Immigrant I derive foreign state chargeability Preference: SB An Employment Based-Immigrant under Sec. 202(b) through my A Diversity Immigrant Numerical limitation: PKST A Special Category (Specify) (foreign state) (Returning resident, Hong Kong, Tibetan, Private Legislation, etc.) of 1 a understand that 1 are required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession visa does not entitle me to enter the United States If at that time I em found to be Inadmissible under the Immigration laws. 1 understand that any willfully false or misleading statement or willian concesiment of a material fact made by me herein the 1, United the undersigned States and, applicant it 1 am admitted for a United to the States United Immigrant States, visa, may do subject solemnly me swear to criminal (or affirm) prosecution that all and/or statements deportation. which appear may In subject this application, me to permanent consisting exclusion of Optional from Forms 230 PART I and 230 PART II combined, have been made by me, Including the answers to Items 1 through 41 Inclusive, and that they are true and complete to the best of my knowledge and belief. 1 de further swear (or affirm) that, If admitted into the United States, I will not engage In activities which would be prejudicial to the public Interest, or Londanger the welfare, safety, or security of the United States; In activities which would be prohibited by the laws of the United States relating or to esplonage, sabolage, public disorder, or In other activities subversive to the national security: in any activity a purpose of which Is the opposition to or the control, overthrow of, the Government of the United States. by force, violence, or other unconstitutional means. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. 213272 The relationship claimed in Items 14 and 15 verified by documentation submitted to consular officer except as noted: (Signature of Applicant) Subscribed and sworn to before me this OCT 3 01992 19 at: NEW DELHI INDIA TARIFF ITEM NO. 20. (Consular Officer) M. Andre Goodfriend American Vice Consul"
}