{
  "anumber": "A41804438",
  "id": "A41804438_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0015/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, LIN-9302251302"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Northern Service Center P.O. Box 82521 Lincoln, Nebraska 68501-2521 01/14/93 A-Number : LIN-Number: LIN-9302251302 UPPAL, JOGINDER SINGH 210 CIRCLE AVENUE #201 FOREST PARK, IL 60130 TO SERVE YOU MORE EFFICIENTLY we are replying to your letter by the following notations. This informal method enables a more prompt response. We trust you will agree that a faster response is more important than formality. Should you write again concerning the same matter, please return this response with your correspondence. Petitioner : Control # Beneficiary: UPPAL, JOGINDER SINGH I93-188 UPPAL, DHIAN SINGH RECORDS INDICATE THAT THE ENTIRE PETITION ALONG WITH ALL THE SUPPORT DOCUMENTS WERE RETURNED TO YOU ON 11/16/92. YOU MUST COMPLY WITH THE REQUEST LETTER AND RETURN ALL OF THESE PAPERS ALONG WITH A COPY OF THE REQUEST LETTER FOR THE OFFICERS TO CONTINUE WITH A DECISION. IF THE REQUESTED INFORMATION IS CONTAINED IN YOUR PERMANENT RECORD FILE, THEN YOU WILL NEED TO CONTACT THE LOCAL INS (PUBLIC-CONTACT) OFFICE, IN YOUR AREA, AND REQUEST THAT OFFICE TO REVIEW YOUR FILE AND IF POSSIBLE, HAVE THAT OFFICE RETURN THE REQUIRED DOCUMENTS TO YOU, IN ORDER TO COMPLY WITH THIS OFFICE'S REQUEST OF INFORMATION ON THE ABOVE I-130 CASE JAMES M. BAILEY Director KJU JOGINDER S. UPPAL C/O KALAMAZOO INN 1900 S WESTNEDGE AVE KALAMAZOO MI 49008-"
}