{
  "anumber": "A41826829",
  "id": "A41826829_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "daughter"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FORMULARIO OPCIONAL 2230 ( (Spanish) ( (Rev. 6-82)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1918,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 FORMULARIO OPCIONAL 230 (Spanish) (Rev. 6-82) Página 2 OPTIONAL FORM 230 (English) (Rev. 6-82) 13. Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos. (Names, addresses, dates and places of birth of all children) PEtRA HENNANDEZ 7272 9TH3t, BURNA PARK Ct 90621 HURSU Quill El Alto JAlisco MEXICO. Born ON 5-7-39. 14. Persona(s) nombrada(s) en los números 12 y 13 que me acompañará(n) 0 me seguirá(n) a los Estados Unidos: (Person(s) named in 12 and 13 who will accompany or follow me to M 15. Domicilio definitivo en los Estados Unidos (Final address in the United States) the United States) 7272 9TH st. NONE BUENA PARK, CALiF 90671 16. Nombre, parentesco (de haberlo) y domicilio de la persona con 17. Nombre y domicilio de la persona u organización que lo patro- quien se reunirá en los Estados Unidos. cina (si no es la misma indicada en el número 16) (Person you intend to join (Give name, address and relation- (Name and address of sponsoring person or organization (If ship, if any) ) PetRA HERNANDEZ different from 16) ) NONE 7272 9TH st Biuma PARK, CA 90621 (DAUGHTER) 18. Filiación personal (Personal description) 19. Señas particulares (Marks of identification) a) Color del cabello c) Estatura (Color of hair) (Height) Grey./Brown 4 / None m (ft.) cm (in.) b) Color de los ojos d) Tez (Color of eyes) (Complexion) BROWN WHite 20. Motivo del viaje a los Estados Unidos 21. ¿Cuánto tiempo piensa permanecer en los Estados Unidos? (Si permanente, (Purpose in going to the United States) WANT TO indíquelo) BE WITH my DAUGHTER (Length of intended stay (If permanently, so state) ) PERMANENTLY 22. Puerto de entrada 23. ¿Tiene usted pasaje hasta su destino final? (Intended port of entry) (Do you have a ticket to final destination?) SAN YSIDRO CALif YES 24. Recursos financieros personales (Personal financial resources) a) Efectivo (Cash) 250.0 00 c) Bienes raices (su valor) None None (Real Estate-(value) ) b) Depósitos bancarios (Bank deposits) d) Otros (describunse) House At C. Del (Other (describe) ) PARQUE, col. AMPLIACION- GUYCURA TIJUANA B.C.M 25. Nombre completo, domicilio, fecha y lugar de nacimiento del padre (si ha fallecido, indíquese en qué año murió) (Father's name, address, date and place of birth (If deceased, so state giving year of death) ) Deceased. 1976 MAKE GOWZA LEZ 26. N ompleto de soltera, domicilio, fecha y lugar de nacimiento de la madre (si ha fallecido, indíquese en qué año murió) (Memor S maiden name, address, date and place of birth (If deceased, so state giving year of death) ) DECCA 1918 MAXIA DE/ REFUGIO BOWILLA"
}