{
  "anumber": "A41826829",
  "id": "A41826829_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificado de Matrimonio, 929631"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 FOLIO C No. 929631 EL C. JESUS MA. OCAMPO JAIME OFICIAL DEL REGISTRO CIVIL DE ESTE LUGAR P. M. D. I. CERTIFICA QUE EN LOS LIBROS ORIGINALES DE ACTAS DEL REGISTRO CIVIL DE HUEJUQUILLA EL ALTO, JALISCO. CORRESPONDIENTE AL AÑO DE 1934 MIL NOVECIENTOS TREINTA Y CUATRO A FOJAS 44 CUARENTA Y CUATRO (VUELTA) Y BAJO EL NUMERO 83 OCHENTA Y TRE S H. AYUNTAMIENTO CONSTITUCIONAL CONSTA UNA PARTIDA DE MATRIMONIO QUE TEXTUALMENTE DICE: DE HUEJUQUILLA EL ALTO, JAL. Al Márgen Número 83 Ochenta y tres Matrimonio de Victorio Diaz- y María Crescencia González DENTRO. En Huejuquilla el Alto Jal-- UNIDOS isco a las 16 diesiseis horas del día 8 ocho de Junio de 1,934. mil novecientos treinta y cuatro, ante mi J. Jesús Garcia, Presi- dente Municipal, encargado del Registro Civil, comparecieron el- Señor Victorio Diaz y la Señorita Maria Crescencia González el- 1/o primero es soltero, agricultor, de 22 veintidos años de edad, católico mexicano, de raza indigena mezclada con blanca, sabe diel Registro> Civil leer y escribir, originario y vecino del rancho de Margarita de-- El Also. Jall. este Municipio, hijo legitimo de Paulino Diaz y Ramona de la To- rre que viven, estando presente el 1/0 primero La 2/a seginda es célive, sin profeción, de 19 diesinueve años de edad, católi ESTE DOCUMENTO NO ca mexicana, de raza indigena mezclada con blanca, no sabe leer-- TIENE VALIDEZ SIN EL SELLO OFICIAL ni escribir, del mismo origen y vecindad del pretenso, hija legi- DEL REGISTRO CIVIL time de Mateo González, que vive y María del Refugio Bonilla, fi- CORRESPONDIENTE nada el 1/o primero esta presente. Ambos pretensos manifestaron- que tienen provada su aptitud legal segun consta en el acta de su presentación número 65 sesenta y cinco de fecha 5 cinco de mayo-- próximo pasado y que es su boluntad unirse en matrimonio civil y- entregarse reciprocamente como marido y mujer. Por ser menor de-re edad la pretensa adquirio el consentimiento paterno y en culla. virtud se les leyeron las obligaciones que las Leyes civiles conseden a los casados y no habiendose denunciado impedimento alguno durante la publicación de las proclamas la propia Autori- dad los declaro unidos en legitimo matrimonio. Fueron testigos de este acto los Ciudadanos Wuenceslao Reyes, Saturnino Escalante y Elidio Manoz, casados y Juan Cordero viudo mayores de edad y de-- este lugar. Se dió lectura a la presente y conforme con su conte- nido firmó el que supo. Doy fé.-J. J. Garcia._Rubrica.-Victorio- Diaz Rúbrica Elidio Muñoz Rúbrica, Es copia sacada fielmente de su original a solicitud de parte interesada para los fines legales correspondientes. Huejuquilla el Alto, Jal., 19, Dic, 1985. UNIDOS E1 Presidente Municipal y, Oficial del Registro Civil P.M.D.L. Juzgade del Registro Civil Huejuquilla El Alto, Jal. JESUS MA. OCAMPO JAIME Para Certificados del Registro Civil del Estado de Jalisco VALOR $ 100.00 T FGJTI 1"
}