{
	"anumber": "A41826829",
	"id": "A41826829_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATE #669588, A SPANISH BIRTH CERTIFICATE TRANSLATED TO THE ENGLISH LANGUAGE."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Mexico"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 CERTIFICATE #669588 In WHOM IT MAY CONCERN: A SPANISH BIRTH CERTIFICATE TRANSLATED TO THE ENGLISH LANGUAGE. CERTIFIES THE FOLLOWING INFORMANTION. BEFORE ME FALCON RAMIREZ MUNICIPAL PRESIDENT AND OFICIAL OF THE CIVIL RECORDS OF HUEJUQUILLA EL ALTO JALISCO MEXICO WHICH I HAVE JURISTICTION AND CERTIFY THE FOLLWING. THIS INFORMATION HAS BEEN TAKEN OUT OF THE ORIGINAL BIRTH CERTIFICATE, WHICH IS FILED HERE AT HUEJUQUILLA EL ALTO JALISCO MEXICO . THE YEAR -1915 (BOOK) SECTION 78 PAGE 399 BIRTH CERTIFICATE OFICIALY STATES THE FOLLOWING INFORMATION, ON PAGE 399 CRESCENCIA GONZALEZ BONILLA UNDER THE JURISTICTION OF HUEJUQUILLA EL ALTO JALISCO, BEING THE 10NTH HOUR OF THE DAY 27, OF DECEMBER 1977 BEFORE ME ROGACIANO CALDERA OFICIAL OF THECIVIL REGISTRY AND RECORDS OF THIS MUNICIPAL AREA APEARED BEFORE ME MS C. MA. CONSEPSION MADERA WIDOWER MEXICAN OF 66YEARS OLD WHOLIVES IN THIS TOWN HUEJUQUILLA EL ALTO JALISCO STATED THAT ON THE 20TH OF APRIL 1915 IN THE RANCH OF MARGARITA OF THIS MUNICIPAL AREA WHICH HAS JURISTICTION THERE. WAS BORN CRESCENCIA GONZALEZ BONILLA BORN IN 1ST PLACE. DAUGHTER OF MATEO GONZALEZ AND MA. DEL REFUGIO BONILLA DESEASED. HER GRAND PARENTS WERE, LADISLADO GONZALEZ AND PETRA LAMAS, DESEASED. WITNESSES PRESENT WERE WHICH WERE TRANQUILINO BONILLA AND MA. DEL REFUJIO ROJO WHICH WERE PARENTS OF MA. DEL REFUJIO BONILLA ALL THIS INFORMATION WAS TAKEN UNDER OUTH, AND REGISTERED INFORMATION. A FEE OF $50. WAS TAKEN WITNESSES WITNISING THE BIRTH WERE AND UNDER OUTH WERE MAGDALENO CARRILLO AND GERMAN LOPEZ. WHICH CONFIRMED AND SIGHNED THE AVOBE INFORMATIO SUBMITED BY MA. CONSEPSION MADERA AND THE ABOVE WITNESES. OVER"
}
