{
  "anumber": "A41804438",
  "id": "A41804438_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, LIN-93-022-51302"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1942,
        1972,
        1996,
        1992,
        1906,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# APPROVED BAG DIRECTOR 11/02/92 LIN-93-022-51302 LJH001 G-28 or Volag NWD 967190026 Section of Law: JUL 23 1996 Petition was filed on: # (priority date) 201 (b) spouse 203 (a)(1) Personal Interview 203 (a)(2) 11/02/92 Previously Forwarded 201 (b) child Pet 201 (b) parent 203 (a)(4) Ben \"A\" File Reviewed Stateside Criteria LIN 6698 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: New Deth. 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: Please VFY father lapr on basis of Secondary evidence A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) UPPAL JOGINDER SINGH UPPAL DHIAN SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 210 CIRCLE AVE (APARTMENT#201) A-3/15 JANAK PURI (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOREST PARK ILLINOISE 60130 NEW DELHI , INDIA - 58 3. Place or of Birth (Town City) W. (State/Country) 3. Place of Birth (Town or City) (State/Country) PAKISTAN VILLAGE DAULTALA, RAWALPINDI, W.PAKISTAN 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Y1) Male Married Single 6-30-1942 Female Widowed Divorced 1-13-1906 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other NONE MAJOR(DR.) Names Used (including DHANSINGH maiden name) SING+ DHIAN 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) NEW DELHI, INDIA, 6-29-1972 N/A 441804438 9 Social Security Number 10. Alien Registration Number (if Anvl 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) 384-06-7367 A-91804436 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended NOT APPLICABLE NOT APPLICABLE N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) NC she last arrived as a (visitor, student, stowaway, without inspection, etc.) N/A Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained/a certificate accitizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\" give number of certificate, date and place it was issued 11614770, 2-9-82, SANFRANCISCO, CALIF. 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: NONE Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: NOT APPLICABLE N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings BORGA NOT APPLICABLE RIIA 16 1996 6 30 LN INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED ml OCT 1992 Rec'd Sent Approved Denied Returned I-130 (Rev. 4/11/91) Y"
}