{
	"anumber": "A41804438",
	"id": "A41804438_0072",
	"page_index": 72,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0072/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 TO THE SECRETARY OF STATE: 7/19/82 REMARKS The petition was filed on PERSONAL INTERVIEW CONDUCTED The petition is approved for status under section: U. S. APPROVED INS, DOCUMENT CHECK ONLY SPOUSE, FIELD INVESTIGATION COMPLETED DATE 201 (b) CHILD 203 (a) (2) OF OCT 1 1982 APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD Janua f Kife 203 (a) (1) 203 (a) (5) DISTRICT REMOTE ADJ. CENTER SYS/LDS #3 REMARKS (Continued) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 20. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in NEW DELHI, INDIA (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Natural- ization Service at (CITY) (STATE) If the application for adjustment of status is denied. the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 21. My residence in the United States is: (C/O, if appropriate) (Apt. No.) (Number and Street) Town or city) (State) (ZIP Code) 815 KENWOOD, BURBANK, CALIF 91505 22. My address abroad (if any) is: (Number and street) ( Town or city) (Province) (Country) 9, GENERAL CARIAPPA ROAD AGRA INDIA 23. Last address at which I and my spouse resided together From To ( Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) MORGAN HILL, CALIF, U.S.A 14950 SWORD DANCER 10/77 to 4/81 24. Address in the United States where beneficiary will reside (City) (State) KENWOOD, BURBANKI CALIF 91505 25. Address at which beneficiary is presently residing (Apt. No.) (Number and street) Town or city) (Province or State) (ZIP Code) 9 j GENERAL CARIAPPA ROAD, AGRA, INDIA 26. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) GENERAL CARIAPPA ROAD AGRA INDIA (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town, or City) (Province) (Country) Eruld BIE 34c & stades 3753121 1 STSY) 27. If this petition is for a child, (a). is the child married? (b). is the child your adopted child? if so, give the names, dates, and places of birth of all other children adópted by you. If none, so state. N/A 28. If this petition is for a brother or sister, are both your parents the same as the alien's parents? N/A If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 29. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner SANT KAUR UPPALCMOTHER UPGAL(BROTHER) JASVIRSINGH UPPAL (BROTHER), GOVIND KAVR UPPAL (SISTER) 30. Have you ever filed a petition for this alien before? NO If so, give place and date of filing and result. 31. If beneficiary is in the United States, give the following information concerning beneficiary: N/A (a) Last arrived in U.S. as (b) Date beneficiary's stay expired or will (c) Beneficiary's File number (Visitor, student, exchange alien crewman, stowaway, etc.) on expire as shown on his Form 1-94 or I-95. if any (Month) (Day) (Year) (Month) (Day) (Year) A- (d) Name and address of present employer (e) Date alien began this employment"
}
