{
	"anumber": "A41804894",
	"id": "A41804894_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804894_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "18. LIST BELOW IN DATE ORDER ALL PLACES WHERE YOU, YOUR SPOUSE AND UNMARRIED CHILDREN NAMED ON THE OTHER SIDE HAVE LIVED SINCE REACHING THE AGE OF 16 ( (IT IS NOT NECESSARY TO LIST THE PLACES EHRER YOU HAVELIVED LESS THAN SIX MONTHS."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1966, 1943, 1928, 1937, 1970, 1968, 1938, 1955, 1953, 1951, 1964, 1947, 1939
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "18. LIST BELOW IN DATE ORDER ALL PLACES WHERE YOU, YOUR SPOUSE AND UNMARRIED CHILDREN NAMED ON THE OTHER SIDE HAVE LIVED SINCE REACHING THE AGE OF 16 (IT IS NOT NECESSARY TO LIST THE PLACES EHRER YOU HAVELIVED LESS THAN SIX MONTHS. First Name of City of Town Occupation From to Family Member. pronvice month year month year country. Judge Jagdev Lahore, Punjab Singh Pakistan. student. Jan. 1928 March, 1937, Rahwali, Punjai Govt. service Pakistan. pronvicial Apri 1937 Apr. 1938 Excise Deptt. SeheikhupraPb, Pakistan. -do- Apr. 1938 March, 43 Kot Radha Kishan, -do- Apr. 1943 Apr. .1947. Lahore, Pakistan. Phillaur, Jalandhar, India. -do- Aug. 1947. . March,51 Ambala Cantt. Pb. -do- Apr. 1951 March 1953 India. Jalandhar, Pb. India. -do- Apr. 1953 March, 1955 Hoshiarpur, Pb. -do- Apr 1955 March, 57 India. Amritsar, Pb. -do- March, 57 March, 1964. India. Gurgaon, Pb. -do- India. Apr. 1964 Apr.1966 Chamba, Himachal. -do- Pradesh-India. Apr. 1966 Sep.1968. Hoshiarpur, Punjao, -do- Oct. 1968 Apr.1970. India. (retired from Govt. service in April, 1970). Joined Sales Tax Bar Association as Sales-tax Practitioner in Apr. 1970 till to-day. Judge Charanjit Kaur (Spouse) Gurdaspur,Punjab, student upto 1939. India. Sheikhupura, Housewife Dec. 1939 till now. Pakistant."
}
