{
	"anumber": "A41804438",
	"id": "A41804438_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice, Immigration and Naturalization Service - Nebraska Service Center"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1996]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Nebraska Service Center P.O. Box 82521 Lincoln, Nebraska 68501-2521 121134 March 21, 1996 Refer to File No. LIN9302251302 JOGINDER S UPPAL C/O KALAMAZOO INN 03/07/96 LIN-93-022-51302 LINVJS01 1900 S WESTNEDGE AVE KALAMAZOO MI 49008- Dear Sir or Madam: CB 108-7-16-90 Case Type: I-130 Beneficiary: DHIAN S UPPAL PLACE THIS LETTER ON TOP OF YOUR RESPONSE. SUBMISSION OF EVIDENCE WITHOUT THIS LETTER WILL DELAY PROCESSING OF YOUR CASE AND MAY RESULT IN A DENIAL. The documentation submitted is not sufficient to warrant favorable consideration of your petition/application. The following information is also required: Please submit the oldest available evidence which establishes the birth and parentage of Joginder. This evidence may include, but is not limited to: a. Hospital birth records which name child and both parents. b. Medical Records which name child and both parents. C. School records which name child and both parents. d. Census records which name child and both parents. e. Church records in the form of a certificate under the seal of the church where the baptism, dedication, presentation or comparable rite occurred within two months after birth, showing the date and place of child's birth, date of the religious ceremony, and the names of the child's parents. Furnish the marriage certificate (s) of Dhian and the mother of Joginder which has/have been registered with the proper civil authorities. Your response must be received in this office by JUNE 13, 1996. JUN 1 1996 -4 00 PM M L au AM PL S 0.1996 -400 PM MTL MAY"
}
