{
  "anumber": "A41804894",
  "id": "A41804894_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804894_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/26/2023, No. 51"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "9/20/2023 Cointer foil 08 Village PHILLAUR HADRAST NO. 153, TEHSIL PHILLAUR DISTRICT JALANDHAR PAGE NO. 51. #1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Serial Entry of the Last Jamabandi in which correction/ amendment New Entry which is to be rubsituted. Nature and No. is required to be made. date of Muta Re R Transfer tion mark No. of Name of Name of owner & Name of culti Or No Land No. of Name of the Name o Culti. Khasr No Revnue including fee add holding Side/ area his particulars. -vator & his Revo and holding owner a nd vator and his name, or amount of in the Well Particulars. nue in New particulars. area & sale/ ordr kind or Jamen- his parti- Kind of Tenancy last 01 culars. Jaman- land Tenance Bandi, La nd. mortgage bandi. cy As it is As it 10-62. ###£ Nand Singh Ha rcharan As it is As it is 10-62 Inheritance son of See is Singh,Jagdev 2225 167 Ma hal 206 Sunder Dass 0.50 Singh, Sampuran date of son of signed Singh,Surjit death Patwari Mehtab Rai Singh, Bhopinder 14.6.69 Geneological.ree% Singh, Harpaljit 13/1/62. of Land Nand Singh Singh Inheritance of Nand Singh is accepted Revenue sons and as mentioned in to be subsituted in Transfer Samitar Kaur, rable Rajinder Kaur, Column No. 9. Rs.2086 Tripat Kaur Sd/- Circle Rev. Officer, Signed Samitter Harcharan Jagdev Sampuran Rajinder Surjit Bhopinder Tripat Harp- daughters 25-6-69 F.Kgo. ahjit of Kaur Singh Singh Singh Kaur Singh Singh Kaur Nand Singh Certified this copy is coorect according to 25-6-69. Singb son of papers and is issued on the request of Subash Daughter Son Son Son daughter son son daugher Son Sunder Dass Chander S/O Chaman Lal and received copying fee equal shares 15. sa/- Avtar Singh Patwari 168 Nand Singh As it is As it XX as above is. 10-24 207 As above Aprilled DEPARTMENT Phillaur. As As it is 10-24 mortgager Sardara Singh can of Mortgagee Digilar Rotary PubHo Fb. v, (India)"
}