{
  "anumber": "A41803955",
  "id": "A41803955_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1935,
        1986,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/24/2023 U.S. Department of Justice OMB No. 1115-0054 Immigration and Naturalization Service Approval expires 4-86 PETITI ASSIFY STATUS OF ALIEN RELATIVE Fee Stamp R ISSUANCE OF IMMIGRANT VISA FRE 043211 (PLEASE NOTE - YOU ARE THE PETITIONER AND 12.10.85 YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: FOIA (b)(6) The petition was filed on 12-10-85 REMARKS The petition is approved for status under U.S. APPROVED INS. PERSONAL INTERVIEW CONDUCTED section: WESTERN ADJ. CENTER DOCUMENT CHECK ONLY SPOUSE, FIELD INVESTIGATION COMPLETED DATE 201 (b) CHILD 203 (a) (2) FEB 27 1986 OF APPROVAL PREVIOUSLY FORWARDED ACTION FORE 201 (b) PARENT 203 (a) (4) DD J.W. 203 (a) (1) 203 (a) (5) DISTRICT (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: KAUR MOHINDER Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? MOHINDER KAUR CHANN YES NO 6. Country of beneficiary's birth INDIA (Present Pakistan) 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? YES NO 9. Petitionar's name ie 11 not in CADE (Circt) 11. The beneficiary is my: (relationship) FOIA (b)(6) MOTHER 12. Other names used by petitioner (including maiden name it married woman) 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) JAGMEET KAUR CHANN INDIA EXPIRED GURDIT 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 7429 N. LAFAYETTE FRESNO , CA 93726 93711 15. Names, birthdates and countries of birth of beneficiary's children: HARJIT CAUR INPIA OPRITAM ©HARDIT SINGH FOIA (b)(6) PINDERJITI KAUK (6) RANJIT KHK LINDIA w KARTAR KAUR FOIA (b)(6) 6 PREM KAOR A (JJGJ) KITUK INDIA 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in FOIA (b)(6) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at RESNO CALIFORNIA (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in NEW-DELHI - INDIA (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 17. Address in the United States where beneficiary will reside (City) (State) 7429 N. LAFAYETTE FREJNO CA 93711 18. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) same as above 19. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) Initial Resubmitted Polanahad Receipt OVER Completed 23 DEC MAR 10 988 1985 FORM I-130 (Rev. 5-5-83) N NOV RECEIVED 08 1984 RET'D TRANS OUT COMPLETED you 18 DEC 1935"
}