{
  "anumber": "A41804438",
  "id": "A41804438_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0056/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXAMINATION OF APPLICANTS UNITED STATES VISAS, OPTIONAL FORM 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 PLACE EXAMINATION OF APPLICANTS New Delhi UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 09.11.96 CITY COUNTRY merican Consul at New Delhi India NAME (Last In CAPS) (First) (Middle) DATE OF BIRTH SEX UPPAL Dhian Singh (Mo., Day, Yr.) F M ve date I examined 01.13.06 WHO BEARS PASSPORT NO. ISSUED BY ON F-177823 PO Bareilly 04.11.89 RPO Delhi 02.08.96 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Gonorrhea Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Insanity Previous Occurrence of One or Mental Defect More Attacks of-insanity Sexual Deviation Narcotic Drug Addiction Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Cardiomegaly & aortic knuckle calcifica- Reaction mm tion are present. Not Done No pulmonary parenchymal lesion. DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ Dr. Avnish B. Chopra 09.11.96 DATE READ SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: Antibody to HIV I+II (ELISA) DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Dr. Arvind Lal 09.11.96 Dr. Arvind Lal 09.11.96 OTHER SPECIAL REPORT(S (When needed) DOCTOR'S NAME (Please print) REMARKS Xray findings are age related and Applicant is medically fit. APPLICANT CERTIFICATION I 11 Sepr 96 certify that I understand the purpose of the medical examination and/ authorize the on this form refers to me. AleignSingh Signature hospet required tests to be completed. Retain The Date information DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE M.BI DATE DR. SHAKUNTALA DAWESAR She Kembel Damn 09.12.96 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 GPO : 1993 O - 151-311 DEPT. OF STATE"
}