{
	"anumber": "A41804438",
	"id": "A41804438_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 1405-0015"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 1909, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "by DK FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE 50230-105 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name First name UPPAL Middle name DHIAN SINGH 2. Other names used or by which known (If married woman, give maiden name) NONE 3. Full name in native alphabet (If Roman letters not used) SAME 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) 13-01-1906 - 83 (City or town) (Province) (Country) DAULTALA, PAKISTAN 7. Nationality 8. Sex 9. Marital status INDIAN Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married times. 10. Occupation AGRA RETIRED MEDICAL PRACTITIONER No.9 GENERAL CARIAPPA ROAD, CANTS 11. Present address c/o 12. Name, address, date and place of birth of wife/husband Give maiden name of wife) AGRA 282001 NAME: SANT KAUR SOBTI ADDRESS: Nr 9 GENERAL CARIAPPA ROAD DATE 1909 PLACE: KOHAT N.W.F.P), PAKISTAN AGRA CANJT - 282001 Date and place of marriage 13. Names, addresses, dates and places of birth of all children NOJ APPLICABLE 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States c/o JOGINDER. SINGH UPPAL SANT KAUR UPPAL 1900 S. WESTNEDGE AVE MAIDEN NAME: SOBTI KALAMAZOU, MICHIGAN 49008 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If JOGINDER. S. UPPAL (SON) if any) different from 16) 1900 S. WESTNEDGE AVE NOT APPLICABLE KALAMA zoo, MI - 49008 18. Personal description 19. Marks of identification (a) Color of hair (c) Height BROWN 5 feet 5 inches MOLE ON RIGHT CHEESE (b) Color of eyes (d) Complexion 20. Purpose in going to the United States BROWN WHEATISH TO STAY PERMANENTLY WITH MY SON 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? PERMANENTLY NEW YORK NO. THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}
