{
	"anumber": "A41804438",
	"id": "A41804438_0070",
	"page_index": 70,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0070/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 220 ( (English) (Rev. 6-82, Form Number: 230"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 OPTIONAL FORM 230 (English) (Rev. 6-82) Page 4 42. The following documents are submitted in support of this application: Passport Evidence of own assets Birth certificates of unmarried children under age 21 who will not Birth certificate Affidavit of support be immigrating at this time (List those for whom birth certificates Police certificate(s) Offer of employment are not available or whose birth certificates are being submitted at this time in connection with a visa application.) Marriage certificate Medical record(s) Death certificate Photographs Divorce decree Other (describe) Military record Birth certificate of spouse DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering parts 43 and 44 43. I claim to be exempt from ineligibility to receive a visa and exclusion under item in part 40 for the following reasons: 212(a)(14) Beneficiary of Waiver under 212( )(28)(I)(i) 212(e) Not applicable 212(a)(28)(1)(ii) 212(g) Attached 212(b)(1) 212(h) 212(b)(2) 212(i) 44. I claim to be a preference immigrant subject to the numerical limitation for Special immigrant not subject to limitation (Foreign state or dependent area) Immediate relative of a United States citizen (1R-5) My claim is based on the following facts: I am (my is) the beneficiary of a petition. I am a returning resident alien. I derive foreign state chargeability under Section 202(b) through my Other (specify) I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigra- tion laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all statements which appear in this application have been made by me, including the answers to parts 32 through 41 inclusive, and are true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. Dhian Singh Mopal (Signature of Applicant) The relationships claimed in items 12 and 13 verified by major Refered documentation submitted to consular officer except as noted: Subscribed and sworn to before me this day of MAY 01 1989 DELHI. INDIA 19 at (Consular NEWS Officer) TARIFF ITEM NO. 20 U.S. U.S. GPO: 1986-491-248/20673"
}
