{
	"anumber": "A41826829",
	"id": "A41826829_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41826829_0012/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "BIOGRAPHIC INFORMATION, G-325 A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "[' assembler', 'f/a attendant']"
			},
			"reason": {
				"reason_llm_v1": "NATURALIZATION"
			},
			"nationality": {
				"nationality_llm_v1": "MEXICAN"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "U.S. Dep ustice ScreenfeBMNARA27A8/2023 OMB No. 1115-0066 Immigr aturalization Service BIOGRAPHIC INFORMATION Approval expires 4-30-85 (Family nome) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE MUMBER HERNANDEZ PETRA DIAZ FEMALE 5-7-39 MEXICAN A FOIA (b) (6) ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. NONE HUEJUQUILLA EL ALTO, JAL MEDI FOIA (b)(6 FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE. FATHER diaz victorio 12-17-10 Huejuquilla el Alto Jal Mex. Tijuana B.C Mex MOTHER(Maiden name) Gonsalez crescencia Bonilla, 4-20-15 Huejuquilla el Alto Mex HUSBAND none, so state) FAMILY NAME FIRST NAME OR BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE (For wife. give maiden name) time: WIFE 01 jat mox Huejuquilla HERNANDEZ MANUEL RAMIREZ MANUEL 12-13-32 2-28-56 Jalisco Nex FORMER HUSBANDS OR WIVES(if none,se state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 7272 9TH ST BUENA PARK CALIF U.S 4 84 PRESENT TIME 6251 FULLERTON AVE BUENA PARK CALIF U.S 11 75 84 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR o e APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR EMERALD OF ANAHEIM HOTEL P/A ATTENDANT 5 84 PRESENT TIME 1717 S. WEST ST, ANAHEIN CALIF 90802. PHOTO -LATH INTERNATIONAL ASSEMBLER 79 5 84 STATON CALIFORNIA Show below last occupation abroad if not shown above. (Include all information requested above.) NONE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT OTHER (SPECIFY): PETITION FOR ALIEN RELATIVE pt IF YOUR NATIVE ALPHASET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME III YOUR NATIVE ALPHANNY IN THIS SPACE Are all copies legible? Yes NONE PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) HERNANDEZ PERTA DIAZ A- FOIA (b) (6) (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: Form G-325 A (Rev. 10-1-82) (4) CONSUL"
}
