{
	"anumber": "A41804438",
	"id": "A41804438_0061",
	"page_index": 61,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41804438_0061/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "SUPPLEMENTAL FORM TO OF-157, OF-157"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 ; 3-29-97 ; 5:35 ; QUARANTINE- CDC:#14 RCV BY: CDCBKK SUPPLEMENTAL FORM TO OF-157 Visa Applicant's Documentation of Immunization To be completed by panel physician only Applicant Identifying Information UPPAL Dhian Singh Date of Birth 01.13.06 (Family) (Personal) (Middle) (Month, Day, Year) Female F - 177823 India M Male Passport # Country :. Immunization Record Vaccine History Transferred from a Written Record Vaccine Completed Waiver(s) to be Requested Given series or Fully Immuns Blanket (Check if YES or write date Not Medically Appropriate of lab COST If immune) /accine Date Kec'd Date Rec'd Date Rec'd Date Roo'd Date given Not Contra Vaccine insufficient Not fall Mo/Day/Yr Mo/Day/Yr Mo/Day/Yr Mo/Day/Yr by appropriate indication unavailable time inserval (flu) Panel Phy. age in country season Mo/Day/Yr X IIIIIIII >T/DTP 3d 05.10.97 X IIIIIIIII X Pollo (OPV/IPV) IIIIIIIIIIIIII seasles 11111111 or MR or MMR) Mumps Huma or MMR) IIIIIIII X Rubella or MR or MMR) 11111111 X Hib X Hepatitis B 11111111 Varicella X 11111111 X Pneumococcal mm X influenza 3. Results Applicant may be eligible for blanket waiver(s) as indicated above. Applicant will request an individual waiver based on religious or moral convictions. Vaccine history complete for each vaccine, all requirements met. Applicant does not meet immunization requirements. 4. Panel Physician's Identifying Information DR. SHAKUNTALA DAWESAR 10.03.97 Panel Physician's Name Date (print or type) Panel Physician's Signature Shekmutels Damn"
}
