{
  "anumber": "A41803955",
  "id": "A41803955_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41803955_0011/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Laboratory Clinical Laboratory Control Laboratory Control Clinical Laboratory Screened by NARA, 8/24/2023 Cream Clinical Centrals Clinical Laboretony Central Clinical Laboratory Central Cash Control Clinical Luboratory Central Clinical Central Laboratory Email Clinical Laboratory Country Climited Consent Clinical Control Control Clinical Liberature Control Plasted Come Caborelete Control Central Clinical GRAMS TESTLAB Central Control Clinical PHONES 312046, 311329, 3746426 Cannot Element Control Clinical Clinical Laboratory Clinical Laboratory Central Dr.S.K.LAL'S Canad Clinical Control Clinical Laboratory Coursel Clinical Clinical Central 661095, 350462 Ermal Clinical Laboratory Laboratory Control Liberatory Clinical Country Climate Central Clinical Laboratory Central Clinical Laboratory Laboratory Clinical Lebovatory Central Clinical Central Central Central Clinical Laborality Control Classed Central Clinical Control Clinical Lebasatory Central Central Central Clinical Clinical Clinical Clinical Laboratory Laboratory Leboratory Laboratory Central Clinical Clinical Laboratory Central Clinical Laboratory Control Control Control Clinical Clinical Cources Clinical Count Chinica Central Clinical Control Clinic Lebonatory Central Clinical Literating Clinical Control Clinical Leboratory Control Climited Costal Clinic Couran Clinical Laboratory Clinical Leboratory Central Clinical Laborary ESKAY HOUSE 54 HANUMAN ROAD, NEW DELHI- 110.001 Laboratory Clinical Laboretony Coural Given Control Clinical Laboratory Clinical Laboratory Control Clinical Laboratory Cannal Clinical Lebovating Central Laboratory Climical Liberatory Coural Criminal Central Clinical Lebovatory Clinical Laboratory Central Clinical Libraratery Control Clinical Laboratory Control Clinical Laboratory Central Clinical Central Clinical Laboratory Clinical Consent Clinical Control Clinical Clinical Laboratory Crassed bl Clinical Laborarony Contract Clinical Central Minisal Clinical Liberatory Created Climical Central Climical Created Clinical Clinical Laboratory Control Wrind Clinical Laboratory Central Clinical Laboratory Control Clinical Vandana Clinical Liberators Cannal Stinical Laboratory Cassed Cannot Clinical Clinical Lebosurosy Clinical Laboratory Central Climical Laboratory Control Clinical Laboratory Control Clinical Control Climical Clinical Laboratory Central Clinical Leterancy Courted Control Clinical DR. ARVIND LAL Laboratory Cancer Clinical Laboratory Circles Clinital Leberatory Central Clinical Central Clinical DR VANDANA LAL Laboratory Central Lebovancy Control Clinical Country Clinic Central Clinical Climinal Laboraryty Central M.B.B.S; D.C.P. (PATH) Lebonatary Central Clinical Laboratory Counsel Clinical M.B.B.S;M.D. (PATH) Clinical Central Clinical Laboratory Corner Clinical Countral Clinical Laboratory Country Clinical Control Clinical Laboretary Central Clinical Country Clinical Conner Clinical Laboratory Central Clinical Control And Central Clinical Clinical Laboratory Count Clinical Laboreining Control Climisal Lebovancy Carter Clinical Like Central Clinical Laboratory Criminal Control Clinical Control Stimulat Laboratory Clinical Central Clinical Control Clinical Course Climical Control Control Clinical Control Clinical Laboratory Cooral Climical Country Laboratory Control Clinical Lebourney Control Climital Literary Common Central Leboratory Plinter Central Clinical Cannet Coural Clinical Common Central Clinical Clinical Country Counal Cantral Counsel Costal MRS MOHINDER KAUR [B-118500] Claim 23591 Central Claims Cannal Clinical Central Clinical NAME Connol LAB. NO Central Clinical Lahoratory Luberatary Count Climical Canada Clinical - Control Clinical Clinical Laboratory Central Clinical Liberatory Cannot Climital Central Clinical Control Climical Dr. Harish Khosla FRCP PD Clinical Laboratory Central Climate Cannot Clinical REFERRED BY ACCT. STATUS district Cans Principal from Control Clinical Common DATE 19/10/92 Conner Bund Control Come Climat Country formal Client Laboratory Laboratory Country Laboratory Central Clinical Laboratory Control Clinical Adams Clinical Courted changed Schoology Countral Guard Library Country Climart Literature Cand Laberonery Central Clinical Liberatory Cannot Climit Coloradory Clinical came Laboratory Test Name Libertary Control Clinical Laboratory Council Clinical Laboratory Result Units Central Ref. Range Cisna elized Connet RADIO ENZYME IMMUNO ASSAY Antibody To HIV-I Non Reactive SEROLOGY & IMMUNOLOGY V.D.R.L. Non Reactive 9 (2) 92"
}