{
  "anumber": "A42130030",
  "id": "A42130030_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42130030_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID Action Stamp Fee Stamp 35.00 FEE PAID A# NOL# 054821 ARS-NEW PROVED TRICT DIRECTOR NATURALIZATION SERVICE G-28 or Volag # 8/5/88 ANS LOUISIANA COLLECTED BY Section of Law: 201 (b) spouse 203 (a)(1) SEP X9 1988 Petition was filed on 8-5-88 (priority date) 201 (b) child 203 (a)(2) P.Linds Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria Recommended by: 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: Tegucigalpa NOL 1728 204 (a)(2)(A) Resolved 204 (h) Resolved REMARKS: Doc check only SLB Ney A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family names CAPS) (First) (Middle) FOIA (b) (6) BARDALES URBINA CALIXTO 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) FOIA (b)(6) Barrio la Isla, Ave. Paz Barahona entre 3y4 Town or Citil /7ID/Doctal Code) (Town or City) (State/Country) (ZIP/Postal Code) calle FOIA (b) (6) casa 48, La Ceiba, Atlantida, Honduras 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) FOIA (b)(6) HONDURAS La Ceiba, Honduras 4. Date of Birth 5. Sex FOIA (b)(6) 6 Marital Status 4. Date of Birth 5. Sex 6. Marital Status FOIA (b)(6 (Mo/Day/Year) FOIA (b)(6) Male Married Single (Mo/Day/Year) Male Married Single FOIA (b)(6) Female Vidowed Divorced 10-14, 1905. Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) FOIA (b)(6) Same as # 1 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) FOIA (b)(6) 10-19-59 AD 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b) (6) FOIA (b)(6) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended N/A 13. FOIA (b)(6) Nas your relative ever been in the U.S.? Yes No 1. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) N/A rrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) N/A ate authorized stay expired, or will expire as shown on Form I-94 or I-95 N/A 5. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: FOIA (b)(6) 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United States citizen or lawful permanent resident? FOIA (b) (6) Exclusion Deportation Res on Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87)N"
}