{
  "anumber": "A42130030",
  "id": "A42130030_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42130030_0029/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 OPTIONAL FORM 155A, (Rev. 6-85) DEPT. OF STATE NS 50155-203 IV-42130,030 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN URBINA BARDALES, CALIXTO ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U. S. IMMIGRATION 212(e) 212(h) NEW ORLEANS SH 418 212(g) 212(i) MAY 2 6 1989 CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH LA CEIBA, HONDURAS 14OCT05 ADMITTE UNTIL FRS CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY (CLASS) LA CEIBA, HOND HONDURAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME XM S W D SEP JUANA SERAPIO FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 5508 PATIO WAY NEW ORLEANS, LA 70129 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED UNR RETIRED F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT TEGUCIGALPA, HONDURAS HONDURAS MARK S. MAYFIELD IMMIGRANT VISA NO. Vice Consul of the United States TGG8826602301 42130030 of Americal ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 09MAY89 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 05SEP89 PASSPORT NO. 357355 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO CALIXTO URBINA BARDALES ALTACHED BY FOREIGN SERVICE MINISTRY OF FOREIGN AFFAIRS Tariff No. 21 UNITED STATES OF AMERICA ON 21DEC88 Fee Paid $75 EXPIRES Local Cy, Equiv. 20DEC93 IV-42,130,030 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. U.S. GPO 1988-210-192"
}