{
	"anumber": "A42210183",
	"id": "A42210183_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Please bring the following inf and/or documents to your next interview: é to do so may result in the denial of your application. NOTE: ALL DOCUMENTS MUST BE ORIGINAL OR CERTIFIED COPIES. Any documents in a foreign language must be accompanied by a translation in English. The translator must certify that he/she is competent to translate and that the translation is accurate. Complete arrest report(s), court disposition(s), and probation report(s) (if applicable) for the following: Arrest date Arresting Agency Place Case Number (All court dispositions MUST be certified by the court issuing the record. If a record is no longer available, you must submit documentation from the appropriate agency as to its unavailability. If a record has been sealed or expunged, court records showing such must be submitted.) Police clearance(s) from the local law enforcement agency(ies), from all jurisdictions where you have resided for the years: Birth certificate of Marriage certificate of Divorce decree (interlocutory and final decree) of Death certificate of Your written statement as well as a letter from your church, signed by a church official, explaining how your religious beliefs prevent you from taking the full oath. Evidence of bona fide marriage - bring any documents which would assist in establishing the validity of your marriage such as (but not limited to) lease agreements or home ownership documents, joint bank and credit accounts, joint tax returns, proof of joint ownership of other property such as investments, automobiles, life insurance, health insurance. Proof that your spouse has been a U.S. citizen for more than three years, such as birth certificate, naturalization certificate, certificate of citizenship, or U.S. passport. Proof of child support for (Bring evidence of your payment of financial support, such as cancelled checks, money order receipts and bank drafts showing your payment record, along with copies of any court or government orders relating to the required payment.) Copies of tax returns for tax year(s) (Bring copies of any correspondence relating to payment arrangements, and copies of any returns for which you claimed to be a non-resident.) Verification of tax compliance from the Internal Revenue Service (I.R.S.) for tax years: Proof of Selective Service registration. (Selective Service System telephone number: 1-847-688-6888). Note: If you failed to register with the Selective Service System before you reached age 26, you must contact Selective Service System and request a status information or advisory letter regarding your failure to register. Please submit this as well as any other correspondence that you receive from the Selective Service System to the I.N.S. Your passport(s) and any travel documents issued by the I.N.S. Proof of physical presence in the United States during the years Other:"
}
