{
	"anumber": "A42210183",
	"id": "A42210183_0050",
	"page_index": 50,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0050/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-42210,183"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1990, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "FORM 155A, (Rev. 6-85) EPT. OF STATE NSN 7540-01-126-7761 50155-203 IV-42210183 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN WARSAME FADUMA ADEN ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION IT 520 212(e) 212(h) 212(g) 212(i) DEC08 1990 CCITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH DR5 GALKAIO, SOMALIA 12/31/13 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY MOGADISHU, SOMALIA SOMALI MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S X W D SEP DUHEI ADEN FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED C/O ABDULLAHI F. HERSI STATES 14531 S. FREEMAN AVE #5 LAWNDALE, CA 90260 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED HOUSEWIFE F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL EMBASSY IR-5 AMERICAN FOREIGN STATE/OTHER AREA LIMITATION AT MOGADISHU, SOMALIA IMMIGRANT VISA NO. BRIAN H. PHIPPS ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 27 SEPTEMBER 1990 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 26 JANUARY 1991 PASSPORT NO. A 0136949 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED PHOTO TO FADUMO ADEN WARSAME FORCHAN BY SOMALIA UNITED STATE OF AMERICA Tariff No. 21 ON 18.06.90 Fee Paid $7X25 EXPIRES Local Cy, Equiv. .SHS. 64,825 IV-42,210,183 17.06.93 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. Info given to IR$ on date of 1-551 Issuance: Name, Addr DOB, A#, Class of Adm, Occup & answers to 9003. U.S. GPO 1988-210-192"
}
