{
	"anumber": "A42210183",
	"id": "A42210183_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form Number: 1030, Title: Alien Registration Form."
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Applicant Name Alien Registration Number FADUMA ADEN WARSAME A- DIAGNOSIS OF IMPAIRMENT(S) 2. (a) Provide your clinical diagnosis of the applicant's impairment(s) and describe the impairment(s) in terms a person without medical training can understand (see Instructions for examples). THIS 93-YEAR-OLD female patient suffers from Senile Dementia. THIS DEMENTIA IS NOTED AS PROGRESSIVE BRAIN DISEASE. THIS DISEASE AFFECTS ON MEMORY WITH AGE. THE SYMPTOMS OF THIS DISEASE ARE MEMORY LOSS, CONFUSION, AND POOR CONCENTRATION. PLUS THE PATIENT SUFFERS FROM SEVERE ARTHRITIS. SHE HAD HIP REPLACEMENT AND SHE IS ON WHEELCHAIR SHE HAS HEART DISEASE. (b) Provide the relevant DSM-IV code(s) for each mental impairment that you described above. does not exist, write \"N/A.\" DIAGNOSIS: DSM IV CRITERIA: AXIS I : SENILE DEMENTIA 298.9 AXIS II : MEMORY LOSS 780.9 AXIS III : CONFUSIONS N/A 7 AXIS IV : ANXIETY DISORDER 300.4 AXIS V : HEART DISEASE 746.85. ARTHRITIS 716.9. CONNECTION BETWEEN IMPAIRMENT(S) AND INABILITY TO LEARN/DEMONSTRATE KNOWLEDGE The law requires that applicants for citizenship demonstrate (1) an understanding of the English language, including the ability to read, and speak simple words and phrases in ordinary usage; and (2) a knowledge and understanding of the fundamentals of U.S. history and civics. An applicant's difficulty in fulfiling the requirements is not sufficient to support a waiver. In addition, illiteracy in the applicant's native language is not sufficient, by itself, to support a finding of inability to learn and/or demonstrate knowledge. 3. Based on your examination of the applicant, provide detailed information on the connection between the impairment(s) and the applicant's inability to learn and or demonstrate knowledge of English and/or U.S. history and civics (see Instructions for examples). SOLY MELAMED, M n Note: This description should address the severity of the effects of the impai 1030 SncGlendale Aveim that affect the applicant's ability to learn and/or demonstrate knowledge. Glendale, CA 91205 This female patient suffers from Senile Dementa ref: ₽8) her severe memory loss since 4 years ago. Her condition is gradually deteriorating with gradual age growth. She states she forgets to take her medications and family members have to check on her. She forgets the names of family members and close relatives. I conducted Mini-Mental State Exam and her MMSE is 15. She is very anxious and confused. She is unable to follow even simple instructions. She states her mind goes blank. MRI of the brain has been rejected by the patient. She suffers from Claustrophobia causing her fear of covered places, causing her anxiety attacks and palpitation. Because of the above brain disease causing her mental impairment, the patient is unable to learn and memorize new languages and new tasks. Cont Form N-648 (Rev. Page"
}
