{
  "anumber": "A42210183",
  "id": "A42210183_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service"
    },
    "years": {
      "ms_years_nlp_v1": [
        1999,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Immigration and Naturalization Service CITIZENSHIP NOTICE returned File No.: 42 210 183 Date: JUL 01 2003 Officer: P... AGUILUZ Dear Naturalization Applicant: Your application has been continued for the following reason(s): Reexamination on ability to read, write, speak, or understand English; or knowledge of U.S. history and government. You will be notified by mail regarding the date and time of your next interview. A more in-depth interview regarding the issue(s) of: your proof of physical presence in the US. Bring California to ARC and any other Form of ID to your next in terview You will be notified by mail regarding the date and time of your next interview. Another interview regarding your eligibility for exception(s) to the requirement(s) of Section 312 of the I.N.A. You will be notified by mail regarding the date and time of your next interview. Form N-648 is required to establish your eligibility for exception(s) to the requirements of Section 312, INA. Please refer to attachment N-648A for more information. The Form N-648 that you submitted lacks certain required information. Please refer to attachment N-648B for more instructions. No further action on your part is required at this time. Upon receipt of the below checked boxes, your application can be acted upon: Your permanent immigrant file. Your fingerprint background clearance from the FBI. Your military clearance and/or verification of your military service. Other: If you have not received a response after 120 days from the date of this notice, you may mail an inquiry to the following address: Immigration & Naturalization Service, P.O. Box 1668, Bellflower, CA 90706. Please send a copy of this notice with your inquiry. If you have a change of address, please complete and mail the attached change of address form. See Reverse WR-821 (BLF) 09/20/1999"
}