{
  "anumber": "A42210183",
  "id": "A42210183_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT ( (MISSING ARC), A 042 210 183"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1913,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT (MISSING ARC) APPLICANT NAME: Faduma Aden Warsame FILE NO A 042 210 183 DATE 9/16/2003 EXECUTED AT Bellflower Office, Bellflower, CA Before the following officer of the U.S. Immigration and Naturalization Service: Daniel Amos (NAME AND TITLE) in the SOMALI Abdullah Hen language. Interpreter used. I, Faduma Aden Warsame , acknowledge that the above named officer has identified himself/herself to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He/she has informed me that he/she desires to take my sworn statement regarding: He/she hs told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: Q. What is your true, full and complete name? A. Faduma Aden Warsame Q. What is your place and date of birth? A. Somalia, December 31, 1913 Q. Check one or more of the following and explain below in detail: A. 1. My Alien Registration Card was lost/stolen, destroyed or mutilated. 2. I have never received my Alien Registration Card. 3. I was never issued an Alien Registration Card. 4. I am/was a member of the Armed Forces of the United States. EXPLANATION: To LOST ARC FROM HER PURSE Q. Have you filed for a replacement Alien Registration Card? A. Yes Q. Do you understand that if you locate your Alien Registration Card, at any time, you must return it to the Immigration and Naturalization Service? A. Yes I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking. Signature Applicant of 1 16 day of SEPT. , 2003 . Sworn and subscribed before me: Signature INS Officer Signature of Witness (Rev. 11/1/98)"
}