{
  "anumber": "A42210183",
  "id": "A42210183_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0075/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, OPTIONAL FORM 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1990,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PLACE MEDICAL EXAMINATION OF APPLICANTS MORADISHU FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 9.9.90 CITY COUNTRY At the request of the American Consul at MOGADISHU SOMALIA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F WARSAME FADUMO ADEN M I certify that on the above date I examined 1913 WHO BEARS PASSPORT NO. ISSUED BY ON A0136949 SOMALIA 18/6/1990 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Nothing abusmal desarvered Reaction mm in the dust Not Done N 1222 DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ Osman O. MOHAMED 9.9.90 DATE READ SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done Not Done TEST TYPE: TEST TYPE: CPR Elisa DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY F.M.Oman 9.10.90 F.M.Oman 9.10.90 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS 'Class B- 'L' eye cormerl scars APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. 5208 x Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Dr MOHAMOD M MOHIDIN hus 9.11.90 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 GPO : 1989 226-954 DEPT. OF STATE"
}