{
  "anumber": "A42210183",
  "id": "A42210183_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Task B - Continued Cases Quality Assurance Checklist, 04 2210183"
    },
    "years": {
      "ms_years_nlp_v1": [
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S.Department of Justice Immigration and Naturalization Service Task B - Continued Cases Quality Assurance Checklist A#: 042210183 3-Digit Office Code: BEL Date Filed: 1/31/2003 Date of Initial Interview: 7/1/2003 Questions: Yes No N/A Comments: 1. Is (Are) the appropriate Processing Worksheet(s) in the Yes No N/A file? 2. Does (Do) the Processing Worksheet(s) contain the Yes No N/A legible written initials/unique ID code of the person completing each required action, and the date the action was completed? 3. Has the appropriate entry been made to the FD-258 Yes No N/A Control Number line on the Processing Worksheet? 4. If the A-file is present, does the Processing Worksheet Yes No N/A indicate that the A-file relates to the applicant? 5. Was the Processing Worksheet completed to show Yes No N/A that the applicant appeared for the interview? 6. Are all required signatures present on the N-400 and Yes No N/A all other required documents? 7. Were all annotations/changes made by the DAO noted Yes No N/A and numbered on the N-400 in red ink? 8. Were the N-400 questions that were asked by the DAO Yes No N/A and answered during the interview checked off or circled in red ink? 9. Were all annotations/changes made by the DAO Yes No N/A numbered and recorded on the N-400 attestation? 10. If reexamination for Sec 312 eligibility, does the Yes No N/A Not noted on N650 or WR821. Processing Worksheet indicate that the case is a re- Met 312 disab excpt marked exam? as completd 11. In cases that are continued but do not require Yes No N/A additional documentation from the applicant, is the reason for continuance clearly indicated in the remarks section of the Processing Worksheet? 12. If necessary, has any additional documentation been Yes No N/A requested on an N-14/G-56? 13. If the response to #12 is Yes, does the N-14/G-56 give Yes No N/A the applicant a due date to submit the additional documentation? 14. Is the Service copy of the N-14/G-56 filed on the Yes No N/A right hand side of file under all Processing Worksheets? INSPECTED: QAA JACK BLOOMFIELD NOTIFIED: JulyBloomfull 7/3/2003 7/3/03 QA Analyst/Evaluator's Signature (Date) Supervisor's Signature (Date) USE SEPARATE SHEET FOR ADDITIONAL COMMENTS (Include: Task B (Cont.), A#, reviewer's signature, and date) Form N-651B (rev.12/3/99) A#: 042210183 Additional Comment Print Delete Save Cancel"
}