{
	"anumber": "A42210183",
	"id": "A42210183_0060",
	"page_index": 60,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42210183_0060/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Adjustment of Status to Permanent Resident ( Form I-430"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "chment is I-72 (I-130) OMITTED ITEMS: Complete items on the petition. OATB/AFFIRMATION: Petition must be notarized below signature by a Notary Public. This is avail ble at the nearest Immigration office. CONSULATE DESIGNATION: Fully complete this item, as beneficiary may not be eligible to adjust status within the United States. ERRORS: Please review the petition. It appears that item(s) have been marked in error. Initial all corrections. TRANSLATION: All foreign language documents must be accompanied by a certified English translation. All English translations must be accompanied by foreign language documents. PHOTOSTATIC COPIES: Photostatic copies are not acceptable unless they have been sealed or certified by the is- suing office. Resubmit the petition with certified copies. If you wish for the copies to be returned, then also submit a set of duplicates. VERIFICATION OF STATUS: This office has been unable to verify your present status, as a legal permanent resident or a naturalized U.S. citizen. Resubmit the petition in person at the nearest Immigration office. Bring your naturalization certificate OF alien card. PRIORITY DATE: A claim is made with the petition that the beneficiary is entitled to a priority date other than the date of filing of this petition. Resubmit the petition with evidence to substantiate that claim. Such evidence may be in the form of an original copy of a letter of notification of priority date, as issued by an American Consulate. Any evidence provided must be in the original, or be a certified copy. SECONDARY EVIDENCE REQUIRED: It has been determined that the documents provided do not clearly establish the relationship alleged. Resubmit the petition together with further evidence regarding the For your convenience a list of examples of acceptable evidence is attached. Any other evidence you submit will also be considered before a final decision is made. CERTIFICATE OF NON-EXISTENCE OF RECORD: For petition approval the Service requires submission of primary evidence, where available. Primary evidence consists of birth/marriage/divorce/death records, as issued by the appropriate state authorities. Secondary evidence in the form of affidavits/school records/ church records are not accep- ted when primary evidence is available. Service records indicate that such primary evidence is available from the state/country where the event in question took place. Therefore, resubmit the petition with a copy of the or a LETTER OF NON-EXISTENCE OF RECORD for the event from the governmental authority having jurisdiction over those records. BIRTH CERTIFICATE: Submit a certified copy of the birth certificate(s) of DELAYED BIRTH CERTIFICATE; It is noted that the birth certificate(s) of was/were delayed registration(s), not recorded until years after the event(s). Therefore, further evidence is requested to establish the relationship. Please see the list of examples that is attached which may be submitted. NO MOTHER'S/FATHER'S NAME: It is noted that the name of the mother/father is not shown on the birth certificate(s) of You are therefore requested to submit supporting evidence to establish the claimed relationship. BAPTISMAL CERTIFICATE: Submit a certified copy(ies) of the baptismal certificate(s) of MARRIAGE CERTIFICATE: Submit copy of the certificate showing the marriage between and 9/87"
}
