{
  "anumber": "A42495127",
  "id": "A42495127_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information About Your Employment and Schools You Attended, N-400"
    },
    "years": {
      "ms_years_nlp_v1": [
        2011,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 2016073521220 2902802 000695 $2 w526888 042716 06:51 0425 Part 8. Information About Your Employment and Schools You Attended A- 042495127 List where you have worked or attended school full time or part time during the last five years. Provide information for the complete time period. Include all military, police, and/or intelligence service. Begin by providing information about your most recent or current employment, studies, or unemployment (if applicable). Provide the locations and dates where you worked, were self-employed, were unemployed, or have studied for the last five years. If you worked for yourself, type or print \"self-employed.\" If you were unemployed, type or print \"unemployed.\" If you need extra space, use additional sheets of paper. Employer or School Name NOT WORKING - retired children support splint Street Number and Name Apt. Ste. Flr. Number City or Town State ZIP Code + 4 - Province or Region Postal Code Country (foreign address only) (foreign address only) (foreign address only) Date From (mm/dd/yyyy) Date To (mm/dd/yyyy) Your Occupation 2011 present 2. Employer or School Name Street Number and Name Apt. Ste. Flr. Number City or Town State ZIP Code + 4 - Province or Region Postal Code Country (foreign address only) (foreign address only) (foreign address only) Date From (mm/dd/yyyy) Date To (mm/dd/yyyy) Your Occupation 3. Employer or School Name Street Number and Name Apt. Ste. Flr. Number City or Town State ZIP Code + 4 - Province or Region Postal Code Country (foreign address only) (foreign address only) (foreign address only) Date From (mm/dd/yyyy) Date To (mm/dd/yyyy) Your Occupation Form N-400 03/26/16 N Page 6 of 20"
}