{
	"anumber": "A42495127",
	"id": "A42495127_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Citizenship and Immigration Services"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2016, 2011, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 ARTMEN U.S. Citizenship ELEMOND SAINT LOUIS and Immigration 934 NW 206 STREET HOMELAND SECURITY Services MIAMI,GARNDES, FL 33169 Date: July 19, 2016 File: A042495127 Please come to this office at the date, time, and place indicated below in connection with an official immigration matter. On: Thursday, July 28, 2016 At: 7:00 AM Re: N-400 Place: 5880 NW 183rd Street Hialeah, Florida 33015 Bundle Num: 0 You are hereby notified to appear for an interview on your Application for Naturalization at the date, time, and place indicated above. Waiting room capacity is limited. Please do not arrive any earlier than 30 minutes before you scheduled appointment time. The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately to the USCIS office listed above with your explanation and a request for a new appointment; otherwise, it may result in the denial of your application. If you are applying for naturalization for yourself, you will be tested on your knowledge of the government and history of the United States. You will also be tested on reading, writing, and speaking English, unless on the day you filed your application, you had been living in the United States for a total of at least 20 years as a lawful permanent resident and were 50 years old, or you had been living in the United States for a total of 15 years as a lawful permanent resident and were over 55 years old, or unless you have a medically determinable disability (you must have filed form N-648 Medical Certification for Disability Exception, with your N-400 Application for Naturalization). Please bring to the interview the following: 1. This letter; 2. Alien permanent resident card; 3. Certified police clearances from all the jurisdictions, where you have been residing from Feb. 2011 to PRESENT. Please provide police clearance letter from Miami- Dade; 4. Two Color Photos. The photos must be glossy, un-retouched and un-mounted, and have a white background. All photos must meet the current specifications for a passport photo; 5. Original Birth certificate of Elemond Saint Louis. YOU MUST BRING ALL ORIGINAL DOCUMENTS AND A PHOTOCOPY OF EACH ORIGINAL DOCUMENT TO YOUR INTERVIEW. YOU MUST SUBMIT A CERTIFIED ENGLISH TRANSLATION OF ALL FOREIGN LANGUAGE DOCUMENTS Failure to submit the requested documentation and/or appear at the interview may result in the denial of your application. If applicable, you must provide an interpreter at the next interview if you meet a language exception or waiver. Att: Olga Domenech, ISO2"
}
