{
	"anumber": "A42495127",
	"id": "A42495127_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Interview, N-652"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 U.S. Department of Justice Naturalization Interview Immigration and Naturalization Service The Immigration and Naturalization Service (INS) processes applications and determines eligibility of people who want to become naturalized United States citizens. As part of the naturalization process, an INS Officer will interview you to determine if you are eligible for naturalization. An individual who seeks naturalization must meet the following requirements: lawful admission for permanent residence, a minimum residency period, a minimum period of physical presence in the United States, demonstration of good moral character and attachment to the Constitution, an understanding of the English language and knowledge of the history and government of the United States. At the naturalization interview, the INS officer will: Provide Professional, Efficient, and Courteous Service and explain the nature of the interview and the requirement that the interview be conducted under oath. Allow an Attorney or Other Representative who has filed a Form G-28 with the INS to accompany you during the interview. In addition, if you are exempt from the English language requirements, you may bring an interpreter to the interview, or the INS may select an interpreter for you. If you have certain disabilities, a family member, or legal guardian may accompany you during the interview, at the discretion of the INS officer. Test Your Understanding of English and Knowledge of the History and Government of the United States, and provide you with the test results. Your understanding of spoken English will be judged by your answers to questions normally asked during the interview. If necessary, the INS officer will repeat or reword questions until satisfied that you understand the questions or do not understand spoken English. If you do not pass the tests at the first naturalization interview, the INS will schedule a second interview for you to take the tests again. If you are exempt from any of these requirements, or if you present a certificate from an authorized testing entity stating you passed the test, the INS officer will not test you at the interview unless there is evidence of fraud. Receive Your Oral or Documentary Evidence to support your claim to eligibility for naturalization. You must also answer all of the INS officer's questions during the interview that relate to your eligibility for naturalization. If you have questions or comments regarding your interview, you may ask to speak with an INS supervisor. You may also mail questions or comments to the district director or officer-in-charge of the interview location, or to the INS Executive Secretariat, Attention: Customer Service Comments, 425 I Street, NW, Washington, DC 20536. After your naturalization interview, the INS officer will fill out the information below which you may retain with your naturalization records. A # 47495 127 On 12/4/98 you were interviewed by INS officer Fresia Doove The results of the evaluation of your understanding of English and knowledge of the history and government of the United States are: You passed the English language test. You failed to demonstrate the ability to speak/ read/ write English. You are exempt from the English language requirement, or the requirement was waived. You passed the history and government test. You failed to demonstrate a knowledge of the history and government of the United States. The history and government requirement was waived. If during the interview you failed to demonstrate an understanding of the English language or a knowledge of the history and government of the United States, you will/ will not be scheduled for another interview to take the tests again. The INS will notify you later of the final decision on your application. Form N-652 (1/12/98)"
}
