{
  "anumber": "A42495127",
  "id": "A42495127_0083",
  "page_index": 83,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0083/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Extraits des registres des actes de mariage de la commune de l'Anse à Foleur"
    },
    "years": {
      "ms_years_nlp_v1": [
        1987,
        2023,
        1946,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "? a Screened by NARA, 9/26/2023 REPUBLIQUE D'HAITI Extrait des registres des actes de mariage de la commune de l'Anse à Foleur deposes au Bureau des Archives Nationales de la Republique. VVV No 14442 L'An mil neuf cent cuarante six an 143e de l'Independance et le trente et unitime jour du mois de Decembre à huit heures in matin. Nous ERNEST KNAGCS, Officier de l'Etat civil de la commune de 1'Anse a Fo- leur soussigné; Vu les pieces à nous transmises par#. curé de la par B'HAITI. U G.1.35 entime roisse conformément à l'article 6 de la Loi du 16 Decembre 1929 modi- JUSTICE TOUS POUR fiée car celle du 26 Janvier 1945. Constatons, enregistrons et certi- fions qu'après les publications dûment faites aucune opposition n' ayant été signifiée au susdit ministre religieux. Monsieur ELEMONT FUCIEN SAINT LOUIS, cultivateur agé de trente et un ens, né à Vieux ANNEE 1946 Caille domicilié sur l'habitation Vieux Caille sise dans la section ru PAGE 28 rale des Cotes de Fer commune de l'Anse à Foleur fils de FICIEN LUCIEN NUMERO 28 SAINT LOUIS, cultivateur domicilié à Vieux Caille et de DORGINA DORVIL Cultivatrice domiciliée à Vieux Caille stipulant pour lui et en son ACTS DE MARIAGE DE: nom personnel d'une part. Et LUMINA CASIMIR, cultivatrice ELEMONT FUCIEN SAINT agée de vingt huit ans née à Léandre domiciliée sur l'habitation Léan- LOUIS et de LUMINA C/A dre sise dans la section rurale des Cotes de Fer commune de l'anse a BIRTH, le 19 Decembre Foleur fille de ALCEMA CASIMERcultivateur domiciliée à Léandre et 1946, rural timbre no de HERMINA LORVINSKY, cultivatrice domiciliée à Léandre stipulant 4125 pour elle et en son nom personnel d'autre part. Se sont pré- L'abbé THEODORE B. WILS-- sentés le dix neuf Decembre mil neuf cent quarante six à cing heu- res du matin à l'Eglise de cette Paroisse pour contracter mariage. A la question s'ils consentaient à se prendre pour époux, ils ont répondu chacun séparément et affirmativement en présence du susdit ministre religieux et de 1) MARC TOUSSAINT age de quaralite huit ans membre de l'agricultire domicilié all Bourg de cette paroisse 2) Ma- dame DUCASSE JUSTILIEN, marchande agée de cinquente ans, domiciliés auBourg de cette paroisse. Ils ont été ainsi unis parle mariage. l'actedressé par le susdit ministre religieux a été signé par lvi. TH. B. WILSHANS curé de la paroisse. En fci de quoi avons dressé et si gné le présent acte conformément & la Loi. WARNEST KNAGGS. Port au Prince le 12 Juin 1987. STOWER POUR COPIE CONFORME A.N.H/A-243549 COLLATIONNES M.E DELLY JEAN WILFRID BERTRAND REPUBLIQUE BENEFIT DIRECTEUR GENERAL"
}