{
  "anumber": "A42495127",
  "id": "A42495127_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application,, N-400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 2016073521220 2902932 010665 62 W526888 042716 06:51 04 Part 12. Additional Information About You (Person Applying for A- 042495127 Naturalization) (continued) 44. A. Are you a male who lived in the United States at any time between your 18th and 26th birthdays? Yes x No (This does not include living in the United States as a lawful nonimmigrant.) B. If you answered \"Yes,\" when did you register for the Selective Service? Provide the information below. Date Registered Selective Service (mm/dd/yyyy) Number 14 C. If you answered \"Yes,\" but you did not register with the Selective Service System and you are: 1. Still under 26 years of age, you must register before you apply for naturalization, and complete the Selective Service information above; OR 2. Now 26 to 31 years of age (29 years of age if you are filing under INA section 319(a)), but you did not register with the Selective Service, you must attach a statement explaining why you did not register, and provide a status information letter from the Selective Service. Answer Item Numbers 45. ⑉ 50. If you answer \"No\" to any of these questions, include a typed or printed explanation on additional sheets of paper and provide any evidence to support your answers. 45, Do you support the Constitution and form of Government of the United States? X Yes No 46. Do you understand the full Oath of Allegiance to the United States? x Yes No 47. Are you willing to take the full Oath of Allegiance to the United States? x Yes No 48. If the law requires it, are you willing to bear arms on behalf of the United States? X Yes No 49. If the law requires it, are you willing to perform noncombatant services in the U.S. armed forces? x Yes No 50. If the law requires it, are you willing to perform work of national importance under civilian direction? X Yes No Part 13. Applicant's Statement, Certification, and Signature NOTE: Read the Penalties section of the Form N-400 Instructions before completing this part. Applicant's Statement NOTE: Select the box for either Item A. or B. in Item Number 1. If applicable, select the box for Item Number 2. 1. Applicant's Statement Regarding the Interpreter A. I can read and understand English, and I have read and understand every question and instruction on this application and my answer to every question. B. The interpreter named in Part 14. read to me every question and instruction on this application and my answer to every question in a language in which I am fluent, and I understood everything. 2. Applicant's Statement Regarding the Preparer At my request, the preparer named in Part 15., prepared this application for me based only upon information I provided or authorized 15 Appleur's Children Helped Prepare Applian Form N-400 03/26/16 N Page 16 of 20"
}