{
  "anumber": "A42495127",
  "id": "A42495127_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0023/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Oath Ceremony Questionnaire, N-4-5"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 INSTRUCTIONS: You MUST bring this completed questionnaire with you to the Naturalization Oath Ceremony, along with the documents listed on the front side of this notice. You are required to give these items to an employee of USCIS at the oath ceremony. Answer the following questions on the day of your Naturalization Oath Ceremony. Please note that these questions do not refer to any events that happened before your naturalization interview. These questions refer to the time period after your interview at the USCIS office. For example, if you were married at the time of your interview and there has been no change in your marital status since your interview, select \"NO\" to Item Number 1 below. If you traveled outside the United States after your interview, select \"YES\" to Item Number 2 below. After you have answered each question, print the date and the location (city and state) where you completed the questionnaire. Also, sign the questionnaire and print your current address. 1. Since your interview, have you married, or been widowed, separated or divorced? Yes No 2. Since your interview, have you traveled outside the United States? Yes No 3. Since your interview, have you knowingly committed any crime or offense, for which you have not Yes No been arrested? 4. Since your interview, have you been arrested, cited, charged, indicted, convicted, fined, or Yes No imprisoned for breaking or violating any law or ordinance, including traffic violations? 5. Since your interview, have you joined, become associated, or connected with any organization in any Yes No way, including the Communist Party, a totalitarian organization, or terrorist group? 6. Since your interview, have you deserted from, claimed exemption from, or been separated or Yes No discharged from military service? 7. Since your interview, has there been any change in your willingness to bear arms on behalf of the Yes No United States; to perform non-combatant service in the armed forces of the United States; or to perform work of national importance under civilian direction if the law requires it? 8. Since your interview, have you practiced polygamy, received income from illegal gambling, been Yes No involved in prostitution, helped anyone enter the United States illegally, trafficked controlled substances, given false testimony to obtain immigration benefits, or been a habitual drunkard? I certify that each answer shown above was made by me or at my direction, and that each answer is true and correct as of the date of my Naturalization Oath Ceremony. Signed at Hialeah FL. on 09-10-2016 City and State Date Signature X Full Address and ZIP Code Street Number and Name Apt. Ste. Flr. Number 934 N.W.206 thst. City or Town miami Gardens F State ZIP Code FL 33169 Form N-445 11/13/14 N Page 2 of 3"
}