{
  "anumber": "A42495127",
  "id": "A42495127_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information About Your Marital History (continued, N-400 03/26/16 N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2012,
        2023,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 3016073521220 2902602 510665 62 $42726 CLALIS-660060 Part 10. Information About Your Marital History (continued) A- 042495127 F. My Current Spouse's Date of Marriage G. Date My Current Spouse's Marriage Ended with Prior Spouse (mm/dd/yyyy) with Prior Spouse (mm/dd/yyyy) H. How My Current Spouse's Marriage Ended with Prior Spouse Annulled Divorced Spouse Deceased Other (Explain): 9. If you were married before, provide the following information about your prior spouse. If you have more than one previous marriage, provide that information on additional sheets of paper. A. My Prior Spouse's Legal Name Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) Saint Louis Lumina B. My Prior Spouse's Immigration Status When My Marriage Ended (if known) U.S. Citizen Lawful Permanent Resident Other (Explain): c. My Prior Spouse's Date of Birth D. My Prior Spouse's Country (mm/dd/yyyy) of Birth 10/25/18 Haiti E. My Prior Spouse's Country of F. Date of Marriage with My Prior Citizenship or Nationality Spouse (mm/dd/yyyy) Haiti 2/19/46 G. Date Marriage Ended with My Prior Spouse (mm/dd/yyyy) 12/01/2012 H. How Marriage Ended with My Prior Spouse Annulled Divorced Spouse Deceased Other (Explain): Part 11. Information About Your Children 1. Indicate your total number of children. (You must indicate ALL children, including: children who are alive, missing, or deceased; children born in the United States or in other countries; children under 18 years of age or older, children who are currently married or unmarried; children living with you or elsewhere; current claim 5 stepchildren; legally adopted children; and children born when you were not married.) children 2. Provide the following information about all your children (sons and daughters) listed in Item Number 1., regardless of age. To list any additional children, use additional sheets of paper. claim all A. Child 1 7 5 we cities) Current Legal Name Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) SAINT LOUIS LEONEL A-Number (if any) Date of Birth (mm/dd/yyyy) Country of Birth A- 08/27/1947 HAITI Form N-400 03/26/16 N Page 9 of 20"
}