{
  "anumber": "A42495127",
  "id": "A42495127_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTITUTIONS, N° 74424"
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1987,
        1945,
        1929,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 E MITS FRATERNIVE RD#7623LM U AITI Extr it des registros des actes de mariage de la commune da l'anse A Feleur deposes at Lurcat des Archives Nationales de la Republique. DES VVV No 74442 1.50 L'An mil neul cont overante six an 1/30 de l'Independence et le trente et uni°a jour an nois de Decembre à huit heures is matin. Nous BRNSST KENCOS, Officier de l'Etat civil de la communo do l'Anse A Fo- lour novasi .e; Vu les sieces à nous transmises par... curé de la par roisse conformément : Urticle 6 de la Lci du 16 D.cembre 1929 modi- U G.1.35 entime TOUS fiée ar celle du 26 Jervier 1945. Constatons, enregistrons et certi- POUR ficns cu'après les publications dûment faites aucune opposition n' pyant été signified an susdit ministre religieux. Monsieur ELEMONT FUGIEN SAINT IO.I., cultivateur agé de trente et un ans, né à Vieux ANDOR 1946 Caille demicilié sur l'habitation Vieux Caille sise dans la section ru PACE 28 rale des Cotes de Fer commune de l'Anse à Foleur fils de FOCIEN LUCIEN NUILRO 28 SAINT LOUIS, cultiviteur comicilié à Vieux Caille et de DORGINA DORVIL Cultivatrice domicilién : Vieux Caille stipulant pour lui et en son ACT. DE MARIAON III: non personnel d'une part. Et LUMINA CASIMIR, cultivatrice ELEHOIRE FUCIDI S INT Agée de vingt huit ans née à Léandre domiciliée sur l'habitation Léan- LOLIS et de LL INA CA are sise dans la section rurale des cotes de Fer comune de l'anse a SIMIR, le 19 Decet 23 Foleur fille de ALCEDA CASTMTRoultivateur domiciliée à Léandre et 1946, rural re 1.0 de HERMINA LORVINSKY, cultivatrice domiciliée à Léandre stipulant 4125 pour elle et en son nom personnel d'autre part. Se sont pré- 1' abb sentés le dix neuf Decembre mil neuf cent quarante six à cinc heu- res du matin E 1'Eglise de cette Faroisse pour contracter mariage. A la question s'ils consentaient à se prendre pour époux, ils ont répondu chac séparément et affirmativement en présence du susdit ministre religieux et de 1) MARC TOUSSAINT age de quarante huit ans membre de Digginultire domicilié all Sourg de cette paroisse 2) Na- dame LUCASOR JUSCILINN, marchande age de cinquente ans, domiciliée auBeurg de cette parcisse. Ils ont été ainsi unis parle mariage. l'actedressé par le susdit ministre religieux 8 été signé par lvi. curé do la parcisse. En fci de quoi avons dressé et si gué le présent acte conformément a la Doi. KNAGCS. Port-au Prince le 12 Juin 1987 OUR COPIE CONFORME COLLATIONIEE JIMA WILFRID BIRTHAND DEPARTMENT DIRECTNOR GENERAL REPUBLIQUE"
}