{
  "anumber": "A42495127",
  "id": "A42495127_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Denial Letter"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 A 42495127 Your application for naturalization is denied because-- I. You have failed to submit the document(s) requested on Form N-14 and/or your failure to establish by a preponderance of the evidence that you meet all the requirements for naturalization pursuant to 8 C.F.R. 316.2(b) relative to: Lawful admission for permanent residence Proof of physical presence Proof of continuous residence Original certified copies of the entire record of all your arrests as requested relative to Good Moral Character and/or deportability Proof of child support for the period required by law Proof of registration with the Selective Service Other: II. You have failed to establish: Your lawful admission to the United States for permanent residence pursuant to Section 316(a)(1) of the Act and 8 C.F.R. 316.2(a)(2). You have resided continuously within the United States. for a period of at least five years after having been lawfully admitted for permanent residence pursuant to Section 316(a)(1) of the Act and 8 C.F.R. 316.2(a)(3). You have been physically present in the United States for at least 30 months of the 5 years preceding the date of filing the application pursuant to Section 316(a)(1) of the Act and 8 C.F.R. 316.2(a)(4). You have resided continuously within the United States from the date of application for naturalization up to the time of admission to citizenship pursuant to Section 316(a)(2) of the Act and 8 C.F.R. 316.2(a)(6). You have been and continue to be a person of good moral character during the period required by law pursuant to Section 316(a)(3) of the Act and 8 C.F.R. 316.2(a)(7) by reason of: Your conviction for Your failure to pay child support Your failure to register with the Selective Service Other: Deportation proceedings are terminated pursuant to Section 318 of the Act. III. You have failed to demonstrate pursuant to Section 312(a) of the Act: An ability to read, write, & speak English An ability to write English Sufficient knowledge and understanding of the fundamentals of the history, and of the principles and form of government. of the United States. IV. You failed to appear for on V. OTHER:"
}