{
	"anumber": "A42495127",
	"id": "A42495127_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 13. Applicant's Statement, Certification, and Signature ( (continued), Form N-400 03/26/16 N"
		},
		"years": {
			"ms_years_nlp_v1": [2016, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 2900802 039665 62 w526888 042716 06:51 0 Part 13. Applicant's Statement, Certification, and Signature (continued) A- 042495127 Applicant's Certification Copies of any documents I have submitted are exact photocopies of unaltered, original documents, and I understand that USCIS may require that I submit original documents to USCIS at a later date. Furthermore, I authorize the release of any information from any of my records that USCIS may need to determine my eligibility for the immigration benefit that I seek. I further authorize release of information contained in this application, in supporting documents, and in my USCIS records to other entities and persons where necessary for the administration and enforcement of U.S. immigration laws. I understand that USCIS will require me to appear for an appointment to take my biometrics (fingerprints, photograph, and/or signature) and, at that time, I will be required to sign an oath reaffirming that: 1) I reviewed and provided or authorized all of the information in my application; 2) I understood all of the information contained in, and submitted with, my application: and 3) All of this information was complete, true, and correct at the time of filing. I certify, under penalty of perjury, that I provided or authorized all of the information in my application, I understand all of the information contained in, and submitted with, my application, and that all of this information is complete, true, and correct. Applicant's Signature 3. Applicant's Signature Date of Signature (mm/dd/yyyy) 04/13/2016 NOTE TO ALL APPLICANTS: If you do not completely fill out this application or fail to submit required documents listed in the Instructions, USCIS may deny your application. Part 14. Interpreter's Contact Information, Certification, and Signature Provide the following information about the interpreter. Interpreter's Full Name 1. Interpreter's Family Name (Last Name) Interpreter's Given Name (First Name) 2. Interpreter's Business or Organization Name (if any) Interpreter's Mailing Address 3. Street Number and Name Apt. Ste. Flr. Number City or Town State ZIP Code 4 - Province Postal Code Country Form N-400 03/26/16 N Page 17 of 20"
}
