{
  "anumber": "A42495127",
  "id": "A42495127_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Naturalization Oath Ceremony, N-445"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 N-445 lotice of Naturalization Oath emony DEPARTMENT USCIS Form N-445 Department of Homeland Security OMB No. 1615-0054 U.S. Citizenship and Immigration Services Expires 04/30/2016 A-Number Date A042 495 127 09/06/2016 Sworn Statement For USCIS Other ELEMOND SAINT LOUIS Use 934 NW 206 ST Only FCO: MIAMI GARDENS FL 33169 United States Citizenship and Immigration Services (USCIS) thanks you for your interest in becoming a United States citizen. You must now appear at a Naturalization Oath Ceremony to complete the naturalization process. You are scheduled to appear for a Naturalization Oath Ceremony on: Date and Time: Saturday, September 10, 2016 at 01:00PM Location: 5880 NW 183RD STREET, MAIN LOBBY 1ST FLOOR HIALEAH FL 33015 Please bring the following with you: This notice with the reverse side completed. Please refer to the instructions on the reverse side. Your permanent Resident Card (\"green card\"). All Reentry Permits or Refugee Travel Documents you may have, valid or expired. Any other documents USCIS issued to you. The naturalization ceremony is a solemn and meaningful event. USCIS asks that you dress in proper attire to respect the dignity of the event. If you cannot come to this ceremony, return this notice immediately with a written explanation on why you cannot attend. You will then receive an appointment for a ceremony at a later date. If you require an accommodation, such as a sign language interpreter, please contact the USCIS National Customer Service Center at 1-800-375-5283, at least 10 days prior to your scheduled ceremony. Please answer the questionnaire on the reverse side of this notice on the day of your scheduled ceremony. Print clearly in black ink. Please read the instructions before answering the questions, which concern events that may have occurred since your interview. If you answer \"YES\" to any of the questions, bring documents to support your answers. For example, if you married or divorced after your interview, bring your marriage certificate or divorce decree. If you were arrested after your interview, bring your arrest records and court dispositions. If you were serving in the military and have been discharged, bring your DD214 or other discharge papers. INSTRUCTIONS: You MUST bring this completed questionnaire with you to the Naturalization Oath Ceremony, along with the documents listed on the front side of this notice. You are required to give these items to an employee of USCIS at the oath ceremony. Answer the following questions on the day of your Naturalization Oath Ceremony. Please note that these questions do not refer to any events that happened before you naturalization interview. These questions refer to the time period after your interview at the USCIS office. For example, if you were married at the time of your interview and there has been no change in your marital status since your interview, select \"NO\" to Item Number 1 below. If you traveled outside of the United States after your interview, select \"YES\" to Item Number 2 below. After you have answered each question, print the date and the location (city and state) where you completed the questionnaire. Also, sign the questionnaire and print your current address. Form N-445 11/13/14 N Page 1 of 2"
}