{
  "anumber": "A42495127",
  "id": "A42495127_0078",
  "page_index": 78,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0078/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SAuf Disposition Contraire stipulée par le Loi, les Etrangers Entrants dans Une Quelque Categories Suivantes Ne Peuvent être Admis à Recevoir Un Visa d'Immigration, M 2 (30"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 OPTIONA M 230 (French) (Rev. 6-82) page 3 es lois des Etats-Unis régissant la délivrance des visas exigent que tout postulant qui sollicite un visa déclare si il ou elle appartient ou on à l'une des catégories d'individus non admissibles aux Etats-Unis. Les catégories non admissibles sont décrites ci-dessous. Veuillez lire attentivement les paragraphes qui suivent; la compréhension de leur teneur et les réponses données aux questions qui suivent permettront au fonctionnaire du consulat de juger si vous remplissez les conditions requises pour recevoir un visa. SAUF DISPOSITION CONTRAIRE STIPULEE PAR LA LOI, LES ETRANGERS ENTRANT DANS L'UNE QUELCONQUE DES CATEGORIES SUIVANTES NE PEUVENT ETRE ADMIS A RECEVOIR UN VISA D'IMMIGRATION a) Les étrangers faibles d'esprit, atteints d'aliénation mentale ou ayant eu une ou plusieurs attaques de folie; les étrangers ayant une personnalité psychopatique, ceux atteints de deviation sexuelle ou de déficience mentale, les toxicomanes, les alcooliques chroniques ou ceux atteints de toute maladie contagieuse dangereuse; les étrangers affligés d'un vice de conformation, d'une maladie ou d'une infirmité qui serait de nature à affecter leur aptitude à gagner leur vie; les étrangers qui sont des indigents, des mendiants de profession ou des vagabonds; les étrangers ayant été condamnés pour un délit impliquant la turpitude morale ou qui admettent avoir commis des actions constituant les éléments essentiels d'un tel delit, ou qui ont été condamnés à des peines de prison d'un total d'au moins cinq ans pour avoir commis deux délits au moins; les étrangers qui sont polygames, ou qui pratiquent ou préconisent la polygamie; les étrangers se livrant ou qui se sont livrés à la prostitution, qui en ont tire profit, qui ont procuré ou importé des personnes dans un but de prostitution, ou qui cherchent à entrer aux Etats-Unis dans le but de se livrer à la prostitution ou à tout autre vice commercialisé, ou à toutacte sexuel immoral; les étrangers qui cherchent à entrer aux Etats-Unis pour exercer un travail spécialisé ou non spécialisé et qui n'y ont pas été autorisés par le Ministère du Travail; et les étrangers susceptibles de tomber à la charge des institutions publiques des Etats-Unis. Appartenez-vous à l'une quelconque des catégories énumérées ci-dessus? Oui Non (Dans l'affirmative donnez des explications) b) Les étrangers qui sollicitent à nouveau leur admission moins d'une année après la date de leur expulsion des Etats-Unis, ou qui au cours des cinq dernières années ont été arrêtés et expulsés des Etats-Unis, ou qui ont été déplacés aux frais du Gouvernement au lieu d'être expulsés, ou qui ont été déplacés parce que tombés dans la détresse ou en tant que sujets d'un pays ennemi; les étrangers qui obtiennent ou tentent d'obtenir un visa ou toute autre documentation par fraude ou fausse déclaration intentionnelle; les étrangers ne répondant pas aux conditions requises pour acquérir la nationalité américaine, ou qui ont quitté les Etats-Unis, ou sont restés en dehors des Etats-Unis, pour éviter de satisfaire à leurs obligations militaires en temps de guerre ou pendant une periode d'urgence nationale; les étrangers qui ont été condamnés pour infraction ou pour complot d'infraction à certaines lois ou certains règlements concernant les stupéfiants ou la marijuana, ou qui sont connus comme trafiquants illicites de stupéfiants ou de marijuana ou supposés en être ou en avoir été; les étrangers qui cherchent à entrer aux Etats-Unis à partir de territoires étrangers limitrophes ou des iles voisines avant expiration d'un séjour de deux ans, s'ils s'y sont rendus à bord d'un avion ou d'un bateau appartenant à une compagnie de transports non conventionnée; les étrangers incapables de lire et de comprendre une langue ou un dialecte quelconque; les étrangers qui ont, sciemment et pour en tirer profit, encouragé ou aidé tout autre étranger à entrer ou à essayer d'entrera Etats-Unis en enfreignant la loi; les étrangers. anciens visiteurs au titre d'un programme d'échange, qui n'ont pas rempli la condition requise de xannées de résidence hors des Etats-Unis: et les étrangers diplômés d'écoles de médecine étrangères qui se destinent à exercer la profession médicale aux Etats-Unis ne sont pas admis à recevoir un visa à moins qu'ils n'aient passé les parties I et II de l'examen NBME ou un examen équivalent tel que stipulé par le Ministère de la Santé et des Ressources Humaines. Appartenez-vous à l'une quelconque des catégories énumérées ci-dessus? Oui Non (Dans l'affirmative, donnez des explications) c) Les étrangers qui sont, ou qui ont été à quelque moment que ce soit, anarchistes ou membres affiliés de tout parti communiste ou autre parti totalitaire, y compris toute subdivision ou filiale; les étrangers qui préconisent ou professent, ou qui ont préconisé ou professé, soit par leurs propos personnels, soit au moyen de tous écrits ou de toutes publications, soit par leur affiliation à une organisation: 1) l'opposition à tout gouvernement organisé; 2) le renversement du gouvernement par la force et la violence; 3) l'attentat contre des fonctionnaires ou leur assassinat en raison de leurs fonctions officielles, 4) la destruction illégale de biens, 5) le sabotage, ou 6) les doctrines du communisme international ou l'établissement aux Etats-Unis d'une dictature; les étrangers qui cherchent entrer aux Etats-Unis pour se livrer à des activités préjudiciables ou des activités illégales de nature subversive. Appartenez-vous à l'une quelconque des catégories énumérées ci-dessus? Oui Non (Dans l'affirmative, donnez des explications) d) Lesétrangers qui durant la période comprise entre le 23 Mars 1933 et le 8 Mai 1945, ont, sous le contrôle direct ou indirect du gouvernement nazi de l'Allemagne, ou du gouvernement de tout pays occupé par, ou allié à ce gouvernement, ordonné, incité, aidé, participé de quelque manière que ce soit à la persécution de toute personne du fait de sa race, de sa religion, de ses origines nationales ou de ses opinions politiques. Appartenez-vous à l'une quelconque des catégories énumérées ci-dessus? Oui Non (Dans l'affirmative, donnez des explications) 41. Vous a-t-on aidé à remplir la présente demande? (Dans l'affirmative, donnez le nom et l'adresse de la personne qui vous a aidé en indiquant s'il s'agit d'un parent, d'un ami, d'un représentant d'agence de voyages, d'un homme de loi ou de toute autre personne) Oui Non Nom Adresse Qualité FOIA (b)(6)"
}