{
  "anumber": "A42495127",
  "id": "A42495127_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/26/2023, MIAMI-DADE POLICE DEPARTMENT"
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2023,
        2006,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 MIAMI-DADE COUNTY, FLORIDA MIAMI-DADE POLICE DEPARTMENT 799 N.W. 81 STREET MIAMI, FLORIDA 33150-2713 MIAMIDADE COUNTY Date: 7-25-2016 To Whom It May Concern: A name search of the Miami-Dade Police Department (MDPD) arrest records under the name of: Name: ELEMOND SAINT LOUIS Race/Sex: B/M AKA: Date of Birth: 08-25-1915 MDPD Criminal Identification Number: No Local Record Criminal Registration Only/No Local Record Local Felony Arrest Record(s) For Case Disposition Contact: (305) 275-1155 Copy on File Felony Division Copy Not on File 1351 NW 12 Street Miami, Florida 33125 Local Misdemeanor Arrest Record(s) For Case Disposition Contact: (305) 275-1155 Copy on File Misdemeanor Division Copy Not on File 1351 NW 12 Street Miami, Florida 33125 Local Traffic Arrest Record(s) For Case Disposition Contact: (305) 275-1111 Copy on File Traffic Division Copy Not on File 1351 NW 12 Street, Room 124 Miami, Florida 33125 Other Local Agency Arrest Record(s) Civil Division (305) 275-1155 73 W. Flagler Street Miami, Florida 33142 Case Numbers: DADERS NORTHSIDE DISTRICT Comments: Date: 7-25-2016 Researched by (Name/Title): OFC. T. WILLIAMS 5644 COUNTY Print and Sign ID/Badge# Date: 7-25-2016 Prepared by (Name/Title): OFC. T. WILLIAMS 5644 Print and Sign ID/Badge# NOTE: Not valid unless the seal of the MDPD is affixed. The MDPD is prohibited from disclosing the existence of juvenile criminal history information, as well as records that have been sealed or expunged. Therefore, if \"No Local Record\" is indi- cated, there remains the possibility that juvenile, sealed or expunged records may be associated with the above name that cannot be disclosed. There is also the possibility that an adult or juvenile may have been arrested in a jurisdiction other than Miami-Dade County. The Florida Department of Law Enforcement may disclose information related to criminal history for certain licensing and employment purposes as provided by law. They may be contacted at 1-800-342-0820. 32.08.60-502 Revised: 12/20/2006"
}