{
	"anumber": "A42495127",
	"id": "A42495127_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 12. Additional Information About You ( (Person Applying for Naturalization) (continued), Form N-400"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 2015073421220 2902802 019663 62 w526444 042716 06:51 0425 Part 12. Additional Information About You (Person Applying for A- 042495127 Naturalization) (continued) 6. Do you owe any overdue Federal, state, or local taxes? Yes X No, 7. A. Have you EVER not filed a Federal, state, or local tax return since you became a lawful permanent Yes X No resident? B. If you answered \"Yes,\" did you consider yourself to be a \"non-U.S. resident\"? Yes X No 8. Have you called yourself a \"non-U.S. resident\" on a Federal, state, or local tax return since you became a Yes x No lawful permanent resident? 9. A. Have you EVER been a member of, involved in, or in any way associated with, any organization, Yes x No association, fund, foundation, party, club, society, or similar group in the United States or in any other location in the world? B. If you answered \"Yes,\" provide the information below. If you need extra space, attach the names of the other groups on additional sheets of paper and provide any evidence to support your answers. Name Purpose Dates of Membership of the of the From To Group Group (mm/dd/yyyy) (mm/dd/yyyy) 12 claims none 10. Have you EVER been a member of, or in any way associated (either directly or indirectly) with: A. The Communist Party? Yes X No B. Any other totalitarian party? Yes x No C. A terrorist organization? Yes x No 11. Have you EVER advocated (either directly or indirectly) the overthrow of any government by force or Yes x No violence? 12. Have you EVER persecuted (either directly or indirectly) any person because of race, religion, national Yes X No origin, membership in a particular social group, or political opinion? 13. Between March 23, 1933 and May 8, 1945, did you work for or associate in any way (either directly or indirectly) with: A. The Nazi government of Germany? Yes x No B. Any government in any area occupied by, allied with, or established with the help of the Nazi Yes X No government of Germany? C. Any German, Nazi, or S.S. military unit, paramilitary unit, self-defense unit, vigilante unit, citizen unit, Yes x No police unit, government agency or office, extermination camp, concentration camp, prisoner of war camp, prison, labor camp, or transit camp? Form N-400 03/26/16 N Page 12 of 20"
}
