{
	"anumber": "A42495127",
	"id": "A42495127_0081",
	"page_index": 81,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0081/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1946]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 1112111111 U.S Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WITE IN THIS BLOCK - FOR EXAMINING OFFICE Case ID# Action Stamp Fee Stamp A# DISTRICT OFFICE RECEIVED APPROVED H.N.S RAC DIRECTOR CASHIER G-28 or Volag # MIA-IFR FLA 1 of Law: A (b) spouse 203 (a)(1) JUN 15 1988 Petition was filed on 1-12-88 (priority date) 281 (b) child 203 (a)(2) Personal Interview by V Cano Previously Forwarded 201 (b) parent 203(a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria Recommended 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: Portaw Prince SRC I 3331 204 (a)(2)(A) Resolved dic check 204 Resolved REMARKS: Plaverify 1023 A. Relationship 021C 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) Lumina SAINT LOUIS SAINT LOUIS, Elemond 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 243 NE 57 St. Apt 1 Rue 7A #140 (Town or City) Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Miami, Fla. USA 33137 Cap Haitien, Haiti 3. Place of Birth (Town Cotes de Fer (State/Country) 3. Place of Birth (Town or City) (State/Country) (Anse-A-Foleur) Haiti Cotes de Fer, Haiti 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male X Married Single 10/25/18 Female Widowed Divorced 8/25/15 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Lumina Casimir - maiden none 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) Dec 9.1946 Haiti Dec 19, 1946, Haiti 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) 590-56-5688 A 41138034 none none 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended none MiA IR5 none 09-07-87 Natz. Cent/I-551 seen 13. If you are a U.S. citizen, complete the following: & ret'd by IFR unit 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) B3 Yes No Birth in the U.S. 1/12/88 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued Arrival/Departure Record (I-94) Number Date arrived (Month/Day/ Year Parents HAY 29 Have you obtained a certificate of citizenship in your own name CEIVED Date authorized stay expired, or will expire as shown on Form 1-94 I-95 Yes No If \"Yes,\" give number of certificate, date and place itwas issued M 15. Name and address of present employer (if (any) self employed farmer Haiti Date and place of admission for, or adjustment to, lawful permanent residence RECEIVED 1988 Date this employment began (Month/Day/Year) 1/19/19 14a. If you are a lawful permanent resident alien, complete.the fo lowing: 9/07/87 - Miami, Fl. I and class of admission: Has your relative ever been under immigration proceedings? ZILLOI Yes No Where When 14b. Did you gain permanent resident status through marriage to United El Exclusion States citizen or lawful permanent resident? Yes Deportation Rescission No Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}
