{
	"anumber": "A42495127",
	"id": "A42495127_0062",
	"page_index": 62,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0062/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 FOIA (b)(6) Respect * Integrity Commitment * Excellence NOTICE: This communication may contain privileged or other confidential information. If you are not the intended recipient, or believe that you have received this communication in error, please do not print, recopy, disseminate, or otherwise use the information. Also, please indicate to the sender that you have received this e-mail in error and delete the copy you received. Thank you. \"WARNING: This document is FOR OFFICIAL USE ONLY (FOUO). It contains information that may be exempt from public release under the Freedom of Information Act (5 U.S.C. 552). This document is to be controlled, handled, transmitted, distributed. and disposed of in accordance with DHS policy relating to Sensitive but Unclassified (SBU) information and is not to be released to the public or other personnel who do not have a valid \"need-to-know\" without prior approval from the originator.\" Please don't print this e-mail unless you really need to. Think Green. From: Koelling, Jaclyn D (CTR) Sent: Wednesday, June 15, 2016 10:01 AM To: Hunt, Cinda K; Rice, Patrick J (CTR); Worley, Jordan P Cc: Gerdes, Carla J (CTR); Martin, Trisha K (CTR); Loyd, Derek J (CTR); Stulz, Enid S; Rochester, Denise M (CTR); Perez, Rodney (CTR); Domenech, Olga; Reyes, Michael D; Walton, Wade M Subject: RE: Advanced Age Applicant - HIA Hello all, A-file (A042495127) has been located, completed and scanned to Carla Gerdes. Let me know if you have any questions. Thanks, FOIA (b)(6) From: Hunt, Cinda K Sent: Tuesday, June 14, 2016 2:05 PM To: Rice, Patrick J (CTR); Worley, Jordan P; Koelling, Jaclyn D (CTR) Cc: Gerdes, Carla J (CTR); Martin, Trisha K (CTR); Loyd, Derek J (CTR); Stulz, Enid S; Rochester, Denise M (CTR); Perez, Rodney (CTR); Domenech, Olga; Reyes, Michael D; Walton, Wade M; Hunt, Cinda K Subject: RE: Advanced Age Applicant - HIA Jaclyn, Please pull, combine. and ship the following file to HIA per Policy Memo 53. FOIA (b)(6) A042495127 Mailroom, 2"
}
