{
  "anumber": "A42495127",
  "id": "A42495127_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42495127_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Oath of Allegiance and Renunciation of Foreign Titles, N-400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 2016071521220 2902802 010665 42 w526888 042726 06:51 0425 Part 17. Renunciation of Foreign Titles A- 042495127 If you answered \"Yes\" to Part 12., Items A. and B. in Item Number 4., then you must affirm the following before a USCIS officer: I further renounce the title of which I have heretofore held; or (list titles) I further renounce the order of mobility of to which I have heretofore belonged. (list order of nobility) Applicant's Printed Name Applicant's Signature USCIS Officer's Printed Name USCIS Officer's Signature Date of Signature (mm/dd/yyyy) Part 18. Oath of Allegiance If your application is approved, you will be scheduled for a public oath ceremony at which time you will be required to take the following Oath of Allegiance immediately prior to becoming a naturalized citizen. By signing below you acknowledge your willingness and ability to take this oath: I hereby declare on oath, that 1 absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty, of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and laws of the United States of America against all enemies, foreign, and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will perform noncombatant service in the armed forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely, without any mental reservation or purpose of evasion; so help me God. Applicant's Printed Name Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) Applicant's Signature Loui) Elemond Date of Signature (mm/dd/yyyy) JUL 28 2016 Form N-400 03/26/16 N Page 20 of 20"
}