{
	"anumber": "A42522340",
	"id": "A42522340_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42522340_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for a Alien Relative,, I-130A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened bv NARA 2/10/2023 TO THE SECRETARY OF STATE: REMARKS The petition was filed on U.S. APPROVED INS: PERSONAL INTERVIEW CONDUCTED The petition is approved for status under section: DOCUMENT CHECK ONLY FIELD INVESTIGATION COMPLETED SPOUSE DATE 201 (b) CHILD 203 (a) (2) OF JUL 10 1981 APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) DD 203 (a) (1) 203 (a) (5) DISTRICT LOS ANGELES, REMARKS (Continued) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) Bangbak 20 Check the appropriate box below and furnish the information required for the box checked Beneficiary will apply for a visa abroad at the American Consulate in Ho-Chi Minh City Viet Nam (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Natural- ization Service at (CITY) (STATE) If the application for adjustment of status is denied the beneficiary will apply for a visa abroad at the American Consulate in Ho-Chi-Minh City Viet-Nam (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 2, My residence in the United States is (C/O. if appropriate) (Apt. No.) (Number and Street) (Town or city) (State) (ZIP Code) 4II8 Emerald Apt # D Torrance California 90503 22 My address abroad (if any) is (Number and street) (Town or city) (Province) (Country) None 23 Last address at which I and my spouse resided together From To (Town or city) (State or Province) (Country) (Apt. No.) (Number and street) (Month) (Year) (Month) (Year) Los Angeles CA. 3II I87 So. Oxford I977 to I980 24 Address in the United States where beneficiary will reside (City) (State) Same as Mine 25 Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) 60/I4I Ly-Chinh-Thang Ho-Chi-Minh City Viet-Nam 26. (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) None (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) None 27. If this petition is for a child, (a). is the child married? (b). is the child your adopted child? If so, give the names dates. and places of birth of all other children adopted by you. If none. so state N/A 28 H this petition is for a brother or sister. are both your parents the same as the alien's parents? N/A If not, submit a separate statement giving full details as to parentage dates of marriage of parents and the number of previous marriages of each parent 29. separate petitions are also being submitted for other relatives give names of each and relationship to petitioner Luan Cong Thinh Brother and his family, Hung-Son Van Thinh ,brother, his fam 30. Have you ever filed a petition for this alien before? yes If so give place and date of filing and result Los Angeles , California 4/10/75 , Approved 31 neficiary is in the United States give the following information concerning beneficiary no st arrived in U.S. as (b) Date beneficiary's stay expired or will (c) Beneficiary's File number isitor, student, exchange alien, crewman, stowaway, etc.) on expire as shown on his Form I-94 or I-95. if any (Month) (Day) (Year) (Month) (Day) (Year) A-20 980 667 (d), Name and address of nt employer (e) Date alien began this employment"
}
