{
	"anumber": "A42522340",
	"id": "A42522340_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42522340_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TÓ KHAI GIA-DINH, 60/14"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1975, 1958]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 L's Lip : thei mis-sinh DO- Khi eir mot nm mu 3 tháng thi phai làp is khai gia dinh. Gia-Trirong HANH SAIGON /it xin Khom-Truong hoão Ap Trust klen-th) van to khat gia_itinh, roi nap cho Van-Phong Phrong hoãc Xã de kiem, aban, kcm theo is khat thay doi noi cur tru. II. Khei them hey bot tên trong to khai aia-dinh Khi có then hay bot nguroi trong gia-dinh thi phai khai bão de cáp-nhat-hoa to khai gia-dinh. la-Truring xin Khom- Truing hoãe Trurng kién-thi vao to khai them hay bot ten trong to khai gia-dinh, rdi nap cho Van-Phong Phirong hoãc Xa de kiem KHAi GIA-DINH nhan, kem theo to khai gia. dinh (bau mau) va cac giay to chirng. minh tichai-sanh, khai- u, to khai thay adi noi cu-tru III. Khai tom tru trong gis-dinh Khi CO than nhAo dea tam tru phat khai bao de ghi vão so 1/26 vang-lai. NHA SÓ a) To 1 den 30 ngay's Gia-Truong nap cho Khom-Truring hoãe Ap- 60/141 Truong to khai in tam tru de kien-thi kem theo the can-ciróc cua DUONG yen Do nguoi xin tam tru. Khom-Truong hoae Ap-Truong dure quyen cho tam tru toi da 30 ngay. KHOM b) To 1 den 3 thang : ia-Truoug xin Khom-Trury hoãc p-Truong PHUONG kien-thi vao to khai xin tam tru roi nap cho Van- Phong Phirong hoãc you J 4/26 Xa de xin kiem nhaa, kem theo the can-curce cua nguri xin tam tru QUAN Ba Phuong-Truring hoãe Xã-Truoug durc quyen cho tam tru toi da 3 thang. c) Trên 3 thang : Nguri xin tam tru hoãc phai tro ve oguyên quan HQ VA TÊN GIA-TRUONG Gas thi yet hoãc phai xin ghi ten hay lap to khai gia-dinh noi cu ngu moi. CUOC CHU: Khi thâu nhan nguoi giup viec, Gia-truong cung phai khai bão theo Saigon, ngdy 3 thang 2 näm 1975 1 trong 2 the thire sau day GIA-TRUONG neu ₫trong su giup viec lâu dai, ap-dung thu-tuc khai them hay birt (Ky ten) tên trong to khai gia-dinh (Muc II). Chung nhan có cho & day neu duong sir ghip viec tam ther, ap-dung thu-tyc khai tam tru tron gia-diah (Muc III). (danh cho to khai cua gia-donh i day) Chu nha yet IV. Khi they dói nori curtru: Khi r&i han noi cu.ogu cu de di is nor khac, thi phai khai bão thay ddi nrri Ctr tru de dure ghi ten hay lap to khai gia-dinh tai noi cur ngu moi Durong sur xin Khom-Truong hoãc -Truong kien-thi vao to khai thay doi noi cir tru. roi nap cho Van Phong Phurong hoãc Xã kèm theo to khai gia-diah (bão mau Phuong-Truing hoãe X Truoug boi ten &ucrag sy trong to khai gia-dinh noi cu ngu cu, kiem -niràn tir khai thay adi noi cu-trú roi giao cho during sur 1 ban de nap vao ho-so khai gia-dinh tai not KIEN THI 011-02-75 KIÈM NHAN 04.0 ctr agu moi. Kh6m Trirong Phirding Throng Sign phap che the Gia-Truong co trách whiém khai bão de cho to khai gia-dish minh luc não cong phu hop voi hien tink ahia-so trong giadinh. Nhung khong hju khai bão, hay khai khong thânb. it (khong ke viec khai gian trá có the truy-10 theo Hinh luát). se bi phat vi-canh, chieu dieu 9 Nghi dinh so 353-BNV/HC/NH ngay 30-6-1958 cua BQ-NOI-VU vi khong tuàn léah cua pha chur-trach Ren hanh-chanh, ma then dieu 491 cui 96 Hinh Luat moi ban -harh, thl ngiroi não vi pham Sae va are pháp ci child quyen Hinh chart hay chire cuyen Do, Tinh. O dani rieng de dong dan phan biet to hai cua chiz Thi, bj phat va, tu 401d00 den 600d00 vá theo dieu 492 ke tiep thi ngoai hinh phat va, an- pham COD có the, tity truding hgp, bi phat giam tir 1 ngay den 10 ngay nixa. nha hay cua nguri i dau."
}
