{
	"anumber": "A42522340",
	"id": "A42522340_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42522340_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-42,522340"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Thailand", "Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1990, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 OPTIONAL FORM 155A, (Rev. 85) DEST. OF STATE NSN 7540-01-126-7761 50155-203 IV-42, 522,340 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN CAO YET THI ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U. S. IMMIGRATION 130 SFR 1838 UA828. 212(e) 212(h) 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH SAIGON VIETNAM 06/12/1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED THAILAND VIETNAMES E UNTIL (CLASS) MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S X W D SEP NHAN BAN FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED 758 TERRA BELLA DR STATES C/O THINH VAN TRUONG MILPITAS CA 95035 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED NONE F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT BANGKOK, THAILAND VIETNAM IMMIGRANT VISA NO. ISSUED ON (Day) (Month) (Year) Eric G. John Consular Officer of the United States of America 15 NOV 1990 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 14 MAR 1991 PASSPORT NO. WAIVED PER 22 CFR 42.6 (A) OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO DOH 410 THE YET BY UNITED STATES OF AMERICA ON Tariff No. 21 Fee Paid $XXX 25 650.00 BAHT EXPIRES Local Cy, Equiv. IV-42, 522,340 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S."
}
