{
	"anumber": "A42522340",
	"id": "A42522340_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42522340_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2 2/10/23, APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1932, 1971, 1937, 1969, 2023, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 OPTIONAL FORM 230 (English/VICT name Rev. 6-82) DEPT. OF STATE FROM APPROVED 50230-104 O.M.B. No. 1405-0015 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION DON XIN CHIEU-KHAN NHAP-CU VA DANG-KY NGOAI-KIEU INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer, The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. LOI CHI DAN: Mâu don nay phai dien lam HAI BAN bang may chu, hay neu viet tay thi phai viet loi chd in cho ro dqc. Phai trà loi (at ca moi cau hoi, neu co the. Cau não Khong tra loi duoc thi ghi N/A. Neu Khong du chô tren mau don thi tra loi tren giay phy, cung lam hai ban va ghi so thu tu nhu tren mau don. Dinh cac to phy Kem voi mau don. XIN DUNG KY TÊN tren mau don truoc Khi duoc vien chuc lanh-si chi dan. Lê phi nhan don xin chieu-Khan nhap-cd nay là 25 My-Kim. Phai trà bang My-Kim hay bang tien dia-phuong theo hoi-xuat, hay bang ngan-phieu ngan-hang, Khi duong don ra trinh truoc vien chuc lanh-su. LOI CANH-CAO: Moi nguoi Khai man hay che dau su that CO the dua toi hau qua bi loai tru vinh-vien vao Hoa-Ky. Du cho co duoc nhan vao Hoa-Ky roi, thi su nhap-canh gian-lan cung du del bi truy-to'hay bi truc-xuat, hay ca hai. 1. Family name Ho First name ten Middle name ten 1ót CAO YET THI 2. Other names used or by which known (If married woman, give maiden name) Nhung ten Khac dude dung hay duoc nguoi ta goi (Neú là phu-nu co chong thi xin ghi nhu-danh) NONE 3. Full name in native alphabet (If Roman letters not used) Ho va teh viet theo tho-ngu (Neu Khong dung loi ch't La-Ma abc) N/A 4. Date of birth 5. Age 6. Place of birth (day) (Month) (year) Tuoi' (City or town) (Province) (Country) Ngay (doesn't Thang remember) 1907 nam (Thanh-phô hay thj-xx) (Tinh) (Nuoce, Xii), 83 SGN VN 7. Nationality 8. Sex phai 9. Merital status tinh-trang gia-dinh quoc-tich Male Female Single (never married) dôc-than VN nam nu?' Married co v co chong Widowed góa v góa chong Divorced ly-di Separated L Ly-than Including my present marriage, I have been married one times. 10. Occupation nghe-nghiep 11. Present address Dia-chi hien-tai HOUSEWIFE 60/141 Fej chink Thing Q3 Home 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) [Ten ho, dia-chi, ngay sinh, noi sinh cua v hay chong (Neu là v8 thi'xin ghi nhú danh)] THINH VAN BUT, DEC 1969 Date and place of marriage (Ngay va ndi lap hon-thu at age of 19 THANH HOA VIENAM 13. Names, addresses, dates and places of birth of all children (Ten no, dia-chi, ngay sinh, noi sinh cua tât ca2 các con cai) 04 children (M) THINH HUU KHUONG, 1932, DEC 1976 See Attached Affidavit living THINH THI PHUONG GHI, 1937; THANH HOA, U.S.A/1971 14. Person(s) named in 12 and 13 who will accompany or follow me to the United States 15. Final address in the United States Dia-chi cudi' cung [(Nhung) nguoi) co Khai ten 8'muc 12 va 13 ma cung di hay se di sau\" duong don toi Hoa-Ky t'oi Hoa-Ky. child See Attached Affidavit SEE# 16 16. Person you intend to join (Give name, address, and relationship, if any) 17. Name and address of sponsoring person or organization Duong don có y-dinh (8i voi ai (Xin cho ten, dia-chi, va lien-he neu co). (If different from 16) Ten va dia-chi cua ngdoi hay THINH THE PHUONG NGHI daughter co-quan bao-tro (neu' Khac voi ten ghi muc 16) 758 TETRA BELLA MILPITAS, CA. 95035 N/A THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE, UNITED STATES OF AMERICA (MAU DON NAY CO THE LANH MIEN-PH TAI CAC LANH-SU QUAN HOA-KY) NSN. 7540-00-149-0919 Mâu in ra truoc day khong con xu dung duoc nua) Previous edition not usable"
}
