{
	"anumber": "A42522340",
	"id": "A42522340_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42522340_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: 157"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Vietnam", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 2/10/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS CHO RAY HOSPITAL FOR UNITED STATES VISAS DATE OF EXAMINATION JUN.22-90 CITY: HO CHI MINH CITY At th est of the American Consul at COUNTRY: VIETNAM NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX CAO THI YET 004-410 12 JUN 07 F I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON GENERAL PHYSICAL EXAMINATION V-39007 I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability P 88 BP 140/90 The conditions listed below were found (Check boxes that apply) mok CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or. Mental Defect Insanity More Attacks of insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Film No 3219 Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ PROF. DO BAT TUY JUN.22-90 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Negative Nonreactive Not Done Not Done TEST TYPE: TEST TYPE: 77599 RPR ELISA (WELLCOME) DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READ DR. TRUONG THI XUYEN JUN.23-90 BANGKOK GENERAL HOSPITAL JUN.29-90 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS Class B- Impaired vision. - Kyphosis. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. aft JUN.22-90 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE For PROF. NGUYEN HUY DUNG Than JUN.23-90 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 GPO 1988 0-209-342 DEPT. OF STATE"
}
