{
  "anumber": "A42733525",
  "id": "A42733525_0079",
  "page_index": 79,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0079/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF APPROVAL OF RELATIVE INMIGRANT VISA PETITION, Form I-171"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE COO SAB NOTICE OF APPROVAL ISA PETITION NAME AND ADDRESS OF PETITIONER NAME OF BENEFICIARY Pan Jing James Chi Yang 1855 15th St. Apt. 1010 CLASSIFICATION FILE NO San Francisco, CA. 94103 201 B DATE PETITION FILED DATE OF APPROVAL OF PETITION 10-10-85 11-1-85 DATE: 11-6-85 The visa petition you filed has been approved. The beneficiary for whom you filed has been given the appropriate classification. Note the approval gives no assurance that the beneficiary will automatically be found eligible for visa issuance, admission to the United States or adjustment to lawful permanent resident status. Whether the beneficiary gets a visa is decided only when an application is made to a consular officer; whether the beneficiary is admitted or adjusts status in the United States is decided only when an application is made to an immigration officer. 1. YOUR PETITION TO CLASSIFY THE BENEFICIARY AS AN IMMEDIATE RELATIVE OF A UNITED STATES CITIZEN HAS BEEN FORWARDED TO THE UNITED STATES CONSULATE AT Beijing THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION. THE UNITED STATES CONSULATE, WHICH IS PART OF THE DEPARTMENT OF STATE, WILL CONTACT THE BENEFICIARY AND GIVE INSTRUCTIONS ABOUT GETTING A VISA. QUESTIONS ABOUT GETTING A VISA SHOULD BE MADE TO THE UNITED STATES CONSUL 2. IF YOU BECOME A NATURALIZED CITIZEN OF THE UNITED STATES AND AN IMMIGRANT VISA HAS NOT YET BLEN ISSUED TO THE BENEFICIARY, NOTIFY THIS OFFICE IMMEDIATELY. GIVING THE DATE OF YOUR NATURALIZATION IF THE PETITION WAS IN BEHALF OF YOUR SON OR DAUGHTER, PLEASE ADVISE WHETHER THAT PERSON IS STILL UNMARRIED THIS INFORMATION MAY BE HELPFUL TO THE BENEFICIARY IN GETTING A VISA FASTER. 3. YOUR PETITION FOR PREFERENCE CLASSIFICATION HAS BEEN FORWARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THE SERVICE. THIS SERVICE DOES NOT ISSUE VISAS IN OTHER COUNTRIES. VISAS ARE ISSUED ONLY BY UNITED STATES CONSULS WHO ARE EMPLOYEES OF THE UNITED STATES DEPARTMENT OF STATE WHEN THE BENEFICIARY'S TURN IS REACHED ON THE VISA WAITING LIST, THE UNITED STATES CONSUL WILL CONTACT THE BENEFICIARY AND GIVE INSTRUCTIONS ABOUT GETTING A VISA. VISAS ARE ISSUED ACCORDING TO THE DATE THE PETITION WAS FILED. QUESTIONS ABOUT GETTING A VISA SHOULD BE ADDRESSED TO THE UNITED STATES CONSUL. 4. YOUR PETITION SAYS THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAWFUL PERMANENT RESIDENT. THE ENCLOSED APPLICATION (FORM I-485) SHOULD BE COMPLETED AND SUBMITTED BY THE BENEFICIARY WITHIN 30 DAYS. (IF THE BENEFICIARY PREVIOUSLY SUBMITTED SUCH AN APPLICATION AND HAD IT RETURNED, IT SHOULD BE RESUBMITTED WITHIN 30 DAYS.) 5. THE BENEFICIARY WILL BE INFORMED OF THE DECISION MADE ON THE PENDING APPLICATION TO BECOME A LAWFUL PERMANENT RESIDENT. 6. THE PETITION SAYS THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAWFUL PERMANENT RESIDENT. THE BENEFICIARY MAY NOT APPLY 10 BECOME A PERMANENT RESIDENT. HOWEVER, UNTIL A VISA NUMBER IS AVAILABLE INFORMATION ABOUT VISA NUMBERS MAY BE OBTAINED FROM THE UNITED STATES DEPARTMENT OF STATE, BUREAU OF CONSULAR AFFAIRS, WASHINGTON, D.C. 7. ORIGINAL DOCUMENTS SUBMITTED IN SUPPORT OF YOUR PETITION UNACCOMPANIED BY COPIES HAVE BEEN MADE A PERMANENT PART OF THE PETITION. ANY OTHERS ARE BEING RETURNED WITH THIS FORM. 8. REMARKS. Immigrant visas are not issued in Shanghai VERY TRULY YOURS. DISTRICT DIRECTOR Form 1.171"
}