{
	"anumber": "A42785993",
	"id": "A42785993_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42785993_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICATION, No. 2246122"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1979, 2023, 1940, 1976, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 TRANSLATION Emblem Republic of CERTIFICATION Honduras Free Sovereign and The undersigned Municipal Secretary and Civil Registrar of this district Independent CERTIFIES: That in the original book of births No. 83, page 196 is found the record which literally says: \"ROBERTO ARMANDO ZELAYA. 11 In San Pedro Sula First Calss at 10:00 a.m. on Tuesday, December 24, 1940. Before me Ernesto Cruz Garcia, Fifty Cents 1976-1979 Municipal Secretary and before the witnesses Lizzie de Ordonez and J. Antonio Torres C., of age, Honduraneans and of this domicile, appeared Mr. Mario No. 2246122 Zelaya R., of age, married, mechanic, Honduranean and of this vicinity, stating Dec. 13, 1978 that on Sunday the 22nd of the current month, at 8:15 p.m., a male child was born in the Hospital del Norte of this city, who will carry the name Rubber stamp \"ROBERTO ARMANDO.\" He is the legitimate son of the appearing party and of his wife Leonor G. de Zelaya, of age, married, Honduranean, and of this Rubber stamp neighborhood. The paternal grandparents are: Lorenzo Zelaya and Elena R. de Zelaya, now deceased. And maternal: Jose Manuel Guadado, also deceased Rubber Stamp and Cristina J. V. de Guardado, of this vicinity. I read what is written to the appearing party, he ratified it and signed it. =MARIO ZELAYA = LIZZIE de ORDONEZ = J. ANTONIO TORRES C. Seal. ERNESTO CRUZ GARCIA, Secy. (signature) Norma Fonseca THIS CONFORMS WITH ITS ORIGINAL Issued in the City of San Pedro Sula on January 2, 1979. Rubber stamp Rubber stamp (signature) illegible Revenue Court (signature) Carlos A. Paredes HERMINA PERDOMO RIVERA CARLOS A. PAREDES Municipal Secretary San Pedro Sula Mayor Rubber stamp Honduras, C.A. By Law I hereby certify that I have translated the foregoing from a document in the Spanish language and that it is a true and complete translation thereof, to the best of my knowledge and belief. Kate wison Kate Wilson Social Worker of copy International Institute of true me by San Francisco seen 2209 Van Ness Avenue Central Service San Francisco, California KW/kg July 31, 1979 Contact Francisco,"
}
