{
  "anumber": "A42733525",
  "id": "A42733525_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 ERAL BUREAU OF INVES IC TION UNITED STATES DEPARTMENT OF JUSTICE 1. LOOP WASHINGTON, D.C. 20537 APPLICANT CENT OF LC ASSIFIABLE FINGERPRINTS ( PRINTER'S INK E INK EVENLY ON INKING SLAB. ID DRY FINGERS THOROUGHLY GERS FROM NAIL TO NAIL AND AVOID ALLOWING FINGERS TO SLIP IMPRESSIONS ARE RECORDED IN CORRECT ORDER MPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER MAKE A NOTATION TO THAT EFFECT D INDIVIDUAL FINGER BLOCK E PHYSICAL CONDITION MAKES IT IMPOSSIBLE TO OBTAIN PERFECT IMPRESSIONS SUBMIT THE BEST THAT CAN BE NED WITH A MEMO STAPLED TO THE CARD EXPLAINING THE CIRCUMSTANCES. NE THE COMPLETED PRINTS TO SEE IF THEY CAN BE CLASSIFIED BEARING IN MIND THAT MOST FINGERPRINTS THE LINES BETWEEN CENTER OF NTO THE PATTERNS SHOWN ON THIS CARD (OTHER PATTERNS OCCUR INFREQUENTLY AND ARE NOT SHOWN HERE). LOOP AND DELTA MUST SHOW 2. WHORL CARD FOR USE BY: LEAVE THIS SPACE BLANK AW ENFORCEMENT AGENCIES IN FINGERPRINTING APPLI. FOR LAW ENFORCEMENT POSITIONS. >FFICIALS OF STATE AND LOCAL GOVERNMENTS FOR PUR. OF EMPLOYMENT LICENSING AND PERMITS AS AUTHOR BY STATE STATUTES AND APPROVED BY THE ATTORNEY AL OF THE UNITED STATES LOCAL AND COUNTY ORDI. ES. UNLESS SPECIFICALLY BASED ON APPLICABLE STATE TES DO NOT SATISFY THIS REQUIREMENT.\" I.S. GOVERNMENT AGENCIES AND OTHER ENTITIES REQUIRED ERAL LAW. OFFICIALS OF FEDERALLY CHARTERED OR INSURED BANK. INSTITUTIONS TO PROMOTE OR MAINTAIN THE SECURITY OSE INSTITUTIONS THESE LINES RUNNING BETWEEN RUCTIONS: DELTAS MUST BE CLEAR PRINTS MUST FIRST BE CHECKED THROUGH THE APPRO. E STATE IDENTIFICATION BUREAU, AND ONLY THOSE FINGER. 3. ARCH S FOR WHICH NO DISQUALIFYING RECORD HAS BEEN FOUND 91755 LLY SHOULD BE SUBMITTED FOR FBI SEARCH PRIVACY ACT OF 1974 (P.L. 93.579) REQUIRES THAT FEDERAL RIE E. OR LOCAL AGENCIES INFORM INDIVIDUALS WHOSE SOCIAL RITY NUMBER IS REQUESTED WHETHER SUCH DISCLOSURE IS ca DATORY OR VOLUNTARY BASIS OF AUTHORITY FOR SUCH DITATION AND USES WHICH WILL BE MADE OF IT. IDENTITY OF PRIVATE CONTRACTORS SHOULD BE SHOWN PACE EMPLOYER AND ADDRESS\". THE CONTRIBUTOR IS THE E OF THE AGENCY SUBMITTING THE FINGERPRINT CARD TO BI. FBI NUMBER IF KNOWN SHOULD ALWAYS BE FURNISHED IN APPROPRIATE SPACE. ELLANEOUS NO. . RECORD: OTHER ARMED FORCES NO. PORT NO. (PP), ALIEN REGISTRATION NO (AR). PORT SE. RITY CARD NO. (PS). SELECTIVE SERVICE NO. (SS). VETERANS' ARCHES HAVE NO DELTAS ADMINISTRATION CLAIM NO. (VA). FD-258 (REV. 12-29-82) PITTCO, VENTURA, CA 93003"
}