{
  "anumber": "A42733525",
  "id": "A42733525_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 U.S. Department OF Justice OMB 1115 0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. Family Given Middle Name ZHANG Name WEN YING Initial U.S. Mailing Address Care of ZHANG, WEN YING 626-288-5492 Resubmitted Street Number Apt. and Name 524 S. ORANGE AVE. # D City County MONTEREY PARK LA State ZIP Reloc Sent CA Code 91755 Date of Birth Country (month/day/year) 10-07-14 of Birth CHINA Social A Security # 619-50-9312 # 427-33-525 Reloc Rec'd Part 2. Basis for Eligibility (check one). 316(a) a. Lhave been a permanent resident for at least live (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office RX 346 (a) resident (month/day/year) where granted adjustment of status. 11-27-91 SFR IR5 Citizenship UUE, speak, read CHINA write & failed History Name on alien registration card (if different than in Part 1) &govt. U.R. Other names used since you became a permanent resident (including maiden name) NONE SEC. 3(2 wriven prw IT Sex Male Height Marital Status: Single Divorced Female 5-4 Married Widowed Can you speak, read and write English ? No Yes. Action Absences from the U.S.: APPROVED INS DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes. Auron womond If you answered \"Yes\" , complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absonce or to list more trips, continue on separate NOV 9 1998 paper. Did absence last Arm L WORDDA Date left U.S. Date returned 6 months or more? Destination Reason for trip Recommended by: LOS 03-19-94 01-11-95 8540 Yes No CHINA VISITING Yes No To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N.400 (Rev 07/17/91)N Continued on back."
}