{
	"anumber": "A42733525",
	"id": "A42733525_0073",
	"page_index": 73,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0073/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FINAL JUDGMENT ( (FAMILY LAW)"
		},
		"years": {
			"ms_years_nlp_v1": [1981, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/26/2023 REPORTED DCT 28 01 ATTORNEY OR PARTY WITHOUT ATTORNEY (Name and Address): TELEPHONE NO.: FOR COURT USE ONLY Leslie S. Ku 408-279-8611 95 S. Market St. , # 300 San Jose, CA 95113 OCT 26 1991 ATTORNEY FOR (Name): HELEN S. C. YANG, Petitioner FILED SUPERIOR COURT OF CALIFORNIA, COUNTY OF San Mateo MARVIN CHURGH COUNTYCLERK BY STREET ADDRESS: 401 Marshall Street DEPUTY CLERK MAILING ADDRESS: Redwood City, CA CITY AND ZIP CODE: BRANCH NAME: MARRIAGE OF PETITIONER: HELEN S.C. YANG JAMES C YANG spetis surrendered RESPONDENT: DISSOLUTION OF MARRIAGE CASE NUMBER: LEGAL SEPARATION FINAL JUDGMENT OF 252833 NULLITY DISSOLUTION OF MARRIAGE-STATUS ONLY $ 200 1. The court acquired jurisdiction of the respondent on (date): April 23, 1981 2. THE COURT ORDERS a. A final judgment of dissolution be entered, and the parties are restored to the status of unmarried persons. b. A judgment of legal separation be entered. C. A judgment of nullity be entered on the ground of (specify): and the parties are declared to be unmarried persons. 3. THE COURT FURTHER ORDERS 1691 a. This judgment be entered nunc pro tunc as of (date): b. Wife's former name be restored (specify): C. Other: OCT 26 1981 a Brenson Dated: Judge of the Superior Court Signature follows last rattachment. 4. Total number of pages attached: zero NOTICE NOTIFIE PLEASE REVIEW YOUR WILL. UNLESS A PROVISION IS MADE IN THE PROPERTY SETTLEMENT AGREEMENT, AND THIS COURT PROCEEDING DOES NOT AFFECT YOUR WILL AND THE ABILITY OF YOUR FORMER SPOUSE TO TAKE UNDER IT. IF YOU FAIL TO PAY ANY COURT ORDERED CHILD SUPPORT, AN ASSIGNMENT OF YOUR WAGES WILL BE OBTAINED WITHOUT FURTHER NOTICE TO YOU. No attachment permitted on less than a full page Cal Rule of C1 201(b) Form Adopted by Rule 1289 FINAL JUDGMENT Judicial Council of California Innume 1091 (FAMILY LAW) CC 4514 4515"
}
