{
  "anumber": "A42785993",
  "id": "A42785993_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42785993_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1916,
        1940
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITEDSTATES PEPARAMENTO F3JUSTICE Form Approved Immigration and Naturalization Service OMB NO. 43-RO 401 PETITION TO Fee Stamp CLASSIFY STATUS OF PLEASE NOTE YOU ARE THE PETITIONER ALIEN REL FOR AND YOUR RELATIVE ISSUAN OF IS THE IMMIGRANT VISA BENEFICIARY FEEPAIDING 100170 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Names, birthdates and countries of birth of ZELAYA, LEONOR beneficiary's children MARiO 1/3/39 HONDORAS 4. Other names used: (including maiden name if married) LEONOR GUARDADO ROBERTO 12/22/40 CRISTINA 2/29/44 5. Country of beneficiary's birth 6. Date of beneficiary's birth (Month, day, year) GERMAN 11/28/47 - HONDURAS JULY 1, 1916 7. My name is: (Last, in CAPS) (First) (Middle) 8. My phone number is: ZELAYA, ROBERTO ARMANOO (415)648-6174 FOIA (b)(6) 9. Other names used: (including maiden name if married woman) 10. Relationship of beneficiary to myself NONE MOTHER 11. I was born: (Month) (Day) (Year) in: (Town or city) (State or Province) (Country) DEC 22,1940 SAN PEDRO SULA, CORTES, HONDURAS 12. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage. (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate. and date and place of naturalization: ROBERTO ARMANDO ZELAYA, No. 10562783, 9/28/76 Francisco, (2) (If known) My former alien registration number was A FOIA (b)(6) (3) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with instruction 3 a (2) 13. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: lb. Date, place, and means of admission for lawful permanent residence A- 14. Beneficiary's marital status: 15. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is Married Widowed Divorced Single for your spouse) MARIO ZELAYA, 6/9/08 HONDURAS 16. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) 21 AVE, S.O. # 148 SAN PEORO SULA, HONDURAS, C.A. 17. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Names of my prior spouses C. Names of spouse's prior spouses 18. Has this beneficiary ever been in the U.S.? YES NO 19. Are beneficiary and petitioner related by adoption? YES NO (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Subscribed and sworn to (affirmed) before me this 20 day of Signature of petitioner (See Instruction No. 5) X Radent. 8 2 Contact Representative (SEAL) My commission expires ton and Naturalization Service Immig IMMIGURE OF OFFICER ADMINISTERINGJ San Francisco, California (TITLE) SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. (SIGNATURE) (ADDRESS) (DATE) RECEIVED TRANS IN RET'D TRANS OUT COMPLETED FORM -130 (Rev. 10-1-77)"
}