{
	"anumber": "A42785993",
	"id": "A42785993_0048",
	"page_index": 48,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42785993_0048/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACIÓN, 2246122"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1979, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/2/2023 A PRIMERA CLASE CINCUENTA CENTAVOS 1976-1979 No 2246122 1 CERTIFICACION 2 El Infrascrito Secretario Municipal y Encargado del Registro Civil de éste tér= mino: CERTIFICIA: Que en el libro original de nacimientos No. 83, folio 196, en- 3 cuentra la partida que literalmente dice: \"ROBERTO ARMANDO ZELAYA\". =En San Pedro 4 Sula, a las diez de la mañana del día martes veinticuatro de diciembre de mil no= 5 vecientos cuarenta. =Ante mí; Ernesto Crúz García, Secretario Municipal y ante los 6 testigos Lizzie de Ordónez y J.Antonio Torres C., mayores de edad, hondureños y GENERAL DE III de este domicilio, compareció el señor Mario Zelaya R., mayor de edad, casado, me cánico, hondureño y de este vecindario, dando cuenta que el día domingo veintidos HONDURAS 10 del mes en curso, a las ocho y quince minutos de la noche, nació en el Hospital ALUANAS 2,1 del Norte de esta ciudad, un varón quien llevará por nombre: \"ROBERTO ARMANDO\"=Es U.S hijo legítimo del compareciente y de su esposa Leonor G. de Zelaya, mayor de edad 13 casada, hondureña y de este vecindario, son abuelos paternos: Lorenzo Zelaya y - Elena R. de Zelaya, ya difunto y maternos: José Manuel Guardado, también ya di- funto y Cristina J.V. de Guardado, de este vecindario. =Lei lo escrito al compare 16 ciente, lo ratificó y firmó. =MARIO ZELAYA. =LIZZIE DE ORDOÑEZ. =J ANTONIO TORRES 17 C. +SELLO. ERNESTO CRUZ GARCIA SRIO ES CONFORME CON SU ORIGINAL 18 Extendida en la ciudad de San Pedro Sula, a los dos días del mes de enero de mil 19 20 novecientos setenta y nueve. 21 the HERMI TO PERDOMO RIVERA SEORETARIO MUNICIPAL FV°B°CARLOS, A. = PAREDES RECORTED ALCALDE MUNICIPAL copy of POR LEY.= Service 25 Contact San"
}
