{
  "anumber": "A42704822",
  "id": "A42704822_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42704822_0000/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPTIONAL FORM 155A, (Rev. 6-85) DEPT. OF STATE 50155-203 IV-42,704,822 IMMIGRANT VISA AND ALIEN REGISTRATION PROCESSORO 1-JJ THE IMMIGRANT HAS BEEN PREVIOUSLY IN TB THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN CHERY CELENE ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S. IMMIGRATION 060 MIA 358 TV020 212(e) 212(h) MAY X5 1990 212(g) 212(i) ADMITTED IR-5 CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH JACMEL HAITI 22OCT06 CLASS UNTIL CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY PORT AU PRINCE, HAT HAITIAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M X S W D SEP ERSILE TERTULTEN FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 131 N. E. 93RD STREET MIAMI, FL 33138 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED UNR NONE This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION day CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT PORT AU PRINCE HAITI SALLYBETH M. BUMBREY IMMIGRANT VISA NO. CONSUL PTP8635320801 42704822 OF THE UNITED STATES OF AMERICA ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 02MAY90 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 29AUG90 PASSPORT NO. 90-660019 OR OTHER TRAVEL DOCUMENTS (Describe) TACHED ISSUED TO VICE BY UNITED STATES OF AMERICA ON Tariff No. 21 Fee Paid $75 Gdes 125 EXPIRES Local Cy, Equiv. IV-42,704,822 ACTION OF I.J. ACTION ON APPEAL S.P.H.S Info given to IRS on date of I-551 issuance: Name, Addr, DOB, A#, Class of Adm, Occup & answers to Form 9003."
}