{
	"anumber": "A42704822",
	"id": "A42704822_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42704822_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Acte de naissance de la commune de Port-au-Prince, déposé au bureau des Archives Nationales de la République., A2 79098"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 REPUBLIQUE D'HAITI Axtrait des registres des actes de naissance de la commune de Port au-Prince, déposés au bureau des Archives Nationales de la Répu- blique.- 1.50 A2 N° 79098 L'An mil neuf cent soixante dix huit an 175e de )' Indépendan ce et le vendredi quatre aout à huit heures dt demée du matin. PAPIER Nous Louis Nazaire identifié au numéro 2040-R Officier de l'Etat e.1.35 civil de la commune de Port-au-Prince, section nord-Est soussi- Une out POUR gné; Certifions, avoir inscrit aux registres y afférents y affé- COUNTY rents au conformité de la loi du vingt aout mil neuf cent soi- xante quatorze. Le dispositif d'un jugement rendu par le tribu- PORT-AU-FRENE nal civil de Port-au-Prince, séant au Palais de Justice de cette ville en audience publique et en ses attributions civiles, le ANNEE 1978 vingt sept Juillet de cette année, sur requete de la dame Celè- PAGE _41 ne Chéry sous la constitution de Mr Pierre C.Labissière, avocat NUMERO 51 de ce barreau doment identifié patenté et imposé. Par ces motifs le Tribunal aprts délibérati /conformément aux nouvelles dis- ACTE DE NAISSANCE DE: positions de loi régissant la matiere et sur les conclusions du CELENE CHERY Ministere Public, dit et déclare sous la réserve des droits de à Jacmel le 22-10-06 ceux qui ont qualités et intérets que CELENE CHERY, du sexe fe- minin est née à Jacmel le vingt deux octobre mil neuf cent six des oeuvree naturelles du sieur TERTULIEN CHERY et de ladame ERSILE PREVOST, dit et déclare que le présent Jugement tiendra A.N.H/A-417757 lieu d'acte de naissance a CELENE CHERY, ordonne 'inscription MLF du dit dispositif au registre spécial tenu en double à cet effet par l'Officier de 1!Etat civil de la section nord-Est de la Ca- pitale. Donné de nous Rock J.Raymond doyen en audience publique du premier Juin milneuf cent soixante dix huit en présence de Me Ulrick Rosarion substitut du commissaire du Gouvernement près ce tribunal avec l'assistance du sieur Ascencio Jumelle, greffie du siège. Il est ordonné etc. En foi de quoi etc. (SIGNER)L.Na- zaire. Port-au-Prince, le 8 féviier 1990 POUR COPIE CONFORME COLLATIONNEE JEAN WILFRID BERTRAND DIRECTEUR GENERAL."
}
