{
  "anumber": "A42733525",
  "id": "A42733525_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Immigration and Naturalization Service, Form N-14"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/26/2023 U.S. Department of Justice Immigration and I :ation Service 300 North Los Angeles Street Los Angeles, CA 90012 ZHANG, WEN YING File No. A42733525 Date 7/23/97 Examination of the (enclosed) application shows that certain additional information, documents, or forms are needed before your application can be acted upon. To help you in that connection, we have chucked in red in this letter the items which need your attention. Please read those items, and, when you are able & comply with than, RETURN THIS LETTER with the requested information, documents, and forms. We will then complists processive of your application. Unless you furnish the requested information or document(s) checked it will be necessary to recommend to the court that your petition for naturalization be donied for look of prosecution. The application form you have submitted is obsolete. Complete and return the enclosed new application. Send money order or check for s made payable to the Department of Justice, Immigration and Naturalization Service. Do not send cash or postage stamps. Your case has been continued for: 1. Receipt of verification of your military service or other routine clearances; 2. Receipt of your immigration file; 3. Reexamination on: history and government: Ability to read, write, speak, or understand English. A more in-depth interview is necessary in your case. ; It will be necesary to reschedule your examination. Please advise this office of any change of address. A more in-depth interview is necessary in your case. You will be notified by mail of further action your case. You will be notified by mail of further action in your case. Your application for a Certificate of Citizenship (Form N600) has been accepted. You will be sent an appointment notice. It is requested that you present original documents and submit copies of the necessary supporting documents at the time of your scheduled interview. In order to act upon your N600 application certain additional information, documents, or forms are required. To help you in this regard we have checked those items below. N-600 location: US Immigration & Naturalization Service 9858 Artesia Blvd. Bellflower, California 90706 Form N-14 (Rev. 12-31-82) Y (Over)"
}