{
  "anumber": "A42733525",
  "id": "A42733525_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Naturalization, FORM N-550 REV. 6-91"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1999
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 R No. 24267971 Personal description of holder INS Registrations No. A 42 733 525 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: OCTOBER 7, 1914 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 4 inches Complete and true signature of holder) Marital status: MARRIED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA CHINA, PEOPLE'S REPUBLI The Attorney General having found that: WEN YING ZHANG then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable rouisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: FEBRUARY 18, 1999 that such person is admitted us a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, Dains meissau PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
}