{
  "anumber": "A42733525",
  "id": "A42733525_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice (INS, Form I-130 ( Rev. 02/28-97) N, I-130, Form I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1935,
        1914,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 U.S. Department of Justice (INS) ion for Alien Relative OMB No. 1115-0054 DO NO E IN THIS BLOCK - FOR EXAMINING OFFICE Case ID# Action Stamp Fee Stamp A# APPROVED me DIRECTOR 0128mp 3/6/91 SR G-28 or Volag # MAR 05 1991 WAC9H105-000932/691 Section of Law: 201 (b) spouse 203 (a)(1) Petition was filed on 01/31/91 (priority date) 201 (b) child 203 (a)(2) Cigarettes kcal) Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Recompanied Pet Ben. \"A\" File Reviewed Stateside Criteria 203,(a)(5) WAC 3822 Field Investigations I-485 Simultaneously AM CON: Grangzlich 204 (a)(2)(A) Resolved 204 (h) Resolved REMARKS: Cof 2 Do NOT Separate A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) PAN, JING ZHANG WENYING 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 737 FOLSOM ST. 624 1000 XINZHA ROAD (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) S.F. CA. 94107 Shanghai of China 200041 3. Place of Birth (Town or City) (State/Country) 3. Place of BirthP (Town or City) (State/Country) Shanghain of The people's Republic of china Shanghai of china 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 6/3/1935 Female Widowed Divorced 10/7/1914 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) N/A N/A 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) June 17th 1985 Shaughn of China 9. Social Security number 10. Allen Registration Number (if any) 9. Social Security number 10. Allen Registration Number (if any) FOIA (b)(6) N/A N/A N/A 11. Names or PHOT Husbands/ wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended Jones HSN N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 14556161 SFR 05/29/90 N/A Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: N/A 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion States citizen or lawful permanent resident? Yes No Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned IAN 31 1991 Form 1-130 (Rev. 02-28-87) N 3/6/41 info"
}