{
  "anumber": "A42733525",
  "id": "A42733525_0061",
  "page_index": 61,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0061/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1991,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/26/2023 PLACE tt First Pleple's Hospital MEDICAL EXAMINATION OF APPLICANTS DATE OF EXAMINATON (MO., Day, Yr,) A 8 # FOR UNITED STATES VISAS the 8 7.26.1991 request of 3 American Consul at CITY thirti COUNTRY SHANGHAI CHINA NAME (Last in CAPS) # (First) z (Middle) DATE OF BIRTH SEX I certify that on the above date I examined st * iRR (Mo., Day, Yr.) F M 10,7.1914 WHO BEARS PASSPORT NO. ISSUED BY ON 878623 GENERAL PHYSICAL EXAMINATION 7.23.1987 I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid at Fill Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, not Active Gonorrhea it IN Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious He Virus(HIV) Infection Previous Occurrence of One or More 1 (HIV) Other Physical Defect, Disease or Mental Retardation Attacks of Insanity Mental Defect Disability: Insanity Narcotic Drug Addiction Sexual De-viation - Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT Normal IE? Abnormal Not Done No reaction Describe findings: Reaction mm #* Not Done DOCTOR S NAME (Please print) DOCTOR'S NAME (Please print) DATE READY FANG D1 MING H DATE READY FANG DI MING 7,4,1971 7. 4.1511 SEROLOGIC TEST FOR SYPHILIS # SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed-indicate treatment under Positive (Confirmed by Western Blot or equally reliable test) Ramarks) (FT Nonreactive Negative Not Done Not Done TEST TYPE: TEST TYPE: usR ELSA. DOCTOR'S NAME (Please print) DATE READY DOCTOR'S NAME (Please print) (If DATE READY FANG DI MING 7.4.1991 FANG 01 MIG 7.5.1991 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Pleas REMARKS : APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The informati. Signature az its ing Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE 8 M HEIGHT FANG DI MING 7.26.1991 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 U.S GOVERNMENT PRINTING OFFICE: 1988 0 218-275 DEPT. OF STATE"
}