{
  "anumber": "A42848739",
  "id": "A42848739_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXTRAIT ACTE DE MAISSANCE DE LA COMUNE DU CAP-HAÏTIEN POUR L'ANNEE 1901, 77777"
    },
    "years": {
      "ms_years_nlp_v1": [
        1901,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 EXTRAIT ACTE DE NAISSANCE DE LA COMMUNE DU CAP-HATTIEN POUR L'ANNEE same DES 1901,DEPOSE RUX ARCHIVES DU GREFFE DU TRIPUNAL CIVIL DU CAP-MAITIEN 20 20 III No 77777 Cases Aujourd hui samadi quatorzo décembro mil nouf cont un An quatro vingt dix-huitiomo do l'Indépandance a dix houres du mtin Par dovant Nous Rosovillo Bornardin Officior do l'Etat Civil do In Vingt Centimes de gourdes No-111 Communicadu Cap-Enition; CHARLES Est compare lo Citoyen Louis Edmond Larocho recoveur Cornumal domi- JOSEPH-PAUL LAROCHE cilié (on cetto Villo, loquel nous a déclaré que lo quntro Novombro dornier a six héuros du soir, il out né on cotto Communo, do lui déclarant on sa maison. ct de la dama Anna Larocho,néc Joun Josoph son épousc, un cnfant du SCXC masculin qu'il nous présente ot auquel il donno los prénoms do CHARLESJOSEPH-PA U TRUN Los ditos déclaration ct présentation fnitos on présence dos cito- yons Justinion Etionno propriétaire ot Montin André Nolson,conser- cant, tous doux majours domiciliés on cottc Villo ot Nous avons apres locturo signé lo présont acto avoc lo péro at los témoins- Un not rayé nul ct un renvoi bon- Ainsi signé- L. Ednond Larocho, J.Etionno,1t Nolson,R. Barnardin DD Pour extrait conformo Collationné Prudent Hyppolito Groffier 3 Vu par Nous Francois Raymond Doyen du Tribunal Civil du Cap-Enition pour la légalisation do la. signature do Monsiour Predent Hyppolito e THIS Greffier au sus-dit Tribusal appenée ci-dossus Tribunal Civil du Cap-Motion CO 2 juillct 1983 An 1800 dc l'Indé- pandance Le Doyon SECURITY Francois Raymond, Av"
}