{
	"anumber": "A42848739",
	"id": "A42848739_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/27/2023, F200-LO-012 ( (Rev. 2/84)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 Southeast Bank, N.A. January 30, 1990 American Consulate of Port-au-Prince, Haiti Dear Sirs: At the request of our customer, Gladys Laroche, we are pleased to inform you that she has maintained a Money Market Account with our Bank since November 8, 1984, in the names of Gladys Laroche or Raynald Laroche. Our records indicate a balance of $3,000.01 on deposit in this account as of the close of business January 29, 1990. Please advise us if we can provide any additional information. Sincerely, Celia E. Diaz Personal Banking Officer STATE OF FLORIDA) ) SS COUNTY OF DADE ) Before me this 30th day of January 1990, personally appeared Celia E. Diaz who declared that the above information is true and correct to the best of her knowledge and belief. NOTARY Lugic Alcantara NOTARY PUBLIC STATE OF FLORIDA BONDED THRU GENERAL MS UMO MY COMMISSION EXP 14.1993 The information contained in this letter is confidential and written as a matter of business courtesy, with the understanding that its source and contents will not be divulged, except as required by law, and that no responsibility therefore is to attach to this bank or those connected with it. It contains information and expression of opinion subject to change without notice; and, while obtained from sources deemed reliable, the accuracy of any statement made herein is not vouched for in any way One Southeast Financial Center Miami, Florida 33131 (305) 375-6300 F200-LO-012 (Rev. 2/84)"
}
