{
	"anumber": "A42848739",
	"id": "A42848739_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "N° 19979, Y N° 19979"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1938]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "HAITI Screened by NARA, 7/27/2023 TIMBRE G.O.IQ ED'HAITI Y No. 19979 20 Du registre de l'Officier in THERE civi in 14 all 6.0.05 G.0.05 Cap-lisitien, Section Sun, déposi all Graff du friban.7 Civil Cmes. de cette villa pour l'année mil neur cent crent huit (1938), is etc extrict l'acte de Naissance wont la teneur suit : PAPIER TIMBREC... Du 22 Décesbre 1938. Vingt centimes de gourde Aujourd hui Jaudi vingt-vaux decembre mil-neuf-cent-trente-huit, 2n 135 an at an V de 72 Tibaration at 1a Restauration, No 118 a mix hours du mtin. NAISSANCE Par devant Neus, LIMOLEON VINCENTI Officier 40 7 'Etat Civil de 72 do Commune all Cap-Haitien. A comparu 1e citoyen PAUL LAROCHE, speculateur en denrées, majeur, demou- RQCHD, 70 vendradi rant at domicilié au Cap-Huitien, Legual neus as présents un enfant au 21 October 1938, à sexe Lasculin qu'il nous declare être son fils Togitime, no en sa deneu- 4 heured do l'apres re en cetts ville, rues 24 et C, In Venereal vingt At un Octobre écause, niai -- Ku-s 24 at 6 à quatre heures e 7'iprés-aidi, de Mastasio ANNA LAROCHE, son épense, propristaire, majoure, dessurant enseable, augus? enfant il denne les lecipissé No 85534 E prénous de : PIERRE RAYNALD. lies declaration et presentation ont eu lieu ell presence des citayens Daniel Pretto, propristaire et Marcel Vincent, AGennicien, caus deux majeurs, soniciliés encette sis-site ville; et neus avons signs 7.0 pré- sent acte avec 1e per et les teneins, pres qu'il leur an 2 été donné lacture. Ainsi sings): Paul Lareche, D. Pretto, M.Vincent et findlish Vincent. Pour extrait conforme Collationné This is a true, correct and compared copy of the original which was returned to the applicant Vancauar Surnave,Greffeer Contact Representative U.S. Immigration & Naturalization Service 01/14/85 Miami, Florida Date"
}
