{
	"anumber": "A42848739",
	"id": "A42848739_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Extrait des registres des actes de naissance de la commune de Cap-Hatié, A6 N° 76133"
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023, 1938]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 UU 14 ) ( / REPUBLIQUE D'HAITI Extrait des registres des aotes de naissance de la commune de Cap Haitie déposé au bureau des Archives Nles de la République A6 N° 76133 1.5 1.50- Aujourd'hui jeudi vingt deux décembre mil neuf cent trente huit an 135 e de l'Indépendance et an VI de la libération et de la Restauration TIMPREC: dix heures du matin Par devant Nous Timoléon Vincent officier de l'éta RÉPUBLIQUE Une gov D'HAITI G:1.35 civil de la commune du Cap-Haitien A comparu le citoyen Paul Haroche,spe JUSTICE TOUS POUR culateur demeurant et domicilié au Cap Haitien lequel nous a présenté ur h enfant du sexe masculin qu'il nous a déclaré etre son fils légitime né en sa demeure en cette ville rues 24 et C le vendredi vingt et un Octobr ANNEE 1938 écoulé à quatre heures de l'apres middi de madame Anna Laroche son épouse PAGE 42 propriétaire majeure demeurant ensemble auquel enfant il a donné les pré NUMERO 117 noms de PIERRE RAYNALD.=Ces déclaration et présentation ont eu lieu en ACTE DE NAISSANCE DE: présence des citoyens Daniel Pretto propriétaire et Morcel Vincent méca- PIERRE RAYNALD LAROCHE, nicien tous deux majeurs domiciliés en cette susdite ville be nous avons le vendredi 21 Octobre 1938 igné le présent acto avec le pore et les témoins apres qu'il leur en a. à 4 heures de l'apres midi été donné lecture.-Pigne: T. Vincent. Rec: 8534-F ues 24 et C Port-au-Prince le 12 dédembre 1989 POUR COPIE CONFORME COLLATIONNED .H/A-407282 SECURITY NATIONALS with JEAN WIT ART BERTRAND GENERAL M.E.V/"
}
