{
	"anumber": "A42849173",
	"id": "A42849173_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42849173_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OPTIONAL FORM 2 (French) (Rev. 6-82), 230"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "Canada"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 OPTIONAL FORM 230 (French) (Rev. 6-82) page 2 25. Nom, adresse, date et lieu de naissance du père (s'il est décédé, mentionnez-le et indiquez l'année du décès) EUGENE SAinT FORT decEDe 26. Nom de jeune fille, adresse, date et lieu de naissance de la mère (si elle est décédée, mentionnez-le et indiquez l'année du décès) THELUCIA THELUSMA decide' 27. Nom, adresse et degré de parenté du plus proche parent dans le pays d'origine (si les père et mère sont décédés) MARie MARthe Saint FORT (SANTO 16 N 1 2 (fille) 28. Enumérez tous les lieux où vous avez résidé pendant au moins six mois depuis l'âge de 16 ans: Ville Département (ou province) Pays Dates (du-au) Métier ou Profession SANTO 16 No 12 HAITI (1906 CULTIVATEUN 29. Enumérez toutes les organisations (professionelles, sociales et politiques) dont vous êtes ou vous avez été membre ou auxquelles vous êtes ou vous avez été affilié(e) depuis l'âge de 16 ans: Nom et adresse Dates (du-au) Précisez la nature de votre participation, et, le cas échéant, de la fonction exercée par vous AUCUNE 30. Enumérez toutes les langues, y compris la vôtre, que vous pouvez parler, lire et écrire Langue Que je parle CReoLe Que je lis Que j'écris CReole 31. Précisez les périodes de votre résidence antérieure, ou de vos séjours, aux Etats-Unis (Indiquez la catégorie du visa obtenu, ou à quel titre vous avez été admis), (Si vous n'avez jamais été aux Etats-Unis, indiquez-le) aucun 32. Avez-vous jamais été en traitement dans un hôpital, une institution ou autre établissement spécialisé Oui Non pour des troubles mentaux, pour vous être adonné à une drogue ou pour alcoolisme? (Dans l'affirmative, donnez des explications) 33. Avez-vous jamais été arrêté, condamné ou incarcéré, ou avez-vous jamais été admis dans un asile Oui Non d'indigents ou autre institution de charité? (Dans l'affirmative, donnez des explications) 34. Avez-vous jamais bénéficié de mesures de grâce, d'amnistie d'un décret de réhabilitation, de toute autre Oui Non mesure de clémence, ou de tout acte analogue? (Dans l'affirmative, donnez des explications) 35. Avez-vous jamais sollicité un visa d'entrée aux Etats-Unis? (Dans l'affirmative, indiquez où, et quand, si vous Oui Non avez fait une demande de visa de non-immigrant ou d'immigrant ou si le visa vous a été accordé ou refusé) VisA TOURiST a ETe REfuse all COURS duMois 23octobee 36. Vous êtes-vous vu refuser l'entrée aux Etats-Unis au cours des 12 derniers mois? (Dans l'affirmative, donnez Oui des explications) Non 37. Vous êtes-vous jamais fait inscrire à un bureau de recrutement selon les lois des Etats-Unis sur le Service Oui Non Militaire obligatoire par sélection? (Dans l'affirmative, donnez des explications) 38. Avez-vous jamais fait une demande afin d'être exempté de l'instruction et du service militaire dans les Oui Non Forces Armées des Etats-Unis, ou avez-vous quitté les Etats-Unis, ou vous en êtes-vous tenu éloigné, pour éviter de satisfaire à vos obligations militaires ou pour vous y soustraire? (Dans l'affirmative, donnez des explications) Avez-vous l'intention d'entrer aux Etats-Uni en venant du Canada, du Mexique ou d'une ile voisine des Oui Non Etats-Unis avant expiration d'un délai de deux ans consécutif à votre arrivée au Canada, au Mexique ou dans l'ile en question? (Dans l'affirmative, indiquez le nom de la compagnie de transports par laquelle vous êtes entré(e) ou vous l'intention d'entrer au Canada, au Mexique ou dans cette fle)"
}
