{
	"anumber": "A42848739",
	"id": "A42848739_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DE Demande de Visa d'Immigrant et d'inscription à titre d'étranger, O.M.B. No. 4-70-R150"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 2023, 1898, 1928]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 Form Approved O.M.B. No. 47-R0150 OPTIONAL 230 (French) (Rev. 6-82) Dept. of State 130-104 DEMANDE DE VISA D'IMMIGRANT ET D'INSCRIPTION A TITRE D'ETRANGER INSTRUCTIONS La présente formule doit être remplie en DOUBLE EXEMPLAIRE, à la machine à écrire, ou à la main en employant des caractères d'imprimerie bien lisibles. Il est indispensable que vous répondiez à TOUTES les questions s'appliquant à votre cas. Si une question ne s'applique pas à votre cas, faites-en mention. Si nécessaire, vous pouvez utiliser des feuilles supplémentaires, en double exemplaire, sur lesquelles devront être reportés les numéros correspondants de la formule. Ces feuilles devront être jointes à la formule. PRIERE DE NE PAS SIGNER la présente formule avant d'y être invite par le fonctionnaire du consulat. Un droit de 25 dollars sera perçu lors du dépôt de la présente demande de visa d'immigration. Ce droit devra être payé en dollars des Etats-Unis, ou en un montant équivalent en monnaie du pays, ou par traite bancaire au moment où l'intéressé se présentera devant le fonctionnaire du consulat. AVERTISSEMENT Toute fausse déclaration ou toute dissimulation d'un fait essentiel pourra entraîner votre exclusion des Etats-Unis à titre permanent Même si vous étiez admis aux Etats-Unis, le fail d'y être entré frauduleusement pourrait donner lieu à des poursuites judiciaires et/ou à votre expulsion du territoire. 1. Nom de famille Premier prénom Second prénom LAROCHE Charles Joseph Paul 2. Tous autres noms que j'ai employés ou sous lesquels j'ai été connu(e). La femme mariée doit indiquer son nom de jeune fille. 3. Nom et prénoms en caractères de l'alphabet d'origine (Si ces caractères ne sont pas ceux de l'alphabet romain) 4. Date de Naissance 5. Age 6. Lieu de Naissance Jour Mois Année Ville Département ou Province Pays 04 Novembre 1901 88 ans CAP-HAITIEN NORD HAITI 7. Nationalité 8. Sexe 9. Situation de famille Célibataire (n'ayant jamais contracté mariage) HAITIENNE Masculin Marié(e) Veuf(ve) Divorcé(e)Une Seule Séparé(e) Féminin Y compris mon présent mariage, j'ai été marié(e) fois 10. Métier ou profession 11. Adresse actuelle CABLISTE. PLANTEUR RUE-17-E CAP-HAITEN ( HAITI) 12. Nom, prénoms, adresse, date et lieu de naissance de votre conjoint (indiquer le nom de jeune fille de la femme) LAROCHE Marie Rose Anna née02 Octobrex32 1898 CAP-HAITIEN ( decedee) Date et lieu du mariage 24 MAI 1928 au CAP-HAITIEN 13. Nom. prénoms. adresse. date et lieu de naissance de tous les enfants FOIA (b)(6) FOIA (b)(6) Pierre Raynald Lieu de Naissance CAP-HAITIEN 14. Personnes(s) indiquée(s) aux rubriques 12 et 13 qui 15. Adresse définitive aux Etats-Unis m'accompagneront ou me rejoindront aux Etats-Unis 455 N.E.-159 ST FOIA (b)(6) North MIAMI BEACH. FLORIDA 33162 16. J'ai l'intention de me rendre auprès de la personne suivante 17. Nom et adresse de la personne ou de l'organisation qui se porte (Indiquez nom et adresse et degré de parenté, s'il y a lieu) garante pour vous (si elle n'est pas la même que celle indiquée à la LAROCHE Pierre Raynald- FILS) rubrique 16) 455 N.E. -159 ST NorthMiami each.Florida 33162 NE S'APPLIQUE PAS 18. Signalement (a) Cheveux GRISONNANTS (c) Taille 60 19. Signes particuliersCalvitie Frontale Prononcée 1 Noirs m cm. (b) Yeux (d) Teint Brun 20. But dans lequel je me rends aux Etats-Unis pour y resider 21. Durée du séjour (indiquez si vous avez l'intention de 22. J'ai l'intention d'entrer 23. Etes-vous en possession d'un billet vous vous fixer, aux Etats-Unis à titre permanent). aux Etats-Unis par le permettant de vous rendre à votre adresse A TITRE PERMANENT port de: definitive? Miami FLO. OUI 24. Ressources personnelies '(a) Espèces (c) Immeubles (valeur) (b) Dépôts bancaires (d) Divers (en donner la description) CETTE FORMULE PEUT ETRE OBTENUE GRATUITEMENT DANS LES SERVICES CONSULAIRES DES ETATS-UNIS D'AMERIQUE NSN 7540-00-149-0919 Previous edition not usable"
}
