{
  "anumber": "A42848739",
  "id": "A42848739_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXTRAIT ACTE DE MARIAGE DE LA COMMUNE DU CAP-HAITIEN, 14737"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1928
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 EXTRAIT ACTE DE MARIAGE DE LA COMMUNE DU CAP_HAITIEN DE L'ANNEE 1928, DEPOSE AUX ARCHIVES DU GREFFE DU TRI- BUNAL CIVIL DU CAP-HAITIEN. 20 20 KKK No 14737 Aujoursehui, jeudi vingt quatte Mai mil neuf cent vingt hyit, An 124e de 1° Independance, a sixheures et demie du soir Par devant Nous, Edmond Raphael Estrade, Officier de iVingt Contines gourdes] Etat Civil de 1a Commune du Cap-Hiitten; Section Sud, Saussigne Ont compatu : 10/ Le Citoyen Charles Joseph Paul Louis Edmond Laroche, ACTE age de vingt six ans six mois et vingt jours, Cabliste, majeur, ne et domicilie au Cap-Haitien, le quatre Novem- DE-MARIAGE bre mil neuf cent'un a six heures du sair, du mariage d'entre le Citoyen Louis Edmond Laroche, decede a Port- au-Prince, de son vivant receveur Communal, domicilie DU CITOYEN au Cap-Haitien, et la dame Anna Laroche, son epouse, CHARLES JOSEPH nee Jean-Joseph, y domiciliee, appert acte de naissance au No-111 dresse et delivrea la date du samedi quinze PAUL ED. LAROCHE janviet mil neuf cent un, a dix heures du matin, part Monsieur Roseville Bernardin, alors Officier de l'Etat ET Civil de la Commune du Cap-Haitien; stipulant pour lui DE LA CITOYENNE et en son Nom personnel d'une part - MARIE_ROSE 26/ La Citoyenne Marie-Rose Anna Robert Laroche, agee de vingt neuf ans sept mois et vingt deux jours, sans ANNA ROBERT LAROCHE profession, majeure, nee et domiciliee au Cap-Hoitien, le deux Octobre mil huit cent quatre vingt dix-huit a six heures et demie du matin, du mariage d'entre le Le 24 Mai 1928 Citoyen Robert Laroche, a cette epoque commercant, domi- a 5h. 1/2 du soir. cilie au Cap-Hoitien, et la dame Flora Laroche, nee Jean- Joseph, appert son acte. de naissance au No. 119 dresse et delivre a.1a date du mardi deux Novembre mil huit cent quatre vingt dix-huit, a neuf heures et demie du matin, par Monsieur Roseville Bernardin, alors Officier de l'Etat Civil de la Commune du Cop-Haitien, stipulant pour elle et enson Nom personnel d'autre part. Lesquels Nous ont requis de proceder a la celebration du mariage projete entre eux, dont les publications ont ete faites devant la principale Entree de notre Bureau; les dimanches six et treize Mai de cette presente Annee, a huit heures du matin. Aucune opposition au dit Mariage ne nous ayant ete si- gnifies, jaisant droit a la dite requisition, apres avoir donne aux parties et aux temoins presents, lec- ture : 10/ Des actes de naissance des futurs epoux. 20/ Des publications ci-dessus enoncees. 30/ Du Chapitre six de la loi numero du Code Civil d'Haiti traitant des droits et devoirs respectifs des epoux, avons demande au futur epoux et a 1a future epouse, s'ils veulent se prendre pour mari et pour femme; Chacun d'eux ayant repondu separement et affir- mativement, en presence des temoins ci-apres nommes et CHARLES JOSEPH PAUL LOUIS EDMOND LAROCHE et la Citovenne qualifies, declarons au nom de la Loi que le Citoyen"
}