{
	"anumber": "A42848739",
	"id": "A42848739_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42848739_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Classify Status of Alien Relative for Issuance of Immigrant Visa, FORM 1-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 1985, 2023, 1984]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": ".S. De B. will ent of Justice Screened by NARA. 7/27/2023 Immigration and Naturalization Service foot A OMB No. 1115-0054 Approval expires 4-86 PETITION CLASSIFY STATUS OF ALIEN RELATIVE Fee Stamp F SUUNCE OF IMMIGRANT VISA Food 6x you (PLEASE NOTE - YOU ARE THE PETITIONER AND YOUR RELATIVE IS THE BENEFICIARY) TO THE SECRETARY OF STATE: The petition was filed on September 1911984 REMARKS The petition is approved for status under section: Approved PERSONAL INTERVIEW CONDUCTED DOCUMENT CHECK ONLY DATE 201 (b) CHILD 203 (a) (2) FEB 5 1985 FIELD INVESTIGATION COMPLETED SPOUSE, OF APPROVAL PREVIOUSLY FORWARDED ACTION 201 (b) PARENT 203 (a) (4) PER COMPUTER DD MIA NR FCO SRO-P'S 4 203 (a) (1) 203 (a) (5) DISTRICT AB (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 00T11 1984 1. Name of beneficiary (Last, in CAPS) (First) (Middle) 2. Do Not Write in This Space 3. Beneficiary's marital status: LAROCHE, C. J. PAUL Married Widowed Divorced Single 4. Other names used by beneficiary (including maiden name if married) 5. Has this beneficiary ever been in the U.S.? N/A 9760V3897 YES NO 6. Country of beneficiary's birth 7. Date of beneficiary's birth (Month, day, year) 8. Are beneficiary and petitioner related by adoption? HAITI November 4, 1901 YES NO 9. Petitioner's name is: (Last, in CAPS) (First) (Middle) 10. petitioner's phone No. 11. The beneficiary is my: (relationship) LAROCHE, Raynald Pierre 949-3760 Father 12. Other names used by petitioner (including maiden name if married woman) N/A 13. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) 14. Full address of beneficiary's spouse and children, if any (Omit this item if petition is for your spouse) Thank USA 15. Names, birthdates and countries of birth of beneficiary's children: 16. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in Port-au-Prince Haiti (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) 7. Address in the United States where beneficiary will reside (City). (State) 455 N.E. 159 Street N. Miami Beach, Florida 33162 Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town or city) (Province or State) (ZIP Code) ,HiRue 17E #61 Cap-Haitien Haiti (a) Beneficiary's address abroad (if any) is: (Number and Street) (Town or City) (Province) (Country) (b) If the beneficiary's native alphabet is other than Roman letters, write his/her name and address in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) OVER RECEIVED TRANS. IN RET'D TRANS OUT COMPLETED FORM 1-130 Rev. 5-5-83) N"
}
