{
  "anumber": "A42994404",
  "id": "A42994404_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42994404_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        2023,
        1902,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 U.F Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# APPROVED 9128R 8/13/905 LILLS RAC DIRECTOR G-28 or Volag # Wac 96-264-50052 Section of Law: AUG 17 1990 201 (b) spouse 203(a)(1) Petition was filed on 8/8/90 (priority date) 201 (b) child 203 (a)(2) 201 (b) parent 203 (a)(4) highen Personal Interview Previously Forwarded Recommended Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) AM CON: Karachi WAC 3822 Field Investigations I-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolved REMARKS: TR-5 6 SEP 1990 A. Relationship 1. The allen relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) ZHUMKHAWALA, Farida TAPAL, Nooruddin M. 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 1747 Blossom Hill Rd. 46/B Maulvi Tamizuddin Rd. (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) San Jose, CA 95124 Lalazar Karachi Pakistan 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Karachi, Pakistan Karachi Pakistan 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 12/16/37 Female Widowed Divorced 1902 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) TAPAL None 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) August 15/70 ; Karachi, Pakistan N/A a Social Security number 10 Alter Renistration'Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) None None 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended None Amtullah Tapal Not Applicable 1976 (Deceased) and returned. 13. If you are a U.S. citizen, complete the original seen a true and correct 10. Has Yes your ORDY. relative ever been in the U.S.? My citizenship was acquired through (check one) No NIC Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization act He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued officer, Not Applicable No. 12319255; 10/3/85 San Jose, CA Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) Retired Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: 16. Has your relative ever been under immigration proceedings? Not Applicable Yes No Where When 14b. Did you gain permanent resident status through marriage to a United States citizen or lawful permanent resident? Yes No Exclusion Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N 08 AUG 1990 but PM"
}