{
  "anumber": "A42985251",
  "id": "A42985251_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42985251_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, FORM NO. 1405-0015"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1938,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 87 15/2023 FORM APPROVED O.M.B. No. 1405-0015 ON RM 230 (English) (Rev. 6-82) OPETATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION 50230-105 INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name First name Middle name QURESHI SABNOOR AZIZ 2. Other names used or by which known (If married woman, give maiden name) MRS. QURESHI 3. Full name in native alphabet (If Roman letters not used) FIE 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) (City or town) (Province) (Country) CORR NOTRNOWN ECTDATE is 1907 84 KAGHAM NWPF PAKISTAN 7. Nationality 8. Sex 9. Marital status PAKISTANI Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married times. 10. Occupation HOUSEWIFE. 11. Present address 301 BLOCK #5 SHAHFAISAL COLONY KARACHI. - 25 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) 1900 Enuct date is not Known. - Date and place of marriage 1938 At Karachi - Exact date has not leen FOIA (b)(6) 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States FOIA (b)(6) 8034 DORSEL COURT ORLAND 0-FL 32819 U-S.A. 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If different from 16) FOIA (b)(6) 18. Personal description 19. Marks of identification (a) BLACK Color of hair (c) Height BLACK spot E GRAY 4. feet 10 inches ByuppeR LEFTEYE - (b) Color of eyes BLACK\" BROWN (d) Complexion 20. Purpose in going to the United States To JOIN my CHILDRENS. 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? P PERMANENTLY ORLANDO-FL- YES THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}