{
  "anumber": "A42940170",
  "id": "A42940170_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42940170_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF SUPPORT, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1987,
        1993,
        2023,
        1977
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/4/2023 AFFIDAVIT OF SUPPORT I, Mukund Prabhakar Gupte, being duly sworn, depose and say that : I am 49 years old and reside at 1700 Rollingwoods Dr., Troy, MI 48098, USA. I have been residing in the USA since 1971. I became naturalized citizen of the United States of America on October 17, 1977 at Detroit's INS office. My alien registration Number is FOIA (b)(6) the petition number is 314 360, and naturalization certificate number is 10156026. This affidavit of support is for my father Mr. Prabhakar Vinayak Gupte, born on February 13, 1903 and currently residing at 759/107/1 Deccan Gymkhana, Pune 411 004, India. I will be providing his airfare and travel expenses from India to USA. Upon his arrival to USA, he will be received at the port of entry. He will be residing with my family at 1700 Rollingwoods, Troy, MI. He will be provided with room and board, proper health care and other incindental expenses required to lead a normal life. I am willing to deposit a bond if necessary, with the Immigration and Naturalization Services to guarantee that he will not become a public charge in the United States. I am a partner and employed with Chronolog Systems Inc., 1235 Chicago Road, Troy, MI 48083 as president of the corporation since 1987. My annual salary is $ 50,000 plus family health care benefits and bonus. I, also manage another engineering firm, Mandex Technology Inc. which is owned and operated by our family with a gross annual revenue of approximately $ 25,000. We own a family home at 1700 Rollingwoods Dr., Troy, MI 48083 with a market value of $ 375,000 with a substantial equity accumulated over the past 18 years. At present our obligations include supporting our household, day to day living expenses for myself, my wife and the two sons. FOIA (b)(6) FOIA (b)(6) There are no other obligations and expenses besides what is mentioned above. I declare under penalty of perjury, that the foregoing is true and correct. mucund habhakargun Witnessed and notarized by Mukund Prabhakar Gupte 11-7-91 Anuradha M Coupte Date NANCY F MYLENEK Anuradha M. Gupte Notary Public, Macemb Co., MI My Comm. Expires Oct 26, 1993"
}