{
	"anumber": "A42994404",
	"id": "A42994404_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42994404_0013/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit,, 10 RS."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1922, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 PAKISTAN 10 RS. TEN RUPEES (1.) v, OF Jack cont d I Alain 1990 MASOD M. THE * NOTARY of ADVOCHE AFFIDAVIT. GRACHIT FAESTING I, Nooruddin Tapal son of late Moosaji Tapal, Muslim, adult, (National Identity Card No. 510-02-150012) resident of 34-B, Lalazar, Queens Road, Karachi (Pakistan), do hereby state on solemn affirmation as under :- 1) That I was married to Mst. Amtulla Bai daughter of late Adamji in the year 1922 at Karachi under the Muslim Shia Law who died in 1976 at Karachi. surviving 2) That from that union I have three/daughteronly. They are : the SECURITY M. our of (i) Mst. Bano wife of Mr. Fakhruddin Millwala; (ii) Mst. Farida wife of Yusuf Jhumkawala, and (iii) Mst. Shameem widow of late Talha Ghaznavi, presently residing at 8-B, Block-9, Kahkeshan, Clifton, Karachi. Under International Law 3) That what is stated above is true to my own knowledge. Karachi, dated N.T.Topol DEPONENT. 11th. June, 1990. (Nooruddin Tapal). The Deponent is identified by me to the Commissioner for taking affidavits. ADVOCATE. Solemnly affirmed before me at Karachi this 11 th. day of June, 1990, by the deponent above-named who is identified by Mr. Zahiruddin Khan, Bar-at-law, who is known to me personally. SOLEMNLY COMMISSIONER AFFIRMER FOR TAKING AFFIDAVITS. BEFORE ME the Lafar Masood B.Com. M.A.I.L. B. Advocate & NOTARY PUBLIC, KARACHI, PAKISAN. 11-6-90"
}
