{
	"anumber": "A42940292",
	"id": "A42940292_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42940292_0019/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, NSN 7540-00-139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 PLACE MEDI \\L EXAMINATION OF APPLICANTS BOMBAY FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 1931232060/11.4.91 CITY COUNTRY At the request of the American Consul at BOMBAY INDIA NAME (Last In CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Da Yr.) F M I certify that on the above date I examined DESAI KHANDUBHAI JEEVANJI 1-2-07 WHO BEARS PASSPORT NO. ISSUED BY ON B 221874 AHMEDABAD 26.8.91 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancrold Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Ingulnale Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcohollsm EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Reaction mm Describe findings: NO PULMONARY OR FLEURAL LESION SEEN Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ - DR. M. TAYABALI DATE READ 4 NOV 199 - SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done KAHN TEST : NEGATIVE Not Done TEST TYPE: TEST TYPERTLY (III) ANTIBODIES-NOT DETECTET DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DR. (MRS) E. LIA DATE READY DR. (MRS) F. E. FALIA 4 NOV 1991 8 NOV 1991 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The Information on this form refers to me. 2 H41-91 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. B. M. MEHERHOMJI 8 NOV 1991 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 GPO : 1989 o - 226-954 DEPT. OF STATE"
}
