{
  "anumber": "A42940170",
  "id": "A42940170_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42940170_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-135"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/4/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp AUG 0.5 $75.00 FEE PAID NO. All APPROVED IMMIGRATION AND NATURALIZATION SERVICE DATE 5-16-9 LINCOLN, NEBRASKA INS RAC DIRECTOR G-28 or Volag VERIFIED BY nh Section of Law: JUL 16 1991 Petition was filed on: 5-15-91 (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child XM Personal Interview Previously Forwarded 203 (a)(2) Recommended by: Pet. Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) LIN 3813 Field Investigations I-485 Simultaneously AM CON: Bombay 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: LIN91-173-00656 A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) GUPTE MUKUND PRABHAKAR GUPTE PRABHAKAR VINAYAK 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 1700 Rollingwoods Dr. 759/107/1 Deccan Gymkhana (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Troy, Michigan, Oakland 48098 Pune, Maharashtra, India 411004 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) near (State/Country) Porbandar, Gujarat State, India Mumbra, Thana District, Bombay, India 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 2-15-42 Female Widowed Divorced 2-13-1903 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) None None 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 5-29-70 Pune, Maharashtra State, India FOIA (b)(6) widowed 9. Social Security Number 10. Alien Registration Number (if Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6 Not applicable Not applicable Not applicable 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Endea 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended Not applicable Not applicable Shanta Prabhakar Gupte 6-16-90 passed away 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My was citizenship Birth in the U.S. acquired COPY through (check attached one) Yes No 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) No. 10156026 10-17-1977 Detroit, MI No Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued None 15. Name and address of present employer (it any) 14a. If you are a lawful permanent resident alien, complete the following: Not applicable Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings RESUBMITTED RELOCATED COMPLETED MAY JUL. 1 1991 Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y N"
}