{
	"anumber": "A42994404",
	"id": "A42994404_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42994404_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023, 1902, 1922]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 FORM APPROVED O.M.B. No. 1405-0015 OP TIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION 50230-105 One INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name First name Middle name TAPAL NOORUDDIN M. 2. Other names used or by which known (If married woman, give maiden name) NONE 3. Full name in native alphabet (If Roman letters not used) 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) (City or town) (Province) (Country) 1902 89 yrs KARACHI SINDH PAKISTAN 7. Nationality 8. Sex 9. Marital status PAKISTANI Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married ONE times. 10. Occupation 11. Present address BUSINESS 34-B, M.T. KHAN ROAD, LALAZAR, KARACHI, PAKISTAN 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) (LATE) AMTULLAH, 1906, Karachi, Sindh, Pakistan Date and place of marriage 1922, KARACHI 13. Names, addresses, dates and places of birth of all children LIST ATTACHED 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States 1747 Blossom Hill Road, San Jose, NONE County of Santa Clara, California 95124-6347, UNITED STATES OF AMERICA 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If if any) different from 16) FARIDA YUSUF ZHUMKAWALA, (Daughter) 1747 Blossom Hill Road, San Jose, County (SAME AS IN 16) of Santa Clara, California 95124-6347 18. Personal description 19. Marks of identification (a) Color of hair GREY (c) Height One mtr. 75 cms CUT MARK ON RIGHT HAND feet inches (b) Color of eyes (d) Complexion BROWN 20. Purpose in going to the United States BROWN IMMIGRATION 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? NEW YORK/SAN FRANCISCO YES PERMANENTLY THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}
