{
  "anumber": "A42940292",
  "id": "A42940292_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42940292_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 230 I ( (ENGLISH)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1923,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 Apr NW022, as OMB APPROVAL NO. 1405-0015 CASE No:- BMB 199123 960 EXPRESS 08-31-92 ESTIMATED BURDEN 1 HOUR APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART I - BIOGRAPHIC DATA INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not Applicable should be so marked. If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent explusion from the United States. This form is Part I of two parts which, together with Optional Form OF-230 PART II, constitute the complete Application for Immigrant Visa and Alien Registration. 1. FAMILY NAME FIRST NAME MIDDLE NAME DESAI KHANDUBHA JEEVANJI 2. OTHER NAMES USED OR BY WHICH KNOWN (If married woman, give maiden name) - NOT APPLICABLE 3. FULL NAME IN NATIVE ALPHABET (If Roman letters not used) visioned yu(ly E415 4. DATE OF BIRTH 5. AGE 6. PLACE OF BIRTH (Day) (Month) (Year) (City or town) (Province) (Country) 2nd JAN 1907 84 YEARS SURAT GUJARAY INDIA 7. NATIONALITY (If dual national, 8. SEX 9. MARITAL STATUS give both) Male Single (Never married) Married Widowed Divorced Separated INDIAN Female Including my present marriage, I have been married COME times. 10. PERSONAL DESCRIPTION 11. OCCUPATION a. Color of hair GREY C. Height 175m b. Color of eyes BLACK d. complexion FAIR RETD: 12. MARKS OF IDENTIFICATION 13. PRESENT ADDRESS FLAT No. 101. DAYA SAGAR APARTMENT. -NIL- DIXIT ST. VACSAD GUJARAT Telephone number: Home Office - - 14. NAME OF SPOUSE (Maiden or family name) (First name) (Middle name) DESAL MANIBEN NATHUBHAI. Date and place of birth of spouse : Dt 10-3-1923 at BONAD/AUJ./INDIA Address of spouse (if different from your own) : ADD:- SAME As(13) 15. LIST NAME, DATE AND PLACE OF BIRTH, AND ADDRESS OF ALL CHILDREN 7 dustien 7 NAME DATE AND PLACE OF BIRTH 1 BIPIN. 18/3/1945 at BOWAA/INNIA SAME AS your (13) ADDRESS (If different from own) 6 FOIA (b)(6) THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA OPTIONAL FORM, 230 I (ENGLISH) NSN 7540-00-149=-0919 REVISED 4-91 50230-108 Previous editions obsolete DEPT. OF STATE"
}