{
  "anumber": "A43088228",
  "id": "A43088228_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0053/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Registered Particulars, RP 1/125 X."
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1954,
        1986,
        1914,
        2023,
        1991,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 IMMIGRATION DEPARTMENT REGISTRATION OF PERSONS OFFICE 7 GLOUCESTER ROAD, WAN CHAI, RP 1/125 X. HONG KONG REF.: - 6 NOV 1991 DATE SERIAL NO.. 340717 TO: Madam FONG Wai-ching ( its 1st floor No 241 Fa Yuen Street Kowloon CERTIFICATE OF REGISTERED PARTICULARS I, CHAN Tak-yim, REGISTRATION OFFICER (ROP) CERTIFICATE , by virtue of the powers and discretions vested in me under Section 2 and Regulation 23 of the Registration of Persons Ordinance and Regulations respectively, Cap. 177 of the Laws of Hong Kong, and in accordance with your written request hereby certify that you are the holder of Hong Kong Identity Card No. B891919 (A). at 2. The record shows that Identity Card No. 51739A was issued to you in September 1954 in the name of FONG Wai-ching ( to ). On re-registration on 13 July 1964 for Identity Card No. B891919 you: (i) elected to retain this name, (ii) never registered an alias and have not registered one since acquiring your Identity Card on 12 August 1964, (iii) declared that you were born on 21 August 1914 (not verified) in Chung Shan, (iv) registered your occupation as 'Nil' (v) registered your marital status as Widowed and Regulation 21 & 22 of the Registration of Persons Regulations state:- (vi) never registered any juvenile dependants. 21. (1) Subject to regulation 22, the burden of proving the truth of the contents of any 3. On 16 September 1986 your Identity Card No. B891919 written application for an identity card, or the contents of the identity card itself, shall lie on the applicant for such identity card, or the person to whom such identity card has been issued, or was replaced by new Identity Card No. B891919 (A). On the on any other person alleging the truth of such contents. same day you notified this office that you were a 'Housewife' (2) If, in any proceedings with reference to any decision or act done or proposed to be 4. On 12 October 1991 you reported the name of your done by a registration officer under any of these regulations, a person claims- late husband as LEE Ying-wah ( ). (a) that he enjoys the right of abode in Hong Kong; or 5. No change in marital status has been reported to (b) that he is entitled to a permanent identity card, this office since you acquired your Identity Card. F the onus of proving the same shall lie on that person. 22. A valid permanent identity card shall be evidence that the person to whom the card relates enjoys the right of abode in Hong Kong. Any Unlawful Alterations or Erasures Render This Certificate Invalid CHAN Tak-yim ROP 57 (Rev. 1990) REGISTRATION OFFICER (ROP) CERTIFICATE ORIGINAL"
}