{
	"anumber": "A43061226",
	"id": "A43061226_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43061226_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FORM OF-179 SEP 89, 2"
		},
		"countries": {
			"ms_countries_nlp_v1": [
				"Cameroon",
				"India",
				"Honduras",
				"Argentina",
				"Netherlands",
				"United Kingdom",
				"Singapore",
				"Sri Lanka",
				"Malaysia",
				"Bermuda",
				"Japan",
				"Jordan"
			]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 1988, 1954, 1981, 1987, 1980, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 FORM OF-179 SEP 89 Page 2 18. Latest or Last Address in the United Kingdom. 19. STANLEY ROAD WELLINGBOROUCH- NORTHANTS NNg 104 19. List Below in Date Order All Places Where You, Your Spouse and Unmarried Children Named on the Other Side Have Lived Since Reaching the Age of Sixteen. You need not list those places where you have lived less than six months. First name of Town, City, Province, Occupation From To Family Member Country Month Year Month Year NAGARBHAI 1 BHAGAPHAI PATEL ZERVAVRA- GUJRAT INDIA FARMER BIRTHIN 1954 WELLINGBOROUGH NORTHANTS MACHINE NAGARBHAI U.K. OPERATOR 1954 OCT 1980 NAGARBHAI ZERVAVRA GUJRAT INDIA FARMER OCT 1980 JUNE 1981 NAGARBHAI WELLINGBOROUGH NORTHAND U.K RETIRED JUNE 1981 OCT 1987 NAGARBHAI LOS-ANGELES. CALIFORNIA u.n. RETIRED OCT 1987 MARCH 1988 NAGARBHAI WELLINGBOBOUGH, U.K. RETIRER MARCH 1988 APRIL 1990 NAGARDHAI LOS.ANGELES CA. V.JA. RETIRED APRIL 1990 OCT 1990 NAGAR BHAI WELLINGBOROUSH NORTHAND RETIRED OCT 1990 NOW. U.K 20. On separate sheet, give following information on each family member who resided in: ARGENTINA - Cedula number; date, place of issue and complete address in Argentina. BERMUDA - Date of arrival in Bermuda, occupation and places of employment in Bermuda. CAMEROON - Place of employment there. HONDURAS - Passport number and date of issuance. JAPAN - Registered domicile in Japan and, if Japanese, Chinese or Korean, give name in Chinese (Kanji characters). JERUSALEM - Israeli Identity Card number or passport number if non-Israeli; family and former names used in Jerusalem, family and former names used on arrival, date of arrival and exact address in Jerusalem. JORDAN - Passport number, date and place of issuance and, if not the same, similar details for passport used while in Jordan; present and past occupation, if different. KOREA - KID number, to be found in passports issued in Korea. MALAYSIA - National Registration Identity Card number and, if Chinese, full name and parents' names and parents' names in Chinese characters. NETHERLANDS Full street addresses in the Netherlands. SINGAPORE - Singapore Identity card number for Singapore citizens and permanent residents. If Chinese, full name and names of spouse and parents in Chinese characters. SRI LANKA - Full street addresses in Sri Lanka. 21. Membership or affiliation in organizations in each country named in item 19: Cultural, Social, Labor or Political ORGANIZATION FROM TO NONE. I certify that all information given is complete and correct. N.B. PATEL 19.STANLEY ROAD WELLINGBOROUGH 0933-228096 NORT HHNT). DATE 7-1-91 SIGNATURE AND PRESENT ADDRESS 'PHONE NO. NOTE: If space above is insufficient to answer any questions properly, the additional information may be printed on a separate sheet of paper and attached to this form."
}
