{
	"anumber": "A43088228",
	"id": "A43088228_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0046/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 10/01/99) Y"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "LEE Screened by NARA WHI 8/18/2023 LHING 1991 270027 U.S. Department of Justice IR5 OMB #1115-0054 In igrati and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp 0128 A# APPROVED Id IN.S RAC DIRECTOR 5/6/91 G-28 or Volag WAC 91-184-00991 Section of Law: SEP 09 1991 201 (b) spouse 203 (a)(1) Recommended by: There Petition Personal was filed Interview on May 4,91 (priority date) 201 (b) child 203 (a)(2) Previously Forwarded 201 (b) parent 203 (a)(4) WAG 3899 Pet Ben \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations 1-485 Simultaneously AM Remarks: CON thong Rong 204 (a)(2)(A) Resolved 204 (h) Resolved A. Relationship Secondary evidence only 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) LEE CHUN WING lee FONG WAI CHING 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 2413 1/2 N EASTERN Are. 2/F 241 Fa Yun Street . (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) L.A. CA / U.S.A CA 90032 KowLooN HONG KONG 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Macau Macau ZhoNG shan Guangdong /ChiNA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Y1) Male Married Single (Mo/Day/Yr) Male Married Single 7/16/43 Female Widowed Divorced 8/21/14 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 10/12/70 HONGKONG 8/15/39 Zhongshan china 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) N/A N/A 11 Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended NONE CONSULATE GENERAL OF THE UNITED NONE N/A STATES OF AMERICA, HONG KONG 13. If you are a U.S. citizen, complete the following: 2.5 SEP 1991 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S CONSULAR SECTION 14. if your relative is currently in the U.S. complete the following He or Naturalization (Give number of certificate, date and place il was issued) she last arrived as a (visitor student stowaway without inspection etc 14147780 6/20/90 Los ANGELES N/A Parents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form 1-94 or 1.95 II \"Yes\", give number of certificate. date and place it was issued N/A 15. Name and address of present employer (it any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence. Date this employment began (Month/Day/Year) and class of admission N/A N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED MAY 04 1991 sh JUL 26 1991/4P) Rec'd Sent Approved Denied Returned Form 1-130 (Rev. 10/01/89) Y 9/16/9"
}
