{
  "anumber": "A43088228",
  "id": "A43088228_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RADIOLOGY REPORT"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 PACIFIC ALLIANCE MEDICAL CENTER NAME: FONG, WAI CHING 531 West College Street PHYS: Wong, Hing C. Los Angeles, CA 90012 DOB: 08/21/14 AGE: 82 SEX: F ACCT: H10516433 LOCATION: RAD EXAM DATE: 03/05/97 STATUS: OUT RADIOLOGY REPORT RADIOLOGY NO: UNIT NO: M530989 Hing C. Wong, M.D. 709 North Hill Street Los Angeles, CA 90012 (213) 628-7958 EXAMS: CT: HEAD-WITH/WITHOUT CONTRAST INDICATION: CVA. TECHNIQUE: Both pre and post IV contrast enhancement study of the brain was performed from the base of the skull to the sella turcica with images obtained at 5 mm. thickness, and from the sella turcica to the vertex with images obtained at 10 mm. thickness. FINDINGS: In the posterior fossa, the fourth ventricle is normal in size and midline in position. The brain stem, cerebellar hemispheres and sella turcica are unremarkable. In the supratentorial region, the third ventricle and lateral ventricles are normal in size and are midline in position. The cortical sulci at the sylvian fissures and over the cerebral convexities are unremarkable. There is an area of lucency in the right side caudate nucleus without evidence of mass or surrounding edema. This most likely represents a lacunar infarct and is best seen on images 10, 11, 27 and 28. No other area of either increased or decreased attenuation is noted. No subdural, epidural or subarachnoid fluid collection is demonstrated. IMPRESSION: Findings compatible with a lacunar infarct involving the right caudate nucleus. SIGNATURE ON FILE WILLIAM CHU M.D. CC: Hing C. Wong, M.D. TRANSCRIBED DATE/TIME: 03/05/97 (2055) TRANSCRIPTIONIST: RAD.XCR PRINTED DATE/TIME: 03/06/97 (0135) BATCH NO: 3384"
}