{
	"anumber": "A43088228",
	"id": "A43088228_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "THE FINAL RULE, N-648, Medical Certification for Disability Exceptions"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1973, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 THE FINAL RULE DEFINITIONS Service has modified the definitions of qualifying disabilities The contained in the proposed rule in response to many public comments that the definitions were too narrow and inconsistent with existing definitions in other federal statutes. The \"who is unable because of a medically determinable has physical lasted rule now provides that an exception shall be granted to any person mental impairment or combination of impairments which an or is expected to last at least 12 months, to demonstrate or understanding of the English language. or who is unable for any the same reasons \"to demonstrate a knowledge and understanding form of of the fundamentals of the history, and of the principles and of government of the United States.\" term medically determinable means an impairment that results \"The from anatomical, physiological, or psychological abnormalities which can be shown by medically acceptable clinical and laboratory diagnostic techniques to have resulted in functioning so impaired as to render an individual unable to demonstrate an understanding that of renders the individual unable to fulfill the requirements to the the English language, as required by (Section 312), or for methods English of determining English proficiency The definition proficiency, even with reasonable modifications \" of \"medically determinable\" is the same with regards to the exception abilities the civics knowledge requirement. Loss of cognitive not based from on the direct effect of the illegal use of drugs is covered as a disability. This interpretation of the disability and mental impairment terms with the Technical Corrections Act comports more closely definitions) and regulations for implementing the nondiscrimination 1973. existing in federal policies (such as Social Security Administration requirements of section 504 of the Rehabilitation Act of PROCEDURES FOR OBTAINING THE EXCEPTIONS order to base its adjudication of requests for the disability In exceptions on solid medical evidence, the INS requires all Medical persons seeking an exception to submit a new Form N-648, Certification for Disability Exceptions, to be completed by a a licensed medical doctor (which includes psychiatrists) or licensed clinical psychologist. These certifying professionals the must be licensed to practice in the United States (including They U.S. territories of Guam, Puerto Rico or the Virgin Islands) must also be experienced in diagnosing persons with physical 2"
}
