{
  "anumber": "A43088228",
  "id": "A43088228_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0042/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 230 ( (English-Chinese)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1937,
        2023,
        1943
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 OPTIONAL FORM 230 (English-Chinese) 8-87) DEPARTMENT OF STATE OF APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is US$125. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name () LEE (FONG) First name and middle name Wai Ching 2. Other names used or by which known (If married woman, give maiden name) FONG Wai Ching, FANG Hui Zhen 3. Full name in native alphabet (If Roman letters not used) 4. Date of birth Chinese (Year) (Month) A (Day) B Western (Day) a (Month) A calendar 1914 14 calendar 21 8 1914 (Year) * 5. Age () 6. Place of birth (Give in Chinese and English) (Country) F (Province) (District) # 77 China Guangdong Zhongshan $4 (Heung) SPF (Village) # 7. Nationality 8. Sex 9. Marital status Chinese Male Female Single (never married) Married XX Widowed Divorced Separated to Including my present marriage, I have been married times. 10. Occupation 11. Present address 241, Fa Yuen St., 1/F, Housewife Kowloon, Hong Kong 12. Name, address, date and place of birth of wife/husband (give maiden name of wife) LI Ying Hua ) husband, 7,1907 China, deceased Date and place of marriage 9.1937 Macau 13. Names, addresses, dates and places of birth of all children. LEE Chun Wing ) son, 16.7.1943 Macau, living in Los Angeles, CA., USA 14. Person named in 12 and 13 who will accompany or follow me to 15. Final address in the United States the United States. 2413, 1/2 N. Eastern Ave N.A. Los Angeles, CA., 90032 USA 16. Person you intend to join (Give name, address and relationship, 17. Name and address of sponsoring person or organization if any) different from 16) LEE Chun Wing (son) Same as 15 Same 18. Personal description 19. Marks of identification (a) Color of hair (c) Height Grey feet R inches None (b) Color of eyes (d) Complexion me 20. Purpose in going to the United States Dk. brown Fair to join my son 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? Permanently Los Angeles Not yet THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}