{
	"anumber": "A43061226",
	"id": "A43061226_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43061226_0020/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "JICAL Examination of Applicants for United States Visas, NSN 7540-00-139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 PLACE N. SICAL EXAMINATION OF APPLICANTS 53 GREAT CUMBERLAND PLACE LONDON W1H 7LH FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 020t91 CITY COUNTRY At the request of the American Consul at NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX PATEL Nagarbhai Bhagabhai (Ma Dav. Yr.) I certify that on the above date I examined 050CC13 F M WHO BEARS PASSPORT NO. ISSUED BY ON P650749E PETERBOROUGH 16Jun 86 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Ingulnale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please DATE READ Dr. E. 1. COBB 02 OCT 1991 DATE READ SEROLOGIC TEST FOR SYPHILIS LONDON, WIH TUH SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: WELLCOZYME DOCTOR'S NAME (Please print) UMBERLAND PLAY DATE READ DOCTOR'S NAME Dr. E. 1. COBB @2OOT 19St (Please UMBERLAND print) ACE DATE READY Dr. E. 1. COBB 02 OCT 199 OTHER SPECIAL REPORT (S) (When needed) 7L4 ONDON W1H7LA DOCTOR'S NAME (Please print) REMARKS APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. A N. 13. PATEL X2-10.91 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Dr. E. 1. COBB lone Cobb. 02 OCT 1991 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 U.S. Government Printing Office: 1990-272-823/10166 DEPT. OF STATE"
}
