{
  "anumber": "A43088228",
  "id": "A43088228_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/18/2023, Form N-644"
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 disabilities or mental impairments. They must attest to the origin, nature, and extent of the medical condition as it relates to the exceptions for English and civics. A person who qualifies as disabled for other government benefit programs is not necessarily unable to demonstrate the level of English proficiency or civics knowledge required for naturalization. The categories of health professionals who may certify an applicant's disability were expanded and clarified in response to comments that the proposed rule was too narrow in its near- exclusive dependence on civil surgeons. Civil surgeons who meet the current requirements may still certify an applicant's disability. The medical certification form may be submitted in support of requests for both the English proficiency and civics knowledge exceptions. Form N-648 may be photocopied. Forms may be obtained from local INS district offices, by calling the INS Forms Center at 1-800-870-3676, or by ordering it through the Internet at http://www.usdoj.gov/ins. By the end of March, applicants may also call 1-800-755-0777 or TDD: 1-800-767-1TDD, for information about the disability exceptions. Under penalty of perjury, both the applicant and the medical professional must attest that all information submitted is accurate. A legal guardian may sign the N-648 authorizing the release of additional medical records to the Service. The Service reserves the right to request an applicant to submit additional supporting evidence or a second certification from another qualified professional in cases where the Service has credible doubts about the veracity of a medical certification that has been initially presented. Persons with disabilities who are not seeking exceptions to the English and civics requirements do not need to submit Form N-648. In accordance with Section 504 of the Rehabilitation Act of 1973, INS will continue to provide reasonable modifications in its testing procedures to enable naturalization applicants who have disabilities to participate in the process. Examples of such modifications may include providing sign language interpreters, wheelchair-accessible test sites, or modifications in test format or administration procedures, among others. OTHER NATURALIZATION REQUIREMENTS The disability exceptions are not blanket exemptions from all naturalization requirements. Congress did not authorize the Service to waive any of the other naturalization requirements outlined in the INA for applicants with disabilities. 3"
}