{
	"anumber": "A43088228",
	"id": "A43088228_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: Medical Assessment Form, Form Number: N-648"
		},
		"years": {
			"ms_years_nlp_v1": [1984, 2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 visions in both eyes; that buld prevent her from demonstra g knowledge of basic English language and/or U. history and civics. 4. Did the applicant's disability or impairment result from the illegal use of drugs? If the applicant is developmental disabled, did this condition first manifest itself before age 22? Please explain. NO 5. What is the duration of the applicant's disability or impairment? Is it temporary (less than 12 months) or permanent Explain. PERMANENT DISABILITY This patient has suffered a stroke in 1997 which caused permanent demage to the brain; it is not curable.\" 6. Please provide your medical speciality. If you are not specialized, provide your medical experience and ot! qualifications that permit you to make this assessment. INTERNAL MEDICINE I have been practicing Internal Medicine in Los Angeles since 1984. of perjury under the laws of the United States of America, that the information medical on the records form up E I certify under submitted penalty with it is all true and correct. I agree to release this applicant's relevant of fa any evidence U.S. Immigration and Naturalization Service. I am aware that the knowing under placement 8 U.S.C. Sect information request from on the the Form N-648 and related documents may also subject me to civil penalties 1324c. Signature CKWay Date 9/28/98 Please Type or Print Middle Name First Name Last Name CHUNG WAI NG City, State, ZIP Code Telephone Business Address LOS ANGELES CA 90012 213-620-1781 857 CLEVELAND ST Licensing State License Number CALIFORNIA 438796"
}
