{
  "anumber": "A43088228",
  "id": "A43088228_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/18/2023, INS Naturalization and Immigration Services"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/18/2023 Applicants must, for example, be able to demonstrate their good moral character, have the necessary residency as a permanent (five years, or three years if married to a U.S. citizen), and have the ability to take the statutorily prescribed oath of allegiance. INS will continue to make reasonable accommodations to enable persons with disabilities to demonstrate that they can meet these requirements. When necessary, INS will accommodate applicants with disabilities by modifying procedures used to determine whether an applicant meets the requirements for naturalization, including those related to administration of the oath of allegiance. The Service believes that many applicants with disabilities, while excepted from the English and civics requirements, will be able to have a limited but sufficient understanding of the concepts of the oath. Each applicant's capabilities regarding the oath requirement will be assessed on a case-by-case basis. Although a disabled applicant need not understand every word of the oath at the interview, the INS officer must conclude that an applicant has an understanding of the nature of the oath. The Service will explain the oath in simplified terms to individuals who, because of their disability, have difficulty understanding it. If the officer concludes that an applicant does understand the nature of the oath, the oath can be administered. For example, an inquiry by an officer at the interview might include an attempt to determine whether the applicant understands that he or she is becoming a U.S. citizen, is foreswearing allegiance to his or her other country of nationality, and personally and voluntarily agrees to this change of status. No requirements will be imposed on applicants with disabilities that are not required of other naturalization applicants. INS officers will also accept a wide variety of signals from an applicant with a disability that indicated that the applicant understands the nature of the oath, including, but not limited to, a simple head nod, eye blinking, or other signals specific to the individual that mean \"yes\" or \"no\". 4"
}