{
  "anumber": "A43061226",
  "id": "A43061226_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43061226_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, INS Form 1-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        2023,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 U.S. De partment of Justice xr OMB #1115-0054 Im gration and Naturalization Service (INS) Petition for Alien Relative and 19903440109 NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp 90344014 0128 am A# APPROVED I.N.S RAC DIRECTOR 10-01-12 G-28 or Volag # Wac 91-025-00036 NOV 13 1990 Section of Law: Petition was on: filed (priority date) 201 (b) spouse 203 (a)(1) recommended 201 (b) child WAC by Personal Interview Previously Forwarded 203 (a)(2) 3883 Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field Investigations I-485 Simultaneously AM CON London 204 (a)(2)(A) Resolved 204 (h) Resolved A. NAME Remarks: Relationship changed by court from Asha NACARbhai decree Patel 1. The alien relative is my 2. Arr_wou related his adontion? 3 Did voilgain nermanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) PATEL NAGARBHAI BHAGABHAI Address (Number and Street) (Apartment Number) L9 STANLEY ROAD, NN8 (Town or City) (State/Country) (ZIP/Postal Code) 1PY ELLINGBOROUGH NORTHANTS. ENGLAND (CUK) Place of Birth (Town or City) (State/Country) ZERVAVRA INDIA Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 10-05-13 Female Widowed Divorced Other Names Used (including maiden name) N/A Date and Place of Present Marriage (if married) 05-06-58 DANDESHWAR (INDIA) Social Security Number 10. Alien Registration Number (if any) 450-77-0256 -N/A- Names of Prior Husbanvis/Wives 12. Date(s) Marriages(s) Ended PARVATIBEN PATEL APRIL-1957 Has your relative ever been in the U.S.? Yes No If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) VISITOR ival/Departure Record (I-94) Number Date arrived (Month/Day/Year) 100163330601 04-28-90 e authorized stay expired, or will expire, as shown on Form I-94 or I-95 10-27-90 Name and address of present employer (it any) - N/A - Date this employment began (Month/Day/Year) - N/A 1 Has you relative ever been under immigration proceedings? Yes No Where When Exclusion Deportation Recission Judicial Proceedings UBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned 11/26/90"
}