{
	"anumber": "A43088228",
	"id": "A43088228_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "OATH OR AFFIRMATION OF DEPONENT, Form Number: 91"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 I have stocks and bonds with the following market value, as indicated on the attached list which I certify to be true and correct to the best of my knowledge and belief. $ -0- I have life insurance in the sum of $ -0- With a cash surrender value of $ -C- I own real estate valued at $ -0- N/A With mortgages or other encumbrances thereon amounting to $ Which is located at (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me NONE 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted NONE 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted NONE 11 (Complete this block only if the person named in item 3 will be in the United States temporarily.) That Xdo intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly, or for how long.) I DO INTEND TO FINISH HER ROOM AND BOARD, COST OF LIVING, I AM GOING TO BUY HER AIRFLIGH TICKET, TOO. OATH OR AFFIRMATION OF DEPONENT I acknowledge at that I have read Part III of the Instructions, Sponsor and Alien Liability, and am aware of my responsibilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that I know thecontents ofthis affidavit signed by me and the statements are true and correct. Signature of deponent Chun Wing dee Subscribed and sworn to (affirmed) before me this 22TH day of OCTOBER 19 91 OFFICIAL SEAL LOS ANGELES FENG YI WU at My commission expires on NOTARY PUBLIC CALIFORNIA Signature of Officer Administering Oath Temprium LOS ANGELES COUNTY Title My comm. expires MAR 16, 1993 If affidavit prepared by other than deponent, please complete the following: I declare that this document was prepared by me at the request of 'he deponent and is based on all information of which I have knowledge. (Signature) (Address) (Date)"
}
