{
	"anumber": "A43088228",
	"id": "A43088228_0056",
	"page_index": 56,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43088228_0056/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AMERICAN CONSULATE GENERAL, 22 GARDEN ROAD, HONG KONG, HNK-2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["China", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 1958, 1956, 1935, 1941, 1914, 2023, 1957, 1991, 1930, 1939, 1965]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/18/2023 HNK-2 5/91 LEE FONG, Wai Ching IR5 1991270027 AMERICAN CONSULATE GENERAL, 26 GARDEN ROAD, HONG KONG BIOGRAPHIC DATA REPORT Please answer all questions. If the information needed to answer any question is not available in Hong Kong, you should obtain it from wherever necessary before presenting this form to the Consulate General. Use extra sheets, if needed, particularly in replying to questions about residences, education, employment, and relatives. All persons 16 years or older must complete this form. Do not leave any questions unanswered. If the answer to a question is \"no\" or \"none\", SO state. ALL NAMES OF CHINESE PERSONS AND PLACES MUST BE GIVEN IN CHINESE AND ENGLISH. 1. Full Name LEE FONG Wai Ching 1a. In Chinese Surname First Second 2455 1920 6297 Standard Telegraphic Code Numbers: (The numbers appearing after your Chinese name in your passport, certificate of identity or Hong Kong identity card) 1b. Other names such as school names, maiden names, etc. FONG Wai Ching 1c. In Chinese to H FANG Hui Zhen 1d. Any other names (If none, SO state) 2. Hong Kong Identity Card No. B891919 (A) 2a. Date you first obtained a Hong Kong Identity Card Sex: male female Date of Issuance 22.2.1990 1954.9 3. Local Residence Address 241, Fa Yuen Street, 1/F, 4. Home Telephone 3813598 Mong Kok, Kowloon, HK. GENERAL OF THE CONSULATE HONG KONG DE AMERICA, 5. Mailing Address (if different from above) STATES Office Telephone NA 8 NUV 1991 do Chinese SECThinese 7. Your Nationality 7a. Former Nationality (if any) 8. 21.8.1914 14.7.1914 77 Birthdate: Western Lunar 8a. Age 9. Birthplace Zhongshan Guangdong China (In Chinese and English) Village/town Heung/County Province Country of 4 10. All places you have actually resided since birth, including those for short periods of time (six months or more) including all time spent in the United States: Address From To Yakou Village, Zhongshan, Guangdong, China. 1914.8 1930.1 23 Beishi Village Rd., Shanghai, China. 1930.1 1935.4 14 The 5th of October Street, 1/F, Macau. 1935.4 1939.7 Yakou Village, Zhongshan, Guangdong, China. 1939.7 1941.3 1 Chan Lok Lane, G/F Macau. 1941.3 1956.9 2 Tai Wong Lane, 2/F, Shau Kei Wan, HK. 1956.9 1957.5 Tai Wai Village, Shatin, N.T. HK. 1957.5 1958.11 16 Fa Yuen Street, 1/F, Mong Kok, Kowloon, HK. 1958.11 1965.6 Cont'd on page 4"
}
