{
  "anumber": "A43151489",
  "id": "A43151489_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43151489_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1956,
        2023,
        1904,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 U.S. Department of Justice (INS) etition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID Action Stamp Fee Stamp A# APPROVED $ 35.00 FEE PAID NO. DEN 88-108 IMMIGRATION AND NATURALIZATION SERVICE G-28 or Volag # DEN DENVER, COLORADO DATE 3-4-88 VERIFIED BY 3md Section of Law: MAR IV Petition was filed on 201 (b) spouse 3/1/08 (priority date) (a)(1) Personal Interview Previously Forwarded 201 (b) child 203(a)(2) Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203(a)(4) 203 (a)(5) 3394 Field Investigations I-485 Simultaneously AM CON: NEWDELIT LIN 204(a)(2)(A) Resolved 204 (h) Resolved REMARKS: SLB/ajj A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) ANAND PRAKASH ANAND DEVI KASTURI 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 8892 W. PROGRESS PL c/o K. D. SHARMA CIVIL HOSPITAL (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) LITTLETON co. 80123 ROORKEE U.P INDIA 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) V SONTA U.P INDIA V. BARKALI U.P. INDIA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 1/15/1934 Female Widowed Divorced 3/4/1904 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) V. KUDANA U.P. INDIA 3/7/1956 V. BARKALI U.P. INDIA 9. Social Security number 10. Alian Denietration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) 524-39-1159 A 26713071 (EXPIRED 11. Names of Prior Husbands/Wives 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended RETURNED -88 13. If you are a U.S. citizen, complete the following: AB we 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 12/18/81 DENVER, 10291038 COLORADO Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? Yes No INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd passent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}