{
	"anumber": "A43185171",
	"id": "A43185171_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185171_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Acte de naissance, 337172"
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1985, 2023, 1909]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 LIBERTE EGAI i FRATERNITE REPUBLIQUE D'HAITI 5366 Extrait des registres des actes de naissance de la commune deDelms déposésau buréau des Archives N1es de la Republique L'An mil neuf cent quatre vingt-cing, An 182eme de l'Indéper dahoe et le m? di vingt-huitieme jour du mois de mai a neuf heures 1.50 1.50 du matin, Nous, Louis Nazaire, identifié au numero - 6801-L, ZZZ No 3013 officier de 1 etat civil de la commune de Delmas, certifions avo: inscrit aux registres y afferents en conformité de la loi du vingt aout mil neuf cent soixante- quatorze , le dispositif d'un juge- REPUBLICUE G.1.35 ment rendu par le tribunal civil de Port-au-Prince, seant au palai Une JUSTICE TOUS mes POUR de Justice de cette ville en audience publique et civile le seize mai mil neuf cent quatre vingt-cing, sur requete de la citoyenne AVRIETTE ALEXIS, sous la constitution de M. Roger M. Ancion, avoon du barreau de la oapitale , doment identifié, patenté et imposé Lequel dispositif est ainsi libellé par oes motifs le tribunal ANNEE - 1985 apres examen et sur les conclusions du ministere public, declare sous la reserve des droits de ceux qui ont interets et qualités qu PAGE - 5 AVRIETTE ALEXIS du sexe feminin, est née à Petite Gosseline, depen NUMERO - -B- 9 dance de la commune de Jacmel le dix-sept avril mil neuf cent- neuf des oeuvres naturelles de Noel Alexis, et de Madela Similien, tous deux décédés, dit que le dispositif du présent jugement tiend ACTE DE NAISSANCE DE: lieu d'acte de naissance à : AVRIETTE ALEXIS: Ordonne la trans- AVRIETTE ALEXIS cription du dit dispositif sur un registre special tenu en double J née a acmel le à cet effet par l'officier de l'etat civil de la commune de Delmas conformement à la loi sur le service d'inspection et de controle 17 avril 1909 de etat civil, donne de nous, Theophile Jean-Francois, Doyen en audience publique et civile de ce jour seize mai mil neuf cent ANI: A 337172 otatre vingt-oing, en présence de he Ulrick Rosarion, substitut KJB commissaire du gouvernement de ce ressort et avec l'assistance an Save commis greffier Agcencio Jumelle; Il est ordonné s..etc En foi d quoi eto. Pour expédition conforme et collationnee 1-F Viotorin C.S graffier , enregistrée à carrefour et légalisee par le Doyen. avons opéré et signée la presente inscription conformement a la lo on notre bureau sis a Delmas-3 rue d'u foyer Nu mero- 34. SIGNE:+ L. NAZAIRE RECEPISSEE! 53686-X Love Port-au-Prince le 17 novembre 1988 POUR COPIE CONFORME JEAN WILFRID BERTRAND DIRECTEUR GENERAL COLLITIONNES"
}
