{
	"anumber": "A43185171",
	"id": "A43185171_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185171_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023, 1909, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 U.S. Department of Justice (IN Petition for Alien Relativ OMB No. 1115-0054 RITE IN THIS LOCKIE FORE AMINING FICE ONLY Case ID# Action Stamp 320 enue 100 Fee Stamp A# DOWENIC T WISIO E20 RECEIVED 3rd FLOOR CASHIER G Volag ALS DISTRICT DIRECTOR Section of Law: 16 1989 201 (b) spouse 203 (a)(1) Petition was filed on (priority date) 201 (b) child 203 (a)(2) OCT 10 1989 Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations New 204 (a)(2)(A) Resolved Yo I-485 Simultaneously AM CON: 204 (h) Resolved NYC REMARKS: 1 0458 A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes X No Yes (No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) SAINTHUBERT PERCINE ALEXIS Avriette 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 221-71 91 Rd. . 221-71 91 Rd. (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Queens Village, New York 11428 Queens Village, New York 11428 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) PORT AU PRINCE HAITI JACMEL HAITI 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married X Single 1/10/43 Female Widowed Divorced 4/17/1909 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) PERCINE ROMULUS NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 08/28/1972 NONE 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) N/ A FOIA (b)(6) NONE NONE 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended NONE OFFICER NOT APPLICABLE 13. If you,aré 10.5: citizen, complete the following COMPARED ORIGINAL DOCUMENT SEEM My citizenship was acquired through (check one) INFO AND RETURNED Has your relative ever been in the U.S.? - NYC - 39 Yes No Birth in the U.S. Naturalization let No. 1008336 If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 805 EDNY Visitor B-1, B-2 No: : 13396809 9/23/86 B KLyn, NY Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents 6 o 1 2 21 3 27 OIO 10/11/87 Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 XYes No UNKNOWN If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) NOT APPLICABLE Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: NOT APPLICABLE Date and place of admission for, or adjustment to, lawfu permanent residence, and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through mia (riage to a United Exclusion DYes No Deportation Rescission States citizen or lawful permanent resident? Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N by"
}
