{
  "anumber": "A43185756",
  "id": "A43185756_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185756_0007/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Acte de naissance de Destine Jean, 532578"
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1974,
        2023,
        1902,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 LIBERTE EGALITE FRATERNITE REPUBLIQUE D'HAITI Extrait des registres des aotes de naissange de la oommune des Gonaives déposés au Bureau des Archives nationales de la République L'A n mil neuf gent quatre vingt dix .An 187ème de 1' Indépendanoe 1.50 1.50 le lundi vingt deux ootobre dig heur. N° dû mateni 6512 Par de Gde. Gdc Vant nous Paul E.Latortue officier de l'etat oivil des Gonaives geation nord soussigné. En vertu d'un jugement rendu par le tribu TIMEREC nal aivil des Gonáives date du vendredi vingt six ootobre mil neuf gent quatre vingt dix nous avons été autorisé a transorire centimes sur le registre spécial tenu en double a get effet le dispositif devant tenir lieu d'aote de naissance du sieur DESTINE JEAN JUSTICE Par 00g motifs le tribunal apres examen sur les oonolusions con formes du Ministère public dit que Destiné Jean né aux Cayes le douze mai mil neuf gent deux à sept heures du matin des oeu ANNEE I 1990 vres naturelles du sieur Dester Jean et de la dame Mirly Emar i tous doux dégédés ,En conséquence autorise conformément à la loi PAGE I 63 du 20 aout 1974 l'officier de l'etat oivil des Gonaives seation NUMERO I 838 nord à recevoir la déglaration tardive de naissange de Destiné Jean et de transorire sur le registre spécial tenu on double a oet effet le dispositif du présent jugement lequel tiendra ACTE DE NAISSANCE DE lieu d'agte de naissance de Destiné Jean. DESTINE JEAN Donné de nous Antoine Norgaisse,Doyen en audionoe ordinaire né le 12 mai 1902 et publique du lundi vingt deux oatobre mil nouf cent quatre vingt dix ,en présence de Mme Huldat C. Cajuste ,aommissaire du go Gouvernement pres de oe ressort avec l'assistance du oitoyen Leonel Charles Cs Greffior .Il est ordonné à tous huissiers eat .En foi de quoi eut. (SIGNE) PAUL E. LATORTUE Port-au-prince,le 22 juillet 1991 POUR COPIE CONFORME COOLLATIONNES CACHE JEAN-JOSEPH TRECTEUR GENERAL a.i. ANHA/ 532578 kl LIQUE"
}