{
	"anumber": "A43194558",
	"id": "A43194558_0080",
	"page_index": 80,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0080/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 S PAGE IS FOR OFFICE USE ONLY Category I As REFUSAL WORKSHEET Category II isd 1. JUSTIFICATION (Give concise summarization of facts on which decision to refuse is based and indicate means whereby such facts were ascertained.) ZEPEDA, Julio Ceran was refused on JUL 1 0 1991 under Section(s) (Applicant's name) (date) 221 (g) because: visa symbol (s) IR-5 meds BC ppt (s) bapt. certificate fotos MC marriage docs: fin. docs other: just notarized work letter frimarily child in US - no all of support, no pay stubs, no tax forms - they 're too lold to work NOTE: If visa is refused on medical grounds, attach Form OF-157 Continue on reverse side if needed. NOTE: If visa IS retused on medical grounds, rum 2. SIGNATURE AND NAME STAMP OF REFUSING OFFICER MICHAEL C. MULLINS American Embassy (Consular Section, Minumes POST: San Salvador, El Salvador Vice Consul of the United States of America 3. ACTION BY PRINCIPAL OFFICER, DESIGNEE OR CHIEF CONSULAR OFFICER Waiver requested: Refusal confirmed. 212(e) Refusal not confirmed. Case referred to Department for advisory opinion. 212(g) Recommended that case be reconsidered for the following reasons: 212(h) 188600 212(i) 7/10 (Date) (Signature) 4. NOTIFICATION TO APPLICANT JUL 10 1991 OF-194 was mailed (handed) to applicant on Alien notified on that review of refusal indicates that he may be eligible to receive a visa. my (Initials of action officer) 5. FORM OF-183, VISA REFUSAL CARD, SENT TO THE FOLLOWING: Central clearing office in country of Application. Department. Alien's birth. None. Alien's nationality. Entered in AVLOS (Initials of action officer) (Date) Alien's residence. OPTIONAL FORM 194 BACK (Rev 1-80) 0A9-262-081/90172"
}
