{
	"anumber": "A43194558",
	"id": "A43194558_0071",
	"page_index": 71,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0071/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificate of Naturalization, N-550-C ( (REV. 11-1-87)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1956, 1990]
		},
		"certificate_naturalization": {
			"complexion": {
				"complexion_llm_v1": "N.A"
			},
			"marital_status": {
				"marital_status_llm_v1": "Divorced"
			},
			"residence_naturlization": {
				"residence_naturlization_llm_v1": "Atlanta, Georgia"
			}
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": true,
	"full_text": "No. 14437753 CAVADI Petition No. 28626 ORIGINAL. INS PRegistration No. 22188899 Personal description, of holder as of date of naturalization: Date of birth SEPTEMBER 20, 1956 sex MALE complacion MEDIUM coloroboyes BROWN color of hair BLACK height 5 feel 8 inches; weight 145 pounds; visible distinctive marks NONE Maritalstatus DIVORCED Country of formerationality EL SALVADOR I certify that the description above givenis true, and that the photograph affired Heretor is a likeness of me. Gear Orlando Zepeda (Complete and true signature of holder) UNITED STATES OF AMERICA SS: NORTHERN DISTRICT OF GA Beit known, that ala termofthe U. S. DISTRICT Court of THE NORTHERN DISTRICT OF GEORGIA held pursuant lawal ATLANTA, GEORGIA on SEPTEMBER 21, 1990 the Court having found that CESAR ORLANDO ZEPEDA then/residing at ATLANTA, GEORGIA intends loreside permanenting in the United. States when so required by the Naturalization Lawsoft the United States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entitled to be Teal admitted decilisenship thereupon ordered that such person be and(s)hewas admitted as a citizen the United States of America. In elestimony whereofthe usealoft the courtis this 21ST day of SEPTEMBER nineteen hundred and NINETY LUTHER D. THOMAS Glerk of the U.S. DISTRICT Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. By Alwae Randstide Clerk. Deputy FORM N-550-C (REV. 11-1-87)"
}
