{
  "anumber": "A43194558",
  "id": "A43194558_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0037/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/13/2023 U.S. Department of Justice Immigration and Naturalization Service 5640 OMB # 1115-0909 Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. Receipt Family Given Name Julio Middle Name Zepeda Initial C. U.S. Mailing Address - Care of Resubmitted Street Number FOIA (b)(6) Apt. and Name # City FOIA (b)(6) County FOIA (b)(6) State FOIA (b)(6) ZIP Code FOIA (b)(6) Reloc Sent Date of Birth Country (month/day/year) 6-11-15 of Birth E Salvador Social A Security # 255-81-5462 # A043194558 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. XI have been a permanent resident for at least five (5) years. b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed c. I am a permanent resident child of United States citizen parent(s). d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 11/02/91 MIA 3/6/98 Citizenship Salvadorian A UNABLE TO UNITED ENGLISH cm NOT Name on alien registration card (if different than in Part 1) Zepeda-Fuentes, Julio Cesar PLACE applicant UNDER Other names used since you became a permanent resident (including maiden name) OATA. OPFICIER DAO Sex Male Height Marital Status: Single Divorced Female 5-07 Married Widowed Can you speak, read and write English? No Yes. Action Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip 12-5-96 1-5-97 Yes No El Salvador Vacation To Be Completed by 12-23-94 1-27-95 Yes No El Salvador Emergency Attorney or Representative, if any Fill in box if G-28 is attached to represent Yes No the applicant Yes No VOLAG# Yes No ATTY State License # Yes No Form N-400 (Rev 07/17/91)N Continued on back."
}