{
	"anumber": "A43151489",
	"id": "A43151489_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43151489_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 2023, 1904]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 Elass FORM APPROVED O.M.B. No. 1405-0015 OPTIONAL FORM 230 (English) (Rev. 6-82) DEPT. OF STATE 50230-105 APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room on the form, answer on separate sheets, in dupli- cate, using the same numbers as appear on the form. Attach the sheets to the forms. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. $125.00 WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your prosecution and/or deportation. 1. Family name First name Middle name DEVI KASTURI 2. Other names used or by which known (If married woman, give maiden name) KASTURI DEVI 3. Full name in native alphabet (If Roman letters not used) at 4. Date of birth 5. Age 6. Place of birth (Day) (Month) (Year) (City or town) (Province) (Country) 04 03 1904 87 BARKALI MUZAFFARNAGARI. P INDIA 7. Nationality 8. Sex 9. Marital status INDIAN Male Female Single (never married) Married Widowed Divorced Separated Including my present marriage, I have been married times. 10. Occupation 11. Present address C/O VIRENDRA KUMAR SHARMA, NONE NATIONAL INSTITUTE OF HYDROLOGY, JAL VIGYAN BHAVAN, ROORKEE (U.P.) 247667 , INDIA 12. Name, address, date and place of birth of wife/husband (Give maiden name of wife) KANWAL SINGH (DECEASED) PLACE OF BIRTH - SONTA (MUZAFFAR NAGAR) U.P., INDIA DATE OF BIRTH 6/20/1905 Date and place of marriage BARKALI (MUZAFFAR NAGAR) U.P. ,INDIA 13. Names, addresses, dates and places of birth of all children MAHAVIR PRASAD (DECEASED) 12/29/29 v. SONTA, MUZAFFAR NAGAR, UP, INDIA ANAND PRAKASH (SONTA, U.P.) 1/15/34 604 RAINTREE RD., BUFFALO GROVE, IL 60089, USA KRISHNA DATT SHARMA (SONTA, U.P.) 10/18/37 CIVIL HOSPITAL, ROORKEE, U.P., INDIA KRISHNA SHARMA (SONTA, U.P.) 11/30/39 VIKAS ADHIKARI, GIRWA , UDAIPUR, RAJASTHAN KANTI DEVI (SONTA, U.P.) 1/25/43 c/o NIRANJAN DEVI SHARMA, CHHIPPIWARA, DEOBAND, U.P. MAYA DEVI (SONTA, U.P.) 7/1/45 MALAKPUR (MEERUT), U.P., INDIA INDIA 14. Person(s) named in 12 and 13 who will accompany or follow 15. Final address in the United States me to the United States 604 RAINTREE ROAD NONE BUFFALO GROVE ILLINOIS 60089 U.S.A. 16. Person you intend to join (Give name, address, and relationship, 17. Name and address of sponsoring person or organization (If if any) different from 16) ANAND PRAKASH , SON 604 RAINTREE ROAD NOT APPLICABLE BUFFALO GROVE, ILL 60089 18. Personal description 19. Marks of identification (a) Color of hair WHITE (c) Height 5 feet 0 NOT APPLICABLE inches (b) Color of eyes DARK (d) Complexion WHITE 20. Purpose in going to the United States JOINING SON 21. Length of intended stay (If permanently, so state) 22. Intended port of entry 23. Do you have a ticket to final destination? No - WILL BE SENT BY PERMANENT CHICAGO .PRAKASH UPON VISA ISSUANCE THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA NSN 7540-00-149-0919 Previous edition not usable"
}
