{
  "anumber": "A43185280",
  "id": "A43185280_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185280_0011/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Marriage Record, HRS. FORM 743"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1982,
        1935,
        2023,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 APPLICATION NO. 84-07488 MARRIA GE RECORD FLORIDA STATE FILE NO. i. Name of (First, (Middle) Male (Last) 2. Race MALE EMMANUEL W. BASTIEN 3. Usual B (City or Town) PERSONAL Residence (County) (State) 4A. DATE OF BIRTH 4B. AGE of Male 10815 S. W. 157 Terrace Miami, Dade, Fla. DA'A 5 NUMBER OF this April 19, 1944 40 IF PREVIACY MARRIED MARRIAGE 2 BA a ASI MARRIAGE BY (STECIFY DEATH Divorce Dadenco ANNULMENT Aug. 1, 1984 UDEL n DATE LACT MAI 7. STATE or BIRTH (IF NOT IN USA NAME COUNTR HAITI 8. Name of (First) Female (Middle) (Last) FEMALE Maiden name if different 9. Race MADELEINE P. BORNO SAME 10. Usual B (City or Town) PERSONAL Residence (County) (State) 11A. DATE OF BIRTH 11B. AGE of Female 10815 S. W. 157 Terrace Miami, Dade, Fla. 12 NUMBER OF THIS Oct. 13, 1935 49 IF PREVIOUSLY MARRIED DATA MARRIAGE 14. STATE OF BIRTH (IF NOT IN USA NAME COUNTRY 13A LAST MARRIAGE ENDED BY (SPECIFY DEATH 2 13B DATE LAST MARRIAGE INDEP Divorce Dadence cc (UNDEMENT: Dec. 21, 1982 HAITI THAT WI THE NO APPL LEGAL It ANIS NAMED IN THIS CERTIFICATE EACH FOR HIMSELF STATE THAT THE FOREGOING INFORMATION IS CORRECT TC THE BEST OF OUR BEL OBJECTION TO THE MARRIAGE NOR TO THE ISSUANCE OF A LICENSE TO AUTHORIZE THE SAME IS KNOWN TO US AND HEREBY APPLY KNOWLEUGE FOR LICENSE AND TO MAIN AFFIDAVIT 15 Male (Sign full name) 19. Female (Sign full name) OF FEMALE ENMANUEL W. BASTIEN Madeline P,Barna 16. Subscribes and sworn 17. Title to before me on: 20. Subscribed and sworn 21. Title AND MALE Dec. 4, 1984 In beloge me Deputy Clerk Dec. 4, 1984 18 Signature Deputy Clerk Maud loaidor 22 Signature Maud leaidor LICENSE TO MARRY / CERTIFICATE OF MARRIAGE AND LICENSE IS HEREBY GIVEN 23. DATE LICENSE ISSUED AUTHORIZED BY THE LAWS 27 THEREBY CEPHIE r :MAT THE ABOVE NAMED BRIDE AND GROOM WERE JOINED RIDA 10 PERFORM A MAR Dec. 4, 1984 BY ML IN MARRIAGE IN ACCORDANCE E WITH THE LAWS OF THE STATE OF FLORIDA STATE OF FLORIDA 24. EXPIRATION DATE MARRIAGE OF THE THISONS Jan. 2, 1985 ON Dec. 4, 1984 AI MIAMI, FLORIDA DAIF LIC CITYORTOWN THIS LICENSE MUST BECUSED ON OR BEFORE THE ABOVE EXPIRATION DATE VALID IN THE STATE OF FLORIDA IN ORDER TO BE RECORDED AND 28A SIGNATURE or PERSON PERFORMING CEREZONY Meand Caudor RICHARDI P. BRINKER CLERK LIQUVISM 25B. BYD.C. 28B NAME OF PERSON Pi at COMING CEREMONY (TYPE OR MARRY M.C. MAUD CAIDOR PRINT) BYD.C. Maud lavdor 28C. TITLE Dade DEPUTY CLERK, CIRCUIT COURT 26, COUNTY CODADE 28D. ADDRESS DADE COUNTY, FLORIDA 31. Date Returned 32. Recorded in 29. WITNESS TO CEREMONY Dec. 4, 1984 Book 298 RECORDED Page 33 CLERK OF COURT 30 WITNESS TO CEREMONY Guy Bostier RICHARD P. BRINKER HRS. FORM 743 (REV. DEC. 79 This license not valid unless seal of Clerk, Philme Duyany Circuit or County Court, appears thereon. AUDIT CONTRO NO. 509203"
}