{
	"anumber": "A43185280",
	"id": "A43185280_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185280_0005/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 02-28-87) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 U.S. Department of Justice (INS) etition for Alien Re DO NO. WRITE IN THIS BLOCK - FOR EX/ Case Action Stamp Fe A# APPROVED G-28 or Volag # N01090973 Section of Law: JAN 29 1991 201 (b) spouse 203 (a)(1) 203 (a)(2) CRiorl Petition was filed on March 5, 1990 (priority date) 201 (b) child Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) CON: Port au Prine SRC 3300 Field Investigations I-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolved AM REMARKS: A. Relationship 1. The alien relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) BORNO Madelaine Philomene BORNO Paul Albert 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 10815 S.W. 157th Terrace Delmas 91 Entre 4 (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Miami, Florida USA 33157 Petionville, Haiti 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Petionville Haiti Petionville, Haiti 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) X Male Married Single 10/13/35 Female Widowed Divorced 1/28/06 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Philamene, Madelaine, formerly Bastien, & Kinchen None 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) Not Applicable 5/30/33 Haiti 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) None None 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended Roy Kinchen 12/21/82 Not applicable JAN 14 1991 Emmanuel Bastien 11/20/89 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? RECEIVED My citizenship was acquired through (check one) Yes No SRC Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued No. 12490528 S.D. Florida Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued 15. Name and address of present employer (if any) Retired Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes Deportation Rescission States citizen or lawful permanent resident? No Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}
