{
  "anumber": "A43195714",
  "id": "A43195714_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43195714_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT ( (FINGERPRINTS)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        1999
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENCE OF JUSTICE IMMIGRATION AND NATURALIZATION SERVI RECORD OF SWORN STATEMENT (FINGERPRINTS) APPLICANT NAME: MANUEL ANTONIO JOVEL FILE NO 9431957141 DATE 04 999 EXECUTED AT ELMONTE CA. ALEX SALAS Before the following officer of the U.S. Immigration and Naturalization Service: ALEX SALAS DAO (NAME AND TITLE) in the SPANISH language. Interpreter ALBORIDRO BLANCO used. I, MANUEL A. JOVEL , acknowledge that the above named officer has identified himself/herself to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He/she has informed me the he/she desires to take my sworn statement regarding: N-400 NATURALIZATION APPLICATION He/she has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: Q. What is your true, full and complete name? A. MANUEL ANTONIO JOVEL A. SAN PEARs MARTIR, EL SALVADOR, BORN ON JUNE 07, 1912 Q. What is your place and date of birth? Q. Have you ever been arrested or detained by a law enforcement officer? A. NO Q. Have you had your fingerprints taken for any reason by a law enforcement officer? A. YES AIRPORT IMMIGRATION TOOK THEM FOR His GREEN CARD Q. Have you ever been issued a ticket or been taken into custody by a law enforcement officer? A. No Q. Have you ever been ordered by a court to: pay a fine; go to jail; serve a probationary sentence; perform community service; make restitution; or have your wages garnished (e.g., for failure to make child support payments)? A. NO Q. Have you ever received an expungement, parole, pardon, or successfully completed a diversion or rehabilitation program? A. NO Q. If you have answered \"yes\" to any of the above questions, please explain below: A. FINGERPRINTS FOR ISSUANCE OF HIS ALIEN REGISTRATION CARD I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking Signature of Applicant 4th day of OCTOBER . 1999 . Sworn and subscribed before me: Glyr Valn ICACAM IC ACANCE Signature INS Officer Signature of Witness ALEX SALAS (Rev 11/1/98)"
}