{
  "anumber": "A43194558",
  "id": "A43194558_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OATH CEREMONY Information Sheet"
    },
    "years": {
      "ms_years_nlp_v1": [
        2005,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OATHneEREMONY 6/13/2023 Information She General Information Applicants and guest are separated during processing. It is a good idea to have the applicant and guest designate a specific location to meet after the ceremony. Courtroom Military Etiquette Personnel This is a U.S. District Court proceeding and business attire is If you are still in active, reserve or National Guard status, strongly suggested. Please do not wear tank tops, shorts, please be in proper uniform prescribed by your branch of jeans, or hats. Men must wear shirts with a collar. Ties are service, in order to be recognized as a member of the armed not required. forces. Cellular phones or pagers must be turned off during the ceremony. It is suggested that comfortable shoes be worn. & Handicap Information Bring With For your convenience, it is recommended that you bring a You wheel chair if you cannot stand for long periods of time or walk long distances. Form N-652 Naturalization Interview Results, for those Alien Registration Card or temporary evidence of lawful people with approved disability waivers. permanent residence, such as an I-94. Reentry Permit or Refugee Travel Document. You may bring a translator if you are: hearing impaired, or exempt the English requirements. Missing Alien Registration Card sworn statement issued to you at the time of your naturalization interview. Only one additional person may sit with you during the oath ceremony to assist you. N-445 oath ceremony appointment notice, and this letter. A writing pen. Site Information You will be scheduled for an Oath Ceremony at one of the following sites: Los Angeles County Fairgrounds * Los Angeles Convention Center * 1101 W. Mckinley Ave., Building 4 1201 South Figueroa Street Pomona, CA 91768 Los Angeles, CA 90015 Approaching Fairplex on I-10 FWY Westbound Approaching the LA Convention Center on I-110 Southbound 1. Take the Garey Avenue exit. 1. Take 6th street exit/Turn right onto South Flower Street. 2. Make quick left on Mckinley Avenue. 2. Turn right onto West Olympic Boulevard. 3. Follow signs to Fairplex. 3. Turn left onto South Figueroa Street. 4. Parking is at gate 14. Approaching the LA Convention Center on I-110 Northbound Approaching Fairplex on I-10 FWY Eastbound 1. Take the I-10/Santa Monica Freeway. 1. Take the Fairplex Drive exit. 2. Take the Pico Blvd exit/stay straight onto Cherry Street. 2. Make left turn on Fairplex Drive. 3. Turn right onto West Pico Boulevard. 3. Follow signs to Fairplex. 4. Turn left onto South Figueroa Street. 4. Parking is at gate 14. i Information: Montebello Quiet Cannon * * Large bags and backpacks are NOT PERMITTED 901 North Via San Clemente Montebello, CA 90640 at the Oath Ceremony sites. Approaching Quiet Cannon on I-60 FWY Westbound Internet Website Address: 1. Take the Garfield/Wilcox Avenue exit. L.A. County Fairgrounds: www.fairplex.com 2. Left on Garfield Avenue. L.A. Convention Center: www.lacclink.com 3. Right on Via San Clemente. National Passport Center: www.travel.state.gov Approaching Quiet Cannon on I-60 FWY Eastbound U.S. Department of Homeland Security: www.dhs.gov 1. Take the Garfield/Wilcox Avenue exit. U.S. District Court-Central District: www.cacd.uscourts.gov 2. Right on Garfield Avenue. 3. Right on Via San Clemente. Check the Status of Your Case: Case Status online: www.uscis.gov W(Congratulations Letter) 02/10/2005 TP/MSN"
}