{
  "anumber": "A43194558",
  "id": "A43194558_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 3. Information About You., Form N-4 (00 ( (Rev. 10/26/05) Y Page 2"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/13/2023 Part 3. Information About You. Write your USCIS \"A\"- number here: A 043-194-558 A. U.S. Social Security Number B. Date of Birth (mm/dd/yyyy) C. Date You Became a Permanent Resident (mm/dd/yyyy) 255-81-5462 06/11/1915/ 11/02/1991 D. Country of Birth E. Country of Nationality ELSALVADOR EL Yes SALVAORR F. Are either of your parents U.S. citizens? (if yes, see Instructions) No G. What is your current marital status? Single, Never Married Married Divorced Widowed Marriage Annulled or Other (Explain) H. Are you requesting a waiver of the English and/or U.S. History and Government requirements based on a disability or impairment and attaching a Form N-648 with Yes No your application? 1. Are you requesting an accommodation to the naturalization process because of a disability or impairment? (See Instructions for some examples of accommodations.) Yes No If you answered \"Yes,\" check the box below that applies: I am deaf or hearing impaired and need a sign language interpreter who uses the following language: I use a wheelchair. I am blind or sight impaired. I will need another type of accommodation Please explain: Part 4. Addresses and Telephone Numbers. A. Home Address - Street Number and Name (Do not write a P.O. Box in this space) Apartment Number FOIA (b)(6) City County State ZIP Code Country FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) U.S.A. B. Care of Mailing Address - Street Number and Name (If different from home address) Apartment Number N/A City State ZIP Code Country C. Daytime Phone Number (If any) Evening Phone Number (If any) E-mail Address (If any) FOIA (b)(6) FOIA (b)(6) Form N-400 (Rev. 10/26/05)Y Page 2"
}