{
	"anumber": "A43194558",
	"id": "A43194558_0036",
	"page_index": 36,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0036/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization Services Decision Notice"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1898, 2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 UNITED STATES DEPARTMENT OF JUSTICE DEPARTMENT @ Immigration and Naturalization Service 300 N. Los Angeles Street Los Angeles, CA 90012 Refer to this File No. : A 43 194 558 JUI IO C ZEPEDA FUENTES FOIA (b)(6) Prepared Byt Aurend Date : 11-12-98 DECISION On March 06.1998 you appeared for an examination on your application for naturalization, and on Oct. 20,1898 you failed to appear for reexamination. Pursuant to the investigation and examination on your application, it is determined that you are ineligible for naturalization. Section 312 of the Immigration and Naturalization Act, 8 USC 1423, provides in pertinent pari [no] person except as otherwise provided shall hereafter be naturalized who canno that demonstrate an understanding of the English language, including an ability to read, write and speak words is ordinary usage in the English language [and] a knowledge and understanding of the fundamentals of the history, and of the principles and form of government, of the United States.\" You have failed to meet the requirements of Section 312 in that : X You have failed to demonstrate ability to speak and understand the English language sufficiently to answer the questions in your interview and in your application, and are not exempt from the requirement. You have failed to demonstrate ability to write words in ordinary usage in the English language which were presented to you to write, and are not exempt from the requirement. [ ] You have failed to demonstrate knowledge of the history, and of the principles and form of government, of the United States. This decision is made without prejudice toward the filling of a new application in the future. If you decide to request a review hearing on this decision pursuant to Section 336(a) of the Act, you must file request for a hearing within 33 days of the date of this notice. If no request for hearing is filed within the tim allowed, this is final. A request for hearing may be made to the District Director of the Immigration an i Naturalization Services at the above address on Form N-336 (Enclosed), request for Hearing on a Decision Naturalization Proceedings under Section 336 of the Act, together with a Fee of $110.00 A brief or othe written statement in support of your request may be submitted with the Request for Hearing. Sincerely yours, Rosemay Mewille Rocempymelville chard K. Rogers by ActiNG District Director HermanD Enclosure N 335 (2)"
}
