{
	"anumber": "A43194558",
	"id": "A43194558_0064",
	"page_index": 64,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0064/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, Optional Form 230 B"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Georgia", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1955, 2023, 1915, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 Optional Form 230 B APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION (Rev. 6/82) Formulario Opcional 230 B (Rev. 6/82) SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO INSTRUCTIONS: T must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. All questions must be answered, if applicable. Questions which are not applicable should marked re is insufficient room on the form, answer on separate sheets, in duplicate, using the same numbers as appear on the form. Attach the sheets to the forms. 00 NOT SIGN this form tructed to do so by the consular officer. The fee for filing this application for an immigrant visa is $25.00. The fee should be paid in United States dollars or local currency equivalent or by bank a nen you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States Even though you should be admitted to the United States a fraudulein entry could be grounds for your prosecution and/or deportation. INSTRUCCIONES: Este formulario debe ser completado por duplicado a máquina 0 de hacerlo a mano, en letras de imprenta legibles. Deben contestarse todas las preguntas si corresponden. Cuando una pregunta no es pertinente debe indicarse. Si no hay suficiente espacio en el formulario, conteste en hojas separadas, por duplicado, utilizando los mismos números tal como figuran en el formulario. Adjunte esas hojas a los formularios. No firme este formulario hasta que se lo indique el funcionario consular. La tarifa para presentar esta solicitud de visa de inmigrante es de USS 25,00. La tarifa debe abonarse en dólares de los Estados Unidos 0 en su equivalente en moneda local, 0 por transferencia bancaria, cuando se presente al funcionario consular. ADVERTENCIA: TODA DECLARACION FALSA 0 ENCUBRIMIENTO DE UN HECHO MATERIAL PUEDE RESULTAR EN SU EXCLUSION PERMANENTE DE LOS ESTADOS UNIDOS. AUN CUANDO USTED HAYA SIDO ADMITIDO A LOS ESTADOS UNIDOS, UNA DECLARACION FRAUDULENTA PUEDE SER CAUSA DE SU PROCESAMIENTO Y/O DEPORTACION. 1. Apellido(s) (Family name) Nombre (First Name) Segundo Nombre (Middle Name) Zepeda Fuentes Julio César 2. Otros nombres por los cuales se le conozca (si es mujer casada, indique el apellido de soltera): (Other names used or by which known. If married woman. give maiden name) Julio Cesar Zepeda 3. Nombre completo en alfabeto nativo (si no se utilizan caracteres romanos) (Full name in native alphabet. 11 Roman letters not used). Julio César Zepeda Fuentes 4. Fecha de Nacimiento (Date of birth) 5. Edad (Age) 6. Lugar de Nacimiento (Place of birth) (if (Day) Mes(Month) Year) Ciudad o puehlo (City or town) Provincia/Departamento/Estado (Province/State) Pais (Country) 11-Junio-1915 76 años Quezaltepeque, La Libertad, El Salvador 7. Nacionalidad (Nationality) 8. Sexo (Sex) 9. Estado Civil (Marital Status) Masculino Femenino Soltero (Que nuncase ha casado) Casado Viudo Divorciado Separado (Male) (Female) (Single) (Never married) (Married) (Widowed) (Divorced) (Separated) Salvadoreño Incluvendo mimatrimonio actual, me he casado dos veces 10. Ocupación (Occupation) (Including my present marriage, have been married times.) Pensionado RETIRED 11. Domicilio actual (en El Salvador) Present Address (in E1 Salvador) Mejicanos, San Salvador, El Salvador: Colonia Universitaria Norte: Calle Julio E. Mejia #40-B 12. Nombre, domicilio, fecha y lugar de nacimiento del/de la esposo/a (Name, address, date and place of birth of wife/husband.) Maria Teresa Menjivar Vasquez: (Dar apellido de solterate la esposa) (Give maiden name of wife) ejicanos, San Salvador. El Salvador: 25-Sept-1932: Chalate- Fecha y lugar de matrimonio. (Date and place of marriage) Matrimonio: 16-Diciembre San Salvador.- nango, El Salvador. 1955 13 Nombres, domicilios, fechas y lugares de nacimiento de todos los hijos (Names, addresses, dates and places of birth of all children.) CEBAL OUADO 3 NO PERTINENTE JULIO EDUARDO DANILO vincio 14. La/s persona/s nombrada/s en 12 Y 13 que me acompañará/n o se reunirá/n conmigo en los Estados Unidos. 15. Domicilio definitivo que tendrá en los Estados Unidos. (Person/s named in 12 and 13 who will accompany or follow me to the United States.) 103adiess if LANE María Teresa Menjivar de Zepeda ATLANTA, GEORGIA.- 30021 16. Persona con quien tiene intención de reunirse. Indique nombre, dirección_ parentesco, si algung 17. Nombrey domicilio de la persona u organización que es su fiador (garante). Sidifiere del punto in (Person you intend to join. Give name address and relationship if any Cesar Zepeda (Name and address of sponsoring person or organization 11 different from 16). HIJO: 1033 TEXEL LANE, CLARKSTONE, GEORGIA NO PERTINENTE 30621: P.O. .BOX 7312, Atlanta, Georgia 30357- 18. Descripción personal (Personal description) Señas particulares (Marks of identification) 20. Propósito del viaje los Estados Unidos. a) Color de cabello (Color of hair) Negro Jas (Purpose in going to the United States) b) Color de ojos (Color of eyes) Cafes Reunirnos con nues- c) Altura (Height): Pies (Feet) 5 Pulgadas (Inches) 6 Ninguna tro hijo Cesar Zepeda d) Tez (Complexion) Moreno (Regular)- 21. Durarian FOIA (b)(6) de en estadía oronuesta Si permanentemente FOIA (b)(6) indiquelo 22, Puerto de entrada propuesto 23. Tiene lld nasaia nara su destino final? FOIA(b)(6) (FOIA (b)(6) (Length of intended stay If permanently so state) (Intended port of entry) FOIA (b) (6) Do you have a ticket to final destination! FOIA (b)(6) Permenentemente- MIAMI NO.- 24. Recursos financieros personales. ASTIGOTO (Personal financial resources) c) Bienes Raices Valor Resi dencia ;valor: $250,000.00 a) Efectivo (Cash) (Real estate Value) Cuentas de Ahorro- b) Depósitos bancarios Otros Describa Valor pensión mensual: $1,170.00 (Bank deposits) (Others Describe) ESTE FORMULARIO PUEDE OBTENERSE GRATIS EN LAS OFICINAS CONSULARES DE LOS ESTADOSUNIDOS DE AMERICA No se puede utilizar la versión anterior. SNS: 9/83 THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA Previous edition not usable."
}
