{
  "anumber": "A43195714",
  "id": "A43195714_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43195714_0048/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1912,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/13/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS E1 Salvador FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) September 16, de 1991 CITY COUNTRY At the request of the American Consul at San Salvador E1 Salvador NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F I certify that on the above date I examined M Jovel Manuel Antonio 6/7/1912 WHO BEARS PASSPORT NO. ISSUED BY ON 0573267 D. General de M. San Salvador GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Gonorrhea Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphilis, infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Insanity Mental Defect Arthritis. Reduction More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism of visual acuity. EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ Victor M. Esquivel 9/16/91 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: V.D.R.L. TEST TYPE: ELISA, DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Lab.Alvarez Aleman 9/16/91 Lab.Alvarez Aleman OTHER SPECIAL REPORT(S) (When needed) 9/16/91 DOCTOR'S NAME (Please print) REMARKS Moderate degree of arthritis since 12 years ago. The examination revealed: reduction of visual acuity as a result of myopia, presbyopia and senile cataracts. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. Antoine Signature Love 9/16/91 Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE Dr. RENE MOLINA URRUT DATE C O Rene Molina Urrutia. San Salvador Fl Salvador C 9/16/1991 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 *U.S. Government Printing Office: 1989-250-926/00306 REVISED 2-88 DEPT. OF STATE"
}