{
  "anumber": "A43136069",
  "id": "A43136069_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43136069_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice immigration and Naturalization Service, NARA, 7/25/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1993,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 U.S. Department of Justice CBO.CC001 120 OMB No. 1115-0145 immigration and Naturalization Service Application for Naturalization M START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. Returned Receipt $22.00 Family Given Middle Name ALVAREZ-GONZALEZ Name GREGORIANA Initial U.S. Mailing Address - Care of: Resubmitted Street Number Apt. and Name 1645 SO. CATALINA ST. # 202 City County LOS ANGELES LA State Zip Reloc Sent CA Code 90006 Date of Birth Country (month/day/year) 05/14/1914 of Birth NICARAGUA Social 612-50-6046 A Security # # 043 136 069 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years. b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s). Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed forms N-426 and G-325B e. Other. (Please specify section of law) At Interview request naturalization ceremony at court Part 3. Additional Information about you. UNITED STATES POSTAL MONEY ORDER 15-800 harks 000 OSTAL SERVICE® 12 * 0 A 43136 069 SERIAL NUMBER YEAR, MONTH. DAY POST OFFICE 201. POLLARS AND CENTS CHECKWRITER PAY TO US Immigration & IMPRINT AREA Gre Boriana Alvarez G. ADDRESS FROM Naturalization Service Gre goriana Alvarez E. ADDRESS Los Angeles, California 1645 So Catalina St, Apt 202 O.D. NO. OR USED FOR N 400 Los Angeles, CA.90606 on NEGOTIABLE ONLY IN THE U.S. AND ⑆000008002⑆ 69796769578⑈ need more room to explain the reason for an absence or to list more trips, continue on separate POSSESSIONS REFUND ONIVO. NO. 1550-2 1993 paper. FEE DEC Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for DATE BSI 08-13-98 08-26-98 Yes No NIC VISIT 03-96 04-96 Yes No NIC VISIT To be completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}