{
  "anumber": "A43136069",
  "id": "A43136069_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43136069_0025/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF DEATH, 0615"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        1999,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "STATE OF CALIFORNIA CERTIFICATION OF VITAL RECORD COUNTY OF LOS ANGELES DEPARTMENT OF HEALTH SERVICES CERTIFICATE OF DEATH STATE OF CALIFORNIA USE BLACK INK ONLY/NO ERASURES, WHITEOUTS OR ALTERATIONS STATE FILE NUMBER LOCAL REGISTRATION NUMBER (REV. 7/97) 1. NAME OF DECEDENT-FIRST (GIVEN) 2. MIDDLE 3. LAST (FAMILY) GREGORIANA ALVAREZ 4. DATE OF BIRTH MM/DDICCYY 5. AGE YRS. IF UNDER YEAR IF UNDER 24 HOURS 6. SEX 7. DATE OF DEATH MM/DDICCYY 8. HOUR MONTHS DAYS HOURS MINUTES 05/14/1914 85 F 08/15/1999 0615 DECEDENT 9. STATE OF BIRTH 10. SOCIAL SECURITY NO. 11. MILITARY SERVICE 12. MARITAL STATUS 13. EDUCATION-YE COMPLETED PERSONAL DATA NICARAGUA 612-50-6046 YES NO UNK WIDOWED 6 14. RACE 15. HISPANIC-SPECIFY 16. USUAL EMPLOYER WHITE YES NICARAGUAN NO SELF EMPLOYED 17. OCCUPATION 18. KIND OF BUSINESS 19. YEARS IN OCCUPATION HOME MAKER OWN HOME 66 20. RESIDENCE- AND NUMBER OR LOCATION) 1645 S. CATALINA ST #202 USUAL RESIDENCE 21. CITY 22. COUNTY 23. ZIP CODE 24. YRS IN COUNTY 25. STATE OR FOREIGN COUNTRY LOS ANGELES LOS ANGELES 90006 10 CALIFORNIA 26. NAME, RELATIONSHIP 27. MAILING ADDRESS (STREET AND NUMBER OR RURAL ROUTE NUMBER, CITY OR TOWN, STATE. ZIP INFORMANT MARLENE MEJIA DAUGHTER 1645 S. CATALINA ST. #202 LOS ANGELES, CA. 90006 28. NAME OF SURVIVING SPOUSE-FIRST 29. MIDDLE 30. LAST (MAIDEN NAME) - - SPOUSE 31. NAME OF FATHER-FIRST 32. MIDDLE 33. LAST 34. BIRTH STATE AND PARENT ESTANISLAO - CRUZ NIC INFORMATION 35. NAME OF MOTHER-FIRST 36. MIDDLE 37. LAST (MAIDEN) 38. BIRTH STATE MARIA - ALVAREZ NIC 39. DATE MM/DDICCYY 40. PLACE OF FINAL DISPOSITION DISPOSITION(S) 08/19/1999 CEMENTERIO GENERAL DE JUIGALPA, JUIGALPA, NICARAGUA 41. TYPE OF DISPOSITION(S) 42. SIGNATURE OF EMBALMER 43. LICENSE NO. FUNERAL DIRECTOR CR/TR/BU luan L. Werner 6449 AND 44. NAME OF FUNERAL DIRECTOR 45. LICENSE NO 46. OF LOCA REGISTRAR much SIGNATURE - 47. DATE MM/DD/CCYY LOCAL REGISTRAR ARMSTRONG FAMILY MALLOY-MITTE FD-380 08/18/1999 101. PLACE OF DEATH 102. IF HOSPITAL. SPECIFY ONE: 103. FACILITY OTHER THAN HOSPITAL 104. COUNTY Q of A/Hollywood Presbyterian Hosp CONV RES. PLACE IP ER/OP DOA HOSP. CARE OTHER Los Angeles OF 105. STREET ADDRESS AND NUMBER OR LOCATION) 106. CITY DEATH 1300 N. Vermont Ave. Los Angeles 107. DEATH WAS CAUSED BY: (ENTER ONLY ONE CAUSE PER LINE FOR A. B. c. AND D) TIME INTERVAL 108. DEATH REPORTED TO CORONER BETWEEN ONSET AND DEATH YES NO IMMEDIATE REFERRAL NUMBER CAUSE (A) Cardio respiratory Arrest Mins. 109. BIOPSY PERFORMED DUE TO (B) Myelodysplastic Syndrome 3 Years YES No 110. AUTOPSY PERFORMED CAUSE OF DUE TO (C) Arteriosclerotic Heart Disease 4 Years YES NO DEATH 111. USED IN DETERMINING CAUSE DUE TO (D) YES No 112. OTHER SIGNIFICANT CONDITIONS CONTRIBUTING TO DEATH BUT NOT RELATED TO CAUSE GIVEN IN 107 None 113. WAS OPERATION PERFORMED FOR ANY CONDITION IN ITEM 107 OR 1121 IF YES. LIST TYPE OF OPERATION AND DATE. No 114. CERTIFY THAT TO THE BE OF MY KNOWL 115 AND TITLE OF CERTIFIER 116. LICENSE NO. 117. DATE MM/DDICCYY EDGE DEATH OCCURRED AT HOUR, DATE PHYSI- AND PLACE STATED FROM THE USES STATED. H. the Leven my A32885 08/18/1999 CIAN'S DECEDENT ATTENDED SINCE DECEDENT LAST SEEN ALIVE CERTIFICA- /DD/CCYY M 118. TYPE ATTENDING PHYSICIAN'S NAME. MAILING ADDRESS, ZIP TION 06/12/1997 08/14/1999 Vasanth K.Kumar M.D.2105 Beverly Blvd.Los Angeles, Ca. 90057 1 CERTIFY THAT IN MY OPINION DEATH 120. INJURY AT WORK 121. INJURY DATE MM/DD CCYY 122. HOUR 123. PLACE OF INJURY OCCURRED AT THE HOUR. DATE AND PLACE STATED FROM THE CAUSES STATED. YES NO 119. MANNER OF DEATH 124. DESCRIBE HOW INJURY OCCURRED (EVENTS WHICH RESULTED IN INJURY NATURAL SUICIDE HOMICIDE CORONER'S PENDING COULD NOT BE USE ACCIDENT INVESTIGATION DETERMINED ONLY 125. LOCATION (STREET AND NUMBER OR LOCATION AND CITY, ZIP) 126. SIGNATURE OF CORONER OR DEPUTY CORONER 127. DATE MM/DD/CCYY 128. TYPED NAME. TITLE OF CORONER OR DEPUTY CORONER A B C D E F G H FAX AUTH. # CENSUS STATE 090247894 REGISTRAR This is a true certified copy of the record filed in the County of Los Angeles Department of Health Services if it bears the Registrar's signature in purple ink. much Francis DATE 276 ISSUED AUG 18 1999 Director of Health Service and Registrar This copy not valid unless prepared on engraved border displaying seal and signature of Registrar. ANY ALTERATION OR ERASURE VOIDS THIS CERTIFICATE"
}