{
	"anumber": "A43195714",
	"id": "A43195714_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43195714_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (001"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023, 1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 U.S. Department oi Justice OMB 15-0009 hamigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. Receipt Family Given Middle D Name JOVEL Name MANUEL Initial ANTOW 10 U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 7416 KIRKWOOD AVE City County RANCHO CUCAMONGA LOS ANGELES State ZIP Reloc Sent CA. Code 91730 Date of Birth Country (month/day/year) 6/7/12 of Birth EL SALVADOR Social A Security # 614-50-9893 # A43 195 714 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. 10/4/94 and have attached completed Forms N-426 and G-325B At interview c. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office ARC CDL s/r. resident (month/day/year) where granted adjustment of status. 10/18/91 LOS IR5 2 CONTINUE than 10/4/201 Citizenship $316.00 CONTINUESON POL SALVADORIAN Name on alien registration card (if different than in Part 1) CLEARANIZED 10/4/99 MANUEL ANTONIO JOVEL Other names used since you became a permanent resident (including maiden name) NONE Sex Male Height Marital Status: Single Divorced Female 5' 4\" Married Widowed Can you speak, read and write English ? No Yes. Action ROVED Absences from the U.S.: STRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? Novayes If you answered \"Yes\" , complete the following Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate OCT 04 1999 paper. by: Did absence last about ho Date left U.S. Date returned 6 months or more? Destination Reason for trip LOS general 8429 ONCE A YEAR 1994 Yes No EL SALVADOR VACATION 2/15/97 No To Be Completed by 5/30/97 Yes uneprow Attorney or Representative, if any 7/20/97. 61 198 Yes No Fill in box if G-28 is attached to represent 12/23/94. Yes No MEDICAL/ varrica the applicant 3/1/95 VOLAG# Yes No MOOTHER Yes No 4 @ ATTY State License # Form N-400 (Rev 07/17/91)N Continued on back."
}
