{
  "anumber": "A43185171",
  "id": "A43185171_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43185171_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPTIONAL FORM 2230 ( (French) (Rev. G-82)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/14/2023 OPTIONAL FORM 230 (French) (Rev. 6-82) page 4 42. Les documents suivants sont joints à l'appui de cette demande Passeport Jugement de divorce Offre d'emploi Acte de Naissance Etat de service militaire Dossier médical Extrait(s) du casier judiciaire Preuve établissant l'existence de vos Photographies Acte de Mariage ressources personnelles Autres pièces (en donner la description) Acte de Décès Garantie de soutien Acte de naissance du conjoint N'ECRIVEZ RIEN AU-DESSOUS DE LA LIGNE DOUBLE Le fonctionnaire du consulat vous aidera à répondre aux rubriques 43 et 44 43. J'estime ne pas être frappé d'inadmissibilité à recevoir un visa ni frappé d'exclusion selon l'alinéa de la rubrique 40, pour les raisons suivantes 212 (a) (14) bénéficiaire d'exemption au titre de Non applicable 212 (a) (28) (1) (i) 212 (e) Ci-joint 212 (a) (28) (1) (ii) 212 (g) 212 (b) (1) 212 (h) 212 (b) (2) 212 (i) 44. J'estime être un immigrant appartenant à la priorité soumis à la limitation numérique établie pour (indiquer le pays étranger ou le territoire qui en dépend) un immigrant spécial non soumis à la limitation numérique proche parent d'un citoyen des Etats-Unis Ma demande est fondée sur les faits suivants: je suis (ma/mon est) bénéficiaire d'une requête je rentre aux Etats-Unis en tant qu'étranger résident ma demande est à imputer à un Etat étranger en vertu de la Section 202 (b) par ma/mon autres faits (préciser) Jen'ignore pas que je dois remettre mon visa à un Agent du Service de l'Immigration des Etats-Unis lors de mon arrivée au lieu où j'ai demandé à entrer aux Etats-Unis et que la possession d'un visa ne me confère pas le droit d'entrée aux Etats-Unis s'il est constate, à ce moment-là que je ne remplis pas les conditions requises par les lois d'immigration. Je n'ignore pas que toute déclaration fausse ou de nature à induire en erreur, ou que toute dissimulation d'un fait essentiel faite intentionellement par moi dans la présente demande peut entraîner mon exclusion permanente des Etats-Unis et, au cas où j'y aurais été admis, peut donner lieu à des poursuites judiciaires et/ou à mon expulsion. Je, soussigné, sollicitant un visa d'immigration aux Etats-Unis, déclare sous la foi du serment (ou affirme solennellement) que toutes les déclarations figurant dans la présente demande, y compris les réponses se référant aux rubriques 32 à 41 inclusivement, ont été faites par moi et sont, autant que je sache, exactes et complètes. Je déclare en outre, sous la foi du serment (ou affirme solennellement) que, si je suis admis aux Etats-Unis, je ne m'y livrerai pas à des activités qui pourraient porter préjudice à l'intérêt public, ou compromettre le bien-être public, la sûreté ou la sécurité des Etats-Unis; à des activités interdites par la loi des Etats-Unis concernant l'espionnage, le sabotage, les troubles publics, ou à d'autres activités subversives qui pourraient compromettre la sécurité nationale; à n'importe quelle autre activité dont le but consisterait à s'opposer au Gouvernement des Etats-Unis, à le contrôler ou à le renverser par la force, la violence ou tout autre moyen inconstitutionnel. Je comprends toutes les déclarations ci-dessus, ayant sollicité et obtenu une explication sur chaque point qui ne me paraissait pas clair. x (Signature du demandeur) Les liens de parenté mentionnés aux rubriques 12 et 13 ont été vérifiés à l'aide des documents soumis au fonctionnaire du consulat, sauf comme suit: Signé et attesté sous la foi du serment, par devant moi, le AUG 26 1991 19 à Maria Rudensky Vice Consul of (Fonctionnaire du Consulat des Etats-Unis d'Amérique) United States of America OFF ITEM No. 20"
}