{
  "anumber": "A43274002",
  "id": "A43274002_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0049/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Returning Resident Visa in favour of NARAIN DAS SIKRI, Form I-901"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2991,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 DECEMBER 7, 1994 Fro NARAI DASS SIKRi 157 LATOR 14 FARIDABAD, Hot RYANA 12100> TO : The Counsellor Amercian Embany, New Delhi- - Subject: Application for Returning Resident Visa in favour of NARAIN DAS Siuri Enclosed please find application for Returning Resident visa in my farour. (Dec 2991) I was given Immigrant Visa in Third week of December 91 (case No 85128498) I entered USA on March 20, 92. I travelled back from USA on June 25,93 to meet my friends a relative in India I had intention G return t USR in february 1994 but I lost my passport visa on Dec. 28.93 for which report was mach & you on Jan. 14,99 as per copy enclosed. I obtained new pasport on 5 May 24,94 approached your office on June 6,94 for new of duplical green card (Alien Registration Card) ( Form I-90J. I was informed on telephone that my date has been verified I could with return to USA immediately as my wife has been serious Sick Since April 11,944 was not in a position t traval. My wife has expired on 11/29/94 as per death certificate enclosed. I wash t travel to USA on 12/28/94 a I have company available on That data I have alread made reservation on flight #761 Lufthansa on Dec. 29,94 as per documentation enloss. Please issue me Returning Resident visa as Kant I can enter USA. Things you. YOUNS faithfulls, N.D. sites. (NARAIN DAS SIKRi)"
}