{
	"anumber": "A43274002",
	"id": "A43274002_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Reentry Permit or Return to the United States, Form 1-313"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 4. X Are you presently the United States? Yes No : not presently in the United States, on what date did you depart? Actual date of deparsure AUG 10, 1997 BY AIR FRANCE FROM WASHINGT Have you departed the United States, and returned since application? filing of Yes No you are DOE presently in the United States submit evidence : establish the date you departed the United States such as a ticket. flight itinerary etc ATTACHED MEDICAL REPORTS NEWDELHI IMMIGRATION OFFICER ARRIVAL STAHP DATE IN PASSPORT You must establish cha: the United States on the date you filed this application. As PER ABOVE ATTACMMENTS, applied for REENTRY PERMIT JULY WHERERS I DEPARTED is on AUG 10.97 : you have moe departed the United States yes, on what date do you intend to depart? Date of intended departure NOT APPLICABLE. Submit a copy of your travel arrangements or other evidence, verifying your proposed date of departure (transportacion ticket etc.) (131Q3A) not APPLICABLE As 1 HAVE DEPARTED FROM USR SINCE AVG 10, 9> 5. Submit a copy of a photo identity document showing your picture name, and date of birth such a document can be a copy of the identity page from your passport a driver's License, or another type of phose = with the same information The i dentisy document copy must clearly show the photograph and identity information (1310.1) 5. Form :-131 must be accompanied by two photos therefore please submit two color photos of yourself, taken within the Last 30 days, and not previously used These photos TUST have a white background Photos be glossy unrespuched, and not mounted Dimension of the facia: :-age should be about inch from chin to top of shown frontal of right side of face right ear visible using soft pencil or felt pen print name receipt number on the back of each photograph You instructions photographer who takes the pictures, 13131 Your response must be received in this office by 11 18 FE MONTH DAY YEAR case is being held in this office pending your response this period you -ay Submit the evidence requested: = Submit or none of the evidence requested and ask for a decision based -gon the record: or 3 the application or petition must submit all evidence a: ona time of only part of the evidence be considered a request for a decision the record No extension period allowed = evidence **** granted Submitted does not establish that your case was approvable at the it was be denied. If you do not respond to this request within the time allowed your case will be considered abandoned and denied Evidence received in this office after the due date will no: be considered. PLACE THIS LETTER ON TOP OF YOUR RESPONSE. SUBMISSION OF EVIDENCE WITHOUT THIS LETTER WILL DELAY PROCESSING OF YOUR CASE AND MAY RESULT IN A DENIAL. PLEASE USE THE ATTACHED LABEL FOR MAILING THIS EVIDENCE BACK TO THIS OFFICE. Sincerely, Natalie **edder NSC Director NSC/3SL EX15:"
}
