{
	"anumber": "A43274002",
	"id": "A43274002_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR EVIDENCE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1833]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 DUPLICATE B2204 ORIGINAL MAILED THED UGAN REGISTERED POST on SEPT 298 UNITED STATES DEPARTMENT OF JUSTICE DOCURATION AND NATURALIZATION SERVICE P.O. Box 82521 Lincoln Nebraska 53501-2521 Date. 826.88 Refer to File No. NERRIN 0 SIKRI SIKRI CT SILVER SPRING MO 20925- 27.08/98 IN-98-180-52148 LINBM001 RS: REQUEST FOR EVIDENCE THE INITIAL DOCUMENTATION SUBMITTED WITH YOUR FORM I-131, (Application for Travel Document), IS NOT SUFFICIENT TO WARRANT FAVORABLE CONSIDERATION OF YOUR APPLICATION. Submittal of the following items and/or additional information will assist in the processing of your application. Please submit OF comply with the items checked below: you are 3 :aw: permanent resident OF conditional resident you must submit verifying your status To be accepted as evidence the documentation show your status, provide your biographic information and must include phoso the following may be accepted as evidence of your lawful cermanent or conditional resident status: photocopy of your :-551, Alien Registration Card (ARC). showing both the and front sides, as proof of your status as a Lawful permanent or resident of the United States. The copies must clearly show your photograph and card information not received your Alien Registration Card, submit a copy of the page and the page of your passport indicating initial admission as a conditional resident, or other evidence that you are a per-arent resident. Or, copy of the approval notice of a segarate application for replacement of your card or temporary evidence of permanent or conditional resident status (131E. A) 2. Submit evidence that you qualify as a refugee for the purpose of issuance of a refugee travel document To qualify you must have been admitted paroled or granted in the :**ised States as a refugee or am asylee. or you must have been admissed tasted to Lawfil permanent resident status based on a refugee or asylee claim submit * chosocopy of your :-94 card, your :-55- or card (both from and back clearLY shows the photo and identity information) appropriate employment authorization card both front and back alsol or other documentation to show that you have been granted a status taking you eligible for a refugee trave: document. : you do no: have an allen registration card you must submit a copy of your Form I-9 along with a copy of a photo identity document such as a passport, a driver's license OF another document showing your photo, your name and date of birth. The identity document copy - clearly show the photograph and identity information. (1313) 3. Since becoming a Per-ament Resident (or during the past five years, whichever is Less how much total time have you spent outside the United states? Have not been outside the U.S. = to 2 years during the mentioned time period 2 : 3 years 1833 shan 5 months 4 years 5 months to : year more than 4 years (CONTINUED ON REVERSE SIDE"
}
