{
	"anumber": "A43273551",
	"id": "A43273551_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43273551_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-43, 273551"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya", "United States", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 OPTIONAL FORM 155A, (Rev. 6-85) DEPT. OF STATE NSN 7540-01-126-7761 50155-203 IV-43, 273,551 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN WARSAME Ali Godane ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U. 6. IMMIGRATION 250 WAS 312 BA217 212(e) 212(h) 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH JUN 04 1993 Galkio, Somalia 06-04-06 #R5 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED Nairobi, Kenya Somali (CLASS) UNTIL MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME X S Dahabo M W D SEP Ali FINAL ADDRESS STREET, ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED c/o Hassan Ali Warsame STATES 4466 Elan Court WAS Annandale, Virginia 22003 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE X NOT REQUIRED ATTACHED None F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL IR5 AMERICAN EMBASSY FOREIGN STATE/OTHER AREA LIMITATION AT NAIROBI, KENYA IMMIGRANT VISA NO. - Marsha von Duerekne ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 13 May 1993 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 12 September 1993 PASSPORT NO. A 0468256 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO - BY - FOREIGN SERVICE Tariff No. 21 ON - Fee Paid $25.30 NIZEOSSIATES OF AMERICA EXPIRES river Local Cy, Equilid - 5FF Class of Adm, October a anenors ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. Form anua."
}
