{
  "anumber": "A43274002",
  "id": "A43274002_0087",
  "page_index": 87,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0087/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FORM OF HINDU MARRIAGE REGISTER CERTIFICATE, FORM NO. D"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1991,
        2023,
        1927,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 FORM OF HINDU M.RRI AGE REGISTER CERTIFICATES SCHEDULE -D SEE RULE 6(2) 1. Name of the applicant, NARAIN DAS SIKRI 2. Date on which application for regi stration made. 9-1-1979. 3. Date of marri age. 23rd January, 1927. 4. Place of marri age. Ma Itan(West Punjab, Pakistan) DETAILS WITH REGARD TO BRI IDEGROOM AND BRIDE 5. Name of Bridegroom NARAIN DAS SIKRI 6. Father's name 7. Usual place of residence. Shri Ghansham Das Sikri Chandigash, 8. Full address. H. No. 1093, sector 18-C, Chandigarh, 9. Age at the time of marri age. 24 years. 10. Civil condition at the time of marriage whether unmarried Un-married, or widower or divorce. 11. Name of Bride. SUSHILA DEVI 12 Father's name. Shri Radha Krishan Rajpal. 13. Usial Place of residence. Chandigazh. 14. Full Address. H. No. 1093, sector 18-C, Chandigarh, 15. age at the time of marri age. 17 years. 16. Civil condition at the time of marriage whether unmarried or Un-married, widow or divorce. sd/- Register R192 on REGISTRAR, Date theth day CHANDIG ARH. of 197 January Certified that the above, which contain entric from Serial No.I to 16 regarding Bridegroom and Bride, is true extract of all the entries 1 in the Hindu Marri age Register maint at ned in the office. REGISTRAR, Original Seen and .NDIGARH. Compared ; (UNDER THE HI ACT) American Embassy *Bakshi* (Consular Section) Salina o New Delhi, India CHANDIGARI DEC 2. 1991 MN"
}