{
	"anumber": "A43274002",
	"id": "A43274002_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "COLLECTION CENTRES IN DELHI, DABUR-3"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 Note 1. Specimens are accepted 8-11.30 a.m. Monday through Saturday. P.P. Glucose samples are accepted till 2.30 p.m. Emergency electrolytes till 5.30 p.m. Note 2. Reports are given 5.30-6.30 p.m. only or after 11 a.m. next day. Note 3. More than 12 hrs. overnight fasting condition is required for Triglycerides and Lipid Profile. Note 4. 2 ml. blood is required in Fluoride bulb for Glucose estimation. Note 5. 2 ml. blood is required in EDTA bulb for Haematology, G-6 P.D., Glycosylated Haemeoglobin and Haemoglobin Electrophoriesis. 2 ml. Blood in EDTA plastic/siliconised-glass bulb is preferred for accurate platelet counts. Note 6. 8-10 ml. clotted blood or 4-5 ml. serum is required for Analyzer 26 (SMA 26). Half this quantity is required for all Hormonal tests. Outstation serum samples should be sent in ice for the same. Note 7. False elevation of LDH, Potassium, Iron and Phosphate as well as a false decrease in Glucose may be seen if whole blood is received by the Lab. Note 8. Bacterial contamination or delayed separation of serum from cells may falsely decrease Glucose and may falsely elevate the Potassium, LDH, Phosphate, SGOT and SGPT. Note 9. Haemolyzed serum may falsely elevate Potassium/Iron SGOT, SGPT, LDH and Phosphate. Note 10. Lipemic serum may falsely elevate Chloride, Alkaline Phosphatase, SGOT, SGPT, Calcium, Total Proteins and Creatinine, and may falsely lower the Total Bilirubin. Note 11. Samples for Blood Gas Analysis should be sent in Heparinised wide nozzle syringe in ice. The needle should be bent and sealed by a rubber stopper. Source (Arterial/Venous) should be mentioned. Note 12. 2 ml. blood in EDTA bulb, well stoppered, in ice is required for Ammonia estimation. C:lsuresh1DABUR-3 COLLECTION CENTRES IN DELHI PLACE TELEPHONE NO. COLLECTION TIMINGS REPORTS TIMINGS MAIN LABORATORY Eskay House, 54, Hanuman Road, New Delhi-110 001 Tel: 312046, 311329 8.00 a.m. to 11.30 am. 5.30 p.m. to 6.30 p.m COLLECTION CENTRES J-5, Green Park (Main), New Delhi-110 016 Tel.: 661095 7.30 a.m. to 10.30 a.m. 7.00 p.m. to 8.00 p.m. 39, Shankar Vihar (Opp. A-40, Swasthya Vihar), Delhi-110 092 8.30 a.m. to 11.30 a.m. 6.45 p.m. to 7.30 p.m. Bhayana Polyclinic, S-565, Greater Kailash II, Tel: 6439364 8.30 a.m. to 11.30 a.m. 8.30 a.m. to 11.30 a.m. New Delhi-110 048 (Next Day) BW-61 A, Shalimar Apartments 8.30 a.m. to 11.30 a.m. 8.30 p.m. to 11.00 p.m. (Next Day) Shalimar Bagh, Delhi-110 052 Sanchet Hospital, 436, Bhera Enclave, Outer Ring Road, Paschim Vihar, Delhi-110 041 Tel.: 5580683, 5580287 8.30 a.m. to 11.30 a.m. 8.00 a.m. to 8.30 a.m. (Next Day) B-2/81, Janakpuri, (Near Church), New Delhi-110 063 Tel: 5591202 8.30 a.m. to 11.30 a.m. 8.30 a.m. to 11.30 a.m. (Next Day) Bhayana Polyclinic Shop No. 36, Sri Ram House, Ashram, New Delhi-110065 8.00 a.m. to 11.00 a.m. 7 p.m. to 8 p.m. Jyoti Shikhar 8.30 to 12.00 a.m. 8 Janakpuri District Centre, Pankha Road, New Delhi-110 058 1.30 p.m. to 8.30 p.m. 8.00 to 8.30 p.m. Sunday 8.30 to 12.00 a.m. D-413, Defence Colony, Tel.: 4628210 8.30 a.m. to 11.30 a.m. 7 p.m. to 8 p.m. (Near Defence Colony Market) New Delhi-110 024 City Cancer Centre, D-5 Chander Nager Tel.: 867341, 867358 8.30 a.m. to 11.00 a.m. 8.30 a.m. to 11.00 a.m. (Opp. Vivek Vihar) Delhi-(U.P. Border) 867364 (Next Day) 21, (Basement) Central Market, Opp. Punjab National Bank 8.30 a.m. to 11.00 a.m. 7.30 p.m. to 8.00 p.m. Ashok Vihar Phase-1, Delhi-110 052 8.30 a.m. to 11.00 a.m. 7.30 p.m. to 8.30 p.m. Uttam Diognostic Centre Tel.: 87-10177 8.30 a.m. to 11.00 a.m. 8.30 a.m. to 11.30 a.m. J-53, Patel Nagar-I, Opp. GDA Ghaziabad-201 001 (Next Day) Arora Polyclinic KG-1/97, Vikas Puri, New Delhi-110 018 Tel.: 5507483 7.30 a.m. to 11.30 a.m. 8.30 p.m. to 9.30 p.m. Dr Jains Clinic Tel.: 7128732 8.30 a.m. to 11.00 a.m. 8.30 a.m. to 11.00 a.m."
}
