{
  "anumber": "A43274002",
  "id": "A43274002_0082",
  "page_index": 82,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0082/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRUSTee, AFFIDAVIT"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1030,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 + 3RS PINDIA GIGG HIGH TORD MORE and THREE RUPEES THREE RUPEES AFFIDAVIT I, Jiwan Dass Sachdeva, s/o Shri Ram Krishan Sachdeva of 99, Model Town, Karnal, do solemnly affirm that:- i) I am 68 years (Sixty-eight years) old. ii) Mr. Om Parkash Sikri and Mr. Atam Parkash Sikri are real brothers and are sons of my sister-in-law (my wife's sister), Mrs. Sushila Devi Sikri. iii) I have known both Mr. Gn Parkash Sikri and Mr. Atam Parkas Sikri very intimately since their birth. iv) Mr. On parkash Sikri was born at Bahawalpur (now in Pakistan) on March 29th,1030 to Mr. Narain Dass Sikri and Mrs. Pushila Devi Sikri. v) Mr. Atar: Parkash Sikri was born at Sheikhupura (now in Pakistan) on March 12th 1939 to Mr. Karain Dass Sikri and Mrs. Sishila Devi ikri. vi) I was residing at Shujabad (Now in Pakistan) when Mr. Om Parkash Sikri and Mr. Atam Parkash Silri were born and came to know about their date of births through their parents, through personal contacts at various occasions and through common relations. It is further affirmed that I have acquired knowledge of above facts through our connon faily relations. Jiwan bass Sacheleva (Jiwan Dass Eachdeva) DEPOMENT VERIFICATION: I further solemnly affirm and declare that the above statement is true to the best of my knowledge and belief Har.en Kuma and nothing has been concealed therefrom. the was declares \" of 9 17.9 givan san Sachdeva Jiwen Dass ATTESTED (Jiwan Dass Sachdeva) DEPQ.ENT Married Correct copy compared with ssiones as who h.s original Al Original returned 11/20/72 on contact Reven U.S. immigration"
}