{
	"anumber": "A43273551",
	"id": "A43273551_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43273551_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [1992, 1953, 2023, 1993]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/13/2023 U.S. Department of Justice F2 OMB #1115 0054 Immigration and Naturalization Service (mrS) Petition for Alien Relative ff DO NOT WRITE IN THIS BLOCK - FOR EX ONLY Case Action Stamp APPROVED INS RAC DIRECTOR 06/15/92 EAC-92-186-50231 LLL001 G-28 or Volag OCT 23 1992 Section of Law: amynarpe Petition was filed on: 5-21-92 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) EAC I 5089 Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field Investigations I-485 Simultaneously nairoBi 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wile Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) WARSAME AL GODANE 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) FOIA (b)(6) P.O Box 31160 (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOIA (b)(6) NIAROB, KENYA 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) KONY FOIA (b)(6) GALKIO SOMALIA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status FOIA(b)(6) FOIA (b) FOIA (b) SOMA (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single FOIA (b)(6) Female Widowed Divorced unknown Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) N/A 1953 GALKIO, 50 MAS 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A N/A NURO WARSAME 13. BY OF THE UNITED your Relative ever been in the U.S.? FOIA (b)(6) OF AMERICA Yes No 14. If your relative is currently in the U.S., complete the following: He or BAMAR 1993 she last arrived as a (visitor, student, stowaway, without inspection, etc.) N/A INSULAR SECTION Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) e? NAIROLL Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? FOIA (b)( Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4/11/91) Y PP"
}
