{
  "anumber": "A43273551",
  "id": "A43273551_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43273551_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Additional Information for Applicants and Petitioners, Form I-797 ( (11/20/91) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/13/2023 Additional Information for Applicants and Petitioners General: Approval of a Petition: The filing of an application or petition does not in itself Approval of an immigrant or nonimmigrant petition allow a person to enter or remain in the United States means that the person for whom it was filed, called the and does not confer any other right or benefit. beneficiary, has been found eligible for the requested classification. However, approval of a petition does not give any status or right. Actual status is given when the beneficiary is given the proper visa and uses it to enter the United States. Please contact the appropriate Inquiries: U.S. Consulate directly if you have any questions about If you do not hear from us within the processing time visa issuance. given on this notice and you want to know the status of this case, contact your local INS office. For nonimmigrant petitions, the beneficiary should contact the consulate after he or she receives our You should also contact your local INS office if you have approval notice. For approved immigrant petitions, the questions about this notice. beneficiary should wait to be contacted by the consulate. Please have this form with you whenever you contact a local office about this case. If the beneficiary is now in the United States and believes he or she may be eligible for the new status without going abroad for a visa, then he or she should contact a local INS office about applying here. Requests for Evidence: If this notice asks for more evidence, you can submit it Denials: or you can ask for a decision based on what you have A denial means that, after every consideration, INS has already filed. When you reply please include a copy of concluded that the evidence submitted does not the other side of this notice and also include any papers establish eligibility for the requested benefit. attached to this notice. If you believe there is more evidence that will establish eligibility, you can file a new application or petition or you can file a motion to reopen this case. If you believe the denial is inconsistent with precedent decisions or Reply Period: regulations, you can file a motion for reconsideration. If this notice indicates that you must reply by a certain date and you do not reply by that date, then we will If the front of this notice states that this denial can be issue a decision based on the evidence on file. No appealed and you believe the decision is in error, you extension of time will be granted. After we issue a can file an appeal. decision any new evidence must be submitted with a new application or petition, motion or appeal, as You can obtain more information about these processes discussed under \"Denials.\" from your local INS office. Form I-797 (11/20/91) Y *U.S. GPO: 1991-312-328/51127"
}