{
	"anumber": "A43274002",
	"id": "A43274002_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Reentry Permit or Other Document,, 1310.2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 4. X Are you presently the United States? Yes No x : not presently in the United States on what date did you depart? Actual date of departure AUG 10, 1997 BY AIR FRANCE FROM WASHINGT Have you departed the United States, and returned since the filing of DC this application? Yes No : you are not presently in the United States you TUST submit evidence to establish the date you departed the United of transportation ticket flight itimerary etc ATTACHED MEDICAL REPORTS, NEWDELHI IMMIGRATION OFFICER ARRIVAL STAMP DATE IN PASSPORT You must establish that United States on the date you filed this application As PER ABOUE ATTACHHENTS, applied for REENTRY PERMIT in JULY 9T WHEREAS I DEPARTED SS ON AUG 10, 97 you have re: departed the yet, on what date do intend to depart? Date of intended departure NOT APPLICABLE. Submit proposed NOT APPLICABLE As I HAVE DEPARTED FROM USA SINCE AUG. 10.97 5 of a photo identity document showing your picture name and date of a document can be a copy of the identity page from your passport a or another type of photo ID with the same information The identity copy must clearly show the photograph and identity information (1310.1) be accompanied therefore please submit two color photos yourself taken within the days, and not previously used These photos must have background Photos must be glossy unretouched and not mounted Dimension of the facial image should be about inch from to top of hair side of Using soft felt print on of each photograph photographer pictures Your response must be received in this office by \" 18 88 MONTH DAY pending your response of evidence requested not be denied If your case considered received in after the due date will be considered PLACE THIS LETTER ON TOP OF YOUR RESPONSE. SUBMISSION OF EVIDENCE WITHOUT THIS LETTER WILL DELAY PROCESSING OF YOUR CASE AND MAY RESULT IN A DENIAL. PLEASE USE THE ATTACHED LABEL FOR MAILING THIS EVIDENCE BACK TO THIS OFFICE. Sincerely Natalie Wedder NSC Director NSC 351 EX151"
}
