{
  "anumber": "A43274002",
  "id": "A43274002_0083",
  "page_index": 83,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0083/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INDIA THREE RUPEES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1930,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened NARA, 9/27/2023 3RS INDIA FIRT FIGT TOUR THURD 12149 GRIN THREE RUPEES THREE RUPEES AFFIDAVIT I, Bhagwati Sachdeva, wife of Shri Jiwan Dass Sachdeva of 99, Model Town,Karnal, do solemnly affirm that:- i) I am 62 (Sixty- - two) years old. ii) Parkash Sikri and Mr. Atan Parkash Sushila Sikri are Devi real Sikri. Mr. brothers am and are sons of my sister Mrs. iii) I have known both Mr. on Parkash Sikri birth. and Mr. Atam Parkash Sikri very intimately since their iv) Parkash Sikri was born at Bahawalpur Dass (Now in Mr. Pakistan) On on March 29th 1930 to Mr. Karain Skiri and Hrs. Sushila Devi Sikri. v) Parkash Sikri was born at Sheikhunura Dass (Iin Sikri in Mr. Pakistan) Atam on March 12th, 1939 to lr. Karain and I'rs. Sushila Devi Sikri. vi) residing at Shujabad (Now in Pakistan) were when born Mr. and On I was Sikri and Mr. Atam Parkash Sikri their parents, cane to through personal contacts ativerious occasions Parkash know about their date of birth through and through control relations. It is further affirmed that I have acquired the knowledge of above facts through our compon family relations attract (Bhagwati Sachdeva) DEPONENT VERIFICATION above statement I is true to the best of my knowledge and belief further solemly affirm and declare that the and nothing has been concealed accidence therefrom. .. a 97.9 to Eachdeva) Marian KUMA DEPOREME self ATTESTED who has under stoo Greene N other original Correct copy, compared with Original returned on 11/20/24 Contact Lind U.S. Immigation & Naturallzatium Service = WAS"
}