{
  "anumber": "A43274002",
  "id": "A43274002_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CLINICAL ABSTRACT SUMMARY, C-AMR-10667"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/27/2023 must days RELEVANT DIAGNOSES ESTABLISHED BY TIME OF DISCHARGE Date 8-5 PRINCIPAL DIAGNOSIS (document the acute condition the condition established after study to be chiefly responsible for Discharge hospitalization.) Sate 8-8-97 V>left femur bone infanct CD -9-CM CODES 733.99 ADDITIONAL DIAGNOSES (document additional conditions that coexist at the time of admission. ordevelop subsequently, and which have an effect on the treatment received or the length of stay.) Severe bain left by secondaryte INS Postato carcinome Protatic enlongement with using obstruction Kyphogis System controlled ADVERSE DRUG REACTION Did the patient experience a newly identified adverse drug or allergic reaction during this admission? Yes No (If yes, list probable drug and reaction under Additional Diagnoses) PRINCIPAL PROCEDURE (document the procedure performed for definitive treatment and most related to the principal diagnosis) ADDITIONAL PROCEDURE (include invasive diagnostic procedures.) (Shaded Areas For Medical Record Department Use) Processing ATTESTATION I certify that the narrative descriptions of the principal and secondary diagnoses and the major procedures performed are accurate and 86 complete to the bess of my ledge. Ame Tear Signature of Physician 8/8/97 Date glose 6488 dinn Additional Diagnoses/Procedures continued on next page. , 357-01 FAIR OAKS HOSPITAL C PATIENT DENDINIAATION 01601822 R ARAIN 8. 93 M CLINICAL ABSTRACT SUMMARY I 07479607 VERMA, ANIL 5928 VERMA, ANIL 5928 C-MR-10667 08/05/97 CAT #98255 . PKGS OF 250"
}