{
	"anumber": "A43274002",
	"id": "A43274002_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43274002_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/27/2023 CONSULTATION Page 2 PATIENT NAME: Sikri, Narain 3. HISTORY NUMBER: 1601822 DATE OF ADMISSION: 8/5/97 DATE OF CONSULTATION: 8/8/97 ATTENDING PHYSICIAN: Anil Verma, M.D. CONSULTING PHYSICIAN: L. F.Smith, Jr., M.D. IMPRESSION: 1. Probable metastases to the left femur. 2. Carcinoma of the prostate, right lobe. 3. Chronic lymphocytic leukemia. 4. Irregular heart rhythm. 5. Hearing loss. COMMENTS AND RECOMMENDATIONS: His chest x-ray looks perfectly fine. The remainder of his Chem-24, except for a BUN of 22, is within normal limits. He has a normal free T4 level and a normal TSH level. I think this gentleman probably has metastatic disease in the left femur which could be causing the left hip pain. This could be referred pain in his hip. The plain films of the left femur are not revealing, as far as showing a lesion. Because of the degree of his pain, I think we should document whether or not this is a metastatic deposit, which I think it probably is. This could best be done by doing an MRI through the positive area on his bone scan. I don't think we need to proceed with a prostate biopsy under these circumstances. He may indeed require some radiation therapy to the left femur for pain control and for strengthening the left femur. I think this gentleman also has chronic lymphocytic leukemia, but I don't think it is necessary to do flow cytometry on his blood or to start any kind of therapy for this. I will check his reticulocyte count, but I don't think he a hemolytic component to his CLL. Thank for allowing me to see this patient. LFS:15 dictated: 8/8/97 transcribed: 8/8/97 L. F. Smith, Jr D. 8/28/97 MRI -7 NO wets Whenth"
}
