{
	"anumber": "A43672523",
	"id": "A43672523_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43672523_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEMANDE DE VISA D'IMMIGRATION ET DE CARTE VIOLETE, 230 II"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 DEMANDE DE VISA D'IMMIGRATION ET DE CARTE VERTE II - ENGAGEMENT SUR L'HONNEUR seul exemplaire de ce formulaire est à compléter pour vous-même et les membres de votre famille devant immigrer avec vous, quel que soit leur âge. Les réponses doivent être dactylographiées ou écrites en caractères d'imprimerie. Biffer les mentions inutiles et inscrire la mention \"sans objet''. Si vous ne disposez pas d'assez de place pour les réponses, utilisez une feuille séparée en reportant les numéros inscrits sur le formulaire. Joindre la feuille à ce formulaire. Ne pas signer le formulaire avant d'en être avisé par l'officier consulaire. Les droits à acquitter pour le dépôt du dossier sont indiqués à la rubrique 20 du tarif. Le paiement devra être effectué en dollars américains ou en monnaie locale, le jour de votre entretien avec l'officier consulaire. ATTENTION : Toute fausse déclaration ou dissimulation de faits peut entraîner une interdiction permanente de séjour aux Etats-Unis. Même si vous deviez être admis sur le territoire américain, votre entrée effectuée en infraction de la loi pourrait donner suite à des poursuites judiciaires et/ou à des mesures d'expulsion. La demande de visa d'immigration et de carte verte requiert la présentation du présent document et du formulaire OF 230 1re partie. 24. NOM DE FAMILLE PRENOM(S) (IEUNT) SAloME CLONISE 25. ADRESSE (actuelle) 26. FUTURE ADRESSE AUX ETATS-UNIS VILLAGE DE DIEU (adresse complète avec code postal) 61- Rue MANDELA PAU-? 210 NE 20Th AVE N° de téléphone N° de télephone (B K YYN) BoyNION Beh. FL 4007-476-3920 27. NOM ET ADRESSE DE LA PERSONNE QUE vous DEVEZ 28. NOM ET ADRESSE DU REQUERANT (parent ou employeur) REJOINDRE (Préciser le lien de parenté) Julien JeuNe 210 NE. 20th Juvier Jeune (Paxent) Fils Boylon Bew FX. 29. OBJET DE VOTRE SEJOUR AUX ETATS-UNIS 30. DUREE DE SEJOUR ENVISAGEE RESIdENt (préciser s'il s'agit d'un séjour définitif) DEFNITIF 31. AEROPORT DE DEBARQUEMENT 32. POSSEDEZ-VOUS LE BILLET POUR VOTRE LIEU DE DESTINATION FINALE ? Miami OUI NON 33. La législation américaine en vigueur en matière de visas requiert de chaque demandeur qu'il précise s'il relève des catégories de personnes interdites de séjour aux Etats-Unis. Les critères généraux d'interdiction de séjour sont résumés ci-dessous. Après une lecture attentive, le demandeur aura l'obligation de déterminer pour chaque catégorie son appartenance éventuelle en répondant par OUI ou par NON. Les réponses qu'il aura fournies permettront à l'officier consulaire de se prononcer sur ses droits à l'obtention d'un visa. SAUF STIPULATIONS CONTRAIRES, TOUT RESSORTISSANT ETRANGER RELEVANT D'UNE DES CATEGORIES SUIVANTES NE POURRA ETRE LEGALEMENT HABILITE A RECEVOIR UN VISA. PENSEZ-VOUS APPARTENIR A L'UNE DES CATEGORIES SUIVANTES ? a. Tout ressortissant étranger ayant contracté une maladie contagieuse grave, ou atteint de troubles physiques ou mentaux susceptibles de présenter une menace pour lui-même ou la sécurité et la santé publiques; tout ressortissant étranger toxicomane ou ayant fait usage de stupéfiants (212) (a) (1). OUI NON b. Tout ressortissant étranger ayant subi une condamnation ou reconnaissant avoir commis un crime ou délit que réprouve la morale publique ou enfreint la loi en matière de substances contrôlées; quiconque aura été condamné à une peine totale d'emprisonnement d'au moins 5 ans pour au moins deux délits; quiconque se rendra aux Etats-Unis pour se livrer à la prostitution ou à un commerce immoral ou s'est livré à la prostitution ou au proxénétisme au cours des 10 dernières années; quiconque s'est livré au trafic de substances contrôlées; quiconque aura commis un délit grave aux Etats-Unis et aura pu se prévaloir du privilège d'immunité pour échapper aux poursuites judiciaires (212) (a) (2). OUI NON C. Tout ressortissant étranger qui chercherait à se rendre aux Etats-Unis pour se livrer à des activités d'espionnage, de sabotage, ou pour échapper au contrôle des exportations, pour renverser le Gouvernement des Etats-Unis, ou tout autre acte illégal; quiconque aura cherché à se livrer à des activités terroristes; quiconque aura été membre du Parti Communiste ou de tout autre parti totalitaire ou d'une organisation affiliée; quiconque aura ordonné des persécutions (participé ou incité à leur exécution) du fait de la race, de la religion, de l'origine ethnique ou des opinions politiques des individus, sous l'autorité directe ou indirecte du gouvernement de l'Allemagne nazie ou de territoires alliés de l'Allemagne nazie ou occupés par elle. Quiconque aura participé à un génocide (212) (3). OUI NON d. Tout ressortissant étranger susceptible de recourir à l'aide publique (212) (a) (4). OUI NON e. Tout ressortissant étranger qui envisagerait d'exercer une activité professionnelle spécialisée ou non, sans autorisation du Département du Travail; tout ressortissant étranger diplômé d'une faculté de médecine d'un pays tiers qui chercherait à exercer sans avoir été reçu OUI NON à l'examen NBME ou en avoir obtenu l'équivalence (212) (5). sans objet f. Tout ressortissant étranger ayant été expulsé au cours de l'année précédente, ou arrêté et expulsé au cours des cinq dernières années; tout ressortissant étranger qui cherche ou a cherché à obtenir un visa, son admission sur le territoire américain, ou un quelconque privilège lié à l'immigration aux Etats-Unis, par voie de fraude ou fausses déclarations; tout ressortissant étranger qui, en connaissance de cause, aura aidé un autre ressortissant étranger à entrer aux Etats-Unis ou tenté de le faire en violation de la loi; quiconque aura enfreint l'article 274C de la loi sur l'Immmigration (212) (a) (6). OUI NON CE FORMULAIRE EST DISPONIBLE A TITRE GRATUIT AUPRES DES SERVICES CONSULAIRES DE L'AMBASSADE DES ETATS-UNIS D'AMERIQUE OPTIONAL FORM 230 II REVISED 4-91 Ce formulaire annule et remplace les précédents DEPT. OF STATE"
}
