{
	"anumber": "A43683986",
	"id": "A43683986_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43683986_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title of the image, Screened by NARA, 7/21/2023, Form number only in double quotes separately, NARA-8694"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 which I certify to be true it the ITV now age and belief S 1 have life insurance in the 01 Term $ 4 it '00 With a cash surrender value of N/H ! own real estate valued at 80,000.00 With mortgages or other encu nbrances thereon amounting to $ -600.00 Which is located at 19632 N.W. splace Miami Florida 33169 (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me Estasie Vixama X 86 Mother 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted No 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted None 11 (Complete this block only if the person named in item 3 will be in the United States temporarily.) That 1 do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\". indicate the exact nature and duration of the contributions. For example. if you intend 10 furnish room and board. state for how long and, if money, state the amount in United States dollars and state whether it is 10 be given in a lump sum. weekly. or monthly. or for how long.) OATH OR AFFIRMATION OF DEPONENT I acknowledge at that I have read Part III of the Instructions, Sponsor and A lien Liability, and am aware of my responsibilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that I know the contents of this affidavit signed by me and the statements are true and correct. Subscribed and sworn to (affirmed) before me this 24th day of Signature of deponent x Pierne Toly aiped June 19 93 PUBLIC or / Signature at of Officer Administering Oath Jenu Carke My commission expires on Driver EXP. are 284416 25, STAY 1995 Title Notary Public If affidavit prepared by other than deponent, please complete the following: I declare that this document was prepared by me at the request of the deponent and is based on all information of which I have knowledge. 26 NE 54 ST mean H 33137 06/24/93 (Sign ture) (Address) in"
}
