{
  "anumber": "A43632062",
  "id": "A43632062_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43632062_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FORMULARIO OPCIÓNAL 230, FORMULARIO OPCIÓNAL 230"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 OPTIONAL FORM 230 FORMULARIO OPCIONAL 230 OPTIONAL FORM 230 FORMULARIO OPCIONAL 230 INS.(Eng. Span. 5/83) PAGE /PAGINA 2 BNS.(Eng. Span. 5/83) PAGE 3 PAGINA 3 25. Nombre completo, domicilio, facha y lugar de nacimiento del padre. Si ha fallecido, indíquelo dando ano de fallecimiento. 40. Las leyes de los Estados Unidos que rigen la emision de visas, requieren que cada solicitante declare si pertenece 0 no a alguna clase de persona inadmisible a los Estados Unidos. A continuación se (Father's complete name, address, date and place of birth receased. so state giving year of death) describen las es excluibles. Lea con cuidado los siguientes parrafos; su comprension del contenido de los mismos y las respuestas que Ud. de a las preguntas que le siguen podrán ayudar al funcio- nario consult jmar una decisión con respecto a su elegibilidad para recibir una visa. Fallecio' unknown (United States laws governing the issuance of visas require each applicant to state whether or not he or she is member of any class of individual excluded from admission into the United States. The excludable classes are de ed below. You should read carefully the following paragraphs; your understanding of their content and the answers you give the questions that follow will assist the 26. Nombre completo, domicilio fecha lugar de nacimiento de la madre. Si ha fallecido, indíquelo dando año de fallecimiento. consular officer to reach Decision on your eligibility to receive a visa.) (Mother's complete name, address, date and place of birth deceased. so state giving year of death) SALVO CUANDO LA LEY DISPONGA LO CONTRARIO, LOS EXTRANJEROS COMPRENDIDOS EN CUALQUIERA Fallecio- Flora Mininda DE LAS SIGUIENTES CLASES SON INELEGIBLES PARA RECIBIR UNA VISA DE INMIGRANTE EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE 27 Nombre completo, domicilie, y parentesco del familiar mas cercano en su país de origen Indique únicamente si ambos padres han fallecido. FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA (Name, adress, and relationship of next of kin in home country Only if neither parent is living). a) Extranjeros que sean retardados mentales, dementes, o que hayan sufrido uno 0 mas ataques de demencia: extranjeros que sufran de personalidad psicopatica, desviacion sexual, defecto mental, adic- cion drogas narcóticas, alcoholismo crónico 0 cualquier enfermedad contagiosa peligrosa; extranjeros que tengan un defecto físico, enfermedad o incapacidad que afecta su capacidad de ganarse el sustento; extranjeros que sean indigentes, mendigos profesionales 0 vagos; extranjeros convictos por un delito que implique depravación moral o quienes admitan haber cometido los elementos esenciales 28. Enumere todos los lugares de residencia durante seis meses 0 más desde que cumplió los 16 años. (List all places of residence for 6 months or more since your 16th birthday) de tal delito, 0 quienes hayan sido sentenciados a prision por lo menos por cinco años, por sentencias sumadas de dos mas delitos; extranjeros que sean poligamos, 0 quienes practiquen 0 prediquen la Ciudad pueblo Provincia/Departamento/Estado País Fechas Desde Hasta Situación \" ocupación poligamia; extranjeras que sean prostitutas, 0 extranjeros que hayan negociado en prostitución, beneficiado financieramente de la prostitucion procuradoo importado personas con el propósito de pros- (City or town) (Province/State) (Country) (Dates From To) (Calling or occupation) titución, 0 que intentan ingresar los Estados Unidos para negociar en prostitución u otro vicio comercializado, 0 cualquier acto sexual inmoral; extranjeros que intentan ingresar para llevar cabo tra- bajos calificados 0 semi calificados y que no hayan sido certificados por el secretario de trabajo; y extranjeros que probablemente se conviertan en carga pública en los Estados Unidos. (a) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity: aliens afflicted with psychopathic personality, sexual deviation, mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn living: aliens who are paupers, professional beggars, or vagrants; aliens convicted of crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to confinement for at least years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in prostitution, benefited financially from prostitution, procured or imported persons for the purpose of prostitution, or who seek entry to the United States to engage in prostitution or other comercialized vice, or any immoral sexual act, aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor: and aliens likely to become public charge in the United States). 29. Enumere todas las organizaciones de las que Ud. sea ahora o haya sido miembro afiliado desde que cumplió los 16 años de edad Incluye organizaciones profesionales, vocacionales, sociales y políticas. ¿Se aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI. explique (If reply is YES. explain.) SI me (List all organizations you are now or have been a member of or affiliated with since your 16th birthday Include professional, vocational. social and political organizations) (Yes) (No) Nombre dirección Fechas: Desde Hasta Categoria de miembro o cargo ejercido si alguno (Name and address) (Dates: From To) (Type of membership and office held if any) b) Extranjeros que pretendan reingresar dentro de un año desde que fueron excluidos de los Estados Unidos, 0 quienes, dentro de los últimos cinco años, hayan sido arrestados y deportados de los Estados Unidos, 0 expulsados costa del gobierno en lugar de deportacion 0 expulsados como un extranjero indigente 0 como un extranjero enemigo; extranjeros que obtengan 0 tratan de obtener una visa otra documentación por medio de fraude por tergiversación intencional; extranjeros que no sean elegibles para adquirir la ciudadania de los Estados Unidos, 0 quienes hayan salido de 0 permanecido fuera de los Estados Unidos para evadir el servicio militar de los Estados Unidos en tiempo de guerra 0 emergencia nacional: extranjeros que hayan sido convictos por violar 0 por conspirar para violar ciertas leyes 0 reglamentos relativos a drogas narcóticas 0 mariguana/marihuan 0 quienes se sepa que sean se crea que sean o que fueron traficantes ilegales de drogas narcóticas 0 mariguana; extranjeros que tratan de ingresar desde territorio extranjero contiguo 0 islas adyacentes dentro de los dos anos de su arribo de esa procedencia en un transporte no signatario; extranjeros que no puedan leer comprender 30. Enumere todos los idiomas, incluyendo el propio, que puede hablar, leer Y escribir. (List all languages, including your own, that you can speak, read and write) read and write) algún idioma 0 dialecto, extranjeros que, a sabiendas y por remuneración, hayan alentado 0 asistido a cualquier otro extranjero a ingresar, tratar de ingresar los Estados Unidos infringiendo la Ley: ex- Idioma (Language) Habla (Speak) Lee (Read) Escribe (Write) tranjeros que siendo anteriormente visitantes de intercambio no hayan cumplido con el requisito de residencia de dos años en el exterior; y extranjeros que sean graduados de colegios médicos extranjeros Espanol 5 no no destinados a los Estados Unidos a brindar servicios médicos son inelegibles para una visa menos que hayan aprobado las partes ly II del examen NBMEE (National Board of Medical Examiner's Exami- nation). 0 el examen equivalente como lo determine el Departamento de Servicios Humanos y de la Salud. (b) Aliens who week re-entry within 1 year of their exclusion from the United States, or who, within the past 5 years, have been arrested and deported from the United States, or removed at government expense in lieu of deportation or removed as an alien in distress or as an alien enemy: aliens who procure or attempt to procure visa or other documentation by fraud or willful misrepresentation aliens 31. Indique, incluyendo fechas, residencia 0 visitas anteriores los Estados Unidos Aclare tipo de visa o situacion. Declare si nunce estuvo. who are not eligible to acquire United States citizenship or who have departed or remained outside the United States to avoid United States military service in time of war or national emergency; aliens (Inclusive dates of previous residence in or visits to the United States. Give type of visa or status If never. so state) who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or marihuana, or who are known or believed to be, or to have been, an illicit traf. B-2-1989,1990 ficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within 2 years of their arrival therein on non signatory carrier; aliens who are unable to read and understand some language or diaject; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United States in violation of law: aliens who are former exchange visitors who have not fulfilled 32. ¿Ha recibido Ud. tratamiento en algún hospital, institución, 0 en otro lugar, por un desorden mental, alcoholismo 0 por ser adicto a barbitúricos? Si la respuesta es SI. explique. SI NO the 2 year foreign residence requirement; and aliens who are graduates of foreign medical schools destined to the United States to perform medical services are ineligible for visa unless they have passed (Have you ever been treated in a hospital, institution, or elsewhere for mental disorder, drug addiction, or alcoholism? If answer is YES, explain). (Yes) (No) parts and II of the NBME Exam (National Board of Medical Examiner's Examination or an equivalent exam as determined by the Department of Health and Human Services.) ise aplica a Ud. alguna de las clases anteriores?. (Do any of the foregoing classes apply tu you?) Si contesta SI explique. (If reply is YES, explain. SI ANO (Yes) (No 33. ¿Ha side Ud. arrestado, convicto 0 recluído en prision, o ha estado Ud. internado en un asilo para indigentes otra institucion de caridad? Si la respuesta es SI, explique. SI X NO (Have you ever been arrested, convicted, or confined in prison, or have you ever been placed in poorhouse or other charitable institution? If answer is YES, explain). (Yes) (No) c) Extranjeros que sean, 0 en cualquier momento hayan sido, anarquistas, 0 miembros de 0 afiliados a cualquier partido comunista U otro partido totalitario, inclusive cualquier subdivision u organismo afiliado del mismo: extranjeros que prediquen 0 ensenen o hayan predicado o ensenado, ya sea por declaracion personal 0 por medio de material escrito 0 impreso, 0 por afiliacion alguna organización: 34. iHa sido Ud. alguna vez beneficiario de un indulto, amnistia, decreto de rehabilitación, otro acto de clemencia, 0 acción similar? Si la respuesta es SI. explique. SI x NO (1) oposición al gobierno organizado, (2) derrocamiento del gobierno por la fuerza 0 la violencia, (3) el asalto 0 asesinato de funcionarios del gobierno por su caracter oficial, (4) la destruccion ilegal de (Have you ever been the beneficiary of pardon, amnesty, rehabilitation decree, other act of clemency, or,similar action? If answer is YES, explain). (Yes) (No) bienes, (5) sabotaje, (6) las doctrinas del comunismo mundial o el establecimiento de una dictadura totalitaria en los Estados Unidos; extranjeros que intentan ingresar a los Estados Unidos para llevar a cabo actividades perjudiciales 0 ilegales de naturaleza subversiva (c) Aliens who are, or at any time have been, anarchists, or members of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof, aliens who advocate or 35. ¿Ha solicitado Ud. alguna vez una visa para ingresar los Estados Unidos? Si la respuesta es SI. de lare donde y cuándo. si solicito visa de inmigrante o de no -inmigrante, y si SI NO teach, or who have advocated or taught, either by personal utterance or by means of any written or printed matter, or through affiliation with an organization, (2) opposition to organized government, la visa fue otorgada denegada. (Have you ever applied for visa to enter the United States? If answer is YES. state where and when, whether you applied for nonimmigrant (Yes) (No) (2) the overthrow of government by force and violence. (3) the assaulting or killing of government officials because of their official character, (4) the unlawful destruction of property, (5) sabotage, or or an immigrant visa, and whether the visa was issued or refused). (6) the doctrines of world communism or the establishment of a totalitarian dictatorship in the United States; aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of subversive nature.) iSe aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI. explique. (If reply is YES. explain.) SI X NO (Yes) (Not 36. ¿Se le ha negado a Ud. la admision a los Estados Unidos durante los últimos 12 meses? Si la respuesta es SI, explique. SI NO (Have you been refused admission to the United States during the last 12 months? If answer is YES, explain) (Yes) (No) d) Extranjeros que durante el período comenzando el 23 de marzo de 1933 y concluyendo el 8 de mayo de 1945, bajo el control, directo 0 indirecto, del gobierno nazi de Alemania 0 del gobierno de 37. ¿Se ha registrado Ud. alguna vez con una junta de reclutamiento bajo las leyes del servicio selectivo de los Estados Unidos? Si la respuesta es SI. explique. SI a NO cualquier área ocupada por, 0 aliada con, el gobierno nazi de Alemania ordenó, incito, asistió, 0 que de cualquier otra manera participó en la persecución de cualquier persona por su raza, religion, origen (Have you ever registered with draft board under United States Selective Service laws? If answer is YES, explain). (Yes) (No) nacional opinion pública. (d) Aliens who during the period beginning of March 23, 1933, and ending on May 8, 1945, under the control, direct or indirect, of the Nazi Government of Germany or of the government of any area occupied by, or allied with, the Nazi Government of Germany, ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political 38. ¿Ha solicitado Ud. alguna vez que se le exima de entrenamiento y servicio en las fuerzas armadas de los Estados Unidos o ha salido 0 permanecido fuera de los Estados Unidos para SI NO opinion. evitar 0 evadir el servicio militar? Si la respuesta es SI. explique. (Have you ever applied for relief from training and service in the United States Armed Forces or departed from (Yes) ANd) (Se aplica a Ud. alguna de las clases anteriores? (Do any of the foregoing classes apply to you?) Si contesta SI. explique. (If reply is YES, explain.) SI NO (Yes) or remained outside the United States to avoid or evade military service? If answer is YES. explain) (No) 41. SI Le ayudó alguien a completar esta solicitud? Si la respuesta es SI. indique nombre y dirección de la persona que lo asistio. indicando si es pariente, amigo. agente de viajes, abo SI NO 39. ¿Tiene Ud. la intencion de ingresar a los Estados Unidos desde Canada, Méjico 0 desde alguna isla adyacente los Estados Unidos, dentro de los dos años de haber arribado di- NO gado. otro. (Were you assisted in completing this application? If answer is YES. give name and address of person assisting you indicating whether relative. friend. travel agent, (Yes) (No) chos países 0 islas adyacentes? Si la respuesta es SI. indique el nombre de la empresa de transporte que utilizo para entrar. o por medio de la cual tiene intención de entrar (Yes) (No) Méjico. Canada o dicha isla adyacente. (Do you intend to enter the United States from Canada, Mexico, or an island adjacent to the United States within two years after arrival attorney. or other.) Nombre (Name) Direccion (Address) Relacion (Relationship) in Canada, Mexico or such adjacent island? answer is YES, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island). yalanda Herrera"
}