{
	"anumber": "A43632062",
	"id": "A43632062_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43632062_0039/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Social Security Responsibilities, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 SOCIAL SECURITY RESPUNSLDILITIES This document must be read and signed by persons wishing CO submit an affidavit of support on behalf of an alien applying for an immigrant visa. is signed copy of this document MUSC be attached CO each copy of any affidavit of support submitted on behalf of all applicant. The Social Security ACC, as amended, established certain requirements for determining the eligibility of aliens for Supplemental Security Income (SSI) and Aid to Families with Dependenc Children (AFUC) benefits. These amendments require that che income and resources of any person who as the sponsor of an alien's entry into the United States, executed an or support or stallar agreement on behalf of the alien, and the income and resources of the sponsor's spouse, shall be deemed CO be one income and resources of the alien under formulas for determining eligibility for SSI and AFDC benefits during the chree years following the alien's entry into the United States. The eligibility of aliens for SSI and AFDC will DE concingent upon their obtaining the cooperation of their sponsor in providing the necessary information and evidence CO enable the Social Security Administration and'State Welfare Agencies to carry our this provision. All alien applying for SSI or APDC must make available to the Social Security Administration and/or State welfare Agency documentation concerning his income or resources of those of his sponsors, including information which he provided in support of his application for an immigrant visa or adjustment of status. The Secretary of Health and Human Services is authorized CO obtain copies of any such documentation from ocher agencies. The Social Security ACC also provides that an alien and his or her sponsor shall be jointly and severally liable to repay any SSI and AFDC benefits which are incorrectly paid because of misinformation provided by sponsor or because of sponsor's failure CO provide information, and any incorrect payments which are not repaid will be wichheld from any subsequent payments ior which the alien or sponsors are otherwise eligible under the Social Security Acc. These provisions do noc apply to allens admitted as refugees or granted political asylum by the Actorney General. They also will noc apply to the SSI eligibility of aliens who become blind or disabled after entry into the Uniced States. The AFDC provisions do not apply to aliens who are dependent children of the sponsor or sponsor's spouse. I FOIA (b) (6) residing ac FOIA (b)(6) (Name) (Street and Number) FOIA (b)(6) acknowledge that I have read the above and am (City) aware of my responsibilities as an immigrant sponsor under the Social Security ACC as amended. This statement is submitted on behalf of the following persons: NAME SEX ACE COUNTRY OF MARRIED RELATIONSHIP BIRTH OR SINCLE TO SPONSOR CELIA ROSA MIRANDA F 85 Nicaragua Widowed Grand-Mother FOIA (b)(6)"
}
