{
	"anumber": "A43672523",
	"id": "A43672523_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43672523_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 02-28-87) N"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 U.S. rtment of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NO WRITE IN THIS BLOCK-FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# APPROVED SKC90 172-00559 G-28 or Volag Section of Law: SEP 12 1990 40. 5/30/90 201 (b) spouse 203 (a)(1) Petition was filed on Aug 27,1990 (priority date) 201 (b) child 203 (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) SRC 3764 Field Investigations I-485 Simultaneously Part Aurunce 204 (a)(2)(A) Resolved AM CON: 204 (h) Resolved REMARKS: A. Relationship 1. The allen relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) Julien (Middle) 1. Name (Family name in CAPS) (First) \"CloMise (Middle) Jeune SAloMe 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) 256 N.E 14:st 22 Flue des A plastie (Apartment Number) (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/PostalCode) DelRAY BeAch Fl-33483 PoRt-an price HAiti 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) Aquin HAiti 5. Sex 4. Date of Birth Aquin HAiti (State/Country) 4. Date of Birth 6. Marital Status 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married 060846 Female Widowed Divorced 08 15,06 Single Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NA Glomise Salone 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) MIAMI F/- 9. Social Security number 10. Allen Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) N/A N/A 11. Names or Prior MusDanas/wives 12. Date(s) Marriage(s) Ended 11. 12. Date(s) Marriage(s) Ended EMilienne WPB, FL (06V) fight COHas Names your of relative Prior Husbands/Wives 4 been Jame in N/A 13. If you are a U.S. citizen, complete the following: My citizenship was acquired through (check one). Date: 5-2-90 ever the U.S.? Yes No N/A Birth in the U.S. If your relative is currently in the U.S., complete the following: Naturalization Give number of certificate, date and place it was issued kg He or she/last arrived as a (visitor student, stowaway, without inspection, etc.) #14211610 MIAMIFI- JAM.29,90 Arrival Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents Have you obtained a certificate of citizenship in your own name? No 1-551 Date authorized stay expired, will expire as shown on Form I-94 or I-95 Yes If \"Yes,\" give number of certificate, date and place it was issued of 15. Name and address of present employer (if any) NATZ N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, 12 and class of admission: NA 16. Has your relative ever been under immigration receedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion States citizen or lawful permanent resident? Yes No Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}
