{
	"anumber": "A43672523",
	"id": "A43672523_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43672523_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-43672523"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1992, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 OPTIONAL FORM.156A (REV. 6-91) B DEPT. OF STATE NSN 7540-01-126-7761 50155-204 IV-43672523 IMMIGRANT VISA AND ALIEN REGISTRATION PROCESSED FOR I-551 THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN SALOME, CLOMISE ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S IMMIGRATION 60 MIA-TAP #C33188 AA 424 212(e) 212(h) 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH DEC 27 1992 AQUIN, HAITI 15AUG1906 IR5 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ALIME UNTIL PORT AU PRINCE, HAT HAITIAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP X BILLA JACQUES FINAL ADDRESS STREET ADDRESS INCLUDE-IN CARE CELL AMT# IF APPLICABLE IN THE UNITED DECRAY BEACH, FC 33444 CITY STATE AND ZIP CODE STATES 256 NE 19TH ST 210 20TH AVE BOYTON BEACH, FL 33435 SEC. 212(a)(5)(A) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED SLS SALES OCCUPATIONS This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY 212 IR5 FOREIGN STATE/OTHER AREA LIMITATION AT PORT-AU-PRINCE HAITI Richard Kaminski Vice-Consul PTP199031006401 43672523 of the United States of America ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 03DEC1992 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 01APR1993 PASSPORT NO. 88-540080 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED UNITED STATES AMERICA Tariff No. 21 Fee Paid $ $ 30 or Local Currency Equivalent IV-43672523 ACTION OF I.J. ACTION ON APPEAL Info given to RS CLASS R (T) U.S.P.H.S SSED HEALT Issuance Name, Adar, BROUIRES DOB A# RTTENTION OF Class of Adm Occupie answers to Form 9003. USPHS AT POE MIAMI FLORIDA (3) CLASS B-2 TB,"
}
