{
  "anumber": "A43683986",
  "id": "A43683986_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43683986_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 OMB APPROVAL N° J015 EXPIRES 8-31-92 ESTIMATED BURDEN 1 HOUR DEMANDE DE VISA D'I. MIGRATION ET DE CARTE VERTE I - ETAT CIVIL seul exemplaire de ce formulaire est à compléter pour vous-même et chaque membre de votre famille devant immigrer avec vous, quel que .oit son âge. Les réponses doivent être dactylographiées ou écrites en caractères d'imprimerie. Biffer les mentions inutiles et inscrire \"sans objet'' Si vous ne disposez pas d'assez de place pour les réponses, utilisez une feuille séparée en reportant les numéros inscrits sur le formulaire. Joindre la feuille à ce formulaire. ATTENTION Toute fausse déclaration ou dissimulation de faits peut entraîner une interdiction permanente de séjour aux Etats-Unis. Le formulaire de demande de visa d'immigration et de carte verte se compose de deux parties OF-230-1 et OF-230-II. 1. NOM DE FAMILLE PRENOM(S) VIXAMAR ESTASIE 2. NOM DE JEUNE FILLE ou PSEUDONYME NONE 3. NOM COMPLET DANS L'ALPHABET D'ORIGINE (Différent des caractères romains) NONE 4. DATE DE NAISSANCE 5. AGE LIEU DE NAISSANCE (j/m/a) (ville) (département) (pays) 03-02-07 86 ANS PORT DE PAIX NORD'OUEST HAITI 7. NATIONALITE (en cas de double 8. SEXE 9. SITUATION DE FAMILLE nationalité mentionner les deux) M Célibataire Marié(e) Veuf(ve) Divorcé(e) Séparé(e) HAITIENNE X F Nombre de mariages 11. PROFESSION 10. (a) Couleur des cheveux GRISONNANTS aille lm61 (b) Couleur des yeux NOIRE (d) Teint COLORE 12. SIGNES PARTICULIERS 13. ADRESSE ACTUELLE NONE 68 RUE DES MIRACLES Téléphone : Domicile Bureau 14. NOM DU CONJOINT (nom de jeune fille ou nom patronymique) Prénom(s) NONE Date et lieu de naissance du conjoint : Adresse du conjoint (si différente de la vôtre) : 15. NOM, DATE ET LIEU DE NAISSANCE, ET ADRESSE DES ENFANTS NOM DATE ET LIEU DE NAISSANCE ADRESSE NONE CE FORMULAIRE EST DISPONIBLE A TITRE GRATUIT AUPRES DES SERVICES CONSULAIRES DE L'AMBASSADE DES ETATS-UNIS D'AMERIQUE 50320-106 Ce formulaire annule et remplace les précédents OPTIONAL FORM 230-I Revised 4-91 Dept. of State"
}