{
	"anumber": "A43632062",
	"id": "A43632062_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43632062_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-43,632062"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1992, 1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 TCS OPTIONAL FORM 155A, (Rev. 6-85) DEPT. OF STATE PROCESSED FOR I-S51 50155-203 IV-43, ,632,062 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN MIRANDA CELIA ROSA ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION 212(e) 212(h) U.S. IMMIGRATION NICA 230 212(g) 212(i) 060 MIA - IAP 840 CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH DEC 12 1992 GRANADA, NICARAGUA APRIL 28-1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED IR-5 GRANADA, NICARAGUA NICARAGUAN UNTIL MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP FLORA UNKNOWN FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE, IF AVAILABLE IN THE UNITED STATES 3160 S.W. 14TH. #1 MIAMI,FL.33145 SEC. 212(a)(14) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED HOUSE WIFE F This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR-5 FOREIGN STATE/OTHER AREA LIMITATION NICARAGUA AT MANAGUA KATHLEEN DALY IMMIGRANT VISA NO. 43,632,062 ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 30 NOVEMBER 1992 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 29 MARCH 1993 PASSPORT NO. C 082982 OR OTHER TRAVEL DOCUMENTS (Describe) ISSUED TO PHOTOGRAPHY AT LACKED FOREIGNI SERVICE BY Tariff No. 21 UN ED STATES OF AMERICA ON Fee Paid $75 EXPIRES Local Cy, Equiv. IV-43,632,062 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. on date of 1-551 Info given Name Addr, DOB, A#, Issuance Class of Adm, Occup & answers to Form 9003."
}
