{
  "anumber": "A43632062",
  "id": "A43632062_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43632062_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, OPTIONAL FORM 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Montenegro",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 PLACE R EDICAL EXAMINATION OF APPLICANTS Managua Nicaraqua FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) Nov. 23-92 CITY COUNTRY At the request or the American Consul at Managua Nicaraqua NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX I certify that on the above date I examined Montenegro Celia R. (Mo., Day, Yr.) F M Apr. 28- 7 WHO BEARS PASSPORT NO. ISSUED BY ON C 082982 Nic. Goverment Mar. 12-92 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Reaction mm Describe findings: Not Done #: 21 DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ R. calderon DATE READ Nov. 23-92 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Negative Nonreactive Not Done Not Done TEST TYPE: V.D.R.L. TEST TYPE: Elisa. DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY OTHER Lab. SPECIAL Wong REPORT (s) (When Valle needed) Nov .23-92 tab. Wong valle Nov. 23-92 DOCTOR'S NAME (Please print) REMARKS Natural secility ( But alest) will live C family APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE S. P. Zamora RpuaRen's Nov.25.92 NSN 7540-00-139-0058 *U.S. Government Printing 50157-103 Office: 1991 295-844/49075 OPTIONAL FORM 157 REVISED 2-88 DEPT. OF STATE"
}