{
  "anumber": "A43632062",
  "id": "A43632062_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43632062_0015/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Social Security Responsibilities, AFDC-1023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by 7/28/2023 SOCIAL SECURITY RLSPU:SIDILITIES This de nc MUSC be read and signed by persons wishing to submit an affidavit of suppo or \\alf of an alien applying for an immigrant visa. A signed copy of this docum MUSC be attached CO each copy of any affidavit of support submitted on behalf of all applicant. The Social Security Acc, as amended, established certain requirements for determining the eligibility of aliens for Supplemental Security Income (SSI) and Aid to Families with Dependenc Children (AFUC) benefits. These amendments require that the income and resources of any person who as the sponsor of an alien's entry into the United States, executed an affidavit or support or stallar agreement on behalf of the alien, and the income and resources of the supensor's spouse, shall be deemed CO be one income and resources or the alien under formulas for determining eligibility for SSI and AFDC benefits during the chrue years following the alien's entry into the United States. The eligibility of aliens for SSI and AFDC will be concingent upon their obtaining the cooperation of their sponsor in providing the necessary information and evidence CO enable the Social Security Admministration and State Welfare Agencies to carry our this provision. All alien applying for SSI or AFDC MUSC make available to the Social Security Administration and/or State Welfare Agency documentation concerning his income or resources of chose of his sponsors, including information which he provided in support of his application for an immigrant visa or adjustment of status. The Secretary of Health and Human Services is authorized CO obtain copies of any such documentation from other agencies. The Social Security ACC also provides that an alien and his or her sponsor shall be jointly and severally liable CO repay any SSI and KFDC benefics which are incorrectly paid because of misinformation provided by sponsor or because of sponsor's failure CO provide information, and any incorrect payments which are not repaid will be wichheld from any subsequent payments for which the alien or sponsors are ocherwise eligible under the Social Security ACC. These provisions do noc apply to allens admitted as refugees or granced political asylua by the Accorney General. They also will noc apply to the SSI eligibility of aliens who become blind or disabled after entry into the Uniced States. The AFDC provisions do not apply CO aliens who are dependent children of the sponsor or sponsor's spouse. I, YOLANDA MONTENEGRO DE HERRERA, residing ac 3160 S.W. 14 Street, No.1 (Name) (Street and Number) Miami, Fl. 33145 , acknowledge that I have read the above and am (City) aware of my responsibilities as an immigrant sponsor under the Social Security ACC as amended. This statement is submitted on behalf of the following persons: NAME SEX ACE COUNTRY OF MARRIED RELATIONSHIP BIRTH OK SINCLE TO SPONSOR CELIA ROSA MIRANDA F 85 Nicaragua Widowed Mother y delands Herrera"
}