{
  "anumber": "A43928228",
  "id": "A43928228_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43928228_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00-139-0058"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS NEW DELHI FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 4/7/93 CITY COUNTRY At the request of the American Consul at NEW DELHI INDIA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F M I certify that on the above date I examined WAZIR SINGH BATRA 1/1/07 WHO BEARS PASSPORT NO. ISSUED BY ON K803901 DELHI 27th, Feb. 92 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Gonorrhea Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Calcified lesions are present in the right lower zone. Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ DR. AGGARWAL 7thApr.93 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Xlegative Not Done Not Done TEST TYPE: TEST TYPE: VDRL ELISA METHOD DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY DR. N.P.S. CHawla 7th,Apr.93 DR. N.P.S. CHAWLA 7th,Apr.93 OTHER SPECIAL REPORT (S) (When needed) DOCTOR'S NAME (Please print) REMARKS : DEFECTIVE VISION CLASS B 3 : CALCIFIED LESIONS ARE PRESENT IN EARLY PARKINSONISM THE RIGHT LOWER ZONE. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and authorize the required tests to be completed. The information on this form refers to me. 4 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. N.P.S. CHAWLA 9th,Apr.93 NSN 7540-00-139-0058 50167 103 OPTIONAL FORM 157 U.S. Government Printing Office: 1991 - 286-971/20115 REVISED 2-88 DEPT. OF STATE"
}