{
  "anumber": "A43926807",
  "id": "A43926807_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43926807_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NONIMMIGRANT VISA APPLICATION"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 1. SURNAMES OR FAMILY NAMES (Exactly as in Passport) DO NOT WRITE IN THIS SPACE B774 B-1/B-2 MAX B-1 MAX 8.2 MAX SANDHU OTHER MAX 2. FIRST NAME AND MIDDLE NAME (Exactly as in Passport) Visa Classification CHANAN SINGH MULT OR Number Applications 3. OTHER NAMES (Maiden, Religious, Professional, Aliases) MONTHS No Validity 4. DATE OF BIRTH (Day, Month, Year) 7. PASSPORT NUMBER ISSUED JAN 11 1991 BY 7.7.1906 A625611 REFUSED ON BY ad 5. PLACE OF BIRTH (City, Province, DATE PASSPORT ISSUED Country) KHatkar UNDER SEC 21th INA 12.2.88 Halan Inc (PK) REFUSAL REVIEWED BY DV 6. NATIONALITY DATE PASSPORT EXPIRES INDIAN 11.3.93 L.O. CHECKED 8. HOME ADDRESS (Include apartment no., street, city, province, and postal zone) U.P.O KHatkar Kalan P.S BANGA TEH NEWONSHOW Very old, frail. 9. NAME AND STREET ADDRESS OF PRESENT EMPLOYER OR / son in us, SCHOOL (Postal box number unacceptable) NIL / son granthis 10. HOME TELEPHONE NO. 11. BUSINESS TELEPHONE NO. - in Payab 12. SEX Female 13. COLOR OF HAIR 14. COLOR OF EYES Male Grey BCAGE Alonegoing 15. COMPLEXION 16. HEIGHT 17. MARITAL STATUS For 1.75cm Married Single Us nm junctor, PRA, 18. MARKS OF IDENTIFICATION Widowed Maleon RT cie Divorced the 6 yes -> Separated 19. NAMES AND RELATIONSHIPS OF PERSONS TRAVELING 25. PRESENT OCCUPATION (If retired, WITH YOU (NOTE: A separate application must be made for a state past occupation) visa for each traveler, including children and infants.) NEZ NO 26. AT WHAT ADDRESS WILL YOU STAY 20. HAVE YOU EVER APPLIED FOR AN IMMIGRANT OR IN NONIMMIGRANT U.S. VISA BEFORE? THE U.S.A.? 35801 PLIME No Yes Where? DECIM Ria way FreMONT When? 11.4.88 CAL VEA Visa was issued Type of visa? 27. WHAT IS THE PURPOSE OF YOUR 13-1-1-3-2 Visa was refused TRIP? Tosee MG 21. HAS YOUR U.S. VISA EVER BEEN CANCELED? SON 28. WHEN 00 YOU INTEND TO ARRIVE No Yes IN THE U.S.A.? AS Sarman 22 Bearers of visitors visas may not work or study in the U.S. 29. HOW LONG 00 YOU PLAN TO STAY DO YOU INTEND TO WORK IN THE U.S.? No Yes IN THE U.S.A.? If YES, explain. 3 months 30. 00 YOU PLAN FUTURE TRIPS TO 23. 00 YOU INTEND TO STUDY IN THE U.S.? No Yes THE U.S.A.? IF SO, WHEN? If YES, write name and address of school as it NOT known appears on form 1-20. 31. HAVE YOU EVER BEEN IN THE U.S.A.? 24. WHO WILL FURNISH FINANCIAL SUPPORT, INCLUDING No Yes When? -11.4.88 TICKETS? For how long? -By Sporisors 6 months NONIMMIGRANT VISA APPLICATION COMPLETE ALL QUESTIONS ON REVERSE OF FORM"
}