{
	"anumber": "A43966574",
	"id": "A43966574_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 10/01/89) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 U.S. Department of Justice $75.00 Immigration and Naturalization Service (INS) Petition for Alien Relative Instructions Read the instructions carefully. If you do not follow the instructions, we may have to return your petition, which may delay final action. If more space is needed to complete an answer continue on separate sheet of paper. 1. Who can file? 4. What documents do you need? A citizen or lawful permanent resident of the United States You must give INS certain documents with this form to can file this form to establish the relationship of certain prove you are eligible to file. You must also give the INS alien relatives who may wish to immigrate to the United certain documents to prove the family relationship between States. You must file a separate form for each eligible you and your relative. relative. A. For each document needed, give INS the original and 2. For whom can you file? one copy. However, because it is against the law to A. If you are a citizen, you may file this form for: copy a Certificate of Naturalization, a Certificate of 1) your husband, wife, or unmarried child under 21 Citizenship or an Alien Registration Receipt Card years old (Form I-151 or I-551) give INS the original only. 2) your unmarried child over 21, or married child of Originals will be returned to you. any age B. If you do not wish to give INS the original document, 3) your brother or sister if you are at least 21 years you may give INS a copy. The copy must be certified old by: 4) your parent if you are at least 21 years old. 1) an INS or U.S. consular officer, or B. If you are a lawful permanent resident you may file this form for: 2) an attorney admitted to practice law in the United States, or 1) your husband or wife 2) your unmarried child 3) an INS accredited representative (INS may still Note: If your relative qualifies under instruction A(2) or require originals). A(3) above, separate petitions are not required for C. Documents in a foreign language must be his or her husband or wife or unmarried children accompanied by a complete English translation. The under 21 years old. If your relative qualifies under translator must certify that the translation is accurate instruction B(2) above, separate petitions are not and that he or she is competent to translate. required for his or her unmarried children under 21 years old. These persons will be able to apply for 5. What documents do you need to show you are a the same type of immigrant visa as your relative. United States citizen? 3. For whom can you not file? A. If you were born in the United States, give INS your You cannot file for people in the following categories: birth certificate. A. An adoptive parent or adopted child, if the adoption B. If you were naturalized, give INS your original took place after the child became 16 years old, or if the Certificate of Naturalization. child has not been in the legal custody and living with C. If you were born outside the United States, and you are the parent(s) for at least two years. a U.S. citizen through your parents, give INS: B. A natural parent if the United States citizen son or 1) your original Certificate of Citizenship, or daughter gained permanent residence through 2) your Form FS-240 (Report of Birth Abroad of a adoption. United States Citizen). C. A stepparent or stepchild, if the marriage that created D. In place of any of the above, you may give INS your this relationship took place after the child became 18 valid unexpired U.S. passport that was initially issued years old. for at least 5 years. D. A husband or wife, if you were not both physically E. If you do not have any of the above and were born in present at the marriage ceremony, and the marriage the United States, see instruction under 8 below. was not consummated. \"What if a document is not available?\" E. A husband or wife if you gained lawful permanent resident status by virtue of a prior marriage to a United States citizen or lawful permanent resident unless: 6. What documents do you need to show you are a 1) a period of five years has elapsed since you permanent resident? became a lawful permanent resident; OR You must give INS your alien registration receipt card 2) you can establish by clear and convincing (Form I-151 or Form I-551). Do not give INS a photocopy of evidence that the prior marriage (through which the card. you gained your immigrant status) was not entered into for the purpose of evading any provision of the immigration laws; OR 7. What documents do you need to prove family 3) your prior marriage (through which you gained relationship? your immigrant status) was terminated by the You have to prove that there is a family relationship death of your former spouse. between your relative and yourself. F. A husband or wife if he or she was in exclusion, deportation, rescission, or judicial proceedings In any case where a marriage certificate is required, if regarding his or her right to remain in the United States either the husband or wife was married before, you must when the marriage took place, unless such spouse has give INS documents to show that all previous marriages resided outside the United States for a two-year period were legally ended. In cases where the names shown on after the date of the marriage. the supporting documents have changed, give INS legal G. A husband or wife if the Attorney General has documents to show how the name change occurred (for determined that such alien has attempted or conspired example a marriage certificate, adoption decree, court to enter into a marriage for the purpose of evading the order, etc.) immigration laws. H. A grandparent, grandchild, nephew, niece, uncle, aunt, Find the paragraph in the following list that applies to the cousin, or in-law. relative for whom you are filing. Form I-130 (Rev. 10/01/89) Y"
}
