{
  "anumber": "A43966574",
  "id": "A43966574_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Explanation of Form SSA-827-OP1, Authorization For Source to Release Information to the Social Security Administration (SSA), Form SSA-827-OP1 ( (8-94) Use Prior Editions"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 Explanation of Form SSA-827-OP1, Authorization For Source to Release Information to the Social Security Administration (SSA) We are requesting that you authorize the release of information about your impairment to us. Sources usually require this authorization before releasing information to us. Also, the law requires this authorization for release of information about certain conditions. You can provide this authorization by signing a Form SSA-827-OP1, Authorization For Source to Release Information to the Social Security Administration (SSA), for each source identified during your disability interview or during the processing of your claim. We must inform you that because of various Federal disclosure laws, SSA cannot give an absolute pledge of confidentiality regarding information submitted in connection with your claim. PRIVACY ACT NOTICE The Social Security Administration is authorized to collect the information on this form under sections 205(a), 223(d) and 1631(e)(1) of the Social Security Act. The information on this form is needed by Social Security to make a decision on your claim. While giving us the information on this form is voluntary, failure to provide all or part of the requested information could prevent an accurate or timely decision on your claim and could result in the loss of benefits. Although the information you furnish on this form is almost never used for any purpose other than making a determination on your disability claim, such information may be disclosed by the Social Security Administration as follows: (1) To enable a third party or agency to assist Social Security in establishing rights to Social Security benefits and/or coverage; (2) to comply with Federal laws requiring the release of information from Social Security records (e.g., to the General Accounting Office and the Department of Veterans Affairs); and (3) to facilitate statistical research and audit activities necessary to assure the integrity and improvement of the Social Security programs (e.g., to the Bureau of the Census and private concerns under contract to Social Security). We may also use the information you give us when we match records by computer. Matching programs compare our records with those of other Federal, State, or local government agencies. Many agencies may use matching programs to find or prove that a person qualifies for benefits paid by the Federal government. The law allows us to do this even if you do not agree to it. Explanations about these and other reasons why information you provide us may be used or given out are available in Social Security offices. If you want to learn more about this, contact any Social Security office. Form SSA-827-OP1 (8-94) Use Prior Editions *U.S. Government Printing Office: 1996 - 404-816/40127"
}