{
	"anumber": "A43966574",
	"id": "A43966574_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NAA, 8/17/2023, I-1354"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 If you are filing for your: 10. Where should you file this form? A. A. husband or wife, give INS If you live in the United States, send or take the form to the INS 1) your marriage certificate office that has jurisdiction over where you live. 2) a color photo of you and one of your husband or wife, B. If you live outside the United States, contact the nearest taken within 30 days of the date of this petition. These American Consulate to find out where to send or take the photos must have a white background. They must be completed form. glossy, unretouched, and not mounted. The dimension of 11. What is the fee? the facial image should be about 1 inch from chin to top of You must pay forty dollars ($40.00) to file this form. The fee will hair in 3/4 frontal view, showing the right side of the face with the right ear visible. Using pencil or felt pen, lightly not be refunded, whether the petition is approved or not. DO print name (and Alien Registration Number, if known) on NOT MAIL CASH. All checks or money orders, whether U.S. or the back of each photograph. foreign, must be payable in U.S. currency at a financial institution in 3) a completed and signed G-325A (Biographic Information) the United States. When a check is drawn on the account of a for you and one for your husband.or wife. Except for name person other than yourself, write your name on the face of the check. and signature, you do not have to repeat on the G-325A If the check is not honored, INS will charge you $5.00. the information given on your I-130 petition. Pay by check or money order in the exact amount. Make the check B. child and you are the mother, give the child's birth certificate or money order payable to \"Immigration and Naturalization Service\". showing your name and the name of your child. However, C. child and you are the father or stepparent, give the child's birth certificate showing both parents' names and your marriage A. if you live in Guam: Make the check or money order payable to certificate. Child born out of wedlock and you are the father, \"Treasurer, Guam\", or give proof that a parent/child relationship exists or existed. For B. if you live in the U.S. Virgin Islands: Make the check or money example, the child's birth certificate showing your name and order payable to \"Commissioner of Finance of the Virgin evidence that you have financially supported the child. (A blood Islands\". test may be necessary). 12. When will a visa become available? D. brother or sister, your birth certificate and the birth certificate When a petition is approved for the husband, wife, parent, or of your brother or sister showing both parents' names. If you do unmarried minor child of a United States citizen, these relatives do not have the same mother, you must also give the marriage certificates of your father to both mothers. not have to wait for a visa number, as they are not subject to the E. mother, give your birth certificate showing your name and the immigrant visa limit. However, for a child to qualify for this category, name of your mother. all processing must be completed and the child must enter the United F. father, give your birth certificate showing the names of both States before his or her 21st birthday. parents, and your parents' marriage certificate. For all other alien relatives there are only a limited number of G. stepparent, give your birth certificate showing the names of immigrant visas each year. The visas are given out in the order in both natural parents and the marriage certificate of your parent which INS receives properly filed petitions. To be considered to your stepparent. H. adoptive parent or adopted child, give a certified copy of the properly filed, a petition must be completed accurately and signed, the adoption decree, the legal custody decree if you obtained required documents must be attached, and the fee must be paid. custody of the child before adoption, and a statement showing For a monthly update on the dates for which immigrant visas are the dates and places you have lived together with the child. available, you may call (202) 647-0508. 8. What if a document is not available? 13. What are the penalties for committing marriage fraud or If the documents needed above are not available, you can give INS submitting false information or both? the following instead. (INS may require a statement from the Title 8, United States Code, Section 1325 states that any individual appropriate civil authority certifying that the needed document is not who knowingly enters into a marriage contract for the purpose of available.) evading any provision of the immigration laws shall be imprisoned for A. Church record: A certificate under the seal of the church where not more than five years, or fined not more than $250,000.00 or both. the baptism, dedication, or comparable rite occurred within two months after birth, showing the date and place of child's birth, Title 18, United States Code, Section 1001 states that whoever date of the religious ceremony, and the names of the child's willfully and knowingly falsifies a material fact, makes a false parents. statement, or makes use of a false document will be fined up to B. School record: A letter from the authorities of the school $10,000 or imprisoned up to five years, or both. attended (preferably the first school), showing the date of 14. What is our authority for collecting this information? admission to the school, child's date and place of birth, and the names and places of birth parents, if shown in the school We request the information on the form to carry out the immigration records. laws contained in Title 8, United States Code, Section 1154(a). We C. Census record: State or federal census record showing the need this information to determine whether a person is eligible for names, place of birth, and date of birth or the age of the person immigration benefits. The information you provide may also be listed. disclosed to other federal, state, local, and foreign law enforcement D. Affidavits: Written statements sworn to or affirmed by two and regulatory agencies during the course of the investigation persons who were living at the time and who have personal required by this Service. You do not have to give this information. knowledge of the event you are trying to prove; for example, the However, if you refuse to give some or all of it, your petition may be date and place of birth, marriage, or death. The persons making denied. the affidavits need not be citizens of the United States. Each affidavit should contain the following information regarding the 15. Reporting Burden. person making the affidavit: his or her full name, address, date Public reporting burden for this collection of information is estimated and place of birth, and his or her relationship to you, if any; full to average 30 minutes per response, including the time for reviewing information concerning the event; and complete details instructions, searching existing data sources, gathering and concerning how the person acquired knowledge of the event. maintaining the data needed, and completing and reviewing the 9. How should you prepare this form? collection of information. Send comments regarding this burden A. Type or print legibly in ink. estimate or any other aspect of this collection of information, including B. If you need extra space to complete any item, attach a suggestions for reducing this burden, to: U.S. Department of Justice, continuation sheet, indicate the item number, and date and sign Immigration and Naturalization Service (Room 2011), Washington, each sheet. D.C. 20536; and to the Office of Management and Budget, C. Answer all questions fully and accurately. If any item does not Paperwork Reduction Project, OMB No. 1115-0054, Washington, apply, please write \"N/A\". D.C. 20503. It is not possible to cover all the conditions for eligibility or to give instructions for every situation. If you have carefully read all the instructions ar still have questions, please contact your arest INS office."
}
