{
  "anumber": "A43926807",
  "id": "A43926807_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43926807_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INDIA, 2RS"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1919,
        2002,
        1906,
        1904,
        1926
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "2RS PINDIAS CBC CEE MORE MORE RUPEES >TWO RUPEES AFFIDAVIT (a) His full name Mahant Amar Dass s/o Chia Panchamdas (b) His full address -V.Khatkarkalan (Jullundur) (c) His qualification for Personalit attended the marriage executing affidavit (d) His profession Landlord (e) Length of time he has Husband since birth known husband/wife Wife since marriage (f) His relationship, if any Village Friend (g) His place & date of birth V. .Hargna(Ludhiara) 7.7.1904 ABOUT THE CEREMONY (a) Exact place of marriage V.Bajo Mazra(Ludhiana) pb, India. (b) Exact date of marriage 7.6.1926 (c) Religious rites performed Sikh Rites (d) Name & qualification of granthi Nikka Sinch of V. Sajomazra person officating. now dead, ABOUT THE HUSBAND (a) His full name CHANAN SINCH SANDHU (b) His date of birth 7.7.1906 (c) His place of birth Khatkarkalan (Jullundur) (d) His full address in India V.Khatkarkalan(Jullundur) (e) His full address abroad N.A. (f) His father's name KHUSHALSINCH SAND!U (g) His caste Jat sikh (h) Whe ther he has be en marri- ed before? NO ABOUT THE WIFE (a) Her full name CURBACHAN KAUR (b) Her date of birth 20.1.1919 (c) Her place of birth V. Sanjon \"azara(Luchiana) (d) Her full address in India V.Sanjon Mazera(Ludhiana) (e) Her full address abroad N.A. (f) Her father's name CHANAN SINCH GHARE (a) Her Caste SINGH Jatssikh (h) Whether she has been marr- ied before? NO ABOVE IS true to the best of my knowledge and belief and nothin led and no part of it is - false. 01/32/2002 Central Gove station:- (Mahant AMAR DASS) Dated:::- 'Adjurer' I know and the Affidavlt Attested identifier NOTARY, Nawa Tiahar gb. (India) Tosheethin"
}