{
	"anumber": "A43966574",
	"id": "A43966574_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Authorization for Source to Release Information to the Social Security Administration ( SSA-827-0P1 ( (8-94)"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 RESIDENTS OF CALIFORNIA TO BE COMPLETED BY SSA NUMBER HOLDER further authorize, by my signature below, a private photocopy company as approved by the Social Security Muzaffar Khan Administration or the State Agency, to photocopy all medical SOCIAL SECURITY NUMBER records needed as evidence in determining my eligibility for SSA and/or SSI benefits. I also understand that I have a right to receive a copy of this authorization upon request. Copy 623-70-6885 request and received. EMPLOYEE/CLAIMANT/BENEFICIARY (If other than Number Holder) Yes No AUTHORIZATION FOR SOURCE TO RELEASE INFORMATION TO THE SOCIAL SECURITY ADMINISTRATION (SSA) INFORMATION ABOUT MEDICAL OR OTHER SOURCE-PLEASE PRINT, TYPE, OR WRITE CLEARLY NAME AND ADDRESS OF SOURCE (Include Zip Code) RELATIONSHIP TO DISABLED PERSON INS - New YORK INFORMATION ABOUT DISABLED PERSON-PLEASE PRINT, TYPE, OR WRITE CLEARLY NAME AND ADDRESS (If known) AT TIME DISABLED PERSON DATE OF BIRTH DISABLED PERSON'S I.D. NUMBER HAD Zip Code) 43.6 CONTACT Elmlt 1/1/03 (If known and different than SSN) (Clinic/Patient No.) APPROXIMATE DATES OF DISABLED PERSON'S CONTACT WITH SOURCE (e.g. dates of hospital admission, Milpitas 95035 treatment, discharge, etc.) TO BE COMPLETED BY DISABLED PERSON OR PERSON AUTHORIZED TO ACT IN HIS/HER BEHALF GENERAL AND SPECIAL AUTHORIZATION TO RELEASE MEDICAL AND OTHER INFORMATION IN ACCORDANCE WITH THE PROVISIONS OF THE SOCIAL SECURITY ACT; THE PUBLIC HEALTH SERVICE ACT, SECTIONS 523 AND 527; AND TITLE 38 U.S.C. VETERANS BENEFITS, SECTION 4132. I hereby authorize the above-named source to release or disclose to the Social Security Administration or State agency the following information for the period(s) identified above: 1) All medical records or other information regarding my treatment, hospitalization, and/or outpatient care for my impairment(s), including psychological or psychiatric impairment(s), drug abuse, alcoholism, sickle cell anemia, or human immunodeficiency virus (HIV) infection, including acquired immunodeficiency syndrome (AIDS), or tests for HIV; 2) Information about how my impairment(s) affects my ability to complete tasks and activities of daily living; 3) Information about how my impairment(s) affected my ability to work. I authorize the use of a telefax or photocopy of this form for the release or disclosure of the information described above. I understand that this authorization, except for action already taken, may be voided by me at anytime. If I do not void this authorization, it will automatically end when a final decision is made on my claim. If I am already receiving benefits, the authorization will end when a final decision is made as to whether I can continue to receive benefits. READ IMPORTANT INFORMATION ON REVERSE BEFORE SIGNING FORM BELOW. SIGNATURE OF DISABLED PERSON OR PERSON RELATIONSHIP TO DISABLED DATE AUTHORIZED TO ACT IN HIS/HER BEHALF PERSON (If other than self) 9/3/26 STREET ADDRESS TELEPHONE NUMBER (Area Code) CITY STATE ZIP CODE The signature and address of a person who either knows the person signing this form or is satisfied as to that person's identity is requested below. This is not required by the Social Security Administration, but without it the source may not honor this authorization. SIGNATURE OF WITNESS STREET ADDRESS CITY STATE ZIP CODE Form SSA-827-OP1 (8-94) Use Prior Editions (OVER) Printed on recycled paper"
}
