{
	"anumber": "A43928228",
	"id": "A43928228_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43928228_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 4/11/91) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1929, 1992, 1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 U.S. Department of Justice IRS 1993082002 Immigration and Naturalization Service S) TX OMB #1115-0054 Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR E) C Action Stamp A# APPROVED 10/28/92 LNS DIRECTOR WAC-93-019-50302 MEG001 G-28 or Volag # JAN 1993 Section of Law 201 (b) spouse 203 (a)(1) butder Petition was filed on OCT 27 1992 (priority date) 201 (b) child 203 (a)(2) Personal Interview 10 201 (b) parent NA 3888 Previously Forwarded 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) AM CON: NWD Field Investigations I-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: 201(b)(2)(A)(I) A. Relationship docs with WAC 93.019.50307 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence II Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien rela 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) BATRA BHUPINDER SINGH (Middle) BATRA, WAZIR SINGH 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) 11220 BIGELOW STREET (Apartment Number) T.2404, FAIZ ROAD (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) CERRITOS CA (State/Country) (ZIP/Postal Code) 90701 KAROL BACH NEW DELHI INDIA 3. Place of Birth (Town or City) (State/Country) KHUSHAB - 3. Place of Birth (Town or City) INDIA (Now PAK). (State/Country) NAALI 4. Date of Birth 5. Sex 6. Marital Status PUNJAB. INDIA (NOW PAK) 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 1.18.31 (Mo/Day/Yr) Male Married Single PKST Female Widowed Divorced 1-1-1907 Female Widowed 7. Other Names Used (including maiden name) Divorced N/A 7. Other Names Used (including maiden name) WAZIR SINGH 8. Date and Place of Present Marriage (if married) 8: Date and Place of Present Marriage (if married) 3.12.59 JULLUNDER (INDIA) JULY 21, 1929 NAUSHERA. 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) 9. Social Security Number 10. Alien Registration Number (if any) - N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) No. 14730502 9thoct. Los ANGELES. she last arrived as a (visitor, student, slowaway, without inspection, etc.) N/A Parents Arrival/Departure Record (1-94) Number Have you obtained a certificate of citizenship in your own name? Date arrived (Month/Day/Year) Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued N/A 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/A Date this employment began (Month/Day/Year) and class of admission N/A N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED OCT 27 1992 Rec'd Sent Approved Denied Returned Form 1-130 (Rev. 4/11/91) Y mm"
}
