{
	"anumber": "A43966574",
	"id": "A43966574_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Freedom of Information Act ((b)(6), FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1992, 2023, 1930, 1943]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "PAGE 2 Screened by NARA 8/17/2023 16. PERSON(S) NAMED IN ANY OR FOLLOW ME TO THE UNITED STATES. 17. NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) Ali AKBAR KHAN Died, 1943 18. MAIDEN NAME OF MOTHER. DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) PyARi JAN Died 1930 19 IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY. FOIA (b)(6) 20. LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE LANGUAGE SPEAK READ WRITE URDII PUNJABI NiL NiL 21. LIST BELOW ALL PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE. CITY OR TOWN PROVINCE COUNTRY OCCUPATION DATES (FROM/TO) NiL Nil NiL Nil NIC 22. LIST ANY POLITICAL, PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTALITARIAN, TERRORIST OR NAZI ORGANI- ZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY. NAME AND ADDRESS FROM/TO TYPE OF MEMBERSHIP NiL NiL NiL 23. LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES. (If never, so state) GIVE TYPE OF VISA STATUS IF ANY. GIVE I.N.S. \"A\" NUMBER IF ANY. LOCATION FROM/TO VISA I.N.S. FILE NO. (If known) Nil Nil Nil Nil SIGNATURE OF APPLICANT DATE abr 21/12/93 NOTE: Return this completed form immediately to the consular office address on the covering letter. This form will become part of your immigrant visa and your visa application cannot be processed until this form is complete. Public reporting burden for this collection of Information Is estimated to average 24 hours per response, Including time required for searching existing data sources, gathering the necessary data, providing the Information required, and reviewing the final collection. Send comments on the accuracy of this estimate of the burden and recommendations for reducing It to: Department of State (OIS/RA/DR) Washington, D.C. 20520-0264 and to the Office of Information and Regulatory Affairs, Office of Management and Budget, Paperwork Reduction Project (1405-0015), Washington, D. C. 20503. *U.S. Government Printing Office: 1992 - 312-071/50035"
}
