{
  "anumber": "A43966574",
  "id": "A43966574_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43966574_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND REGISTRATION, 230 Part I ( BIOGRAPHIC DATA"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1903,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 OMB APPROVAL NO. 1405-0015 EXPIRES: 8-31-92 ESTIMATED BURDEN: 1 HOUR APPLICATION FOR IMMIGRANT VISA ANL GISTRATION PART I - BIOGRAPHIC DATA INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not Applicable should be so marked. If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent explusion from the United States. This form (OF-230 PART I) is Part I of two parts which, together with Optional Form OF-230 PART II, constitute the complete Application for Immigrant Visa and Alien Registration. 1. FAMILY NAME FIRST NAME MIDDLE NAME RAJA MUZAFFAR KHAN 2. OTHER NAMES USED OR BY WHICH KNOWN (If married woman, give maiden name) NiL 3. FULL NAME IN NATIVE ALPHABET (If Roman letters not used) 4. DATE OF BIRTH 5. AGE 6. PLACE OF BIRTH (Day) (Month) (Year) (City or town) (Province) (Country) 1903 90 year Rawal Pindi Punjab Pakistan. 7. NATIONALITY (If dual national, 8. SEX 9. MARITAL STATUS give both) Male Single (Never married) Married Widowed Divorced Separated Pakistam Female Including my present marriage, I have been married one times. 10. PERSONAL DESCRIPTION 11. OCCUPATION a. Color of hair WHITE C. Height 67 cm b. Color of eyes BLACK d. Complexion RETAIRED FROM ARMY 12. MARKS OF IDENTIFICATION 13. VILLAGE, PRESENT ADDRESS PERCHHAN P.O. KoTRi SATTIAN Mark on left eyes RAIVAL PiNDi, PAKISTAN. Telephone number: Home 4279841 R.Pinnottice Nil 14. NAME OF SPOUSE (Maiden or family name) (First name) (Middle name) Date and place of birth of spouse: makber Jan Raj'a Address of spouse (If different from your own): 15. IST NAME, DATE AND PLACE OF BIRTH, AND ADDRESSES OF ALL CHILDREN NAME FOIA (b)(6) M AS GAR TEHSil KOTLI. STATION FOIA (b)(6) THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA OPTIONAL FORM 230 Part I (ENGLISH) NSN 7540-00-130-8317 REVISED 4-91 50230(1)-101 Previous editions obsolete DEPT. OF STATE"
}