{
	"anumber": "A44052464",
	"id": "A44052464_0039",
	"page_index": 39,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0039/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 10/01/99) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1907, 1937, 1973, 1993, 2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Servic NS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# APPROVED I.N.S RAC DIRECTOR 01/22/93 EAC-93-081-50140 MAH001 G-28 or Volag # APR 16 1993 Section of Law: Petition was filed on: 1.19.93 (priority date) 201 (b) spouse 203 (a)(1) Recommende Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) 201 (b) parent 203 (a)(4) EAC 5995 Pet. Ben. \"A\" File Reviewed Stateside Criteria 208 (a)(5) Field Investigations I-485 AM Remarks: CON: Britay 204 (a)(2)(A) Resolved 204 IRS A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) DESAI DRUPAD BATUKLAL DESAI, BATUKLAL CHAAGANLAL 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 13459 SORGHUM COURT 501, RAMLAXMI NIVAS ,16th ROAD (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) HIGHLAND MARYLAND U.S.A 20777 KHAR, BOMBAY - 400052 , INDIA IND 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) IND AHMEDABAD INDIA. AHMEDABAD INDIA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single JANUARY 8, 1940 Female Widowed Divorced AUGUST 31,1907 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) DRU BATUK 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) BUGUST 13. 1966 BALTIMORE. MARYLAND DECEMBER 1937. AHMEDABAD INDIA a Social Security Number 10 Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wife 12. Date(s) Marriage(s) Ended N/A N/A PRIYAMVADA Non. 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., comple te the following: He or Naturalization (Give number of certificate, date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) 9711624 october 9,1973, Montgomery County N/A <05 mm Parents Rockville, Manyland Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) or Have you obtained a certificate of citizenship in your own name? D Yes No Date authorized stay expired, or will expire, as shown on Form 1-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued. 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: NONE Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: N/A N/A 16. Has your relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y"
}
