{
  "anumber": "A44052464",
  "id": "A44052464_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0035/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS FOR BOMBAY UNITED UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 1993617072 / 8.16.93 CITY At the request of the American Consul at BOMBAY COUNTRY INDIA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) I certify that on the above date I examined DESAI BATUKLAL CHHAGANLAL 8.31.07 F X M WHO BEARS PASSPORT NO. ISSUED BY ON L 827121 BOMBAY 25.6.92 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphillis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurence of One or Mental Defect Instanity More Attactks of Insanity Narcotic Drug Addiction Sexual Deviation Phychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS instructions) CHEST X-RAY REPORT No reaction X Normal Abnormal Not Done Reaction mm Describe findings: SEEN Not Done DOCTOR'S NAME (Please print) - DOCTOR'S NAME (Please print) DR. ANIRUDH KOHLI 16 DATE READ AUG ,443 DATE READ - SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANITBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) X Negative Nonreactive TEST TYPE: RAHN TEST NELATIVE Not Done Not Done HTLV (III) ANTIBODIES NOT DETECTED TEST TYPE: DOCTOR'S NAME (Please print) DR (MRS) F.E. PALIA 16 DATE READ 93 DOCTOR'S NAME (Please print) 11 AUG READY DATE READY DR (MRS) F. E. PALIA OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS Moderate deafness. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me j Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. B. M. MEHERHOMJI Anthony 17 AUG :993 GPS 5,000/3-93 50157 OPTIONAL FORM 157 REVISED 2-88 GPO : 1989 0 - 226-954 DEPT. OF STATE"
}