{
	"anumber": "A44052464",
	"id": "A44052464_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0002/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 OPTIONAL FORM 155A (REV. 11-95) DEPT OF STATE NSN 7540-01-126-7761 50155-206 UNUVEDSTAVVESOFAMERICA IV-45,792,898 IMMIGRANT VISA AND ALIEN REGISTRATION (Family Name) (First Name) (Middle Name) DESAI, BATUKLAI CHHAGANLAL INS FILE #. IF KNOWN A44052464 ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATES VIA (Name of vessel or flight no. of arrival) U.S. IMMIGRATION BA 283 GENDER 160 LOS 4202 MALE CITY AND COUNTRY OF BIRTH DAY-MO-YR OF BIRTH APR 2.6 1997 AHMEDABAD, INDIA 31AUG1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED SB, MUMBAI, IND INDIAN (CLASS) MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME MARRIED RAMLAXMIBEN CHHAGANLAL FINAL ADDRESS STREET ADDRESS, INCLUDE - IN CARE OF & APT# IF APPLICABLE CITY. STATE, AND ZIP CODE IN THE UNITED STATES D B DESAI 13459 SORGHUM COURT HIGHLAND, MD 20777 SEC. 212(a)(5)(A) OCCUPATION NOT APPLICABLE UNR RETIRED This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL SB1 FOREIGN STATE/OTHER AREA LIMITATION AT MUMBAI INDIA BMB199710600101 45792898 Kerem Bilge ISSUED ON (Day) (Month) (Year) Vice Consul Consular Officer of lhe United States of America 24APR1997 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 2 21AUG1997 PASSPORT NO. L 827121 OR OTHER TRAVEL DOCUMENTS (Describe) RESE PROCESSED FOR 1.551. TOGRAPH TEMPORARY EVIDENCE OF FOREIGN SERVIDE LAWFUL ADMISSION FOR PERMANI NT RESIDENCE UNITED STATES\" VALID UNTIL APR 25,199 Tariff No. 21 Fee Paid $ EMPLOYMENT AUTHORIZED or Local Currency Equivalent IV-45792898 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S."
}
