{
	"anumber": "A44052464",
	"id": "A44052464_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "JP TIONAL FORM 155A, (REV. 6-91) DEP OF STATE 0-01-126-7761 50155-204 IV-44052464 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN DESAI, BATUKLAL CHHAGANLAL ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION HER IMMIGRATION LH 402 9/4/93 212(e) 212(h) sig NEW 202 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH SEP 04 1993 AHMEDABAD INDIA 31AUC1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED IR-5 BOMBAY IND INDIAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME A 44052464 M S W D SEP RAMLAXMIBEN CHHAGANLAL FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES D B DESAI 13459 SORGHAM CT MARYLAND, MD 20777 SEC. 212 (a) (5) (A) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED UNR RETIRED This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL IR5 FOREIGN STATE/OTHER AREA LIMITATION AT BOMBAY INDIA JAMES James M. WALLER. M. WAller BMB 199361707201 44052464 ISSUED ON (Day) (Month) (Year) VICE CONSUL. Consular Officer of the United States of America 27AUG1993 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 24DEC1993 PASSPORT NO. L 827121 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED PHOTOGRAP ATTACH FOREIGN SERVICE UNITED STATES OF AMERICA Tariff No. 21 Fee Paid $ or Local Currency Equivalent IV-44,052A64 PROCESSED FOR ACTION OF I.J. ACTION ON APPEAL EVIDENCE OF LAWF ADMISSION FOR Info given to IRS on date of 1-551 PERMISSION Name, Aodr VALIClass of Adm AUTHORIZE Occup & answers to Form 9003 )-88) GPO : 1991 DEPT. OF STATE Previous editions obsolete 50230(1)-101"
}
