{
	"anumber": "A44052464",
	"id": "A44052464_0066",
	"page_index": 66,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0066/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service, EAC 93 081 501440"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1925, 1953, 2023, 1963, 1993, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 8 Immigration and Naturalization Service Eastern Service Center 75 Lower Welden Street St. Albans, VT 05479-0001 Re: EAC 93 081 50140 I-130 Petition for Alien Relative Beneficiary: Desai, Batuklal Chhaganlal Applicant: Desai, Drupad Batuklal To whom it may concern, I, Upendra D. Desai, of Lanham, Maryland, a naturalized citizen of the United States of America, residing at 6309 Merna Lane, Lanham, Maryland 20706, do hereby solemnly affirm, declare and state as under: 1. I was born on March 10, 1925, in Amod, Gujarat, India. 2. Mr. Drupad Batuklal Desai is a friend of our family. I have known his father, Mr. Batuklal Chhaganlal Desai, who resides at 501 Ramlaxmi Nivas, 527A 16th Road, Khar (West) Bombay-52, India, for approximately forty (40) years. I know Batuklal Chhaganlal Desai because he was a client of my father, a building contractor. In 1953, my father built Mr. Batuklal Chhaganlal Desai's house at 527A 16th Road, Khar (West) Bombay-52, India. I visited Mr. Batuklal Chhaganlal Desai and his family in Bombay in 1959, and at his home in Khar(West) prior to my immigrating to this country to work at Goddard Space Flight Center, NASA. 3. I am in personal contact with Mr. Drupad Batuklal Desai since January 1963, when he moved to Baltimore, Maryland. I, Upendra D. Desai, attest that Mr. Drupad Batuklal Desai is the son of Mr. Batuklal Chhaganlal Desai and Mrs. Priyamvada Batuklal Desai. I attended the wedding of Mr. Drupad Batuklal Desai in August 1966, where his mother was present. Solemnly affirmed at Lanham, Maryland upendva D Dasan on March 21, 1993 Upendra D. Desai"
}
