{
  "anumber": "A44052464",
  "id": "A44052464_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SOCIAL SECURITY AND INCOME TAX IN THE UNITED STATES, A-126 of 2/22/84: 84 STATE 123570 OF 4/27/844"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 SOCIAL SECURITY AND INCOME TAX IN THE UNITED STATES SOCIAL SECURITY - (THE SOCIAL SECURITY ADMINISTRATION) The Social Security Act and related laws establish a number of programs which have the basic objectives of providing a continuing income when family earnings are reduced or stop because of retirement, disability or death. It is in your interest to be covered by Social Security. Although almost all jobs are covered by Social Security, there are special rules which apply to some. The Social Security Administration can tell you about these special rules and to which jobs they apply. You need a Social Security Number if you work is to be covered by Social Security or if you have certain kinds of taxable income. When you apply for a Social Security Number the law requires that you furnish evidence of your date of birth, identity and U.S. citizenship or lawful permanent residence admission status. If you are age 18 or older and have never had Social Security Number Card, you must apply in person at your nearest Social Security Office as soon as possible. The number on your card is used to keep a record of your earnings and it is also used for federal Income Tax purpose. You only need one Social Security Number during your lifetime. You can apply for a Social Security Number at any one of the 1300 Social Security Offices located throughout the United States. At the time, the Social Security Administration. Office will be glad to give you additional information about the Social Security programs in the United States. To find the address of their nearest office, look in the phone directory in the U.S. Government Section under \"Social Security Administration\", or ask your office. INCOME TAX-(THE INTERNAL REVENUE SERVICE) All aliens who obtain an immigrant visa and emigrate to the United States to take up permanent residence are classified as resident aliens for income tax purpose and are taxed on their income from all sources both within and outside the United States, the same as U.S. citizens. As a resident alien of the United States you are required by law to file a tax return each year with the Internal Revenue Service (IRS). With few exceptions, resident aliens must obtain a taxpayer identification number on their federal income tax return. You are required to apply for this number when you start earning income subject to federal taxes. This taxpayer identification number is your Social Security Number which you can apply for at the nearest Social Security Administration Office. As tax laws are complex, you should contact the Internal Revenue Service for assistance and guidance after your arrival in the United States. To find the nearest IRS office, look in the phone directory in the U.S. Government Section under 'Internal Revenue Service.\" A-126 of 2/22/84: 84 STATE 123570 OF 4/27/84"
}