{
	"anumber": "A44052464",
	"id": "A44052464_0059",
	"page_index": 59,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0059/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 8/17/2023, BIRLA VISHVAKARMA MAHATODAYA VALLABH SINGH"
		},
		"years": {
			"ms_years_nlp_v1": [1960, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Tel. are BIRLA VISHVAKARMA MAHAVIDYALAYA ENDINEERING DOLARGER VALLABE VIDYAKAGA 4221 of 1959 whereas 10th December 1959 This is to certify that Mr. Drupad Batuklal Desai X * bonafide student of this College studying in the B.L. (GETT) of the Degree course in Civil Engineering for the YORK 1959-60 HC with be appearing for his B.E. (Civil) examination of the Sarday Vallabhbhai Vidyapeeth (University) to be hold in April 1960 in which he is expected to do well. Mr. Deaal has been known to me intimately for the last three years. HC is a keen and intelligent pupil and takes intelligent interest in \"11 his work. He has done well in and him University examinations. After obtaining his degree in this country he Lntends going abroad for further studies in Transport Engineering or Advanced Construction in a foreign University IS consider him capable to take up such course and he will be profitted by such studys He has a good command of English language. as the medium of instruction of this College is English Mr. Desai also takes active part in the extre-curricular activities of the College. He is an elected Chairman of the students! Chapter for this year. He was also member of the organising Committee in Dramatic functions and took active part in dramas, and won prise. He also represented our College for #12 the three years in the Inter-collegiate Badminton tournaments and particularly this year he lead the College team and was sent to play coaching matches at Baroda. I am confident Mr. Desai will do well at any foreign University which admits him for an advanced course. To the best of my knowledge Mr. Desai bears a good moral character. R.H. chokhava PRINCIPAL RIRLA VISHVAKARMA MAHAVLDYALAYA"
}
