{
	"anumber": "A44154337",
	"id": "A44154337_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "STATUTORY DECLARATION, A SOLICITOR AUTHORIZED TO ADMINISTER OATHSS."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United Kingdom", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1928, 1955, 1992, 1931, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 STATUTORY DECLARATION I RASHIKLAL MLSHANKER TRIVEDY OF 15 GRASSIOT ROAD TOOTING BROADWAY, LONDON SW17, pensioner DO HEREBY SOLEMNLY AND SINCERELY DECLARE AS FOLLOWS:- 1. THAT I HAVE KNOWN CHHAGANLAL NATHUBHAI VYAS SINCE 1928 AND HE IS PRESENT RESIDING IN THE UNITED KINGDOM AT 11 ELGIN ROAD, SEVENKINGS, ILLFORD, ESSEX 1G3 8LM. I AM ALSO ACQUAINIED WITH SAVTABEN LAXISHANKER RAVAL. 2. CHHAGANLAL NATHUBHAI VYAS WAS MARRIED TO SAVITABEN LAXISHANKER RAVAL AT A MARRIAGE CEREMONY SOLEMNISED ON THE 30th MARCH 1931, ACCORDING TO THE CUSTOMS AND RITES APPERTAINING TO THE HINDU FAITH AS BOTH PARTIES BELONG TO THE HINDU FAITH. 3. THE SAID MARRIAGE BETWEEN CHHAGANLAL NATHUBHAI VYAS AND SAVITABEN LAXMISHANKER RAVAL TOOK PLACE AT SHAPUR VILLAGE IN THE STATE OF GUJRAT IN INDIA. I ATTENDED THE MARRIAGE AS A MEMBER OF THE GROOMS WEDDING PARTY. THE MARRIAGE CEREMONY WAS IN ACCORDANCE WITH HINDU CUSTOM, WITH BOTH PARTIES TO THE MARRIAGE ENCIRCLING THE SACRED FAIRER SEVEN TIMES WHILST THE PRIEST RECTIED FROM THE GITA (HOLY BOOK). AFTER THIS THE PARTIES WERE PRONOUNCED MAN AND WIFE. THEREAFTER THE RELATIVES AND FRIENDS OF THE COUPLE OFFERED THEIR CONGRATULATIONS AND GARLANDED THE COUPLE. 4. THAT I AM ADVISED AND VERILY BELIEVE THAT THE SAID MARRIAGE CEREMONY COMPLIED WITH THE REQUIREMENTS OF THE HINDU FAITH RELATING TO HINDU MARRIAGES. 5. THAT I AM FURTHER ADVISED AND VERILY BELIEVE THAT THE SAID MARRIAGE WAS FOR ALL PURPOSES A VALID MARRIAGE UNDER THE HINDU MARRIAGES ACT 1955 OF INDIA AND WOULD BE SO RECOGNISED IN THE COURTS OF INDIA. 6. AND I MAKE THIS SOLEMN DECLARATION BELIEVING THE CONTENTS OF THE SAME TO BE TRUE. DECLARED ) Rasikl al. M. TRIVEDY National was truste ) Bank Chambes ) London SW 170TH ) ) THIS 23rdDAY OF Decembe 1992 Roys Goral BEFORE ME Kenwright & Can Solicitors, National Westminster Bank Tooting Broadway, SW17 OTF A SOLICITOR AUTHORISED TO ADMINISTER OATHS."
}
