{
	"anumber": "A44182040",
	"id": "A44182040_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44182040_0019/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00--139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1993, 2023, 1992]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS E1 Salvador FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) March 16, 1993 CITY COUNTRY At the request of the American Consul at San Salvador E1 Salvador NAME (Last in CAPS) Carmen (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) I certify that on the above date I examined Avila vda. de Barrera Camila del F M WHO BEARS PASSPORT NO. 7/25/1907 ISSUED BY ON 0952089 D.General de M. San Salvador GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Gonorrhea Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Ingulnale Human Immunodeficiency Hansen's Disease, Not Infectious Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Insanity Mental Defect See remarks. More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm There are osteoarthritic changes in the Not Done right shoulder. There is elevation of the left diaphragm. DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ Victor M. Esquivel 3/15/93 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: V.D.R.L. TEST TYPE: ELISA, DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Lab. Alvarez Aleman 3/15/93 Lab. Alvarez Aleman 3/15/93 OTHER SPECIAL REPORT(S (When needed) DOCTOR'S NAME (Please print) REMARKS The physical examination revealed: bilateral hearing defect, she wears amplifier in the right ear. She wears glasses, there was loss of the visual acuity in the right eye. There was reduction of visual acuity in the left eye, as a result of cataract. There was excessive outward curvature of the spine in the thoracic region (Kyphosis). The chest-x-ray showed osteoarthri- tic changes in the right Shoulder APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. Camelade Bothars 3/16/93 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Dr. RENE MOLINA URRUTIA Rene Molina Urrutia. MEDICO 3/16/1993 NSN 7540-00-139-0058 50157-103 San Salvador, EI Salvador, C. A. OPTIONAL FORM 157 REVISED 2-88 U.S. GOVERNMENT PRINTING OFFICE : 1992 0 - 316-148 DEPT. OF STATE"
}
