{
  "anumber": "A44154337",
  "id": "A44154337_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0072/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CONTINUANCE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 OF Direct all responses by mail to the office listed below: IMMIGRATION AND INATURALIZATION SERVICE 9403 Tradeport Drive Orlando FL 32827 U.S. Department of Justice 97 YEARS old Immigration and Naturalization Service Refer to this file: SSC*000 473034 Alien Number: A 44154334 Date: DEC 04 2003 Officer: Mary Schneider CONTINUANCE Examination of your N400 application shows that additional information, documents or forms are needed before your application can be acted upon. Please return this letter with the requested information and/or documents by JANUARY 30, 2003 Failure to do so may result in the denial of your application. Submission of this information, however, does not guarantee that this case will be approved. We strongly recommend that you submit all the requested information, documents, or forms as listed on the following pages as soon as possible so that we can resume processing. Any interim benefits that may otherwise stem from the filing of this application or petition will be delayed while this case is in suspense awaiting your response. If you choose to submit only some or none of the requested information, then the application will be adjudicated on its merits. You may also request, in writing, to the Service that this application be withdrawn. If the district director consents to the withdrawal, the application will be denied without further notice to you and without prejudice to any future application. The withdrawal will constitute a waiver of any review pursuant to Section 336 of the Title 8 Code of Federal Regulations. If the district director does not consent to the withdrawal, then the application shall be adjudicated on its merits. One photo copy, front and backside of your resident alien card (green card) Two (2) INS color photos, 3/4 frontal with right ear showing on white background Copy of your signed IRS tax returns (signature copy) and copies of attached W-2s for each individual shown on the tax returns, [available from the IRS], for the years: : Certified copy of the Petition for Divorce and the Final Divorce Decree from Certified copy of the birth certificate for all of your children / for your child Proof of your child support for all your children / or for A list of all absences from the United States from to the present date Copies of all pages of your old and new passports Copy of your U. S. citizen spouse's naturalization certificate Copy of your certificate of marriage to Application Support Center fingerprint appointment See attached request Completed page 6 of NYOO N648 Form N-14 (Rev. 9/16/97)"
}