{
	"anumber": "A44154337",
	"id": "A44154337_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0042/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-44,154337"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 1994]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OPTIONAL FORM 155A (REV. 6-91) FCO - MIA DEPT. OF STATE NSN 7540-01-126-7761 50155-204 IV-44,154,337 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #. IF KNOWN VYAS. CHHAGANLAL NATHUBHAI ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U.S. IMMIGRATION ULE 725 212(e) 212(h) & OALANDO #76 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH SEP 01 1993 PIPALTA INDTA 06FEB1906 IRS CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY ADMITTED SEVEN KINGS. GRBR BRITISH UNTIL INDEFINITELY MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP NATHUBHAI VYAS X DECEASED DECEASED FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES 8616 WHISPERING WILLOW CT ORLANDO, FL 32811 SEC. 212 (a) (5) (A) OCCUPATION SEX LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED UNR RETIRED This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT LONDON, ENGLAND INDIA L. P Noyee LND199354701101 44154337 ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 25MAY1993 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 21SEP1993 PASSPORT NO. 007699226 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED ON SERVICE UNITED STATES OF AMERICA Tariff No. 21 Fee Paid $ IV-44,154,337 or Local Currency Equivalent PROOF ACTION OF I.U. FOR I-551 ACTION ON APPEAL U.S.P.H.S. TEMPORARY EVIDENCE OF no CLASS LAWFUL ADMISSION FOR REQUIRES ATTENTION PERMANENT RESIDENCE VALID UNTIL FEB28,1994 Info given to IRS on date of 1.551 EMPLOYMENT AUTHORIZED 008 A#, Class of Adm, Occup & answers to Form 9003. 4-97 J-105 Tice or Management and Budget, Paperwork you, Reduction U.C. 20520-0264 Project (1405-0015). and to the Office Washington, of Information D. immensations C. and 20503. Regulatory for reducing Affairs, It Of- to: DEPT. OF STATE"
}
