{
	"anumber": "A44154337",
	"id": "A44154337_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FLORIDA CERTIFICATE OF DEATH, C2022536"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2005, 2023, 1947]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 adidas STATE OF FLORIDA OFFICE of VITAL STATISTICS CERTIFIED COPY 055457 FLORIDA CERTIFICATE OF DEATH CAL FILE NO. 1. DECEDENT'S NAME (First, Middle, Last, Suffix) 2 SEX CHHAGANLAL VYAS MALE 3. DATE OF BIRTH (Month Day. Year) 4a AGE-Last Birthday 4b. UNDER 1 YEAR 4c UNDER DAY 5. DATE OF DEATH(Month/ Year) (Years) Months Days Hours Minutes JANUARY 1, 1906 99 SEPTEMBER 16 2005 6 SOCIAL SECURITY NUMBER 7 BIRTHPLACE (City and State or Foreign Country) 8 COUNTY OF DEATH 004-07-3034 RAJKOT, INDIA ORANGE 9. PLACE OF DEATH HOSPITAL Inpatient Emergency Room/Outpatient Dead Arrival (Check only one) NON HOSPITAL Hospice Facility Nursing Home/Long Term Care Facility X Decedent's Home Other (Specify) 10 FACILITY NAME (If oor institution. give street address) 11a. CITY TOWN OR LOCATION OF DEATH 1b INSIDE CITY LIMITS? 4957 RIVER GEM AVENUE WINDERMERE Yes No 12. MARITAL STATUS (Specify) 13 SURVIVING SPOUSE S NAME (If wife. give maiden name) Married Married, but Separated Widowed Divorced Never Married 14a RESIDENCE STATE 14b COUNTY 14c CITY, TOWN OR LOCATION FLORIDA ORANGE WINDERMERE 14d. STREET ADDRESS 14e. APT.NO. 14f. ZIP CODE 14g INSIDE CITY LIMITS? 4957 RIVER GEM AVENUE 34786 Yes No 15a DECEDENT'S USUAL OCCUPATION (Indicate type of work done during most ol working life) 15b KIND OF BUSINESS/INDUSTRY Do not use \"Retired\" SALES WHOLESALE 16 DECEDENT RACE (Specify the racefraces to indicate what decedent considered himself/herself to be More than one race may be specified.) White Black or African American American Indian or Alaskan Native (Specify tribe) Asian Indan Chinese Filipino Japanese Korean Vietnamese Other Asian (Specify) INDIA Native Hawaiian Guamanian or Chamona Samoan Other Pacifo Isl. (Specify) Other (Specify) 17 DECEDENT OF HISPANIC OR HAITIAN ORIGIN? Yes (11 Yes, specify) XNo Mexican Puerto Rican Cuban Central/South American (Specify decedent was of Hispanic or Haitian Origin.) Other Hispanic (Specify) Hallian 18 DECEDENT'S EDUCATION (Specify the decedent's highest degree or level of school completed at time of death.) 19. WASDECEDENT EVER'IN U.S. ARMED FORCES? 8th or less High school but no diploma High school diploma GED College degree (Specify) Associate Bachelor's Master's Doctorate Yes X No 20 FATHER'S NAME (First Middle, Last Suffix) 21. MOTHER'S NAME (First, Middle, Maiden Surname) NANDU VYAS SANTOKBEN VYAS 22a INFORMANT 'S NAME 22b. RELATIONSHIP TO DECEDENT 23a. INFORMANTSMAILING-STATE FOIA (b)(6) 23. OR TOWN 23c STREET ADDRESS 23d ZIP CODE FOIA )(6) 24 PLACE OF DISPOSITION (Name of cernetery, crematory. or other place) 25a LOCATION STATE 25b. LOCATION CITY DR TOWN WOODLAWN CREMATORY FLORIDA GOTHA 26a METHOD OF DISPOSITION Burial Entombrent Donation Removal from State Other (Specify) 26b IF CREMATION DONATION OR BURIAL AT SEA. 27a LICENSE:NUMBER Licensee) 27b SIGNATURE OF FUNERAL SERVICE LICENSEE OR PERSON ACTING AS SUCH WAS MEDICAL EXAMINER APPROVAL GRANTED? Yes No 4165 28. NAME OF FUNERAL FACILITY 29a PACILITY'S MAILING STATE WOODLAWN FUNERAL HOME FLORIDA 29b CITY OR TOWN 29c. STREET ADDRESS 29d ZIP CODE GOTHA 400 WOODLAWN CEMETERY ROAD 34734 30 CERTIFIER X Certifying Physician To the best of my knowledge, death occurred at the time. date and place. and due to the cause(s) and manner stated (Check one) Medical Examiner On the basis of examination and/or investigation in my opinion, death occurred at the time, date and place, due to the cause(s) and manner stated 31a (Signature of Certified Onorline 31b. DATE SIGNED (mm/dd/yyyy) 32. TIME OF DEATH 33 MEDICAL EXAMINER'S CASE NUMBER 9.16.05 12.05 PM 34a LICENSE NUMBER (of Certifier) 34b CERTIFIER'S NAME 35. NAME OF ATTENDING PHYSICIAN (If other than Certifier) ME 50242 V. KRISHNA M.D 36a CERTIFIERS STATE 36b. CITY OR TOWN 36c. STREET ADDRESS 36d ZIP CODE FLORIDA ORLANDO 3333 SOUTH CONWAY ROAD 32812 37 SUBREGISTRAR Signature and 38a- LOCAL REGISTRAR Signature 38b DATE FILED BY REGISTRAR (Mo. Day. Fatricia Millia Rosacid DEPUTY REGISTRAR SEP 2 2005 DEC 05 2005 THE FLORIDA DEPARTMENT OF THIS DOCUMENT IS PRINTED OR PHOTOCOPIED ON SECURITY PAPER WITH WATERMARK OF THE GREAT WARNING: SEAL OF THE STATE OF FLORIDA DO NOT ACCEPT WITHOUT VERIFYING THE PRESENCE OF THE WATERMARK HEALTH THE DOCUMENT FACE CONTAINS A MULTI-COLORED BACKGROUND AND GOLD EMBOSSED SEAL. THE BACK CONTAINS SPECIAL LINES WITH TEXT AND SEALS IN THERMOCHROMICINK DH FORM 1947 (08/04) C2022536 CERTIFICATION OF VITAL RECORD"
}
