{
	"anumber": "A44182040",
	"id": "A44182040_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44182040_0000/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMIGRANT VISA AND ALIEN REGISTRATION, IV-44,182204"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 OPTIONAL FORM 155A, (REV. 6-91) DEPT. OF STATE NSN 7540-01-126-7761 50155-204 IV-44,182,040 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: AVILA DE BARRERA, CAMILA DEL CARMEN (Family Name) (First Name) (Middle Name) INS FILE #. IF KNOWN ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION 212(e) 212(h) U. S. IMMIGRATION TATIOU NEW YORK, N.Y. 2503 July 17,1993 212(g) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH JUL 17 1993 SANTA ANA, EL SALVADOR 15JUL1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY IRS SANTA ANA, ELSL SALVADORAN ADMITTED (CLASS) MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME UNTIL M sX W D SEP AMELIA MANUEL FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES 45A 66TH ST. WEST NEW YORK, NJ 07093 SEC. 212(a) (5) (A) OCCUPATION UNR RETIRED SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION EMBASSY CLASSIFICATION IRS SYMBOL AMERICAN SAN SALVADOR FOREIGN STATE/OTHER AREAN MITATION EL SALVADOR the AT SNS199267104101 44182040 ISSUED ON 07 JUN9993 (Month) (Year) Consular Officer of the United States of America the THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF 04OCT1993 (Daw (Month) (Year) PASSPORT NO. 0952089 OR OTHER TRAVEL DOCUMENTS (Describe) TACHED RESERVED ICE UNITED STATES UF AMERICA Tariff No. 21 Fee Paid $ or Local Currency Equivalent IV-44,182,040 ROOLSOLD I-551, date ACTION OFTURY EVIDENCE 09 ACTION ON APPEAL U.S.P.H.S. Info given to IRS Addr, DOB, answers A# to LAWFUL ADMISSION FOR PERMANENT RESIDENCE VALID UNTIL Estance Class I Adm, Name, Occup & EMPLOYMENT AUTHORIZED Form 9003."
}
