{
  "anumber": "A44154337",
  "id": "A44154337_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0049/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 U.S. Department of Justice OMB #1115-0054 Immi: ration and Naturalization Service 3) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY C Action Stamp A# APPROVED SRC-93-026-51555 ACF001 11/06/92 CENTER DIRECTOR G-28 or Volag Section of Law: JAN 22 1993 Petition was filed on: 11-5-92 (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) Recommended by C Keiss Personal Interview Previously Forwarded Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) AM CON: LND (a)(5) SSC 3810 Field investigations I-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolve A. Remarks Relationship G 1. The alien relative is my 2. Are you related by adoption? .3 Did you gain permanent residence through adoption Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) VYAS CHHAGANLAL NATHUBHAI 2. Address (Number and Street) (Apartment Number) 11 ELGIN ROAD (Town or City) (State/Country) SEVEN KINGS ESSE* U.K. 3. Place of Birth (Town or City) (State/Country) PIPALIA GUJARAT INDIA 4. Date of Birth 5. Sex 6. Marital Status IND (Ma/Day/Yr) Male Married Single Female Widowed Divorced 7. Other Names Used (including maiden name) NA 8. Date and Place of Present Marriage (if married) 9. Social Security Number 10. Alien Registration Number (if any) TELLS -14 NA NA 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 12 NA NA TECHNOLOGY SYSTEMS =10 13. Has your relative ever been in the U.S.? Yes No JAN 19 1993 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: NA Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission NA 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4/11/91) Y"
}