{
  "anumber": "A44154337",
  "id": "A44154337_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44154337_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "NOTES Observaciones - Bemaerkninger - Hinweise - - Avis - Nótai 1 Surname/ Apellidos/ / Avviso - Opmerkingen - Anotações - Lisämerkintoja - Anmärkningar Cognome/Naa n/Apelidos/Sukunimi/Efternamn 1 Validity A passport is valid for ten years unless otherwise stated. If issued to 2 Given Nombre/Fornavne/Vornamen/Ovoud/Prenoms/ a child under sixteen it is normally valid for five years. A passport which has Réamhainm (neacha)/Nome/Voornaam/Nomes proprios/Etunin expired or has no further space for visas must be replaced by a new one. Förnamn 2 Citizenship and National Status British citizens have the right of abode in 3 Nationality/Nacionalidad/Nationalitet/Staatsangehorigkeit/ the United Kingdom. No right of abode in the United Kingdom derives from the status, as British nationals, of British Dependent Territories citizens, British Nacionalidade/Kansalaisuus/Nationalitet Nationals (Overseas), British Overseas citizens, British protected persons and 4 British subjects. Date Fecha adenacimiento/Fedselsdato/Geburtsdatum/ Date de naissance/ Dáta breithe/ 3 Immigration and Visa Requirements The possession of a passport does not exempt the holder from compliance with any immigration regulations in force Data di nascita/Geboortedatum/Datade nascimento/ Syntymäaika/ Födelesedatum in any territory or from the necessity of obtaining a visa or permit where required. It should be noted in this connection that the majority of British 5 Sex/ Sexo/ Kon/ Geschlecht/ Gnéas/ Sesso/ Geslacht/ territories overseas have immigration restrictions applicable to British nationals Sexo/ Sukupuoli/ Kor as well as aliens. 6 Place of birth/Lug de nacimiento/ Fedested/ Geburtsort/Tortog 4 Registration Overseas British nationals resident overseas who are entitled to Ait bhreithe/ Luogo di nascita/ the protection of the United Kingdom authorities should contact the nearest Geboorteplaats/Local aldenascimento/Syntymäpaikka/Fodelseort British High Commission, Embassy or Consulate to enquire about any 7 Date of issue/ Fecha de expedición/Udstedelsesdato/ arrangements for registration of their names and addresses. Failure to do so may in an emergency result in difficulty or delay in according them assistance de délivrance/ and protection. Dáta eisiúna/D di rilascio/ Da van afgifte/ Data de emissão/ Myönnetty/Utfärdat den 5 Dual Nationality British nationals who are also nationals of another country cannot be protected by Her Majesty's Representatives against the authorities 8 Authority/Autoridad/Myndighed/Behörde/Apxn/Autorité/ of that country. If, under the law of that country, they are liable for any obligation Jdarás/Autorità/Instantie/Autoridade/Viranomainen/Myndighet (such as military service), the fact that they are British nationals does not exempt 9 Date of expiry/ Este pasaporte expira el/ Gyldigt indtil/ Gültig bis/ them from it. A person having some connection with a Commonwealth or our Date d'expiration/ As feidhm/ Data di scadenza/ foreign country (eg by birth, by descent through either parent, by marriage or De geldigheidsduur van dit paspoort eindigt op/Válido at by residence) may be a national of that country, in addition to being a British Viimeinen voimassaolopäivä/Giltigt t.o.m. national. Acquisition of British nationality or citizenship by a foreigner does not necessarily cause the loss of nationality of origin. 10 Holder's signature/ del titular/ Indehaverens underskrift/ 6 Caution This passport remains the property of Her Majesty's Government in Unterschrift des Passinhabers/ 11 TOU katóxou/ Signature du the United Kingdom and may be withdrawn at any time. It should not be titulaire/ Síniú an tsealbhóra/ Firma del re/Handtekening van de tampered with or passed to an unauthorised person. Any case of loss or houder/ Assinatura do titular/ Haltijan nimikirjoitus/Passinnehavarens destruction should be immediately reported to the local police and to the nearest namnteckning British passport issuing authority (eg Office of the United Kingdom Passport 11 Observations - page/ Observaciones - página/ Bemarkninger - side/ Agency; British Consulate; British Embassy or British High Commission); only Vermerke - Seite/ - ochidal Observations - page/ after exhaustive enquiries can a replacement be issued in such circumstances. Tagairti - leathanach/ Osservazioni - pagina/ Opmerkingen - bladzijde/ The passport of a deceased person should be submitted for cancellation to the Observações - página/ Huomautuksia/ Noteringar nearest such passport authority; it will be returned on request. 3 2"
}