{
	"anumber": "A44246176",
	"id": "A44246176_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACIÓN, 05-86-01-04711"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 CERTIFICACION La Infrascrita Registradora Civil Municipal de esre termino, Certifica: Que en el libro Original de nacimientos No. 167, folio 416.- Se encuen- tra la partida de nacimiento No.0506-81-04711.- Que vertenece A: AGRIPI NA OBANDO TINOCO. En Puerto Cortés, a los veintiseis días del mes de noviembre de mil novecientos ochenta y uno.- La Infrascrita Secretaria- Municipal y Encargada del Registro Civil HACE CONSTAR: Que en esta fe- cha se ha recibido del Juzgado de Ketras Seccional de este Fuerto, una Comunicación de la Sentencia dictada por dicho tribunal en cuyo pream- bulo y parte resolutiva de la Sentencia dice: RESULTAS.- CONSIDERANDO.- por tanto.- ORDEN Que el señor Encargado del Registro Civil de esta Cindad Puerto proceda agreement la Omisión de la partida de nacimiento de AGRIPINA OBANDO TINOCO. Quién nació en la aldea el Trisagio de es ta Jurisdicción el veintitres de junio de mil novecientos siete; sien do hija de los señores: Indalecio Obando y Maria Tinoco. Debiendo po ner el acta en el lugar correspondiente a la fecha en que se extienda y al margen de este asiento.- Asi como al de la inscripción cuya repa ración se ordena una suscinta nota de mutua referencia.- Presenciaron y firman esta inscrinción los testigos: Norma G. Castro de Romero.- y Ana Marin Hernandez de Cosenza, oficinistas, hondureñas y de este ve- cindario.- A.M. de Cosenza.- Norma G. C. de Romero.- Sello.- M. de J. A. F.- Sria.- ES CONFORME CON EL ORIGINAL. Extendida en Puerto Cortés, a los ocho días del mes de noviembre de - mil novecientos noventa y tres. REGISTRO REGISTROCIA 05.06 ISTRADORA CIVIL MUNICIPAL 1.0."
}
