{
	"anumber": "A44246176",
	"id": "A44246176_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-44,246176"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 OPTIONAL FORM 155A, (REV. 6-91) DEPT OF STATE NSN 7540-01-126-7761 50155-204 IV-44,246,176 IMMIGRANT VISA AND ALIEN REGISTRATION X HE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #. IF KNOWN OBANDO TINOCO, AGRIPINA ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION U. S. IMMIGRATION NEW YORK, N.Y. 2487 212(e) 212(h) 12-28-93 LAISA6 212(c) 212(i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH PUERTO CORTES, HONDURAS 23JUN1907 ADMITTED CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY UNTIL (CLASS) A44246177 CHOLOMA, HOND HONDURAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP X MARIA INDALECIO FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES 420 EAST 146 ST. BRONX, NY 10455 SEC. 212(a)(5)(A) OCCUPATION SEX LABOR CERTIFICATION NOT APPLICABLE ANOT REQUIRED ATTACHED HOU HOUSEWIFE This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION TEGUCIGALPA, HONDURAS HONDURAS AT TGG199368800201 44246176 ANTIONY d. WOODS ISSUED ON (Day) (Month) VICE (Year) 13DEC1993 STATES Consular Office 6 the United States of America THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 11APR1994 PASSPORT NO. 319469 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED AGRIPINA OBANDO TINOCO ATTACHED MINISTRY OF FOREIGN AFFAIRS VICE Tariff No. 21 UNITED STATES OF AMERICA Fee Paid $ or Local Currency Equivalent IV-44,246,176 PROCESSED FOR 1.551. ACTION TEMPORARY OF EVIDENCE OF ACTION ON APPEAL U.S.P.H.S. LAWFUL ADMISSION JUN 27 1994 PERMANENT RESIDENCE on Date of sance I-551 Name, Addr, VALID UNTIL vi DOB, Adm, A#, OVMENT AUTHORIZED & answers to"
}
