{
	"anumber": "A44246176",
	"id": "A44246176_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Solicitud de Visa Inmigrante y Registro de Extranjero, Formulario Opcional 230 Eng/Span."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 Formulario Opcional 230 Ing/Esp. OMB APPROVAL No. 1405 . 0015 Optional Form 230 Eng/Span. EXPIRES: 08-31-92 Revised 4-91 ESTIMATED BURDEN: 1 HOUR Dept. of State OLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EXTRANJERO APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART I - DATOS BIOGRAFICOS (BIOGRAPHIC DATA) INSTRUCCIONES Compleie una copia de este formulario por Ud. y cada miembro de su familia que inmigrará con Ud., sin importar la edad. Por lavor escriba en istra de imprenta su respuesta a todas las preguntas Las preguntas que no son pertinentes deberán marcarse como tales Si no hay suliciente espacio en el formulario, conteste on una hoja separada usando los mismos números que aparecen en el formulario. Adjunie la(s) hoja(s) a este formulario. ADVERTENCIA: Tods declaración false o encubrimiento de un hacho material puede resultar en su exclusión permanente de loe Estados Unidos Esle formulario es la Parte I de dos partes que. en conjunto con el Formulario Opcional OF-230 PARTE II, constituyen la Solicitud completa de inmigrantes y Registro de Extranjero. INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family regardless of age. who will immigrate with you. Please print or type your answer to all Questions. Questions that are Not applicable should be so marked If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form WARNING: Any false statement or concealment of a material fact may result in your permanent from the United States. This form is Part I of two parts which, together with Optional Form OF-230 PART 11. constitute the complete Application Immigrant Visa and alien Registration 1. APELLIDO(S) (FAMILY NAME) PRIMER NOMBRE (FIRST NAME) NOMBRE (MIDDLE NAME) OBANDO TINOCO, AGRIPINA NMN 2. OTROS NOMBRES POR LOS CUALES SE LE CONOZCA (a 06 mayer casode, indique or apaltido de solleral (OTHER NAMES USED OR BY WHICHK NOWN) (II married women, given masian NONE 3. NOMBRE COMPLETO EN ALFABETO NATIVO (Si no se usan caracteres Romanos) (FULL NAME IN NATIVE ALPHABET) (If Roman letters are not used) NONE 4. FECHA DE NACIMIENTO (DATE OF BIRTH) 5 EDAD (AGE) 6. LUGAR DE NACIMIENTO (PLACE OF BIRTH) Dia (Day) Mes (Month) Ano (Year) Ciudad Pubblo (City or Town) Provincia (Province) Pais (Country) 23 June 1907 86 yrs. Puerto Cortes, Cortes Honduras 7 NACIONALIDAD (Doble citer embas) 8. SEXO (SEX) 9 ESTADO CIVIL (MARITAL STATUS) (NATIONALITY (# dual national give both) Soltero (que nunca so na casado) Casado Viudo Divorciado Separado Masculino (Single) (never Married (married) (Widowed) (Divorced) (Separated) (Male) Honduran Femanino Incluyendo mi matrimonio actual he estado casado/a veces (Female) (Including my present marriage, I have been married times 10. DESCRIPCION PERSONAL (PERSONAL DESCRIPTION) 11. OCUPACION (OCCUPATION) & Color de Cabellc (Color of hair) Grey C. Altura (Height) 1.45 b Color de Qjos (Color of eyes) Brown d Complexion (Complexion) Med Housewife 12. SEÑAS PARTICULARES (IDENTIFYING MARKS) 13 DOMICILIO ACTUAL (PRESENT ADDRESS) Barrio Abajo Casa #203 NONE Choloma, Cortes, Honduras Número de Telélono: Particular Oficina (telephone number) (Home) 69-39-70 (office) 14. NOMBRE DEL CONYUGE (Apellido de Sollara) (NAME OF SPOUSE) (Mission family name) (Primer Nombre) (First name) (Segundo Nombre) (adidas name) NONE Lugar y Fecha de Nacimiento del cónyuge (Date and place of birth of spouse) Domicilio del Cónyuge (Si dillere del propio) (Address of spouse) in children from your own) 15. ENUMERE NOMBRE, FECHA Y LUGAR DE NACIMIENTO, Y DIRECCION DE TODOS LOS HIJOS (LIST NAME. DATE AND PLACE OF BIRTH. AND ADDRESSES OF ALL CHILDREN) NOMBRE (NAME) LUGAR YFECHA DE NACIMIENTO DOMICILIO (Si difiere del propio) (DATE AND PLACE OF BIRTH) (ADDRESS) (If different from your own) 1 Francisco Pagoada Obando 10/12/30-Pto.Cortes Hond. 367 Brook Ave Bronx, N.Y. 2 Ruben Pagoada Obando 04/02/35-Pto.Cortes,Hond, Bo. Abajo, Choloma, Cortes Hond 3. Elsa Pagoada Obando 10/12/38-Pto.Cortes, Hond. Bo.E Caiman, La Lima, Hond 4 Victoria Pagoada Obando 01/01/44-Pto.Cortes,Hond 2073 Park Ave. Bronx, N.Y. 5 Olga Pagoada Obando 02/02/45-Pto.Cortes Hond. Col. Planeta No. 1893-San Pedro Sula 6 7 FOIA (b)(6) 8 ESTE FORMULARIO PUEDE OBTENERSE GRATIS FN LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA Ediciones previas obsoletas THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA (Previous editions obsolete)"
}
