{
  "anumber": "A44246176",
  "id": "A44246176_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 6/7/2023, FOIA(b)(6)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1993,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 MAY 14, 1993 TO WHOM IT MAY CONCERN: I, SAMUEL LICONA, OF LEGAL AGE AND A RESIDENT OF THE CITY OF NEW YORK SINCE 1989, MY ALIEN REGISTRATION # BEING FOIA (b)(6) DO HEREBY SWEAR: SINCE MY CHILDHOOD I HAVE KNOWN THE PAGOADA FAMILY. MY PARENTS AND FRANCISCO JR's PARENTS WERE LIKE FAMILY. TOGETHER THEY USED TO WORK IN MY COUNTRY. THEY PLANTED ALL TYPES OF EDIBLE GRAINES IN ORDER TO PROVIDE FOR THEIR FAMILIES, ALREADY THAT THIS WAS THE ONLY AVAILABLE WORK. FRANCISCO PAGOADA, JR. AND I WENT TO SCHOOL TOGETHER, WERE WE LEARNED THE SKILLS NECESSARY TO LEAD A MORE OR LESS NORMAL LIFESTYLE. THERE IS THE POSSIBILITY THAT THERE IS NO TANGIBLE, DOCUMENTED PROOF TO THE ABOVE STATED DUE TO THE FACT WE WERE RAISED IN A VERY SMALL, RURAL TOWN AND THEY LACKED THE IMPORTANCE OF MAINTAINING ADEQUATE RECORDS OF THIS TYPE OF INFORMATION. I DO HOWEVER TESTIFY THAT MR. FRANCISCO PAGOADA, FATHER AND AGRIPINA OVANDO, MOTHER, IN SPITE OF THE FACT THAT THEY ARE NOT LEGALLY MARRIED HAVE ALWAYS BEEN GOOD PARENTS AND ABOVE ALL VERY CLOSE TO THEIR CHILDREN. IF YOU SHOULD NEED ANY ADDITIONAL INFORMATION ABOUT THE PAGOADA FAMILY PLEASE DO NOT HESITATE TO CONTACT ME AT THE FOLLOWING ADDRESS: SAMUEL LICONA 3073 PARK AVENUE. # 13G BRONX, NEW YORK 10451 SINCERELY, Samuel Licona SAMUEL LICONA SWORN TO BEFORE ME THIS 14th DAY OF MAY 1993 ALEX BURGOS Notory Public, State of/ Now York #03-4990014 Certificate Filed in Bronx Commission Expires Doc"
}