{
  "anumber": "A44246176",
  "id": "A44246176_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Public Sponsoring Alien Application for Immigrant Visa"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1923,
        1988,
        1989,
        1993,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 16 LA(S) PERSONA(S) NOMBRADA/S EN 14 Y 15 QUE ME ACOMPAÑARA(N) o SE REUNIRA/N CONMIGO EN LOS ESTADOS UNIDOS. (PF RSON(S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES) NONE 17. NOMBRE DE SOLTERA DE LA MADRE, FECHA Y LUGAR DE NACIMIENTO Y DOMICILIO (Si ha fallecido, indiquelo dando año de fallecimiento). (MAIDEN NAME OF MOTHER DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) Maria Tinoco - (DECEASED) 18. NOMBRE DEL PADRE, FECHA Y LUGAR DE NACIMIENTO Y DOMICILIO (Si ha fallecido indíquelo dando año de fallecimiento (NAME OF FATHER DATE AND PLACE OF BIRTH AND ADDRESS) (If deceased, so state, giving year of death) Indalecio Obando - (DECEASED) 19. SI NINGUNO DE LOS PADRES VIVE, PROVEA NOMBRE Y DOMICILIO DEL PARIENTE MAS CERCANO EN SU PAIS DE ORIGEN. (IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY). My son: Ruben Pagoada Obando Address: Same as 13 20. ENUMERE TODOS LOS IDIOMAS INCLUYENDO EL PROPIO. QUE PUEDE HABLAR. LEER Y ESCRIBIR (LIST ALL LANGUAGES YOU CAN SPEAK. READ AND WRITE) IDIOMA (LANGUAGE) HABLA (SPEAK) LEE (READ) ESCRIBE (WRITE) Spanish yes no no 21 ENUMERE TODOS LOS LUGARES DONDE HAYA VIVIDO DURANTE SEIS MESES o MAS DESDE QUE CUMPLIO LOS 16 AÑOS. COMIENCE CON SU DOMICILIO ACTUAL (LIST BELOW All PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE) CIUDAD O PUEBLO PROVINCIA PAIS OCUPACION FECHAS (DATES) (CITY OR TOWN) (PROVINCE) (COUNTRY) (OCCUPATION) DESDE (FROM) HASTA (TO) Choloma &Pto. Cortes Cortes Honduras Housework 1923 - 1988 Dic. New York N.Y. USA Tourist 1988 - 1989 June Choloma Cortes Honduras Housework 1989 - 1993 22. ENUMERE CUALQUIER ORGANIZACION POLITICA PROFESIONAL o SOCIAL AFILIADAS A ORGANIZACIONES COMUNISTAS, TOTALITARIAS. TERRORISTAS o NAZI. DE LAS QUE SEA AHORA o HAYA SIDO MIEMBRO AFILIADO DESDE QUE CUMPLIO LOS 16 AÑOS. (LIST ANY POLITICAL. PROFESSIONAL. OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST TOTALITARIAN TERRORIST OR NAZY ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY). NOMBRE Y DOMICILIO (NAME AND ADDRESS) DESDE/HASTA (FROM/TO) CATEGORIA DE MIEMBRO (TYPE OF MEMBERSHIP) NONE 23 ENUMERE LAS FECHAS DE TODAS LAS RESIDENCIAS ANTERIORES o VISITAS A LOS ESTADOS UNIDOS DECLARE SI NUNCA ESTUVO. ACLARE TIPO DE VISA SI TIENE INDIQUE NUMERO DE INS \"A\", Si LO SABE. (LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES (If never. so state) GIVE VISA STATUS If ANY) GIVE INS \"A\" NUMBER IF KNOWN) LUGAR (LOCATION) DESDE/HASTA (FROM / TO) VISA (VISA) I.N.S. N° (I.N.S. FILE N°) New York Ones from Dic. 1988 to B-1-2 NONE June 1989 Visa FIRMA DEL SOLICITANTE (SIGNATURE OF APPLICANT) NUMERO DE CASO (CASE NUMBER) FECHA (DATE) TGG-1993688002 Dec. 13, 1993 NOTA Devusive este formulario completo IIMEDIATAMENTE a is oficina consular cuya dirección sparece en la carta adjunta Este formulario lormará parte de su solicitud de visa de inmigrante is cual no podrá ser procesada hasta que asie formulario haya sido completado y devuello. NOTE Return this completed form inmediately to the consular office address on the covering letter. This form will become part of your immigrant visa application which cannot be processed until this form is complete EBTE FORMULARIO PUEDE OSTENERSE GRATIS EN LAS OFICINAS CONSULAREB DE LOB EBTADOS UNIDOS DE AMERICA Ediciones previes obsoletas THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA (Previous editions obsolete) FORMULARIO OPCIONAL 230 ing/Esp BNS REVISION 4-91 PAGINA 2 OPTIONAL FORM 230 Eng./span BNS REVISED 4-01 PAGE 2 *Public reporting burden for this collection of information is estimated to average 24 hours per response. including time required for searching data squces, gathering the necessary data. providing the information required and reviewing the final collection Bend comments on the accuracy of this estimate of the orden and recomendations for reducing it to Departament of State (OIS/DR) Washington D C. 20520-0264 and to the Office of Information and Regulatory Anairs Office of Management and Budget Paperework reduction Project (1406-0015). Washington D. C., 20503"
}