{
  "anumber": "A44246176",
  "id": "A44246176_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0019/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 OMB No. 1115-0062 U. S. Department of Justice Immigration and Naturalization Service Affidavit of Support (ANSWER ALL ITEMS: FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, FRUNCISCO (Name) jr: residing at 420 EAst (Street 146 Number) st Apt. 304 PAgoada and BRONK New york 10455 U.SA (City) (State) (ZIP Code if in U.S.) (Country) BEING DULY SWORN DEPOSE AND SAY: 1. I was born on 10/12/30 at Puerto cortos Honducas. C., (Date) (City) (Country) If you are not a native born United States citizen, answer the following as appropriate: a. If a United States citizen through naturalization, give certificate of naturalization number 10854074 b. If a United States citizen through parent(s) or marriage, give citizenship certificate number C. If United States citizenship was derived by some other method, attach a statement of explanation. d. If a lawfully admitted permanent resident of the United States, give \"A\" number 2. That I am 63 years of age and have resided in the United States since (date) 1972 3. That this affidavit is executed in behalf of the following person: Name Citizen (Country) Agripina lovando Sex Age F 86 Honducas. central America Marital Status Relationship to Deponent Presently resides at-(Street and Number) (City) single Mother (State) Barrio Abajo casa # 203 choloma (Country) CORtes Honduras. C., Name of spouse and children accompanying or following to join person: Spouse Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age 4. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become a public charge in the United States. 5. That I am willing and able to receive, maintain and support the person(s) named in item 3. That I am ready and willing to deposit a bond, if necessary, to guarantee that such person(s) will not become a public charge during his or her stay in the United States, to the expiration of his or her authorized stay in the United States. or to guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior 6. That I understand this affidavit will be binding upon me for a period of three (3) years after entry of the person(s) named in item 3 and that the information and documentation provided by me may be made available to the Secretary of Health and Human Services and the Secretary of Agriculture, who may make it available to a public assistance agency. 7. That I am employed as, or engaged in the business of Building maintenance with Feelin Services INC (Type of Business) at 116 EAST 30 st now yock N.Y. (Name of concern) 10016 (Street and Number) (City) (State) (Zip Code) I derive an annual income of (if self-employed, I have attached a copy of my last income tax return or report of commercial rating concern which I certify to be true and correct to the best of my knowledge and belief. See instruction for nature of evidence of net worth to be submitted.) $ 25,205.98 I have on deposit in savings banks in the United States 12,948.95 I have other personal property, the reasonable value of which is $ Form I-134 (Rev. 12-1-84) Y OVER"
}