{
  "anumber": "A44246176",
  "id": "A44246176_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0028/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, OPTIONAL FORM 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 PLACE CENTRO MEDICO HONDURENO MEDICAL EXAMINATION OF APPLICANTS OR UNITED STATES VISAS DATE OF EXAMINATION Day, 93 CITY COUNTRY At the request of the American Consul at TEGUCIGALPA HONDURAS NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX OBANDO TINOCO AGRIPINA (10.23.1907 F M I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY Ministry Tegucigalpa ON 319469 Foreing Affairs 3-23-1988 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ RUBEN VILLEDA BERMUDEZ 12-9-93 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done Not Done RPR SERODIA TEST TYPE: TEST TYPE: DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY LABORATORIO CENTRO MEDICO 12-9-93 LABORATORIO CENTRO MEDICO 12-9-93 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The Information on this form refers to me. DEL 12-9-93 Signature deving Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE Hamas 0805781855 DATE EDMUNDO DEL CARMEN CUADRA 12-9-93 NSN 7540-00-139-0058 50157-103 de OPTIONAL FORM 157 REVISED 2-88 GPO : 1992 o - 333-762 DEPT. OF STATE"
}