{
  "anumber": "A44246176",
  "id": "A44246176_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certification, 047111"
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        1993,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/7/2023 Seal First Class One Lempira 1988-1991 No. 0407111 CERTIFICATION The undersigned Municipal Civil Registrar of this Terminal certifies: That in the original book of births No. 167, folio 416, is found record No. 04711 - which literally says: AGRIPINA OBANDO TINOCO. At Puerto Cortes, on the twentysixth day of the month of November of nineteen-hundred-eighty-one the undersigned Municipal Secretary in charge of the Civil Registry deposes: That on this date a communication was received from the Court of this Port stating the judgement issued by the said Tribunal in which its preamble and resolution of the judgement states: Results, having been considered and ordered, that the person in charge of the Civil Registry of this Port city proceed to correct the omission on the Birth Record of AGRIPINA TINOCO, who was born in the section of Trisagio of this jurisdiction on the Twenty-Third of June of Nineteen-Hundred-Seven, daughter of INDALECIO OBANDO and MARIA TINOCO. The record shall be located in place corresponding to the date on which it is issued and it is ordered that a detailed note shall be placed at margin of this certification as well as on the margin of the original inscription. Witnessed and signed by Norma G. Castro de Romero, and Ana Maria Hernandez de Cosenza, office workers, Hondurans, and of this neighborhood. THIS CONFORMS TO THE ORIGINAL Issued at the City of Puerto Cortes, on this Eighteenth day of the month of July of Nineteen-Hundred-Eighty-gight. Signed and Sealed NELLY REBECA ARAUJO DE RAMIREZ MUNICIPAL CIVIL REGISTRAR STATE OF NEW YORK ) COUNTY OF THE BRONX) SS: CITY OF NEW YORK ) I. Elizabeth Mero, having been duly sworn under the law hereby depose and say: That I have full knowledge of both the Spanish and the English languages and that the above translation, made by me, is to the best of my knowledge and belief a true and correct translation of the attached certification. Sworn to before me this 22nd day of January 1993 PUBLIC ORTIZ NOTARY State of New York No. 03-2976330 Qualified in Bronx County Commission Expires MAY 31 1993"
}