{
	"anumber": "A44246176",
	"id": "A44246176_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44246176_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2005, 1907, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 U.S. Department of Jastice TEG OMB #1115-0054 Immigration and Naturalization Service (INS) Pet on for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING Case ID# A A# APPROVED LALS RAC DIRECTOR EAC-93-119-50223 SJR001 03/16/93 G-28 or Volag # JUN 21 1993 Section of Law Petition was filed on: 3/8/93 (priority date) 201 (b) spouse 203 (a)(1) MBroulltte Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) EAC 5070 Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: Jegucia 204 (a)(2)(A) Resolved 204 (h) Reseture Remarks: IRS A. Relationship Returned for fee 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption Husband/Wife Parent Brother/Sister Child Yes No Yes No 93 B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) PAgoRdA FRANCiSCO obando Agripinaz Throco 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment (DNumber) 420 EAST 146 street 304 Barrio Abajo casa (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) Postal-Dage) BRONX now York 10455 choloma cortes Nonduras 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State Eit FLOND country) El TRisagio cortes HonduRas. C.A El TRisagio cortes Honduras C.A 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 10-12-30 Female Widowed Divorced 6/23/1907 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used maiden name) none 8. Date and Place of Present Marriage (if married) 8. Date and Place married) of _( Present (including Marriage Ryo (if 9/30/77 now York city - 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number any) FOIA (b)(6 FOIA (b) (6) 2005 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12 Date(s) Marriages(s) Ended CIS verified 4/19/93 EAc/MB 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate. date and place it was issued) she last arrived as a (visitor student stowaway. without inspection etc.) 10854074 9/3/80 new york city Parents Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? joni Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\". give number of certificate date and place it was issued 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: - Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission - 16. Has you relative eyer been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form 1-130 (Rev. 4/11/91) Y"
}
