{
	"anumber": "A44588377",
	"id": "A44588377_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44588377_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-44,588,377"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/2/2023 OPTIONAL FORM 155A, (REV. 6-91) DEPT. OF STATE 540-01-126-7761 Dies/ NEG. 50155-204 IV-44,588,377 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS TON TOT BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #. IF KNOWN CASTOR, MELITA ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION 212(e) 212(h) U.S. IMMIGRAT LM-973 212(g) 212 (i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH APR 18 1994 It's AQUIN HATTI 10JUN1903 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY PORT AU PRINCE HAT HAITIAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W 4 SEP K VERONIQUE ISAAC DRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE ITED 7. 1 621 S. SWINTON AVE DELRAY BEACH, FL 33444 <(a) (5) (A) OCCUPATION SEX CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED NOT NOT REPORTED This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION PORT AU PRINCE HAITI AT JAMES A. MONAUGHT VICE CONSUL PTP199369306101 44588377 OF THE UNITED STATES OF AMERICA ISSUED ON (Day) (Month) (Year) 14APR1994 Consular Officer of the United States of America THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 11AUG1994 PASSPORT NO. 89-615069 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED FOREIGN SERVICE 096 UNITED STATES OF AMERICA Tariff No. 21 $ 30 Fee Paid $ or Local Currency Equivalent IV-44,588,377 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. REVISED 4-91 Ce formulaire annule et remplace les précédents DEPT. OF STATE"
}
