{
	"anumber": "A44601460",
	"id": "A44601460_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44601460_0006/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAI Case ID# Action Stamp F APPROVED A# INS RAC DIRECTOR 07/09/91 EAC-91-205-50612 G-28 or Volag # RMS001 AUG 19 1991 Section of Law DMRcnaved Petition was filed on: 7-8-91 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 a)(2) FAC 4168 Pet Ben \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field investigations I-485 Simultaneously AM CON: Port an Prince 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: Proper fu received 7-8-91 A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) SEJOUR MALTHIDE 2. Address (Number and Street) (Apartment Number) 2007 Ravenall Avenue (Town or City) (State/Country) (ZIP/Postal Code) Orlando Florida 32811 3. Place of Birth (Town or City) (State/Country) Bombardopolis Haiti 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 1/28/1907 Female Widowed Divorced 7. Other Names Used (including maiden name) None 8. Date and Place of Present Marriage (if married) Widow 9. Social Security Number 10. Alien Registration Number (if any) None None 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended Mervilus Olizia 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway without inspection etc.) Without inspection 4 Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire, as shown Form 94 or 1-95 15. Name and address of present employer (it any) None Date this employment began (Month/Day/Year) 16. Has you relative ever been under immigration proceedings? Yes No Where When Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y"
}
