{
  "anumber": "A44606320",
  "id": "A44606320_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0043/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, FORM OF-230 PART I"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Malaysia",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1928,
        1910,
        1944,
        1934,
        2023,
        1904,
        1940,
        1932,
        1947,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OMB APPROVAL NO 1405-0015 Screened by NARA, 9/14/2023 ESTIMATED BURDEN: 1 HOUR APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART I - BIOGRAPHIC DATA INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not Applicable should be so marked. If there is insufficient room on the form. answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent explusion from the United States. This form (OF-230 PART I) is Part I of two parts which, together with Optional Form OF-230 PART II, constitute the complete, Application for Immigrant Visa and Alien Registration. 1. FAMILY NAME FIRST NAME MIDDLE NAME IMAM MAHMOODMIAN MOHAMED 2. OTHER NAMES USED OR BY WHICH KNOWN (If married woman, give maiden name) N/A 3. FULL NAME IN NATIVE ALPHABET (If Roman letters not used) Hegern Hicrine 4. DATE OF BIRTH 5,AGE 6. PLACE OF BIRTH (Day) (Month) (Year) (City or town) (Province) (Country) 2 12 1904 90 Rander - Surat Gujarat India 7. NATIONALITY (If dual national, 8. SEX 9. MARITAL STATUS give both) Male Single (Never married) Married Widowed Divorced Separated Indian Female Including my present marriage, I have been married times. 10. PERSONAL DESCRIPTION 11. OCCUPATION a. Color of hair Grey c. Height 5' 10\" b. Color of eyes d. Complexion Brown Retired 12. MARKS OF IDENTIFICATION 13. PRESENT ADDRESS Mole on Left Arm 5 Pesiaran Ampang Kuala Lumpur, Malaysia Telephone number: Home 456-3745 Office 14. NAME OF SPOUSE (Maiden or family name) (First name) (Middle name) IMAM FATIMA MAHMOODMIAN Date and place of birth of spouse: 15 Sep 1910, Rander-Surat, India Address of spouse (If different from your own): Expired 15. LIST NAME, DATE AND PLACE OF BIRTH, AND ADDRESSES OF ALL CHILDREN NAME DATE AND PLACE OF BIRTH ADDRESS (If different from your own) Sarabibi M. B. Khan 11 Jul 1928 / Rander, India Dilawarkhan Street, Rander Abdul Rashid Subedar 18 Nov 1932 / Rander, India 1226 N. Klein, Reedley, CA. Mariambibi Y. Imam 07 Mar 1934 /Rander, India 1115, Village Dr, Belmont, CA Mohd. Nisar M. Imam 19 Jun 1939 / /Rander, India 941 Emerald Bay Rd, So. Lake Tahoe, CA Mohd, Zaheer M. Subedar 21 Dec 1940 / Rander, Indial10 Wembley Dr, Daly City, CA Iqbalunnisa Y. Mirza 10 Feb 1944 / Bombay, India 56 Marion Ave, Salinas, CA Rehanabanoo R. Khan 15 Apr 1947 / Rander, India 524 Belmont Dr, Salinas, CA THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA OPTIONAL FORM 230 Part I (ENGLISH) NSN 7540-00-130-8317 REVISED 4-91 50230(1)-101 Previous editions obsolete DEPT OF STATE"
}