{
  "anumber": "A44606320",
  "id": "A44606320_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ALIEN REGISTRATION RECEIPT CARD, I-513"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 TION U S IMMIGRATION SERVICE - U.S ALIEN REGISTRATION RECEIPT CARD IZATION SERVICE 7-1-72)N AND NATURAL!? Form I - 151 (Rev. This wharberhonored in lieu of visa and passport if rightful holder a country or area specified in Part 211 of Title 8, (Code of federal Regulations. was not absent over a year, and is not NESS otherwill includable under immigration laws. If travel in such a country A12 Adrigod dreamstime of over a year is contemplated, consult Immigration A Natid Naturalization Service office before you depart as to whether you sb Build apply for another document. Notify 1 & N Service of address during Teach year and within ten days after each change of address. Obtain forms from any Immigration or Post Office Your regis- tratton number as shown on the other side of this card should be includ- In cations to the I & N Service AND NATURALIZI Commissioner of Immigration and Naturalization GRATION UNITED STATES DEPARTMENT OF JUSTICE IMMIGS br'sol # OLDER YOU ARE REQUIRED BY LAW TO HAVE THIS CARD WITH YOU AT ALL TIMES RVIC 1004 5:9.5.0 MIGRATION AND ALIEN REGISTRATION RECEIPT CARD PERSON IDENTIFIED BY THIS CARD IS ENTITLED TO RESIDE PERMANENTLY AND WORK IN THE U.S. 40448007 11 19 405 742 27531 A NUMBER ISS/T CK PARITY 3577 17812 42902 30904 75280 PBD IOW 1 IDW 2 IDW 3 PARITY 2 061089 247 150 09550 9573948 ADM/ADJ DATE COB ISS CODE SOUNDEX PARITY FORM 1.551 JAN 77"
}