{
  "anumber": "A44606320",
  "id": "A44606320_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, 1115-0054"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        2014,
        1948,
        1904,
        1994,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "I.S.GPO:1989-228-690 For sale by the Superintendent of Documents U.S. Government Printing Office Screened by NARA- 9-14-2023 Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NO. WRITE IN THIS BLOCK-FOR EXAMINING OFFICE NLY Case ID# Action Stamp Fee Stamp 1994 Fll COLLECTED A# G-28 or Volag # HOMELAND Kenneth E. Gross, Jr. American Consul Section of Law: 201 (b) spouse 203 (a)(1) Petition was filed on 1994 (priority date) 201 (b) child 203 (a)(2) Kenneth Gross, Jr. Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) American Consul Field Investigations I-485 Simultaneously kel 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: REMARKS: A. Relationship 1. The allen relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) SUBEDAR - MOHAMMED ANEES - MAHMOODMIAN IMAM IMAM - MAHMOODMIAN - MOHAMED 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 5 Pesiaran Ampang 5 Pesiaran Ampang (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Kuala Lumpur Malaysia Kuala Lumpur Malaysia 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Bmobay Maharashtra/India Rander-Surat Gujarat/India 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) Male Married Single 8/23/1948 Female Widowed Divorced 12/2/1904 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) N/A N/A 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 12-7/1975 Rander, India 5/27/1927, INDIA 9. Social Security number 10. Allen Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) N/A 558-27-9782 A40448007 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. us Dip passport FOIA (b)(6) 14. If your relative is currently in the U.S., complete the following: Naturalization ISSUED \"at WaSHDC ON He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued 1009243 19 Sep 75, Phoenix, AZ 8may90 N/A Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) EXPS Parents 2014 N/A Have you obtained a certificate of citizenship in your own name? Yes 25JUL94 Date authorized stay expired, or will expire as shown on Form I-94 or I-95 No If \"Yes,\" give number of certificate, date and place it was issued N/A 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: 16. Has your relative ever been under immigration proceedings? N/A Yes No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Yes No Deportation Rescission Judicial Proceedings States citizen or lawful permanent resident? N/A INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent proved Denied Returned Form I-130 (Rev. 02-28-87) N 1994132004"
}