{
	"anumber": "A44606320",
	"id": "A44606320_0089",
	"page_index": 89,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0089/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title of the image, Screened by NARA, 9/142023, Form number only in double quotes separately, NARA-94465"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1944, 2023, 1968, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 Block 1. - Information About Alien Beneficiary (Continued) 21. Address in the United States where beneficiary will reside (City) (State) 110 WEMBLEY DRIVE DALY CITY CALIF. 94015 22. Address at which beneficiary is presently residing (Apt. No.) (Number and street) (Town/or city) (Province or State) (Zip Code. if in U.S.) 110 23. If beneficiary is in the United States, give the following information concerning beneficiary: WEMBLEY DRIVE DALY CITY, CALIF. 94015 a. He last arrived in the U.S. on b. He last arrived in U.S. as c. Show date beneficiary's stay expired or will (Month) (Day) (Year) (Visitor, student, exchange alien, crewman. stowaway, etc.) expire as shown on his Form I-94 or 1-95: 6-17-1976 VISITOR AUGUST 10TH 1976 d. Name and address of present employer e. Date alien began this employment NONE 24. Check the appropriate box below and furnish the information required for the box checked: Beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) (FOREIGN COUNTRY) Beneficiary is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at SAN FRANCISCO CALIFORNIA (CITY) (STATE) If the application for adjustment of status is denied, the beneficiary will apply for a visa abroad at the American Consulate in (CITY IN FOREIGN COUNTRY) BOMBAY INDIA (FOREIGN COUNTRY) Block II. - Information About Petitioner 25. My name is (Last) (First) (Middle) 26. Other names used; (including maiden name if married woman) MIRZA VQBALUNNISA YLISUF 1QBALUWMSA M. iMAM 27. I reside in the United States at (C/O. if appropriate) (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code) 2106 AVENUE -SAN FRANUSCO CALIP. 94116 28. Address abroad (if any) (Number and street) (Town or city) (Province) (Country) 29. I was born: (Month) (Day) (Year) B (in: (Town or city) (State or Province) (Country) -10-1944 - BOMBAY - MAHARASHTRA INDIA 30. If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate, and date and place of naturalization: 1QBALUNNISA YUSUF MIRZA No. 9051718 12-10 1968-SAW FRANCISCO (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on such acquisition? (a) If so, give number of certificate and date and place of issuance: (b) If not, submit evidence of citizenship in accordance with Instruction 4a. (2). n/c seen theit D b. Have you or any person through whom you claim citizenship ever lost Unitad States citizenship? N07/26/26.23 If so, attach detailed explanation on separate sheet. 31. If you are a lawful permanent resident alien of the United States, give the following: a. Alien Registration Number: b. Date, place, and means of admission for lawful permanent residence A c. Have you ever lost status as a lawful permanent resident alien? If so, explain: (If you are married to a citizen of the United States, read instruction 1b carefully) 32. Have you attached all required documents (see instruction No. 4)? Yes Block III. - Oath or Affirmation of Petitioner 1 swear (affirm) that I know the contents of this petition signed byme and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 6) y mirzu Subscribed and sworn to (affirmed) before me this 26th of A.D. 1976 at (SEAL) My commission expires can (SIGNATURE OF OFFICER ADMINIST ERING OATH) (TITLE) Block IV. - Signature of Person Preparing Form. If Other Than Petitioner I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. Year y (SIGNATURE) a. mirzes 2106-22ND AVE SAN FRANUSCO 7/22/1976 (ADDRESS) ALIF.94116 (DATE) 7/22/1976"
}
