{
	"anumber": "A44606320",
	"id": "A44606320_0074",
	"page_index": 74,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0074/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Executive Affidavit for Support,, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1977, 2023, 1975, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 6. (To be filled in, if appropriate.) That I have previously submitted affidavit(s) of support for the following per- Date submitted son(s): Name June 1976. FOIA (b)(6) 11 11 7. (To be filled in, if appropriate.) That I have submitted visa petiton(s) to the Immigration and Naturalization Service, on behalf of the following person(s): Date submitted Name Relationship Hafezbibi Mirza Abdulla Sister 7.10.1975. \" Madinabibi Mirza Abdulla Sister 8. That I am willing and able to receive, maintain, and support the person(s) listed in item 3 above for the year Feady and willing to deposit a bond, if necessary, with the Immigration and Naturalization Service to guarantee that such person(s) will not become public charges during their stay in the United States, or that they will maintain their nonimmigrant status if admitted temporarily and will depart prior to the expiration of their authorized stay in the United States. 9. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become public charges in the United States. 10. (Complete this block only if the person(s) named in item 3 will be in the U.S. temporarily.) That above. I do intend, do not intend, to make specific contributions to the support of the person(s) listed in item 3 intend (If you checked \"do intend\", indicate the exact nature and duration of the contributions. For example, if you and state to furnish room and board, state for how long and, if money, state the amount in United States dollars whether it is to be given in a lump sum, weekly, or monthly and for how long.) 11. That my reasons for signing this affidavit are: Signature of person preparing form, if other than deponent EXECUTION OF AFFIDAVIT. You must sign the affidavit in your full, I declare that this document was prepared by me at the true, and correct name and affirm or make it under oath. In the United States the affidavit may be sworn to or affirmed request of the deponent and is based on all information before an immigration officer without the payment of fee, or be- of which 1 have any knowledge. fore a notary public or other officer authorized to administer SIGNATURE oaths for general purposes, in which case the official seal or certificate of authority to administer oaths must be affixed. Address: 41, Jones St., Date: Outside the United States the affidavit must be sworn to or San Brancisco. Ca. affirmed before a United States consular or immigration officer. SUBSCRIBED AND SWORN TO BEFORE ME THIS 26th day of July A.D. 19 76 Ahomed A. Mauza (Signature of deponent San Francisco, Calif. at Eileen Streat Notary Public (Title of officer) (Signature of officer) OFFICIAL ODAD EILEEN STUART NOTARY PUBLIC CALIFORNIA SAN FRANCISCO COUNTY FPI LC 5.76 COM 9372 My Commission Expires Jan. 21, 1977 1098 Market St., San Francisco. CA. 94102"
}
