{
  "anumber": "A44606320",
  "id": "A44606320_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0025/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Oath of Allegiance"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Malaysia",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1999
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Application Form No.: N-400 File No.: A44606320 Daytime Phone No.: ( 916541-1866 6/3/96 Examiner: E12 you INITIAL INTERVIEW DATE: Sec. of Law: 316 319 Other: English: Speak Read Write Oath: A \" B 1025 Only Only Government: INS Test Standard Test FINAL ACTION : Comments and Documents Presented Alien Registration Card I-551 StR I-151 Denie/Withdrawn CA DL/ID: N9298195 S&R Salenes Passport: CA Eligible Other: Soc Sec 7/1/1999 New Address: Video: Y / N PHYSICAL DESCRIPTION: DOB: N-445a: Marital Status: 2 M 3\" 4° Height: FT IN DENY: Date: Country of Nationality: Date decision prepared: Sex: M F Occupation: Date of Entry: REEXAM DATE: RECOMMENDATIONS: 04 895 55 /15 NAME CHANGED FROM 4 77 MUST COMPLETE 92 (91) (19) PETITION FOR NAME CHANGE D/granction NAME TO BE TYPED ON CERTIFICATE A22 452 319 another file immigrated 1977 but absent June 90 - Sept OATH 91 OF ALLEGIANCE to issuance of IV In India Malayia I HEREBY DECLARE, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign lost residence ison reapplied Granted + admitted 6/1/94 prince potentate, state, or sovereignty of who or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and laws of the United States of America against all enemies, foreign and domestic; I will bear true faith and allegiance to the same; that I will bear arms of behalf of the United States when required by law; that I will perform noncombatant service in the Armed Forces of the United States when required by law; that I will perform work of national importance under civilian direction when required by law; and that I will take this obligation freely without any mental reservation or purpose of evasion: SO HELP ME GOD. In acknowledgment whereof I have I have hereunto affixed my signature. GST NIV says 1-15/ destroyed@SFR A22452319"
}