{
  "anumber": "A44606320",
  "id": "A44606320_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44606320_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa, IV-44,606320"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Malaysia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 3 Presen 1, since we do not have OPTIONAL FORM 155A. (REV. 6-91) DEFT. OF STATE complete mailing address please mail all correspondence to the below address: IMMIGRANT VISA MahmoodMear M. Imam C/O Mrs R. R. Khan 524 Belmont Drive Salinas OF: (Family Name) (Firs IMAM, MAHMOODMIAN MOHAM CA. 93901 ACTION BY IMMIGRATION INSPECTOR THE IMMIGRAN STATES VIA (N U. S. IMMIGRATION 130 SFR 1847; CITY AND COL JUL 01 1994 RANDER INDIA 02DEC1904 ADMITTED IR-5 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY KUALA LUMPUR MLAS INDIAN MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP FATMAN SHAIKH MOHAMED FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES M SUBEDAR c/o Mrs.R. R. KHAN Dra SALINAS CA 93901 ONIZUKA AIR FORCE BASE ,524 Belmont SUNNYVALE, CA 00000 SEC. 212 (a) (5) (A) OCCUPATION SEX LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED UNR NONE This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT KUALA LUMPUR, MALAYSIA INDIA KLL199413200401 44606320 Kenneth E. Gross. Jr. ISSUED ON (Day) (Month) (Year) American Consul Consular Officer of the United States of America 02JUN1994 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 29SEP1994 PASSPORT NO. A 186618 OR OTHER TRAVEL DOCUMENTS (Describe) ED RESERVED was UNITED STATES OF AMERICA Tariff No. 21 Fee Paid $ US $30.00 or Local Currency Equivalent IV-44, 606320 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. I151 destroyed at SFR AHA22452319"
}