{
	"anumber": "A45056074",
	"id": "A45056074_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45056074_0018/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/244223"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 Applicant Name Alien Registration Number ABELINA MEDINA RIVERA A -045056074 DIAGNOSIS OF IMPAIRMENT(S) 2. (a) Provide your clinical diagnosis of the applicant's impairment(s) and describe the impairment(s) in terms a person without medical training can understand (see Instructions for examples). The patient is a 91-year-old female who has medical problems such as: 1. Angina (413.9) : is a cramping pain in the chest. It is most often by a shortage to of oxygen alteration if rhythm of the heartbeat either in time the heart 3. C.O.P.D (496) chronic Airway Obstruction pulmonary disease. or force. 4. Hypertension (401.9) a disorder from high blood pressure. 5. H-C.V.D(431): Hypertensive Celebrovascular disease. 6. Implantation of permanent Pacemaker surgery 7. Osteoanthritis (733.00) (b) Provide the relevant DSM-IV code(s) for each mental impairment that you described above. If a DSM-IV code does not exist, write \"N/A.\" CONNECTION BETWEEN IMPAIRMENT(S) AND INABILITY TO LEARN/ DEMONSTRATE KNOWLEDGE The law requires that applicants for citizenship demonstrate (1) an understanding of the English language, including the ability to read, and speak simple words and phrases in ordinary usage; and (2) a knowledge and understanding of the fundamentals of U.S. history and civics. An applicant's difficulty in fulfilling the requirements is not sufficient to support a waiver. In addition, illiteracy in the applicant's native language is not sufficient by itself to support a finding of inability to learn and/or demonstrate knowledge. 3. Based on your examination of the applicant, provide detailed information on the connection between the impairment(s) and the applicant's inability to learn and/or demonstrate knowledge of English and/or U.S. history and civics (see Instructions for examples). Note: This description should address the severity of the effects of the impairment(s) including the specific limitations that affect the applicant's ability to learn and/or demonstrate knowledge. Due to her multiful medical problems, she frequently experiences dizziness, fatigue, shortness of breath and chest pain. when she is on the stress, her blood pressure goes up and has palpitation and anxiety. she has been having frequent forgetfulness and short-term memory loss over last few years. Further, she is very confused and her memory severely worsened to a point in which she often repeated her words again and again. And due to severe Osteoarthritis , her joints became severely painful Patient also has very poor vision in both eyes and cannot read This patient has great difficulty learning new facts and retaining newspapers or books. and INS civil examination due to her multiful medical problems information So, this patient is unable to study for English Form N-648 (Rev. 04/09/02)N Page 2"
}
