{
	"anumber": "A45056074",
	"id": "A45056074_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45056074_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NARA Form 4, 2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1930]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 16. LA(S) PERSONA(S) NOMBRADA/S EN 14 Y 15 QUE ME ACOMPAÑARA(N) o SE REUNIRA/N CONMIGO EN LOS ESTADOS UNIDOS. (PERSON(S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES) NAOA 17. NOMBRE DE SOLTERA DE LA MADRE, FECHA Y LUGAR DE NACIMIENTO Y DOMICILIO (Si ha fallecido, indíquelo dando año de fallecimiento). (MAIDEN NAME OF MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) MaGDALENA Rivera, Desconocioo y ya Fallecido 18. NOMBRE DEL PADRE, FECHA Y LUGAR DE NACIMIENTO Y DOMICILIO (Si ha fallecido indíquelo dando año de fallecimiento (NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) SantiAGO RIVERA, descoNocido y ya Fallecido 19. SI NINGUNO DE LOS PADRES VIVE, PROVEA NOMBRE Y DOMICILIO DEL PARIENTE MAS CERCANO EN SU PAIS DE ORIGEN. (IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY). MARGARITA GUTIERREL HERNANDEZ, Jesus DE OtoRo Intibuca HIJA 20. ENUMERE TODOS LOS IDIOMAS, INCLUYENDO EL PROPIO, QUE PUEDE HABLAR, LEER Y ESCRIBIR. (LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE) IDIOMA (LANGUAGE) HABLA (SPEAK) LEE (READ) Español Espanol EspaNd ESCRIBE (WRITE) EspaNoL 21. ENUMERE TODOS LOS LUGARES DONDE HAYA VIVIDO DURANTE SEIS MESES o MAS DESDE QUE CUMPLIO LOS 16 AÑOS. COMIENCE CON SU DOMICILIO ACTUAL (LIST BELOW ALL PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE). CIUDAD O PUEBLO PROVINCIA PAIS OCUPACION FECHAS (DATES) (CITY OR TOWN) (PROVINCE) (COUNTRY) (OCCUPATION) DESDE (FROM) HASTA (TO) Jesus deOtoRo IntibucA HONDURAS amadeCosa 1930 d presente 22. ENUMERE CUALQUIER ORGANIZACION POLITICA, PROFESIONAL, o SOCIAL AFILIADAS A ORGANIZACIONES COMUNISTAS, TOTALITARIAS, TERRORISTAS o NAZI, DE LAS QUE SEA AHORA O HAYA SIDO MIEMBRO AFILIADO DESDE QUE CUMPLIO LOS 16 AÑOS. (LIST ANY POLITICAL PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST. TOTALITARIAN TERRORIST OR NAZY ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY). NOMBRE Y DOMICILIO (NAME AND ADDRESS) DESDE/HASTA (FROM/TO) CATEGORIA DE MIEMBRO (TYPE OF MEMBERSHIP) NADA 23. ENUMERE LAS FECHAS DE TODAS LAS RESIDENCIAS ANTERIORES o VISITAS A LOS ESTADOS UNIDOS DECLARE SI NUNCA ESTUVO. ACLARE TIPO DE VISA SI TIENE. INDIQUE NUMERO DE I.N.S. \"A\", SI LO SABE. (LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES (If never, so state) GIVE VISA STATUS IF ANY). GIVE N. S. \"A\" NUMBER IF KNOWN) LUGAR (LOCATION) DESDE HASTA (FROM / TO) VISA (VISA) I. N. S. N° N. S. FILE N°) Los angeles, CAlifoRNiA 05-08-91/05-30-92 B-2 turista NADA FIRMA DEL SOLICITANTE (SIGNATURE OF APPLICANT) NUMERO DE CASO (CASE NUMBER) FECHA (DATE) Ab belina Medina Rivera NOTA Devuelva este formulario completo INMEDIATAMENTE a la oficina consular cuya dirección aparece en la carta adjunta. Este formulario formará parte de su solicitud de visa de inmigrante la cual no podrá ser procesada hasta que este formulario haya sido completado y devuelto. NOTE Return this completed form inmediately to the consular office address on the covering letter. This form will become part of your immigrant visa application which cannot be processed until this form IS complete. ESTE FORMULARIO PUEDE OBTENERSE GRATIS EN LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA Ediciones previas obsoletas THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA (Previous editions obsolete) FORMULARIO OPCIONAL 230 Ing/Esp. BNS REVISION 4-91 PAGINA 2 OPTIONAL FORM 230 Eng./span. BNS REVISED 4-91 PAGE 2 *Public reponing burden for this collection of information is estimated to average 24 hours per response, including time required for searching data souces, gathering the necesary data, providing the information required. and reviewing the final collection Send comments on the accuracy of this estimate of the orden and recomendations for reducing it to Departament of State (OIS/DR) Washington, D. C., 20520-0264. and to the Office of Information and Regulatory Anairs Office of Management and Budget Paperework reduction Project (1405-0015). Washington, D. C., 20503."
}
