{
	"anumber": "A45069414",
	"id": "A45069414_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45069414_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Public Information Form, NARA-1045-0015"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1801, 1995, 1979, 1989, 1993, 2023, 1870]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 16. PERSON(S) NAMED IN 14 AND 15 WH VILL ACCOMPANY OR FOLLOW ME TO THE UNI STATES. NiL 17. NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) YASVANTR AO DEV. DECESED 925 Birth DATE NOT known Place of BIRTH RATNAGIRI 5th y 1801 not Kisson 18. MAIDEN NAME OR MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) PARVATI 11-12-1870 DHULIa Decesed 19. IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY. SHANTABEN SITARAM PATEL 36. GANDHIGRAM SOCIETY. KARELiBAUG BARUDA 390018 20. LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE LANGUAGE SPEAK READ WRITE GUjARATI yes yes yes MARATHI yes yes yes ENGLISH yes yes yes 21. LIST BELOW ALL PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE. CITY OR TOWN PROVINCE COUNTRY OCCUPATION DATES (FROM/TO) BARODA GUjARAT INDIA service 19940nwedd Do DO Do Retired 196H onwal 22. LIST ANY POLITICAL, PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTALITARIAN, TERRORIST OR NAZI ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY. NAME AND ADDRESS FROM/TO TYPE OF MEMBERSHIP ovil 23. LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES (If never, so state) GIVE TYPE OF VISA STATUS IF ANY GIVE I.N.S. \"A\" NUMBER IF ANY. LOCATION FROM/TO VISA I.N.S. FILE NO. (If known) SAN Clement 1979 10 1989 IMMIGRATION 435388515 SIGNATURE OF APPLICANT DATE x M.Muley 13 JUL 1995 NOTE : Return this completed form immediately to the consular office address on the covering letter. This form will become part of your immigrant visa and your visa application cannot be processed until this form is complete. . Public reporting burden for this collection of information is estimated to average 24 hours per response, including time required for searching existing data sources, gathering the necessary data, providing the information required and reviewing the final collection. Send comments on the accuracy of this estimate of the burden and recommendations for reducing it to: Department of State (OIS/RA/DR) Washington, D.C. 20520-0264, and to the Office of information and Regulatory Affairs, Office of Management and Budget, Paperwork Reduction Project (1405-0015), Washington, D.C. 20503. U.S.Government Printing Office: 1993 - 342-199/50194"
}
