{
  "anumber": "A45056074",
  "id": "A45056074_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45056074_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PLEASE DISREGARD 09/28/05 INTERVIEW NOTICE, N400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2005,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 PLEASE DISREGARD 09/28/05 INTERVIEW NOTICE NOTICE DATE Request for Applicant to Appear for Naturalization Initial Interview August 26, 2005 CASE TYPE INS A# N400 Application For Naturalization A 045 056 074 APPLICATION NUMBER RECEIVED DATE PRIORITY DATE PAGE WSC*001324235 May 20, 2005 May 20, 2005 1 of 1 APPLICANT NAME AND MAILING ADDRESS Please come to: ABELINA MEDINA RIVERA EL MONTE USINS OFFICE c/o LUIS A DELGADO 9650 FLAIR DRIVE DELGADO & ASSOCIATES PARK PLACE BUILDING 3250 WILSHIRE BLVD 1107 RAMOS, 1 LOS ANGELES CA 90010 EL MONTE CA 91731 On (Date): Saturday, September 10, 2005 At (Time): 08:50 AM You are hereby notified to appear for an interview on your Application for Naturalization at the date, time, and place indicated above. Waiting room capacity is limited. Please do not arrive any earlier than 30 minutes before your scheduled appointment time. The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately to the INS office address listed below with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. If you are applying for citizenship for yourself, you will be tested on your knowledge of the government and history of the United States. You will also be tested on reading, writing, and speaking English, unless on the day you filed your application, you have been living in the United States for a total of at least 20 years as a lawful permanent resident and are over 50 years old, or you have been living in the United States for a total of 15 years as a lawful permanent resident and are over 55 years old, or unless you have a medically determinable disability (you must have filed form N648 Medical Certification for Disability Exception, with your N400 Application for Naturalization). You MUST BRING the following with you to the interview: This letter. Your Alien Registration Card (green card). Any evidence of Selective Service Registration. Your passport and/or any other documents you used in connection with any entries into the United States. Those items noted below which are applicable to you: If applying for NATURALIZATION AS THE SPOUSE of a United States Citizen; Your marriage certificate. Proof of death or divorce for each prior marriage of yourself or spouse. Your spouse's birth or naturalization certificate or certificate of citizenship. If applying for NATURALIZATION as a member of the United States Armed Forces; FILE Your discharge certificate, or form DD 214. If copies of a document were submitted as evidence with your N400 application, the originals of those documents should be brought to the interview. PLEASE keep this appointment, even if you do not have all the items indicated above. If you have any questions or comments regarding this notice or the status of your case, please contact our office at the below address or customer service number. You will be notified separately about any other cases you may have filed. INS Office Address: INS Customer Service Number: US IMMIGRATION AND NATURALIZATION SERVICE (800) 375-5283 300 NORTH LOS ANGELES STREET LOS ANGELES CA 90012- REPRESENTATIVE COPY M"
}