{
  "anumber": "A45056074",
  "id": "A45056074_0071",
  "page_index": 71,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45056074_0071/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00-139-0058"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS Hospital y Clinicas Viera FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 3 - 30 - 95 CITY COUNTRY At the request of the American Consul at Tegucigalpa Honduras NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX Medina Rivera Abelina (M2-254-14) F M I certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON 781815 Ministry of Foreign 3-29-95 GENERAL PHYSICAL EXAMINATION Affairs. I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Gonorrhea Tuberculosis, Not Active Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Ingulnale Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Signs of chronic bronchitis Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) Jorge Betanco DATE READ DATE READ 3-30-95 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Nonreactive Not Done SERODIA: Negative VDRL. TEST TYPE: TEST TYPE: DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Marco Casco 3-30-95 \"arco Casco 3-30-95 OTHER SPECIAL REPORT (S) (When needed) DOCTOR'S NAME (Please print) REMAURS impairment caused by aging process. -Abnormal chest X-4 ays suggestive of Other chest conditions. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. Alfelina Medina Pivera 3-30-95 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Elisa Carrasco de Alvarado Cluxa CARRAS 3-30-95 NSN 7540-00-139-0058 50157-103 3105351925 OPTIONAL FORM 157 SECURITY REVISED 2-88 U.S.GOVERNMENT PRINTING OFFICE : 1988 0 - 213-238 DEPT. OF STATE Medico"
}