{
	"anumber": "A45056074",
	"id": "A45056074_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45056074_0008/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 9. Information About Your Children, Form N-4 (07/23/02)N Page 6"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1947, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 Part 9. Information About Your Children ite your INS \"A\"- number here: A 0 4 5 0 5 4 A. How many sons and daughters have you had? For more information on which sons and daughters 3 you should include and how to complete this section, see the Instructions. B. Provide the following information about all of your sons and daughters. If you need more space, use a separate sheet of paper. Full Name of Date of Birth INS \"A\"- number Current Address Son or Daughter (Month/Day/Year) (if child has one) Country of Birth (Street, City, State & Country) MARGARITA GUTIERREZ 05/15/1945 NONE HONDURAS JESUS DE OTORO, HONDURAS FOIA (b)(6) VERONICA 07/09/1947 FOIA (b)(6) GUTIERREZ HONDURAS FOIA (b)(6) A A 14 A A A Part 10. Additional Questions Please answer questions 1 through 14. If you answer \"Yes\" to any of these questions, include a written explanation with this form. Your written explanation should (1) explain why your answer was \"Yes,\" and (2) provide any additional information that helps to explain your answer. A. General Questions 1. Have you EVER claimed to be a U.S. citizen (in writing or any other way)? Yes X No 2. Have you EVER registered to vote in any Federal, state, or local election in the United States? Yes No 3. Have you EVER voted in any Federal, state, or local election in the United States? Yes X No 4. Since becoming a Lawful Permanent Resident, have you EVER failed to file a required Federal, state, or local tax return? Yes No 5. Do you owe any Federal, state, or local taxes that are overdue? Yes X No 6. Do you have any title of nobility in any foreign country? Yes X No 7. Have you ever been declared legally incompetent or been confined to a mental institution within the last 5 years? Yes No Form N-400 (Rev. 07/23/02)N Page 6"
}
