{
	"anumber": "A45255908",
	"id": "A45255908_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45255908_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT"
		},
		"countries": {
			"ms_countries_nlp_v1": ["India"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/15/2023 1 2 2 50 1Re 50 4H PINDIAN FIFTYPAISE NOTARIAL NUTHING ECO each ART 1 COURT COURT FEE EE STATE ? Re EVER INDIA INDIA 324 direct UCR TREET THREE RUPEES D HRA ON ONE RUPEE 4476 TO WHOM so EVER IT MAY CONCERN (india) as AFFIDAVIT SOCAA I Suraj Bahadur Raizada S/o Rai Gauri Shanker Raizada aged about 92 years R/o Patthar Wali Haveil, Arya Samaj Mandir Bhoor, Bareilly do hereby take oath and solemnelly affirm as under - 1. That the deponent is a native and citizen of India and was born at Bareilly. 2. That the deponent is fully conversant with the facts contained herein. 3. That Mr. Mahesh Swarup and his entire family are well known to me since my childhood. 4. That hte deponent knows that Mr. Mahesh Swarup was born on March his 6th, 1907. At the time of micro birth Mahesh Swarup's parents and my parents family lived in th same town in the same neighbourhood. His father's name was Mr. Narhar Swarup and mother's name was Mrs. Savitri Devi. 5. FIRSD That my parent's family was invited to the celebration marking Swarup's birth and as part of my father's family, I 11/8/55 attended the celebrations and his baptism in accordence with the Hindu religion. w (India) of Sanizada DUTAIN Deponent. 11/8 The above contains are true to my personal knowledge and belief. Nothing is false nor anything is concealed. So help me God. Verified at Bareilly on 11th August, 1995. Suraj who Bahadur Raigeda Jitendia Naram Ashocate Idautified Spricada cer ity that Srt Deponent. Ident ied by Er & affirmed of the a (jdavit in 11-8-95 my presence 11/10/95 further understo (VINOD PRAKASH) Advocata & Notary"
}
