{
	"anumber": "A45219651",
	"id": "A45219651_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45219651_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LIST OF APPROVED PHYSICIANS FOR MEDICAL EXAMINATIONS FOR VISAS"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 AMERICAN EMBASSY DIPLOMATIC ENCLAVE, RAMNA 5 ISLAMABAD LIST OF APPROVED PHYSICIANS FOR MEDICAL EXAMINATIONS FOR VISAS The following physicians in Karachi, Lahore and Islamabad have been approved by the American Consulate for purposes of medical examinations for United States visas. Medical examinations are required as part of an application for an immigrant visa to the United States, must be completed and brought at the time of the interview. They are to be done from one of the following doctors: (1) DR. MOHAMMAD NAEEM-UL-HAQUE (2) DR. S.M. HOSAIN Al-Haroon Building The Poli Clinic 10 Garden Road, Room \"J\" 124-T-2 Main Tariq Road 3rd Floor, KARACHI Near Telegraph Office Phone: 7726070 9a.m.- 8p.m. P.E.C.H.S., KARACHI 7726043 5p.m.- - 8p.m. Phones: 4553728 - 4555993 Clinic Timings: Sat to Wed. Clinic Timings: Sat to Thu 5:00pm to 8:00pm 5:30pm to 7:30pm Thursday & Friday closed. Friday closed (3) Dr. ROOHINA SATTAR (4) Dr. ABDUL MAJEED Room 1-3, 3 F1 Al-Haroon Bldg. Mid East Medical Center (Near Star Cinema) Clifton, Karachi 6 Phone 7726048 Phone 539610 Clinic Timings: Sat to Wed Clinic Timings: 5:30pm to 7:30pm 5:00 pm to 7:00 pm Thursday & Friday Closed Ehsan Medical Center Near National Stadium, Karachi Phones: 474042 - 474217 Clinic Timings: 10:00am-12 noon (5) DR. MUHAMMAD IJAZ UL HASSAN (6) PROF. ALI AJWAD SHAH Dr. Amir Ud Din Road Punjab Medical Center 97-C/II, Gulberg 3 5-Gulberg (Jail Road) Near Hussain Chowk Near Canal Bridge, Lahore Via Liberty Market, Lahore Contact Mr. Nizam on arrival. Phones 5711725, 878339, 5755308 Phones: 7571105, Clinic Timings: Clinic Timings: 8:30am to 5:30pm 10:00 am to 01:00 pm Daily 5:00 pm to 8:00 pm (7) Dr. AHMED RAZA JAN Aziz Nursing Home Saidpur Road, Rawalpindi Phones: 413913, 413914, 413915 Clinic Timings: 10:00 am to 1:30 pm 6:00 pm to 8:30 pm"
}
