{
	"anumber": "A45219651",
	"id": "A45219651_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45219651_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT IN LIEU OF FAMILY RECORD, FOIA (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Pakistan", "India"]
		},
		"years": {
			"ms_years_nlp_v1": [1917, 2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 PAKISTAN 10 RS. TEN RUPEES v, AFFIDAVIT IN LIEU OF FAMILY RECORD ABDUL HA KEEM KHAN (Name of person giving testimony) MUNSHI MOHALLA, BEHIND LIQUIAT FLOUR MILLS, MANDI BAHAUDDIN (PAKISTAN) (Current Address) 10-12-1917. INDIA. (Date and Place of Birth) I have personal knowledge of the following events: That Mr. ABDUL GHAFOOR KHAN (Father) and Ms. BASHIRI BEGUM (Mother) both were born in India and migrated to Mandi Bahauddin (Which became part of Pakistan after Partition) and they got married at Mandi Bahauddin on JANUARY 10, 1940. The following children were born from this marriage: NAME OF CHILD SEX DATE OF BIRTH PLACE OF BIRTH A. FOIA (b)(6) B. FAZAL REHMAN KHAN M 11.15.41 RAWALPINDI, PAKISTAN C. MUMTAZ BEGUM F 11.03.44 MANDI BAHAUDDIN, PAKISTAN D. IMTIAZ BEGUM F 12.13.46 MANDI BAHAUDDIN. PAKISTAN E. F. G. FOIA (b)(6) H. I. ONE SON WAS DIED SIX MONTHS AFTER BIRTH. I know this information to be true and correct because: BASHIRI BEGUM IS MY REAL SISTER. I & BA SHIRI BEGUM WERE BORN IN THE SAME CITY IN INDIA AND MOVED TO PAKISTAN AND I AM LIVING IN CLOSE CONTACT TO THIS FAMILY AND AWARE OF A LL SON'S AND DAUGHTER'S OF MY SISTER AND KNOW EVERY BODY IN THIS FAMILY PERSONALLY. ATTESTED Signature Bills 19 ABDUL HAKEEM KHAN identifical by name of person giving testimony) Suhait Amoun Kham s/o Abdul Su for kher To us. counted U.D. 8 Day RIU mumshi Mukallah M Mamde Bahaadps"
}
