{
  "anumber": "A45610307",
  "id": "A45610307_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45610307_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4. Eligibility to Sponsor, Form I-864 ( (Rev. 12/17/96)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997,
        4008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 4008 Part 4. Eligibility to Sponsor You of your must status. be a U.S. If you citizen are a or U.S. national or a lawful permanent resident If you are a joint sponsor you must certificate, or certificate of citizen attach a copy of a document proving your status such as a U.S. provide pro Alien Registration naturalization. I-551). If you are a lawful permanent resident, attach a copy of both passport, sides of bin Card (Form you The to maintain determination the sponsored of your eligibility immigrant(s) to sponsor an immigrant will be based on an evaluation of your demonstrated petitioner sponsoring your spouse or child at and or you above are 125 on active percent duty of in the the Federal U.S. poverty line (100 percent if you abili: are are readily converted sponsored), to cash and and household income as shown on the last three Federal income tax returns. the numbe of ability immigrants to provide being for a sponsored immigrant will include your current employment, Armed household Forces). size The (including assessment of you including any such assets of sponsored that immigrants, can be made may also available be considered. for the support of sponsored immigrants if Assets necessary the is The unable greatest to weight demonstrate in determining eligibility will be placed on current employment and household income. If income requirement is ability to meet the stated income and asset requirements, a joint sponsor who a petitione in application for an immigrant visa or adjustment to permanent resident status. denial of the immigrant's needed. Failure to provide adequate evidence of income and/or assets or a joint sponsor can will meet resul th A. Sponsor's Employment I am: Employed by SPRECKELS Self Annual salary $ 22,000 or hourly wage s 9.42 (for 40-Schours (provide per week) evidence of employment) employed Nature of employment or business (Name of business) Unemployed since 4-17-91 B. Use of Benefits Have 3 you years? or your spouse, son, daughter, or parent living in your household received any type of welfare benefits in the past Yes No (If yes, provide details, including programs and dates, on a separate sheet of paper) C. Sponsor's Dependents 1. Number (Do NOT of persons (spouse, sons, daughters, and parents) living in your household, including yourself include persons being sponsored in this affidavit) 4 4. persons who are otherwise dependent on you 3. 2. Number Number of of persons NOT living in your household for whom you have previously signed affidavits of support O 0 spouse children.) Number and of persons being / sponsored in this affidavit (include principal intending immigrant and any accompanying 5. Total number of dependents (add lines 1 through 4) 5 List (If additional persons included above in lines 1 or 2 for whom affidavits of support have been submitted since March 1, 1997. space is needed, use additional paper) Name A-Number Date of Affidavit of NONE Support Relationship Form I-864 (Rev. 12/17/96) N"
}