{
	"anumber": "A45610307",
	"id": "A45610307_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45610307_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "na"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/14/2023, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1946, 1947, 1942]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by: NARA, 0/14/2023 FAGE PERSON(S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES PERSON NAMED IN 14 WILL ACCOMPANY ME TO THE U.S.A. NAME OF FATHER DATE AND PLACE OF BIRTH AND ADDRESS (# deceased so state. giving year of death) BA WA SINGE DECEAS 3D IN DHB YEAR 1942. MAIDEN NAME OF MOTBER DATE AND PLACE OF BIRTH AND ADDRESS (If deceased. so state, giving year of death) BANTI haur - DECEASED IN THE YEAR 1946. 9 IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY FOIA (b)(6) ) LIST ALL LANGUAGES YOU CAN SPEAK. READ AND WRITE LANGUAGE SPEAK HEAD WRITE PUN JABI YES NO NO 1 LIST BELOW ALL PLACES YOU HAVE LIVED FOR Six MONTHS OR LONGER SINCE REACHING THE AGE OF 16 BEGIN WITH YOUR PRESENT RESIDENCE CITY OR TOWN PROVINCE COUNTRY OCCUPATION DATES FROM/TO DHE IAN KAHNA PUNJAB INDIA RMING AUG 1947 to PRESENT CHAK NO.53 LAYALFUR PAKISTAN FA RMING SINCE BI RTH TO AUG 47. LIST ANY POLITICAL PROFESSIONAL OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST. TOTALIARIAN TERRORIST OR NAZI ORGAN ZATIONS WHICH YOU ARE NCW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY NAME AND ADDRESS FROM/TO TYPE OF MEMBERSHIP NON 3 LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES (If never. so state) GIVE TYPE OF VISA STATUS IF ANY GIVE IN S. \"A\" NUMBER IF ANY LOCATION FROM,10 VISA IN FILE NO knowly NONE IGNATURE OF APPLICANT DATE 14thAug 95. NOTE: Return this completed form immediately to the consular office address on the covering letter. This form will become part of your Immigrant visa and your visa application cannot be processed until this form is complete. Public reporting burden for this comecion of information is estimated 10 average 24 Fours per response. including ume required for searching existing data SOUICES gathening the necessary data providing formation required ar dreviewing the final collection Send comments on the accuracy of this estimate of and recommerdation for Department of State (OIS/HA/DR) Washington DC 20520 0264. and to the Office"
}
