{
	"anumber": "A46040534",
	"id": "A46040534_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040534_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "fem"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Support, NARA-498239"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 -9- UNITED STATES DEPARTMENT OF JUSIICE Form approved Immigration and Naturalization Service OMB No. 43-R423 AFFIDAVIT OF SUPPORT (ANSWER ALL ITEMS; FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, ADINO BLADIMIR CRUZ , residing at 20288 PORTSIDE DR. (Name) (Street and Number) WALNUT CALIFORNIA 91789 U.S.A. (City) (State) (ZIP Code if in U.S.) (Country) REING DULY SWORN DEPOSE AND SAY: 1. I was born on 12/7/41 at QUEZALTEPEQUE LA LIBERTAD. EL SALVADOR (Date) (City) (Country) If you are not'a native born United States citizen, answer the following as appropriate: a. If a United States citizen through naturalization, give certificate of naturalization number 21170095 b. If a United States citizen through parent(s) or marriage, give citizenship certificate number C. If United States citizenship was derived by some other method, attach a statement of explanation. d. If a lawfully admitted permanent resident of the United States, give 'A' number 2. That I am 54 years of age and have resided in the United States since (date) 12/21/80 3. That this affidavit is executed in behalf of the following person: PILAR ESCOBAR PEÑA FEM 89 (Name) (Sex) (Age) EL SALVADOR DIVORCED MOTHER (Citizen of - Country) (Marital Status) (Relationship to Deponent) AVENIDA LIBERTAD 2-B SAN SALVADOR EL SALVADOR (Presently resides at - Street and Number ) (City) (State) (Country) 4. That this affidavit is made by me for the purpose of assuring the United States Government that the person named in item 3 will not become a public charge in the United States. 5. That I am willing and able to receive, maintain and support the person named in item 3. That I am ready and willing to deposit a bond, if necessary, to guarantee that such person will not become a public charge during his or her stay in the United States, or to guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior to the expiration of his or her authorized stay in the United States. 6. That I understand this affidavit will be binding upon me for a period of three (3) years after entry of the person named in item 3 and that the information and documenation provided by me may be made available to the Secretary of Health and Human Services. CUSCATLAN 7. That I am employed as, or engaged in the business of DENTAL CENTER with (Type of business) (Name of concern) at 4666 ROSEMEAD BLVD. PICO RIVERA CA 90660-2045 (Street and Number) (City) (State) (ZIP Code) I derive an annual income of (if self-employed, I have attached a copy of my last income tax return or report of commercial rating concern which I certify to be true and correct to the best of my knowledge and belief. See instruction for nature of evidence of net worth to be submitted.) $ 178,203 I have on deposit in savings banks in the United States $ 109,973.89 I have other personal property, the reasonable value of which is $ 713,009 I have stocks and bonds with the following market value, as indicated on the attached list which I certify to be true and correct to the best of my knowledge and belief. $ I have life insurance in the sum of 850,000 With a cash surrender value of $ 4,000 I own real estate valued at 1,015,000 With mortgages or other encumbrances thereon amounting to $500,000 Which is located at 20288 PORTSIDE DR. WALNUT CALIFORNIA 91789 (Street and number) (City) (State) (ZIP Code) Form I-134 4666 ROSEMEAD BLVD. Pico RIVERA CA 90660 (Rev. 9-30-80) N 190121 FOOT HILL BLVD. FONTANA CA 92335"
}
