{
	"anumber": "A46040534",
	"id": "A46040534_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040534_0025/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00-139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS CLINICAS MEDICAS FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) Nov. 08, 96 CITY COUNTRY At the request of the American Consul at SAN SALVADOR EL SALVADOR NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo. Day Yr.) ESCOBAR PEÑA PILAR. F M I certify that on the above date I examined Oct. 12,07 WHO BEARS PASSPORT NO. ISSUED BY ON 531861 Direcc.Gen.Mig Nov. 17,94 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect See below Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ VICTOR M ESQUIVEL Nov, 08, 96 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: ELISA DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY LAB ALVAREZ ALEMAN Nov.08,96 LAB ALVAREZ ALEMAN Nov. 08, 96 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS Patient has mild Parkinson disease with no medical therapy. No han- dicaps. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. x Pila Encolos Ressa Nov. 08, 96 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Pr. Pahis Sandeval Berja M.D. NSN 7540-00-139-0058 50157-103 pl Nov. 08, 96 PAREL PHYSICIAN REC. 1446 OPTIONAL FORM 157 REVISED 2-88 *U.S. GOVERNMENT PRINTING OFFICE: 1995 390-274/09119 DEPT. OF STATE"
}
