{
	"anumber": "A46040534",
	"id": "A46040534_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040534_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "La responsabilidad financiera del fiador bajo el Acta del Seguro Social, FORM DS-1858"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 LA RESPONSABILIDAD FINANCIERA DEL FIADOR BAJO EL raTA DEL SEGURO SOCIAL IMPORTANTE: Este documento deberá ser leído y firmado por todas las personas que desean someter una carta de sostenimiento a favor de un aplicante para visa de inmigrante. Una copia de este documento deberá ir adjunto a la carta de sostenimiento sometido a favor del aplicante. El Acta del Seguro Social, revisada, establece ciertos requirimientos para determinar la eligibilidad de los aplicantes por beneficios de los SUPPLEMENTAL SECURITY INCOME (SSI) y el AID TO FAMILIES WITH DEPENDENT CHILDREN (AFDC). El FOOD STAMP ACT, revisada, contiene provisiones similares. Estas enmiendas requieren que los ingresos y recursos de cualquier persona (y el cónyugue de esa persona) que presenta una carta de sostenimiento de un acuerdo similar a favor de un aplicante para inmigrar, sean considerados por los ingresos y recursos del aplicante bajo formulas para determinar la eligibilidad para los beneficios del SSI, AFDC, y FOOD STAMP, durante los 3 años siguientes que el aplicante entró a los Estados Unidos. La eligibilidad para los aplicantes de los beneficios del SSI, AFDC y FOOD STAMP, será dependiendo sobre la obtención de la coopearción de sus fiadores en proveer la información necesaria y la evidencia para autorizar a la Administración del Seguro Social y/o a las Agencias de Asistencia Social del Estado para llevar a cabo estas provisiones. El aplicante solicitando para los beneficios del SSI, AFDC, O FOOD STAMP deberá poner a la disposición con la Administración del Seguro Social y/o a las Agencias de Asistencia Social del Estado, la documentación concerniente a sus ingresos O recursos O a la de sus fiadores, incluyendo información que él O ella provee en sostener su aplicación de visa de inmigrante O ajuste de su condición legal. El Secretario de Salud y Servicios Humanos y/o las Agencias de Asistencia Social del Estado estan autorizados a obtener copias de cualquier documentación de otras agencias. El Acta del Seguro Social y THE FOOD STAMP ACT también proveen que un aplicante y su fiador juntamente tienen la obligación solidaria de compensar cualquier beneficio del SSI, AFDC y FOOD STAMP, que sean incorrectamente pagados por alguna información errónea suministrada por el fiador O por falta del fiador de proveer información. Además, cualquier pago incorrecto de los beneficios del SSI y AFDC que no han sido pagados, serán retenidos de cualquier pago subsiguiente por el cual el aplicante o el fiador sean de otra forma elegibles bajo el Acta del Seguro Social. Estas provisiones no son pertinente a los aplicantes admitidos como refugiados O a los que se les haya otorgado asilo político por el Procurador General. Tampoco son pertinente a los aplicantes elegibles al SSI que hayan quedado ciegos O incapacitados después de entrar a los Estados Unidos. Las provisiones del AFDC no son pertinente a los aplicantes que sean hijos dependientes del fiador O del cónyugue. Yo/Nosotros 0 domicilio actual (Nombre(s)) (Calle y Número) reconciendo haber leído lo anterior y (Ciudad) (Estado) estando al tanto de las responsabilidades como Fiador de Inmigrante bajo el Acta del Seguro Social y THE FOOD STAMP ACT, corregidos. Esta declaración está siendo sometida a favor de las siguientes personas: PAIS DE CASADO/ PARENTESCO NOMBRE SEXO EDAD NACIMIENTO SOLTERO CON FIADOR Firma(s) del Fiador (es) FORM DS-1858"
}
