{
	"anumber": "A46040013",
	"id": "A46040013_0040",
	"page_index": 40,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040013_0040/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 230 Eng./Span."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 2023, 1911]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 FORMULARIO OPCIONAL 230 Ing. / Esp. OMB APPROVAL N° 1405-0015 OPTIONAL FORM 230 Eng. / Span. EXPIRES: 09-30-95 BNS REVISED 11-91 *ESTIMATED BURDEN: 1 HOUR SOLICITUD DE VISA DE INMIGRANTE Y REGISTRO DE EX ANJERO APPLICATION FOR INMIGRANT VISA AND ALIEN REGISTRATION PARTI - DATOS BIOGRAFICOS (BIOGRAPHIC DATA) INSTRUCCIONES: Complete una copia de este formulario para Ud. y cada miembro de su familia que inmigrará con Ud., sin importar la edad. Por favor escriba en letra de imprenta su respuesta a todas las preguntas. Las preguntas que no son pertinentes deberán marcarse como tales. Si no hay suficiente espacio en el formulario, conteste en una hoja separada usando los mismo números que aparecen en el formulario. Adjunte la (s) hoja (s) a este formulario. ADVERTENCIA: Toda declaración falsa o encubrimiento de un hecho material puede resultar en su exclusión permanente de los Estados Unidos. Este formulario es la Parte I de dos partes que, en conjunto con el Formulario Opcional OF-230 PARTE II, constituyen la Solicitud completa de Visa de Inmigrante y Registro de Extranjero. INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not applicable should be so marked If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. This form is Part I of two parts which, together with Optional Form OF-230 PART II, constitute the complete Application for Immigrant Visa and Alien Registration. 1. APELLIDO (S) (FAMILY NAME) PRIMER NOMBRE (FIRST NAME) SEGUNDO NOMBRE (MIDDLE NAME) Escobar de Raymundo Casimira 2. OTROS NOMBRES POR LOS CUALES SE LE CONOZCA(si es mujer casada. indique el apellido de soltera) (OTHER NAMES USED OR BY WHICH KNOWN) (If married woman, give maiden name) Casimira Escobar 3. NOMBRE COMPLETO EN ALFABETO NATIVO (Si no se usan caracteres Romanos) (FULL NAME IN NATIVE ALPHABET) (if Roman letters are not used) 4. FECHA DE NACIMIENTO (DATE OF BIRTH) 5. EDAD (AGE) 6. LUGAR DE NACIMIENTO (PLACE OF BIRTH) Día (Day) Mes (Month) Año (Year) Ciudad 0 Pueblo (City or Town) Previncia (Province) País (Country) 04 Marzo 1911 85 Oratorio Concepcion, Cuscattan , / Salvador 7. NACIONALIDAD (Doble nacionalidad, citar ambas) 8. SEXO (SEX) 9. ESTADO CIVIL (MARITAL STATUS) (NATIONALITY) (If dual national, give both) Masculino Soltero (que nunca se ha casado) Casado Viudo Divorciado Separado Salvadorena (Male) (Single) (never married) (Married) (Widowed) (Divorced) (Separated) Femenino Incluyendo mi matrimonio actual he estado casado/a / veces (Female) (Including my present marriage, I have been married times) 10. DESCRIPCION PERSONAL (PERSONAL DESCRIPTION) 11. OCUPACION (OCCUPATION) a. Color de Cabello (Color of hair) Cano C. Altura (Height) 1.50 Mts oficios Domesticos b. Color de Ojos (Color of eyes) Cafes d. Tez (Complexion) Morena 12. SEÑAS PARTICULARES (IDENTIFYING MARKS) 13. DOMICILIO ACTUAL (PRESENT ADDRESS) REsidencial Los Girajoles Usa Lentes Block \"H\" Senda 5 oriente Casa # 12 santa Tech No de Teléfono: Particular 229-565 Oficina (Telephone number) (Home) (Office) 14. NOMBRE DEL CONYUGE (Apellido de Soltera) (NAME OF SPOUSE) (Maiden or family name) (Primer Nombre) (First name) (Segundo Nombre) (Middle name) Raymundo Isabel Lugar y Fecha de Nacimiento del Conyuge (Date and place of birth of spouse): San Pedro Perulapan 27 Julio 1901 Domicilio del Conyuge (Si difiere del propio) (Address of spouse) (If different from your own) canton Istagua , San pedro Perulapan, Cuscatlan, El Salvador 15. ENUMERE NOMBRE, FECHA Y LUGAR DE NACIMIENTO, Y DIRECCION DE TODOS LOS HIJOS (LIST NAME, DATE AND PLACE OF BIRTH, AND ADDRESSES OF ALL CHILDREN NOMBRE (NAME) LUGAR Y FECHA DE NACIMIENTO DOMICILIO (si difiere del propio) (DATE AND PLACE OF BIRTH) (ADDRESS) (If different from your own) Teresa Excobar San Pedro Perulapan, 02 Junio FOIA (b)(6) FOIA (b)(6) ESTE FORMULARIO PUEDE OBTENERSE GRATIS EN LAS OFICINAS CONSULARES DE LOS ESTADOS UNIDOS DE AMERICA Ediciones previas obsoletas THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA (Previous editions obsolete) I-1"
}
