{
	"anumber": "A46040534",
	"id": "A46040534_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040534_0011/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
		},
		"years": {
			"ms_years_nlp_v1": [1995, 1941, 1973, 2023, 1005]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 U.S. Department of Justice IR5 OMB #1115-0054 Immigration and Naturalization Service (NS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# APPROVED RAC DIRECTOR 09/21/95 WAC-95-250-50475 WACJXH01 G-28 or Volag # OCT 26 1005 Section of Law: n Petition was filed on: SEP 20 1995 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previor ded 201 (b) child 203 (a)(2) Pet. Ben. \"A\" File Reviewed 201 (b) parent 203 (a)(4) Stat 203 (5) Field Investigations I-48 AM CON: Son Alsada 204 (a)(2)(A) Resolved 204 Remarks: REVIEW Pet original B.C. year 1941 books A. Relationship offered on AttAched copy 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adóption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) CRUZ ADINO BLADIMIR ESCOBAR PILAR 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 20288 PORTSIDE DR. AVENIDA LIBERTAD # 2 - B (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) WALNUT CALIFORNIA 91789 SAN SALVADOR, EL SALVADOR, C. A. 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) QUEZALTEPEQUE, LA LIBERTAD EL SALVADOR JUTIAPA, CABANAS EL SALVADOR 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 12/07/41 Female Widowed Divorced 10/20/07 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) N/A PILAR DE CRUZ 8. Date and Place of Present Marriage (il married) 8. Date and Place of Present Marriage (if married) 4/10/65 El Salvador, C. A. N/A 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b) (6) FOIA (b) (6) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A N/A Andres Abelino Cruz 1973 PASSPORT # FOIA (b)(6) 13. If you are a U.S. citizen, complete the following: expires 12-25-293 Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Birth in the U.S. seen tratwruct 4. Yes No If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) #6426 she last arrived as a (visitor, student, stowaway, without inspection, etc.) 21170095 Los Angeles CA 11/10/94 N/A Parents Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: N/A N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED IN Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4.11/91) Y"
}
