{
	"anumber": "A46040013",
	"id": "A46040013_0041",
	"page_index": 41,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040013_0041/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: FOIA ( (b)(6), Form Number: 1-2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [
				1921, 1990, 1995, 1988, 1968, 1981, 1887, 1969, 1992, 1993, 2023, 1996, 1964, 1991, 1932,
				1892
			]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 16. LA/S PERSONA/S NOMBRADA/S EN 14 Y 15 QUE ME ACOMPAÑARA/N 0 SE REUNIRA/N CONMIGO EN LOS ESTADOS UNIDOS. (PERSON (S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES) FOIA (b)(6) 17. NOMBRE DE SOLTERA DE LA MADRE, FECHA Y LUGAR DE NACIMIENTO, Y DOMICILIO (Si ha fallecido, indiquelo dando año de fallecimiento) (MAIDEN NAME OF MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) ina grellana 23 septiembre 1887, San Pedro Perulapan Fallecida 27 1932 septiem bre 18. NOMBRE DEL PADRE, FECHA Y LUGAR DE NACIMIENTO, Y DOMICILIO (Si ha fallecido, indiquelo dando año de fallecimiento) (NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) Estanislao Episobar 30 Agosto 1892 San Pedro Perulapan Fallecido año 1921 19. SI NINGUNO DE LOS PADRES VIVE, PROVEA NOMBRE Y DOMICILIO DEL PARIENTE MAS CERCANO EN SU PAIS DE ORIGEN FOIA (b)(6) 20. ENUMERE TODOS LOS IDIOMAS, INCLUYENDO EL PROPIO, QUE PUEDE HABLAR, LEER Y ESCRIBIR. (LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE) IDIOMA (LANGUAGE) HABLA (SPEAK) LEE (READ) ESCRIBE (WRITE) Espanol Si si si 21. ENUMERE TODOS LOS LUGARES DONDE HAYA VIVIDO DURANTE DOCE MESES 0 MAS DESDE QUE CUMPLIO LOS 16 AÑOS. COMIENCE CON SU DOMICILIO ACTUAL. (LIST BELOW ALL PLACES YOU HAVE LIVED FOR TWELVE MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE). CIUDAD 0 PUEBLO PROVINCIA PAIS OCUPACION FECHAS (DATES) (CITY OR TOWN) (PROVINCE) (COUNTRY) (OCCUPATION) DESDE (FROM) HASTA (TO) San Martin San Salvador E Salvador Amade Casa 1964 1968 Ilopango san Salvador Ei Salvador Amade Casa 1969 1981 Nueva San Salvador La Libertad El Sawador Ama de Casa 1982 1988 Canoga Park California Estados Unides Ama de Casa 1988 1989 Nuesa San Salvador La Libertad El Salvador Ama de casa 1989 1990 22. ENUMERE CUALQUIER ORGANIZACION POLITICA, PROFESIONAL, 0 SOCIAL VINCULADA CON ORGANIZACIONES COMUNISTAS, TOTALITARIAS, TERRORISTAS 0 NAZISTAS DE LAS QUE SEA AHORA 0 HAYA SIDO MIEMBRO 0 AFILIADO DESDE QUE CUMPLIO LOS 16 AÑOS. (LIST ANY POLITICAL, PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTALITARIAN, TERRORIST OR NAZI ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY). NOMBRE Y DOMICILIO (NAME AND ADDRESS) DESDE/HA (FROM/TO) CATEGORIA DE MIEMBRO (TYPE OF MEMBERSHIP) Ninguna 23. ENUMERE LAS FECHAS DE TODAS LAS RESIDENCIAS ANTERIORES OVISITAS A LOS ESTADOSUNIDOS. DECLARE SI NUNCA ESTUVO. ACLARE TIPO DE VISA SI TIENE. INDIQUE NUMERO DE I.N.S. \"A\", SI LO SABE. (LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES. (If never, so state) GIVE VISA STATUS IF ANY. GIVE I.N.S. \"A\" NUMBER IF KNOWN). LUGAR (LOCATION) DESDE / HASTA (FROM / VISA (VISA) I.N.S. N°(I.N.S. FILE N*) Canoga Park ICA 22 Agosto 1988- 20Agosp1989 NONIMMIGRANT VISA Canoga Park, 04. 19 Octubre 1990-15 oct. 1991 NONIMMIGRANT VISA Canega Park C4 30 Diciembre 1992-24 oct. 1993 NONIMMIGRANT VISA Canoga Park, ck.) 26 Septiembre1994- oBsept 1995 NONIMMIGRANT VISA NUMERO DE CASO (CASE NUMBER) FECHA (DATE) X SNS- 1996735005 17 octubre 1996 NOTA: Devuelva este formulario completo INMEDIATAMENTE a la oficina consular cuya dirección aparece en la carta adjunta. Este formulario formará parte de su solicitud de visa de inmigrante la cual no podrá ser procesada hasta que este formulario haya sido completado y devuelto. NOTE: Return this completed form inmediately to the consular office address on the covering letter. This form will become part of your inmigrant visaapplication which cannot be processed until this form is complete. *Public reporting burden for this collection of information is estimated to average 24 hours perresponse, including time required for searching existing data sources, gathering the necessary data, providing the information required, and reviewing the final collection. Send comments OR the accuracy of this estimate of the burden and recommendations for reducing It 10: Department of State (OIS/RA/DR) Washington, D.C. 20520-0264, and to the Office of information and Regulatory Affairs, Office of Management and Budget, Paperwork Reduction Project (1405-0015), Washington D.C. 20503. 1-2"
}
