{
	"anumber": "A46040013",
	"id": "A46040013_0063",
	"page_index": 63,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46040013_0063/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LA INFRASCRITA JEFE DEL REGISTRO DEL ESTADO FAMILIAR DE ESTA CIUDAD, 4012356789"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 1 LA INFRASCRITA JEFE DEL REGISTRO DEL ESTADO FAMILIAR DE ESTA CIUDAD CERTIFICA: Que a las páginas 43 y 44, del libro de partidas de MATRI- 2 3 MONIOS que esta oficina llevó en el año de 1959, se encuentra la par 4 tida que literalmente dice; partida número sesenta y cinco Los señores : ISABEL RAYMUNDO Y CASIMIRA ESCOBAR, ambos salvadoreños, - 5 6 viudo el primero de cincuenta y seis años de edad, jornalero de este- origen y domicilio, hijo de ROSENDO RAYMUNDO Y SANTOS PORTILLO, ambos- 7 8 ya difuntos y la segunda de cuarenta años de edad, de oficios domés- 9 ticos, originaria de Oratorio de Concepción y de este domicilio, hija 10 de Estanislao Escobar y Lina Orellana, ambos ya difuntos contrayeron 11 matrimonio civil en esta Alcaldía, hoy a las diez y seis horas y tre 12 inta minutos ante los oficios del suscrito Alcalde Propietario don 13 Antonio Huezo Cordova y secretario que autoriza don Pedro Virgilio- 14 González con asistencia de los testigos señores Moises Miranda y Gui 15 llermo Barrilla, ambos mayores de edad y de este domicilio. . - -Alcaldía- 16 Municipal: : San Pedro Perulapán, dieciocho de Marzo de mil novecientos 17 cincuenta y nueve . - -Antonio Huezo Cordova . - V. González.sr 18 R U B R I C A D A S 19 ES CONFORME. CON SU ORIGINAL CON EL CUAL SE CONFRONTO .San Pedro Pe- 20 rulapán, dos de Octubre de mil novecientos noventa y seis.- enmend ados -propietario-vale - 21 22 de SAN 23 24 del in FJefe del Registro Familiar Estado CAN Maria del Carmen Orellana de Acosta.- - SALVDOR"
}
