{
  "anumber": "A46184983",
  "id": "A46184983_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46184983_0028/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00-139-0058"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1996,
        1914,
        2023,
        1991,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/5/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS KARACHI. FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 11 AUG, 1997. CITY COUNTRY At the request of the American Consul at ISLAMABAD, PAKISTAN. NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F M I certify that on the above date I examined MR. SIDDIQUE SIRAJ UL ABIDIN. AUG 03, 1914 WHO BEARS PASSPORT NO. ISSUED BY ON B-939532. PAKISTAN. MARCH 19, 1996 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis. Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect. Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism See below EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Reaction mm Describe findings: Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please OR MUHAMMED print) H.KESHANA DATE READ DATE READ Consultant Radiologist 1 1 AUG 1997 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Negative Nonreactive Not Done Not Done TEST TYPE: TEST TYPE: DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY DR. M. KHURSHID AUG. 12 1997 DR. M. KHURSHID AUG. 12 1997 OTHER SPECIAL REPORT (S) (When needed) DOCTOR'S NAME (Please print) REMARKS .H/O Ischemic heart disease with complete heart block.Now on Disprin and Elantan 20 mg twice a day. 2.H/9 Stroke in 1991 and June 1997 with resultant paralysis Right side of the body,mild mental confusion and slurrad speech. Needs wheel chair for ambulation.) Needs assistance for personal needs. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and authorize the required tests to be completed. The information on this form refers to me. An 11, 1997 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE AUG 16 1997 DR. ABDUL MAJEED 50157-103 OPTIONAL FORM 157 NSN 7540-00-139-0058"
}