{
  "anumber": "A46187299",
  "id": "A46187299_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0049/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-00-139-0058"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        2023,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS Rawalpindi FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) October 20, 1997 CITY COUNTRY At the request of the American Consul at ISLAMABAD PAKISTAN NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F M I certify that on the above date I examined KHAN ABDUL MANAN 1907 WHO BEARS PASSPORT NO. ISSUED BY ON E-474698 Regional Passport Sep 10, 1997 GENERAL PHYSICAL EXAMINATION Office, Swat. I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) \"B3\" CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Ingulnale Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Please see remarks. Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Calcified nodes in both hila. Bronchi- Reaction mm ectasis changes in both lung fields. Not Done Cardiac Shadow is within normal limits. DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ DR AHMED RAZA JAN Oct 20, 1997 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: (By Genelavia Mixt, Sanofi Pasteurs) ELISA DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY DR AHMED RAZA JAN Oct 20,1997 Armed Forces Institute Oct 21,1997 OTHER SPECIAL REPORT(S) (When needed) of Pathology, Rawalpindi DOCTOR'S NAME (Please print) REMARKS CLASS - \"B3\" - PULMONARY TUBERCULOSIS, OLD HEALED. Calcified nodes in both hila. CLASS - \"B\" - Blind of both eyes. - Senile Dementia. - Unable to responsed to vocal commands. - Urinary & facial in continence - Unable to walk. - Left Hernitomy & Herniorraphy done 15 years ago - Transvesical prostectomy done APPLICANT CERTIFICATION 03 years ago I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed The Information on this form refers to me. Left thumb impression of Saidpur 001/20/1997 Mr Abdul Manan Khan. Signature Road Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE walpindi DATE DR AHMED RAZA JAN llever Oct 21, 1997 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 U.S. Government Printing Office: 1990-272-823/10166 DEPT. OF STATE"
}