{
  "anumber": "A46184983",
  "id": "A46184983_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46184983_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TRUE TRANSLATION, FORM No. 2"
    },
    "years": {
      "ms_years_nlp_v1": [
        1951,
        2023,
        1957,
        1963,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/5/2023 de 16. iga TRUE TRANSLATION CF by P3:1 of the with spacification di the sine JCS is valuation syrec to beween the paces (UROU TO ENGLISH) FORM # 0.2 17. (SEE Rules a& 10) 18. buster: 516 de register the power Under Rules 8 & 10 of Muslim Family Laws the Sale SC under what Ord rance. 1951 (VIII of 1961) F o R M 19. husbands right of CHOICE in any success 20. 23 documents 22 at re MARRIAGE CERTIFICATE d manage selecage to diner and Marrenance. etc a 50 contacts Beex Peer Colony Town/Union: Comitte Tensit 2: Water the has any existagate Yes there is existing wife, written Police New rown and District Karachi Where the marriaça took place eco is whether he Mrs SEC/FD re permission for second marriage has Perpey $8.09 el Arberator under the been obtained from Cnion Committe 2. SATE d PO & ris tarac ach Siraj ul Abidin Side eque s/o Moin adden- Master Facty Corana 1957 is contract narrespective resource Siddeque. Khoded Colony, A/21, Karachi. Xo 93, Khudad Colony, Karacbi. 22 Kumaa are date et the Communications FLO/ 309/ 63 Dated 12-7-1963. 3. Age al the 40 Fourty Years. cyrepa D the Bndegrice re permission 2° is Astraction Cs.-ci same sacines 2 Name of the are $ car with the Ashref on Nisa. D/O Mahamsed Ibraheen revace 22 NaTE address Jama ludeen S/O Late Mahammed Farooq respector residence. Shareer. J-92 , Peer colony, Karachi. sciamo-red Khateeb Jania MOSQUE Peer Colony, 5. Whether the Bride IS Vager a Midea Karachi. Virgin. Divorced We 21 July 1963. 24 Date: Reg statics of Marriage 6. Age d the Bride 20 Twenty Years. 23 Represent inPag: Rupees Seven Only. One Rupee for form. 7. Name of the Varil à any applicated by the Syed Abned Magbool S/G Syed Andul 2ab side his father's maina and his residence 15/ c, Defence Society, Karachi. Signature of the Wilnesses lo the Appointment 8 Names & the Wilnesses 50 the appointment (1) Syed Mahmed Maqgood s/o Syed Abdul Signature of Bndegrcom DF his Vakil: of the Bridegroom's Vakil: of Bride's Vald with mere taxas name. Rub. 2- A. Nazimabad. Karachi. (1) that resdarce and the relationship with the (2). Meer lqbal LL. S/0 Miasat All Shan. Siraj ul Abidin Siddeque S1. Bade 623, Peer Ilabi Sux Colony, Karáchi. Sd. Signature of Bride Signature ol Bride's Valid 122 Sd. Ashref on nisa Signature of the Wilcasses to the appointment 9. Name cf the Value an apported by T4 of Bride's Vakil: Basegroom his lather's name and F's So. Sd. residence: Signature 35 the Witnesses to the Marriage (1) Syed ahmed Maqbool. So Muhamed Ziauddin Faxrooqui. 10. Names of the Winesses to a appointment (1) Meer Igbal Ali. Sd. (2) of the Bridge oom's Valid with their father's Kban Alam KHan Sd. cames their residence (2) Sd. Signature of the person who solemnized the marriage 11. hares of the Yornesses to the Marriage (1)Mubammed Ziaudden Farooqai S/O Jamal ud Din. ther father's cantes and they residence Subameed Baga udden Farooqui (a) Khan Alam Khan. s/o Sheb Alam Kbap. True Sd. Hyderabad Colony &/ 16, Khudad Colony, Signature & Seel of the Registrar of Marriage Karachi. TRUE TRANSLATION FROM: URDU TO ENOLISH Mabaumed Sagani. 12. Date on which the marriage was adentized: 21 July 1963. 13. Amount of Domet: Seven Thousand Ropeos Current Denomination. 14. How much of the Dowel is Mulajjal (Prima) All Deferred: and how much Muleagal (Deferred) 15 Whether any portion of the dower was paid AQIB IMRAN NOTARY all the Eme of marriage, H so, how much : PUBLIC NOTARY FUBLIC"
}