{
  "anumber": "A46187299",
  "id": "A46187299_0056",
  "page_index": 56,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0056/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/14/2023, Form No. E-47468"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Chest*X-Rays should be obtained from the radiologist recommended by the examining physician. All expenses in connection with medical examinations and X-Ravs must be borne by the individual applicant. Applicants will be required to present two copies of the prescribed medical certificate, signed by the appropriate physicians, a copy of the laboratory chest X-Ray report and the X-Ray plate to the Consular Officer. Each visa applicant must identify himself to the examining physician and to the radiologist by presentation of his passport and having the physician and radiologist sign the following statements. On Oct 20, 19 97 , I examined the following visa applicant who presented passport No E-474698 as identification. Name of applicant MR ABDUL MANAN KHAN . llever Dr. Ahmed Raza Jan M.B.B.S. (Ft) Regd. No. 23172-P Signature of Physician Muscine-Nome Rawalplndt. After the same identification I took a chest X-Ray of the above named applicant October 20, 1997 Chemes Dr. Ahmed Roza M.B.B.S. Rogel 23173-F Signature of Radiologist Amta Nursing Home Rewelpladt (Reports of Medical Examination will not be accepted by the American Consulate General unless accompanied by the above statements signed by the physician and Radiologist) NOTE: In the IR-5 category children regardless of any age may not accompany and should not have their medicals done. Children above 21 years of age except in the F1 and F2B category may not accompany and should not have their medicals done. X Islamabad IV/007 (March 17, 1997)"
}