{
  "anumber": "A46187299",
  "id": "A46187299_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, G-28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Karachi NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE DATE In re: ABDUL M. KHAN FILE No. FOIA (b)(6) I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): NAME Petitioner Applicant Abdul M. Khan Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) 4705 8th Avenue, Brooklyn, N.Y. 11220 NAME Petitioner Applicant Abdur R. Khan Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) 4705 8th Avenue Brooklyn, N.Y. 11220 Check Applicable Item(s) below: I am an attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia Massachusetts Supreme Judicial Court and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2. I am an accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so ecognized by the Board: 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS 570 Seventh Avenue Fifteenth Floor George Grinberg-Funes, Esq. New York, New York 10018 NAME (Type or Print) TELEPHONE NUMBER Sachs & Spector, P.C. (212) 221-1632 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND INATURALIZATION SERVICE SYSTEM OF RECORDS: Sachs & Spector, P.C. (Name of Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE ABDUR R. KHAN Hussal Khan H: 28 ( NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented is a citizen of the United States OF an alien lawfully admitted for permanent residence.) Form G-28 UNITED STATES DEPARTMENT OF JUSTICE (OVER) (Rev. 10-25-79)N Immigration and Naturalization Service"
}