{
  "anumber": "A46184983",
  "id": "A46184983_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46184983_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "American Embassy Diplomatic Enclave, Rama 5 Islamabad, Form Number: NARA, 7/5/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/5/2023 AMERICAN EMBASSY DIPLOMATIC ENCLAVE, RAMNA 5 ISLAMABAD LIST OF APPROVED PHYSICIANS FOR MEDICAL EXAMINATIONS FOR VISAS The following physicians is Karachi, Lahore and Islamabad have been approved by the American Embassy for the purposes of medical examinations for United States Visas. Medical examinations are required as part of an application for an immigrant visa to the United States, must be completed and brought at the time of interview. They are to be done from one of the following doctors: 1. DR. AHMED RAZA JAN DR. ROOHINA SATTAR Aziz Nursing Home Room J, 3rd Floor Saidpur Road Al-Haroon Building, Rawalpindi 10 Agha Khan (Garden) Road Karachi Phones: 413913, 413914, 413915 Phone: 7771675 Clinic Timings: 10:00 A.M. - 1:00 P.M. Clinic Timings: Mon to Fri 5 P.M. 7 P.M. 6:00 P.M. - 8:30 P.M. Medical Fee: Adults: Rs. 1435.00 Medical Fee: Adults: Rs. 1200.00 Children under 15yrs: Rs. 600.00 Children under 15yrs: Rs. 600.00 DR. MUHAMMAD IJAZ UL HASSAN 6. DR. ABDUL MAJEED 97-C/11, Gulberg 3 Mid East Medical Center Dr. Amir ud Din Road Khayahan-e-Iqbal Near Hussain Chowk, Kehloasban, Via Liberty Market Clifton, Lahore Karachi Phones: 5711725, 878339. 5755308 Phones: 5865252, 5877701-5 Clinic Timings: 10:00 A.M. - 01:00 P.M., Clinic Timings: Mon Thur 7:00 P.M. - 9:00 P.M. 5:00 P.M. - 8:00 P.M. Medical Fee: Adults: Rs. 1200.00 Medical Fee: Adults: Rs. 1435.00 Children under 15yrs: Rs. 600.00 Children under 15yrs: Rs. 600.00 3. PROF. ALI AJWAD SHAH Ehsan Medical Center Punjab Medical Center Sir Shah Muhammad Suleman Road 5 - Gulberg (Jail Road), Near National Stadium Near Canal Bridge, Karachi Lahore Phones: 7571105 Phones: 463059, 474042, 474217 Clinic Timings: 8:00 A.M. - 5:00 P.M. Clinic Timings: Mon Thur 10:00 P.M. - 1:00 P.M. 2:30 P.M. - 6:00 P.M. Medical Fee: Adults: Rs. 1200.00 Medical Fee: Adults: Rs. 1435.00 Children under 15yrs: Rs. 600.00 Children under 15yrs: Rs. 600.00 DR. MOHAMMAD NAEEM-UL-HAQUE 7. DR. S.M. HOSAIN Room J, 3rd Floor The Poli Clinic Al-Haroon Building 124 T.2 Main Tariq Road, 10 Agha Khan (Garden) Road, Near Telegraph Office Karachi P.E.C.H.S. Karachi Phone: 7726070 9 A.M. 8 P.M. Phones: 4553728, 4555993 7726043 5 P.M. - 8 P.M. Clinic Timings: Mon to Fri 5 P.M. 8 P.M. Clinic Timings: Sat Thur 5:30 P.M. - 7:30 P.M. Medical Fee: Adults: Rs. 1435.00 Medical Fee: Adults: Rs. 1435.00 Children under 15yrs: Rs. 600.00 Children under 15yrs: Rs. 600.00 Islamabad 117007 (March 17. 1997)"
}