{
	"anumber": "A46187299",
	"id": "A46187299_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE, G 325 (REV. 5-1-79Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Do Not Remove Screened by NARA 9/14/2023 Carbons. If typewrite is not available, print heavily in block letters with ball-point pen. U. S. GOVERNMENT PRINTING OFFICE: 4981-349-641 FORM G-325 (REV. 5-1-79)Y BIOGRAPHIC UNITED STATES DEPARTMENT OF JUSTICE Form Approved INFORMATION Immigration and Naturalization Service OMB No. 43-8436 Family same) (First same) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY KHAN ABDURRA'B FOIA (b)(6) FEMALE 3/9/1940 Pakistani ALL OTHER NAMES USED (Including sames by previous marriages) CITY AND COUNTRY OF BIRTH ABDUR RAB Swat, Pakistan FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE FATHER Khan Abdulmanan unknown Bompokha Swat Pakistan MOTHER (Maiden same) Oimat Jan FOIA (b)(6) FAMILY NAME (For wife. give malden name) FIRST NAME BIRTHDATE DATE AND PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE NONE APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 4705 8th Avenue Brooklyn New York USA 9 80 PRESENT TIME 191 East 17th Street Brooklyn New York USA 9 78 9 80 221 East 16th Street Brooklyn New York USA 3 77 9 78 600 West 113th Street NYC New York USA 4 74 3 77 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR none APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (Specify) MONTH YEAR MONTH YEAR Randy Drug Store Inc., 1084 Flatbush Ave. 8 78 PRESENT TIME Brooklyn, New York In Manager Shafi Medical Services, 159 West 116th St. NYC, NY 10026 Medical Tech 1 75 8 78 Show below last occupation abroad if not shown above. (Include all information requested above.) Medical practice. THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION OTHER (SPECIFY) STATUS AS PERMANENT RESIDENT Khan 11/17/83 IF YOUR NATIVE ALPHABETIS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE Are all copies legible? es PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family same) (Bives same) (Middle same) (Alies registration number) KHAN ABDURRAB A20 826 670 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: FORM e-099 [1] Ident."
}
