{
	"anumber": "A46187299",
	"id": "A46187299_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Consideration for Providing Affidavit of Support ( (Continued)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "009 02/28/97 WED 10:26 FAX 202. 307 Part 7. Consideration for Providing Affidavit of Support (Continued) I agree to submit to the personal jurisdiction of any court of the United States or of any State, territory, or possession the United States if the court has subject matte- jurisdiction of a civil action to enforce this affidavit of support. I agr that no action to enforce this affidavit of support shall be barred by any statute of limitations that might otherwise appl so long as the plaintiff initiates the civil action no later than ten (10) years after the date on which a sponsored immigra last received any means tested public benefits. Collection of Judgment. I acknowledge that a plaintiff may seek specific performance of my support obligation. Furthermore, any money judgmei against me based on this affidavit of support may be collected through the use of a judgment Lien under 28 U.S.C. $3201, writ of execution under 28 U.S.C. ยง3203, a judicial installment payment order under 28 U.S.C. $3204, or garnishmen under 28 U.S.C. ยง3205, or through the use of any corresponding remedy under State law. I may also be held liable fc costs of collection, including attorney fees. Concluding Provisions. I, ABDURRAB KHAN certify under penalty of perjury under the laws of the United States that: (a) I know the contents of this affidavit of support signed by me; (b) That all the statements in this affidavit of support are true and correct; (c) That I make this affidavit of support for the consideration stated in Part 7, freely, and without any mental reservation or purpose of evasion. (d) That Income. Tax Returns submitted lu support of this affidavit are true copies of the returns filed with the Internal Revenue Service; and (e) Any other evidence submitted is true and correct. 10/24/87 (Date) (Sponsor's Signature) Subscribed and sworn to (affirmed) before me this 24th day of October 1997 (Month) (Year) at My commission expires on Vice Carsul (Signature of Officer Administering Oach) (Tule) Islamic Republic of Pakistan City of Islamabad Embassy of the: SS United States of America Part 8. If someone other than the sponsor prepared this affidavit of support, that person must complete the following: I certify under penalty of perjury under the laws of the United States that I prepared this affidavit of support at the sponsor's request, and that this affidavit of support is based on all information of which I have knowledge. Signature Print Your Name Date Daytime Telephone Number ( ) Firm Name and Address"
}
