{
	"anumber": "A46187299",
	"id": "A46187299_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0043/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 4  Eligibility to Sponsor, NARA, 9/142023"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 Part 4. Eligibility to Sponsor You must be a U.S. citizen or national or a lawful permanent resident. If you are a joint spor or you must provide proof of your status. If you are a U.S. citizen attach a copy of a docum nt proving your status such as a U.S. passport, birth certificate. or certificate of naturalization. If you are a lawful permanent resident, attach a copy of both sides of your Alien Registration Card (Form I-551). 10 determination of your eligibility to sponsor an immigrant will be based on an evaluation of your demonstrated ability 16 maintain the sponsored immigrant(s) at or above 125 percent of the Fedc. al poverty line (100 percent If you are a petitioner sponsoring your spouse or child and you are on active duty In the U.S. Armed Forces). The assessment of your a my to provide for a sponsored Immigrant will Include your current employment, household size (Including the number ! immigrants being sponsored). and household income as shown on the last three Federal Income tax returns. Assets that TC readily converted to cash and that can be made available for the support of sponsored Immigrants if necessary. including any such assets of sponsored immigrants. may also be considered. The greatest weight in determining eligibility will be placed on current employment and household Income. If a petitioner $ inable to demonstrate ability to meet the stated Income and asset requirements, a joint sponsor who can meet the income requirement is needed. Failure to provide adequate evidence of income and/or assets or a joint sponsor will result in denial of the immigrant's application for ar. immigrant visa or adjustment to permanent resident status. A. Sponsor's Employment Employed by RAY DRUG STORES INC pr vide evidence of employment Annual salary 5 64,000 or hourly wage $ (for hours per week) Self employed (Name of business) Nature of employ men or business G. MANAGER Unemployed since B. Use of Benefits Have you or your spouse, son, daughter, or parent living in your household received any type of welfare benefits in the past 3 years? a Yes No ( If yes. provid details, including programs and dates. on a separate sheet of paper) C. Sponsor's Dependents 1. Number of persons (spouse, sons, daughters, and parents) living in your household, including yourself 8 (Do NOT include persons being sponsored in this affidavit) 2. Number of persons NOT living in your household for whom you have previously signed affidavits of support j. Number of persons who a.: otherwise dependent on you 4. Number of persons being sponsored in this affidavit (Include principal intending immigrant and any accompanying spouse and children.) I 5. Total number of dependents (add lines I through 4) 9 List persons Include above In lines 1 or 2 for whom affidavits of support have been submitted since March 1, 1997. 11/ additional space is needed. use additional paper) Date of Amdavit of Name A-Number Relationship Support Page 2"
}
