{
	"anumber": "A46187299",
	"id": "A46187299_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46187299_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 7, Consideration for Providing Affidavit of Support ( (Continued), Form I-864 ( (Rve 12/17/96) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1996]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 Part 7., Consideration for Providing Affidavit of Support (Continued) The income of the sponsor (and of that sponsor's spouse) will be considered (or deemed) to be the income of the immit 13 sponsored, In determining the Immigrant's eligibility for most Federal means-tested public benefits. seras government and any State or-local government may consider (or deem) the Income of the sponsor (and of the sponsor's spouse) to e the income of the Immigrant, for purposes of determining the Immigrant's eligibility for public benefits. except for those public benefits specified in section 422(b) of Public Law 104-193. This attribution of the income of the sponsor (and of the sponsor's spouse) to the Immigrant will continue until the immigrant becomes a U.S. citizen or until the immigrant has worked for or can be credited with 40 qualifying quarters under title 11 of the Social Security Act, provided that the immigrant must not have received any Federal means-tested public benefit during an creditable quarter for any period after December 31, 1996. The speasor and the immigrant for whom the sponsor executes this affidavit should be aware that, with certain exceptions. section 403(a) of Public Law 104-193 makes an alien lawfully admitted for permanent residence ineligible for all Federal means-lested public benefit programs for 5 years after the alien becomes a permanent resident. except for those programs identified in section 403(c) of Public Law 104-193. I understand that, under section 213A of the Immigration and Nationality Act (Act). as amended, this affidavit of support constitute 1 contract between me and the United States Government, for the benefit of the sponsored immigrants. the United St. Government, and State and local government agencies or private entities that provide means-tested benefits ! understand that my obligations under this affidavit of support, as defined by section 213A of the Act and INS regulations ay to enforced against me by a lawsuit filed in accordance with section 213A of the Act. Sponsor's Obligations. !. Financial Sapport. I agree to provide to the sponsored immigrant(s) whatever financial support is necessary to main in the sponsored immigrant(s) at an income that is at least 125 percent of the Federal poverty guidelines (or 100 percent for petitioners on active duty In the U.S. Armed Forces sponsoring a spouse or child). If the sponsored Immigrant(s) receive(s) any Federal means-tested public benefit (other than the benefits specified In section 423(d) of Public Law 104-193) while my support obligation continues in force, I agree to reimburse the Federal, State. or local agency for the costs of the means-tested public benefit provided to the sponsored Immigrant(s). This support obligation shall continue in force with respect to each sponsored immigrant identified in Part 3 until each sponsored Immigrant becomes a citizen of the United States: has worked. or can be credited with. 40 qualifying quarters under dif- 11 of the Social Security Act; ceases to hold the status of an allen lawfully admitted for permanent residence and leaves the United States: or dies. 2. Notice of Change of Address. Until my obligation under this affidavit of support terminates. I shall give written notice of any change In my address. in the manner prescribed by INS regulations, to the Immigration and Naturalization Service that has jurisdiction over the place of residence of the sponsored Immigrant(s). and to the State In which the sponsored immugrant(s) reside(s). 1 shall give this notice within 30 days of the change in my address. I understand that failure to g..e this notice may subject me to the civil penalty established under section 213A(d)(2) of the Act. Civil Action to Enforce. executed ii. receives any Federal or State means-tested public benefits. other than those public benefits specified in section before the obligations under this affidavit of support expire. the immigrant on whose behalf this affidavit of support is of Public Law 104-193, the Federal, State or local agency that provides the public benefit may request reimbursement 423(d) from the sponsor of this affidavit. If you fail to honor the request for reimbursement, the Federal. State or local agency may sue the sponsor in any United States District Court or in any State court with jurisdiction of civil actions for bierc. of contrast. INS will provide information on the names and addresses of sponsors 1. benefit-providing ag the spellisor may also be liable for the costs of collection, including legal fees. ! acknowledge that seellon 213A(a)(1)(B) of the Act grants standing to bring a civil action to enforce this affidavit of support (.) The sponsored Immigrant(9); (1) The Government of the United States; and, any State or political subdivision that provides means.tested public benefits to the sponsored immigrant(s). and any private entity that administers any Federal. State or local me insteated public benefit program and that provides any public benefit to the sponsored immigrant(s). Form I 864 (Rve 12/17/96) N Parr 5"
}
