{
  "anumber": "A46337255",
  "id": "A46337255_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46337255_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information on Sponsor’s Household Member or Sponsored Immigrant/Household Member, FORM I-864A ( (10/6/97) PAGE 2"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 Part 1. Information on Sponsor's Household Member or Sponsored Immigrant/Household Member FOIA (b)(6) Last Name FOIA (b)(6) First Name FOIA (b)(6) Middle Name Date of Birth (Month Dav Year) Social Security Number Illandatory for A-Number (If any) FOIA (b)(6) voluntary for U.S. citizens FOIA (b)(6) U.S.CITIZEN Address (Street Number and Namel City State/Province ZIP/Postal Code FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) Telephone Number Relationship to Sponsor: SPOUSE 1 enoth of residence with sponsor FOIA (b)(6) The sponsor's household member. (Complete Part 2) The sponsored immigrant/household member. (Complete Part 3.) FOIA (b)(6) Part 2. Sponsor's Promise I, THE SPONSOR FOIA (b)(6) in consideration of the household member's promise to support the (Print name of sponsor) sponsored immigrant(s) and to be jointly and severally liable for any obligations I incur under the affidavit of support, promise to complete and file an affidavit of support on behalf of the following - 1- sponsored immigrant(s): (Indicate number) Name of Sponsored Immigrant Date of Birth Social Security Number A-Number (First, Middle, Last) (Month, Day, Year) (If any) (If any) ELOISA HERRERA 6/27/15 A- Part 3. Household Member's Promise I, THE HOUSEHOLD MEMBER, . in consideration of the sponsor's (Print name of household member) promise to complete and file the affidavit of support on behalf of the sponsored immigrant(s): 1) Promise to provide any and all financial support necessary to assist the sponsor in maintaining the sponsored immigrant(s) at or above the minimum income provided for in section 213A(a)(1)(A) of the Act (not less than 125 percent of the Federal poverty line) during the period in which the affidavit of support is enforceable; 2) Agree to be jointly and severally liable for payment of any and all obligations owed by the sponsor under the affidavit of support to the sponsored immigrant(s), to any agency of the Federal Government, to any agency of a State or local government, or to any private entity; 3) Agree to submit to the personal jurisdiction of any court of the United States or of any State, territory, or possession of the United States if the court has subject matter jurisdiction of a civil lawsuit to enforce this contract or the affidavit of support; and 4) Certify under penalty of perjury under the laws of the United States that all the information provided on this form is true and correct to the best of my knowledge and belief and that the income tax returns I submitted in support of the sponsor's affidavit are true copies of the returns filed with the Internal Revenue Service. FORM I-864A (10/6/97) PAGE 2"
}