{
	"anumber": "A46337255",
	"id": "A46337255_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46337255_0032/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: 157"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1953, 2023, 1940]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 PLACE MEDICAL EXAMINATION OF APPLICANTS Clinicas Medicas FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 06 22 98 CITY COUNTRY At the request of the American Consul at Tegucigalpa Honduras NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) I certify that on the above date I examined F M HERRERA Eloisa 06 27 15 WHO BEARS PASSPORT NO. ISSUED BY ON No.: 738140 SPS Seccion Pasaportes 08 02 94 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect. disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) No YES CLASS B CONDITIONS Chancroid Hanson's Disease, Infectious Gonorrhea Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphilis, Infectious Virus (HIV) Infaction Other Physical Defect, Disease Mental Retardation or Disability; Previous Occurrence of One or Mental Defect Blindness of righteye. Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Devation Psychopathic Personality Chronic Alcohollsm Arterial Hypertension, EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Cardiomegaly degree I with hypertrophy Reaction mm of left ventricle.Aorta opaque and wide with Not Done atheroma in aortic knob. The lungs are normal. Calcified nodule of 7mm. in the lateral segment DOCTOR'S NAME (Please print) of lobe (without pathologic significance) DOCTOR NAME (Please print) DATE READ DATE READ Ruben Villeda B. 06 22 98 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally rellable test) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: SERODIA DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Lab. Poujol 06 22 98 Lab. Poujol 06 22 98 OTHER SPECIAL REPORT (S) (When needed) DOCTOR'S NAME (Please print) REMARKS Severe rethinophaty in 1940, ending in eye enucleation. Gall Blader surgery in 1953, Hospital D'Antoni, La Ceiba. Arterial hypertension in last 10 years, controlled with Covertal, Blood Pressure: 180/95, no heart failure- CLASS B-Blindness of right eye (Retinal lesion in 1940) Arterial Hyperntension (with Crdiomegaly degree I) RISK:1 II because age) APPLICANT CERTIFICATION on this form refers to me. I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The Information Signature KAIDO Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Fernando Tome-Abarca. , MD. , FAAP 0680520 06 22 98 NSN 7540-00-130-0058 50157-103 OPTIONAL FORM 157 *U.S. Government Printing Office: 404-763/40008 REVISED 2-88 DEPT. OF STATE"
}
