{
	"anumber": "A46337255",
	"id": "A46337255_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46337255_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Contract Between Sponsor and Household Member, Form I-864A ( Affidavit of Support Under Section 213A of the Act"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 OMB #1115-0214 U.S. Department of Justice Contract Between Sponsor and Household Member Immigration and Naturalization Service Sponsor's Name (Last First Middle) Social Security Number A-Number (If any) FOIA (b)(6) General Filing Instructions: Form I-864A, Contract Between Sponsor and Household Member, is an attachment to Form I-864, Affidavit of Support Under Section 213A of the Immigration and Nationality Act (the Act). The sponsor enters the information above, completes Part 2 of this form, and signs in Part 5. The household member completes Parts 1 and 3 of this form and signs in Part 6. A household member who is also the sponsored immigrant completes Parts 1 and 4 (Instead of Part 3) of this form and signs in Part 6. The Privacy Act Notice and information on penalties for misrepresentation or fraud are included on the instructions to Form I-864. The signatures on the I-864A must be notarized by a notary public or signed before an Immigration or Consular Officer. A separate form must be used for each household member whose income and/or assets are being used to qualify. This blank form may be photocopied for that purpose. A sponsored immigrant who qualifies as a household member is only required to complete this form if he or she has one or more family members immigrating with him or her and is making his or her income available for their support. Sponsored immigrants who are using their assets to qualify are not required to complete this form. This completed form is submitted with Form I-864 by the sponsored immigrant with an application for an immigrant visa or adjustment of status. Purpose: This contract is intended to benefit the sponsored immigrant(s) and any agency of the Federal Government, any agency of a State or local government, or any private entity to which the sponsor has an obligation under the affidavit of support to reimburse for benefits granted to the sponsored immigrant, and these parties will have the right to enforce this contract in any court with appropriate jurisdiction. This contract must be completed and signed by the sponsor and any household member, including the sponsor's spouse, whose income is included as household income by a person sponsoring one or more immigrants under Section 213A of Act. The contract must also be completed if a sponsor is relying on the assets of a household member who is not the sponsored immigrant to meet the income requirements. If the sponsored immigrant is a household member immigrating with a spouse or children, and is using his or her income to assist the sponsor in meeting the income requirement, he or she must complete and sign this contract as a \"sponsored immigrant/household member.\" By signing this form, a household member, who is not a sponsored immigrant, agrees to make his or her income and/or assets available to the sponsor to help support the immigrant(s) for whom the sponsor has filed an affidavit of support and to be responsible, along with the sponsor, to pay any debt incurred by the sponsor under the affidavit of support. A sponsored immigrant/household member who signs this contract agrees to make his or her income available to the sponsor to help support any spouse or children immigrating with him or her and to be responsible, along with the sponsor, to pay any debt incurred by the sponsor under the affidavit of support. The obligations of the household member and the sponsored immigrant/household member under this contract terminate when the obligations of the sponsor under the affidavit of support terminate. For additional information see section 213A of the Act, part 213a of title 8 of the Code of Federal Regulations, and Form I-864, Affidavit of Support Under Section 213A of the Act. Definitions: 1) An \"affidavit of support\" refers to INS Form I-864, Affidavit of Support Under Section 213A of the Act, which is completed and filed by the sponsor; 2) A \"sponsor\" is a person, either the petitioning relative, the relative with a significant ownership interest in the petitioning entity, or another person accepting joint and several liability with the sponsor, who completes and files the Affidavit of Support under Section 213A of the Act on behalf of a sponsored immigrant; 3) A \"household member\" is any person (a) sharing a residence with the sponsor for at least the last 6 months who is related to the sponsor by birth, marriage, or adoption, or (b) whom the sponsor has lawfully claimed as a dependent on the sponsor's most recent Federal income tax return even if that person does not live at the same residence as the sponsor, and whose income and/or assets will be used to demonstrate the sponsor's ability to maintain the sponsored immigrant(s) at an annual income at the level specified in section 213A(f)(1)(E) or 213A(f)(3) of the Act; 4) A \"sponsored immigrant\" is a person listed on this form on whose behalf an affidavit of support will be completed and filed; and 5) A \"sponsored immigrant/household member\" is a sponsored immigrant who is also a household member. Form 1-864A (10/6/97)"
}
