{
	"anumber": "A46337255",
	"id": "A46337255_0000",
	"page_index": 0,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46337255_0000/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NBC Routing Slip, N-4 / LA-203"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2008]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 NBC ROUTING SLIP TEAM N-400 / LA-203 Date: 10/7/2008 (Your Name or RPC AND Team # if applicable) FILEROOM PROCESS (BLUE CART) Deschedule Remove 1485 Case from AOS Scheduler Completed AOS Case, ready for Interview process (A-shelf/Awaiting Fingerprints) Inter-file Completed Call Up shelf Inter-file LHM Completed RFE REPRINT CSD, PLEASE FILL OUT BELOW Indicate New Call-Up Date: / / RFE Resent? History Updated with \"Request for Additional Evidence?\" Other (See Remarks) Completed To 90 Day Ready for Interview Shelf TO 1687 Special Master I-800 Call-Ups I-800A Call-Ups I-800A Awaiting I-800 To I-698 Call-Up I-800 Awaiting Fingerprints I-800A Awaiting Fingerprints I-800/1800A A-file to Shelf Consolidate and Return to Officer I-90 A Shelf I-90 JIT Shelf (Awaiting Fingerprints) Please Note: Do not use this route slip for B-shelf requested files being routed back to the B-shelf, use the coversheet on the file. *** POST ADJUDICATION PROCESS (RED CART) I-131 APRV/PEND I-512L Completed ROUTE TO BIA Completed Print I-512L Mult Entry Completed ROUTE TO AAO Completed Print I-512L Single/Foreign Completed I-129F/I-130 APPROVED To NVC Completed Print I-512 A.O.S. Completed I-800/1800A APPROVED TO NVC Completed Print I-512 for TPS Completed I-824 APPROVED TO NVC Completed Print 12 or CBS/Newman Completed classified 1817 DENIEL Official Completed Only Print I-512 for NWIRP Return to Officer Completed BIOMETRICS Completed ALL OTHER DENIALS Completed CONSOLIDATION Completed ROUTE TO NRC Completed (See Remarks) ROUTE TO HBG Completed OTHER (See remarks) Completed ROUTE TO FCO/SRVC CNTR Completed Remote out of NBC ClaimsLAN Completed I-94 SEND TO LONDON, KY Completed Consolidate and Ship TO FCO Completed I-90A BIOMETRICS SHELF Completed INTERDEPARTMENT PROCESS (WHITE BUCKET) Customer Relations Completed FDU Completed Exams Completed Admin Completed Records-CRU LR307 Completed Executive Management Completed Records-CPAU LR100 Completed REMARKS: version #36 8/29/08 pel/cpau"
}
