{
  "anumber": "A46916529",
  "id": "A46916529_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0075/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP, No. 23500199"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1940
      ]
    },
    "certificate_naturalization": {
      "complexion": {
        "complexion_llm_v1": "N.A"
      },
      "marital_status": {
        "marital_status_llm_v1": "Married"
      },
      "year_naturalization": {
        "year_naturalization_llm_v1": 1940
      },
      "residence_naturlization": {
        "residence_naturlization_llm_v1": "Baltimore, Maryland"
      }
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": true,
  "full_text": "No. 23500199 Personal description of holder INSRegistration No. FOIA (b)(6) as of date of naturalization: April 11, 1940 I certify that the description given is true, and that the photograph affixed Date of birth: hereto is a likeness of me. Sex: Male Vicurte Anibal Eoleds Height: 5 feet 6 inches Complete and true signature of holder) Marital status: Married Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: Baltimore, Maryland El Salvador The Attorney General having found that: Vicente Anibal Toledo then residing in the United States, intends to reside in the United States when so required by the Naturalization laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was. entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the at: U.S. Immigration & Naturalization Service on: NOV 19 19 Baltimore, Maryland that such person is admitted as a citizen of the United States of America. IT IS PUNISHAELE BY U. S LAW TO COPY, Daic meisering PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization Pike"
}