{
	"anumber": "A46916529",
	"id": "A46916529_0065",
	"page_index": 65,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0065/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Naturalization Service ( Form I-94, IV- 4-6916529"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "OPTIONAL FORM 155B (REV. 11-95) DEPT OF STATE 50155-301 IV-46,916,529 IM 01/26/1999 SRC-99-084-51407 SRCBGF01 ATION (Family Name) (First Name) (Middle Name) TOLEDO, FRANCISCA HORTENSIA INS FILE #, IF KNOWN ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATES VIA (Name of vessel of flight no. of arrival) HAMIGHATION WALL A43 UA860 GENDER FEMALE CITY AND COUNTRY OF BIRTH DAY-MO-YR OF BIRTH IAN x7 1999 SONSONATE, EL SALVADOR 26JUN1913 ASMITTED IR5 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY SONSONATE, EL SALVADOR EL SALVADOR WITH Perm. Res. MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME SINGLE MERCEDES VICENTE FINAL ADDRESS STREET ADDRESS INCLUDE- IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES HYATTSVILLE, MD 20782 3122 LANCER PLACE SEC. 212(a)(5)(A) OCCUPATION NOT REQUIRED HOU HOUSEWIFE/HOUSEHUSBAND This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN EMBASSY IR5 FOREIGN STATE/OTHER AREA LIMITATION AT SAN SALVADOR, ELSL EL SALVADOR A SNS 199859901101 ISSUED ON (Day) (Month) (Year) Consular Officer of the United States of America 15DEC1998 THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 14JUN1999 PASSPORT NO. A194725 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED ISSUED TO: ISSUED BY: ISSUED ON: 13AUG1998 Tariff No. 21 Fee Paid S or Local Currency Equivalent EXPIRES ON: 13AUG2003 IV-46,916,529 ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S THOUS 19 1999"
}
