{
	"anumber": "A46916529",
	"id": "A46916529_0086",
	"page_index": 86,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0086/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Alcaldía Municipal de Juayúa"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Alcaldía Municipal de Juayúa El Salvador C. A. Tel. 452-2003 Fax: 452-2255 La Infrascrita Jefe del Registro del Estado Familiar, CERTIFICA: Que a página número noventa y seis del libro de parti das de Nacimientos que esta oficina llevó en el año de mil novecientos trece, se encuentra asentada la que literalmente dice:\"****P. No. 189.- Alcaldía Municipal: Juayúa, a las diez de la mañana del día nueve de -- Julio de mil novecientos trece.- FRANCISCA HORTENSTA, ladina hija ilegi tima de Mercedes Toledo, nació el veintiseis del mes próximo pasado á - las nueve de la mañana en el Barrio de Santa Lucía de esta ciudad.- Dió estos datos don Alfonso Pérez, quién firmó.- Miguel Mendoza./Alfonso Pé rez./S. Arocha, Srio. \"RUBRICADAS.- AL MARGEN SE LEE: Ver Pg. No. 367 Marg. No. 1,063 Libro No. 1.- Número mil sesenta y tres.- Margi nase la partida de Nacimiento número ciento ochenta y nueve, página nú- mero noventa y seis del libro de nacimientos que esta oficina llevó en el año de mil novecientos trece, en el sentido de que la inscrita FRAN- CISCA HORTENSIA TOLEDO, es la misma persona conocida por los nombres de HORTENSIA TOLEDO, según Testimonio de Escritura Pública Número Cuatro - otorgada ante los oficios del Doctor Carlos Alexis Portillo Alvarez, No tario del domicilio de Sonsonate.- Registro Civil de la Alcaldía Munici pal: Juayúa, veintiuno de Noviembre de mil novecientos ochenta.- A. L. Borja H., Ana Leticia Borja H., Jefe Registro ES CONFORME CON SU ORIGINAL CON EL CUAL SE CONFRONTO, Y para efectos de Ley, se extiende la presente en la Sección del Regis- tro del Estado Familiar de la Alcaldía Municipal: Juayúa, trece de Agos to de mil novecientos noventa y ocho,- HOMELAND Ana Leticra Borja H. de Guandique, Jefe del Registro del Estado Familiar.- DE EL INFRASCRITO ALCALDE MUNICIPAL DE ESTA CIUDAD, HACE CONSTAR: Que al pie de la presente Certificación relacionada con la Partida de Nacimiento, aparece la firma que SE LEE: \"Lety de Guan- dique\" puesta por la señora Ana Leticia Borja H. de Guandique, haciéndolo en concepto de Jefe del Registro del Estado Familiar de esta ciudad, es - AUTENTICA por haber sido impresa de su propio puño y letra en presencia - del Infrascrito Alcalde y Secretario que autoriza.- Alcaldía Municipal: Juayúa, trece de Agosto de mil novecientos noven ta y ocho.- Walter Francisco Cardona STORE Jose Edgardo Aguilar OSEH VRACALDIA The SECRETARIO MUNICIPAL ALCALDE MUNICIPAL DE DE"
}
