{
	"anumber": "A46916529",
	"id": "A46916529_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Employment Authorization"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U. S. Department of Justice Immigration and Naturalization Service Application for Employment Authorization How to File: What is our authority for collecting this information? A separate application must be filed by each applicant. The authority to require you to file Form I-765, Application Applications must be typewritten or clearly printed in ink for Employment Authorization, is contained in the and completed in full. If extra space is needed to answer \"Immigration Reform and Control Act of 1986.\" This any item, attach a continuation sheet and indicate your information is necessary to determine whether you are name, A-number (if any) and the item number. eligible for employment authorization and for the Note: It is recommended that you retain a complete copy preparation of your Employment Authorization Document if of your application for your records. you are found eligible. Failure to provide all information as requested may result in the denial or rejection of this application. Who should file this application? The information you provide may also be disclosed to Certain aliens temporarily in the United States are eligible other federal, state, local and foreign law enforcement and for employment authorization. Please refer to the regulatory agencies during the course of the investigation ELIGIBILITY SECTION of this application which is found required by this Service. on page three. Carefully review the classes of aliens Basic Criteria to Establish Economic Necessity: described in Group A and Group C to determine if you are Title 45 - Public Welfare, Poverty Guidelines, 45 CFR eligible to apply. 1060.2 may be used as the basic criteria to establish This application should not be filed by lawful permanent eligibility for employment authorization when the resident aliens or by lawful temporary resident aliens. applicant's economic necessity is identified as a factor. If you are an applicant who must show economic necessity, you should include a statement listing all of your assets, What is the fee? income, and expenses as evidence of your economic Applicants must pay a fee of $35.00 to file this form need to work. unless otherwise noted on the reverse of the form. Note: Not all applicants are required to establish Please refer to page 3. If required, the fee will not be economic necessity. Carefully review the ELIGIBILITY refunded. Pay by cash, check, or money order in the SECTION of the application. Only aliens who are filing for exact amount. All checks and money orders must be employment authorization under Group C, items (c)(10), payable in U.S. currency in the United States. Make (c)(13), and (c)(14) are required to furnish information on check or money order payable to \"Immigration and economic need. This information must be furnished on Naturalization Service.\" However, if you live in Guam attached sheet(s) and submitted with this application. make it payable to \"Treasurer, Guam,\" or if you live in the U.S. Virgin Islands make it payable to \"Commissioner of What are the penalties for submitting false Finance of the Virgin Islands.\" If the check is not honored information? the INS will charge you $5.00. Title 18, United States Code, Section 1001 states that whoever willfully and knowingly falsifies a material fact, makes a false statement, or makes use of a false Where should you file this application? document will be fined up to $10,000 or imprisoned up to Applications must be presented in person to the nearest five years, or both. Immigration and Naturalization Service (INS) Office that Title 18, United States Code, Section 1546(a) states that processes employment authorization applications within whoever makes any false statement with respect to a the jurisdiction over your place of residence. Please bring material fact in any document required by the immigration your INS Form I-94 and any document issued to you by laws or regulations, or presents an application containing the INS granting you previous employment authorization. any false statement shall be fined or imprisoned or both. Please Complete Both Sides of Form. Reporting Burden: Public reporting burden for this collection of information is estimated to average sixty (60) minutes per response, including the time for reviewing instructions, searching existing data sources, gathering and maintaining the data needed, and completing and reviewing the collection of information. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: U.S. Department of Justice, Immigration and Naturalization Service, Room 2011, Washington, D.C. 20536; and to the Office of Management and Budget, Paperwork Reduction Project: OMB No. 1115-0163, Washington, D.C. 20503. Form I-765 (08/24/89) Page 1"
}
