{
	"anumber": "A46916529",
	"id": "A46916529_0080",
	"page_index": 80,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0080/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: NSN 7540-06-139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1913, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "PLACE MEDICAL EXAMINATION OF APPLICANTS El Salvador FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) November 26, 1998 CITY COUNTRY At the request of the American Consul at San Salvador El Salvador NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F M Toledo Francisca Hortensia 6/26/1913 1 certify that on the above date I examined WHO BEARS PASSPORT NO. ISSUED BY ON A194725 D.G.de Migracion Santa Ana GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks! CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Virus (HIV) Infection Granuloma Inguinale Syphilis, Infectious Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurance of One or Mental Defect see remarks More Attacks of Insanity Insanity Narcotic Drug Addition Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Reaction mm Describe findings: The chest x-ray shows a calcified granu Not Done loma of 3mm in diameter in the base of the right lung. There are no pleuropulmonary abnor- DOCTOR'S NAME (Please print) malities that show active infectious processes. DOCTOR'S NAME (Please print) DATE READ DATE READ Bustamante-Maza - 11/26/98 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed . indicate Positive (Confirmed by Western Blot or equally reliable test) treatment under Remarks) Negative Nonreactive Not Done Not Done TEST TYPE: V.D.R.L. TEST TYPE: ELISA. DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READ Lab. Clinesa 11/26/98 Lab. Clinesa 11/26/98 OTHER SPECIAL REPORT(S) (When needed) DOCTOR'S NAME (Please print) REMARKS The patient has a marked reduction of the visual acuity in the left eye due to a senile cataract, the right was operated but the reduction still re- mains; nevertheless the patient is able to move around. There is also reduc- tion of the hearing acuity but the patient is able to answer questions if spo ken loudly to her. There is an ocassional fine tremor see nect page APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and | authorize the required tests to be completed. The information an this forms refers to me. partencia/olido 11/26/98 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Rene Molina Urrutia. RENE MOLINA URRUTIA M. D. 11/26/1998 PANEL PHYSICIAN NSN 7540-00-139-0058 J. V. P. M. 818 OPTIONAL FORM 157 REVISED 2-88 DEPARTMENT OF STATE"
}
