{
  "anumber": "A46916529",
  "id": "A46916529_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0072/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Report 2 Scheduled Applicants' Case Records, SNS199859011"
    },
    "years": {
      "ms_years_nlp_v1": [
        1913,
        998,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Report 24 - Scheduled Applicants' Case Records Post: SNS Appointment Dates 15-DE-0998 Through 15-DEC-1998 Requested By: IVEOD Date/Time Prepared: 02-DEC-1998 11:06 Case: SNS1998599011 P/A Name: TOLEDO, HORTENCIA Cross Reference: N Packet 3A Sent: Case Applicants Interview Status: Scheduled Packet 3 Sent: 13-APR-1998 Derogatory Info: Total: 1 Transfered To: Date: Of230 P1 Received: 23-SEP-1998 Provisional: N App Over 16: 1 Received From: TVP Date: 20-APR-1998 Has Docs (OF-230 P2): 23-SEP-1998 Namecheck Stat: NP Issued: 0 Termination Letter 1: Doc Qualified: 23-SEP-1998 Post Clearance: X Refused: 0 Termination Letter 2: Reported Qualified: FBI Clearances: X Traveling: 1 Packet 4 Sent: 09-OCT-1998 Finger Print: Will Join: 0 Purge Date: Packet 4A Sent: Used X Charge Foreign State Visa Class Priority Date Visas Frog: X ELSL IR5 Last Contact: 09-OCT-1998 Interview Date: 15-DEC-1998 Time:07:00 Medical Appt. Time: Address Use Indicator: Applicant Letter Language: Applicant Address Information Name: HORTENCIA TOLEDO Line 1: 1 C. LOTE #6 Phone: Line 2: COL BELEN Line 3: SONSONATE diff Line 4: EL SALVADOR Petitioner's Address Information Name: TOLEDO, VICENTE ANIBAL Line 1: Phone: Line 2: Type: Line 3: Line 4: Case Notes No. Author Date Created Subject 1 NVC 19-MAY-1998 Text loaded from NVC PETITIONER SSN # & DOB: FOIA (b)(6) 04APR40 Applicant ID: 1 N/C Status: N Applicant Status: Open Surname: TOLEDO Given Name: HORTENCIA Alias1: TOLEDO, FRANCISCA HORTENCIA POB: ELSL City: SONSONATE Region: DOB: 26-JUN-1913 Gender: Female Rel To P/A: P/A FSC: ELSL Occupation: Previous INS No.: Acc/Join: Accompanying P/A Adjudication Status: NA Adjudication Date: Adjudicated By: Visa Symbol: Authorized By: I CERTIFY THAT A CHECK OF THE Issuance Date: Issued By: Namecheck Results Listing DEPAR SYSTEM Date: 9/24/98 08:35:27 Status: RECEIVED Source: DNC DNC CD Date: 19980704 IS NO Hit Category: N Hit Count: 0 B SI. Namecheck Namecheck ORRef Refusal Result Hit Name POB Post Cd Date Post Date ALIEN. ** This Report Contains Only IV Data. Page 65 of 104"
}