{
  "anumber": "A46916529",
  "id": "A46916529_0088",
  "page_index": 88,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0088/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4. Eligibility to Sponsor"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Part 4. Eligibility to Sponsor To be a sponsor you must be a U.S. citizen or national or a lawful permanent resident. If you are not the petitioning relative, you must provide proof of status. To prove status, U.S. citizens or nationals must attach a copy of a document proving status, such as a U.S. passport, birth certificate, or certificate of naturalization, and lawful permanent residents must attach a copy of both sides of their Alien Registration Card (Form I-551). The determination of your eligibility to sponsor an immigrant will be based on an evaluation of your demonstrated ability to maintain an annual income at or above 125 percent of the Federal poverty line (100 percent if you are a petitioner sponsoring your spouse or child and you are on active duty in the U.S. Armed Forces). The assessment of your ability to maintain an adequate income will include your current employment, household size, and household income as shown on the Federal income tax returns for the 3 most recent tax years. Assets that are readily converted to cash and that can be made available for the support of sponsored immigrants if necessary, including any such assets of the immigrant(s) you are sponsoring, may also be considered. The greatest weight in determining eligibility will be placed on current employment and household income. If a petitioner is unable to demonstrate ability to meet the stated income and asset requirements, a joint sponsor who can meet the income and asset requirements is needed. Failure to provide adequate evidence of income and/or assets or an affidavit of support completed by a joint sponsor will result in denial of the immigrant's application for an immigrant visa or adjustment to permanent resident status. A. Sponsor's Employment I am: 1. Employed by OSICOM TECHNOLOGUES (Provide evidence of employment) Annual salary $ 25,332.00 or hourly wage $ 12.17 (for 40 hours per week) 2. Self employed (Name of business) Nature of employment or business 3. Unemployed or retired since B. Use of Benefits Have you or anyone related to you by birth, marriage, or adoption living in your household or listed as a dependent on your most recent income tax return received any type of means-tested public benefit in the past 3 years? Yes No ( If yes, provide details, including programs and dates, on a separate sheet of paper) C. Sponsor's Household Size Number 1. Number of persons (related to you by birth, marriage, or adoption) living in your residence, including 2 yourself. (Do NOT include persons being sponsored in this affidavit.) 2. Number of immigrants being sponsored in this affidavit (Include all persons in Part 3.) 3. Number of immigrants NOT living in your household whom you are still obligated to support under a previously signed affidavit of support using Form I-864. 4. Number of persons who are otherwise dependent on you, as claimed in your tax return for the most recent tax year. 5. Total household size. (Add lines 1 through 4.) Total 3 List persons below who are included in lines 1 or 3 for whom you previously have submitted INS Form I-864, if your support obligation has not terminated. (If additional space is needed, use additional paper) Date Affidavit of Name A-Number Support Signed Relationship NONE Form T-864 (10/6/97) Paoe 2"
}