{
	"anumber": "A46916529",
	"id": "A46916529_0052",
	"page_index": 52,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0052/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1-17a (Rev. 1-16-87) U.S. Departn of Justice Federal Bureau of Investigation JUN 2 8 1990 37 7 3 Washington, D.C. 20537-9700 The finger impressions which have the number in individual finger blocks circled on the attached cards are not susceptible of accurate classification because of one or more of the various reasons listed below. Each fingerprint card indicates by number or nota- tion on the back of the fingerprint card the particular reason or reasons for its return. (1) Ink was unevenly distributed (8) One or more fingers printed twice (2) Fingers not fully inked or rolled (9) One or more impressions missing or partially missing. (3) Too much ink Please indicate if there is an amputation. If no amputa- (4) Insufficient ink tions, obtain these fingerprints. In cases of bent or (5) Some impressions smudged, possibly fingers slipped paralyzed fingers, it is suggested that a spoon or similar while being rolled, or fingers not clean and dry instrument be used and the fingers be printed individually (6) Ridge characteristics not distinct, possibly due to the (10) Fingerprints not in sequence in spaces indicated nature of the individual's employment or some other (11) Impressions not black on standard white fingerprint card cause. Legible prints may be obtained after a few days stock (7) Hands have been reversed (12) Fingerprint ink not permanent. Due to the volume of fingerprints contained in the fingerprint files of the FBI, and the use of super breakups and extensions in conjunction with the Henry Classification System, it is necessary to obtain exact ridge counts and tracings of all ten fingers in order to search our files properly. In the event of serious injury to a finger precluding the taking of prints of the finger at this time, it is suggested that printing be done at a later date when a complete set of prints may be secured. It is suggested that reprints be obtained and forwarded to the FBI for appropriate action. When submitting the reprints it is not necessary to return the original fingerprint card, as only one copy of each set of fingerprints is necessary for retention in this Bureau's files. For your information, a check by name only has been made on the enclosed prints with negative results. Thank you for your cooperation in this matter. Identification Division FBI Note: Illegible fingerprint cards submitted in connection with licensing or employment for which you are paying a fee must be returned with your resubmission of prints in order to receive credit for your original payment. Please Note Instructions on Reverse Side."
}
