{
  "anumber": "A46916529",
  "id": "A46916529_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Employment Authorization, I-765 ( (08/24/89)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U. S. Department of Justice OMB # 1115-0163 Immigration and Naturalization Service Application for Employment Authorization Do Not Write in This Block Please Complete Both Sides of Form Case ID# Action Stamp Fee Stamp A# Remarks Applicant is filing under 274a.12 Application Approved. Employment Authorized / Extended (Circle One) (Date). until (Date). Subject to the following conditions: Application Denied. Failed to establish eligibility under 8 CFR 274a.12 (a) or (c). Failed to establish economic necessity as required in 8 CFR 274a.12(c), (10), (13), (14). I am applying for: Permission to accept employment Replacement (of lost employment authorization document). Extension of my permission to accept employment (attach previous employment authorization document). 1. Name (Family Name in CAPS) (First) (Middle) 11. Have you ever before applied for employment authorization from INS? FRANCISCA HORTENCIA TOLE do Yes (If yes, complete below) 2. Other Names Used (Include Maiden Name) Which INS Office? Date(s) HORTENCIA TohEdo 3. Address in the United States (Number and Street) (Apt. Number) Results (Granted or Denied - attach all documentation) 4818 HENTON AV. COVINA CA 91724 (Town or City) (State/Country) (ZIP Code) 12. Date of Last Entry into the U.S. (Month/Day/Year) EL SALVADOR CA. 3- 8- 1970 4. Country of Citizenship 13. Place of Last Entry into the U.S. JUALLUA - SONSONATE ELSALVADORCA 5. Place of Birth (Town or City) (State/Province) (Country) 14. Manner of Last Entry (Visitor, Student, etc.) 1- 26 - 1913 ILEgAL 6. Date of Birth (Month/Day/Year) 7. Sex 15. Current Immigration Status (Visitor, Student, etc.) Male Female 8. Marital Status Married Single 16. Go to the Eligibility Section on the reverse of this form and check the Widowed Divorced box which applies to you. In the space below, place the number of the box you selected on the reverse side: 9. Social Security Number (Include all Numbers you have ever used) NONE Eligibility under 8 CFR 274a.12 10. Alien Registration Number (A-Number) or I-94 Number (if any) NONE ( ) ( ) ( ) Complete the reverse of this form before signature. Your Certification: I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information which the Immigration and Naturalization Service needs to determine eligibility for the benefit I am seeking. I have read the reverse of this form and have checked the appropriate block, which is identified in item #16, above. area 818-966-4752 - 3-26-1990 Signature Telephone Number Date Herteneia Toledo Signature of Person Preparing Form if Other Than Above: I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Print Name Address Signature Date Initial Receipt Resubmitted Relocated Completed Rec'd Sent Approved Denied Returned Form I-765 (08/24/89) Page 2"
}