{
	"anumber": "A46916529",
	"id": "A46916529_0069",
	"page_index": 69,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0069/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form I-4, I-10203"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "C. Un extranjero que intenta ingresar a los Estados Unidos para espionaje, sabotaje, violaciones al control de exportación, derrocamiento del Gobierno de los Estados Unidos u otras actividades ilegales; un extranjero que intenta ingresar a los Estados Unidos para llevar a cabo actividades terroristas; un extranjero que haya sido miembro de O afiliado al Partido Comunista, 0 cualquier otro partido totalitario; un extranjero que bajo las instrucciones del gobierno Nazi de Alemania, o de cualquier area ocupada, O aliada con, el gobierno Nazi de Alemania ordenó, incitó, ayudó, 0 de cualquier otra manera participó en la persecución de cualquier persona por su raza, religion, nacionalidad u opinión pública; un extranjero que haya participado en un genocidio. [212(a)(3)] (c. An alien who seeks to enter the United States to engage in espionage, sabotage, export control violations, overthrow of the Government of the United States, or other unlawful activity; an alien who seeks to enter the United States to engage in terrorist activities; an alien who has been a member of or affiliated with the Communist or any other totalitarian party; an alien who under the direction of the Nazi government of Germany, or any area occupied by, or allied with the Nazi government of Germany, ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion; an alien who has engaged in genocide). [212(a)(3)}. SI (YES) NO d. Un extranjero que probablemente se convertirá en carga pública [212(a)(4)] (d. An alien who is likely to become a public charge.) [212(a)(4)] SI (YES) NO e. Un extranjero que intenta ingresar con el propósito de llevar a cabo trabajos calificados O semi-calificados y que no haya sido autorizado por el Secretario de Trabajo; extranjeros que sean graduados de un colegio médico extranjero intentando brindar servicios médicos en los Estados Unidos y que no haya aprobado el examen National Board of Medical Examiners Examination 0 un examen equivalente. [212(a)(5)] (e. An alien who seeks to enter for the purpose of performing skilled or unskilled labor who has not been certified by the Secretary of Labor; an alien graduate of a foreign medical school seeking to perform medical services who has not passed the NBME exam or its equivalent). [212(a)(5)] SI (YES) NO f. Un extranjero que dentro del último año haya sido deportado, 0 quien dentro de los últimos cinco años, haya sido arrestado y deportado: un extranjero que intente 0 haya intentado obtener una visa, ingresar a los Estados Unidos, 0 cualquier beneficio de inmigración de los Estados Unidos, mediante fraude O tergiversación intencional; un extranjero que se encuentre en violación de la Sección 274C del Acta de Inmigración. [212(a)(6)] (f. An alien previously deported within one year, or arrested and deported within five years; an alien who seeks or has sought a visa, entry into the United States, or any U.S. immigration benefit by fraud or misrepresentation; an alien who knowingly assisted any other alien to enter, or try to enter the United States in violation of the law; an alien who is in violation of Section 274C of the Immigration Act. [212(a)(6)] SI (YES) NO g. Un extranjero que sea permanentemente inelegible para adquirir la ciudadania de los Estados Unidos; un extranjero que haya salido de los Estados Unidos para evadir el servicio militar en tiempo de guerra. [212(a)(8)] (g. An alien who is permanently ineligible for U.S. citizenship; a person who has departed the United States to evade military service in time of war.) [212(a)(8)] SI (YES) NO h. Un extranjero que venga a los Estados Unidos a practicar la poligamia; un extranjero que sea tutor y sea requerido para acompañar a un extranjero excluido; un extranjero que retenga la tenencia de un niño/ a fuera de los Estados Undios habiendose otorgado la custodia legal de ese niño/ a a un ciudadano de los Estados Unidos. [212(a)(9)] (h. An alien who is coming to the United States to practice polygamy; an alien who is a guardian required to accompany an excluded alien; an alien who withholds custody of a child outside the United States from a United States citizen granted legal custody). [212(a)(9)] SI (YES) NO i. Un extranjero que habiendo sido visitante de intercambio no haya cumplido con el requisito de residencia de dos años en el exterior [212(e)] (i An alien who is a former exchange visitor who has not fulfilled the two-year foreign residence requirement.) [212(e)] Es Ud. miembro o representante de una organización terrorista? (Are you a member or representative of a terrorist organization?) SI (YES) NO 34. ¿Ha sido Ud. alguna vez, arrestado convicto O recluido en prisión, 0 ha estado internado en un asilo para indigentes otra institución de caridad?; ¿Ha sido Ud. alguna vez beneficiario de un indulto 0 amnistia?: Ha sido Ud. tratado en un hospital, institución, o en otro lugar por insania U otro desorden mental? [222(a)] (Have you ever been arrested, convicted or ever been in a prison or almshouse?; have you ever been the beneficiary of a pardon or an amnesty?; have you ever been treated in an institution or hospital or other place for insanity or other mental disease? [212(a)] SI (YES) NO 35. Es poco probable que me convierta en una carga pública debido a lo siguiente: Recursos financieros personales (describa) ( are unlikely to become a public charge because of the following:) (Personal financial resources) (describe) Empleo (adjunte) (Employment) (attach) Declaración de sostenimiento (adjunte) (Affidavit of Support) (attach) II - : 2"
}
