{
	"anumber": "A46916529",
	"id": "A46916529_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: INS 1-2, Form Number: I-948503, Title: INS 1-2, Form Number: I-998503"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Guatemala"]
		},
		"years": {
			"ms_years_nlp_v1": [1950, 1946]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "16. LA/S PERSONA/S NOMBRADA/S EN 14 Y 15 QUE ME ACOMPAÑARA/N 0 SE REUNIRA/N CONMIGO EN LOS ESTADOS UNIDOS. (PERSON (S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES) Vicente Anibal Toledo 17. NOMBRE DE SOLTERA DE LA MADRE, FECHA Y LUGAR DE NACIMIENTO, Y DOMICILIO (Si ha fallecido, indiquelo dando año de fallecimiento) (MAIDEN NAME OF MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) Mercedes Totado Gea (fallecida) 18. NOMBRE DEL PADRE, FECHA Y LUGAR DE NACIMIENTO, Y DOMICILIO (Si ha fallecido, indiquelo dando año de fallecimiento) (NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS) (If deceased, so state, giving year of death) Vicente Arevalo Guevara (fallecido) 19. SI NINGUNO DE LOS PADRES VIVE, PROVEA NOMBRE Y DOMICILIO DEL PARIENTE MAS CERCANO EN SU PAIS DE/ORIGEN (IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY) Julio Cesar Rivas Toledo, 20. ENUMERE TODOS LOS IDIOMAS, INCLUYENDO EL PROPIO, QUE PUEDE HABLAR, LEER Y ESCRIBIR. (LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE) IDIOMA (LANGUAGE) HABLA (SPEAK) LEE (READ) ESCRIBE (WRITE) Espanol si si SI - - - - - - - 21. ENUMERE TODOS LOS LUGARES DONDE HAYA VIVIDO DURANTE DOCE MESES 0 MAS DESDE QUE CUMPLIO LOS 16 AÑOS. COMIENCE CON SU DOMICILIO ACTUAL: (LIST BELOW ALL PLACES YOU HAVE LIVED FOR TWELVE MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE). CIUDAD 0 PUEBLO PROVINCIA PAIS OCUPACION FECHAS (DATES) (CITY OR TOWN) Tiquizato Liquizate (PROVINCE) Guatemala (COUNTRY) (OCCUPATION) DESDE (FROM) of. Domesticas HASTA (TO) 1946 1950 Sorsonate Senoonate El Salvador of Domestices 1950 a Tatacha - - - - - - - - - - - 22. ENUMERE CUALQUIER ORGANIZACION POLITICA, PROFESIONAL, 0 SOCIAL VINCULADA CON ORGANIZACIONES COMUNISTAS, TOTALITARIAS, TERRORISTAS 0 NAZISTAS DE LAS QUE SEA AHORA 0 HAYA SIDO MIEMBRO 0 AFILIADO DESDE QUE CUMPLIO LOS 16 AÑOS. (LIST ANY POLITICAL, PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTALITARIAN, TERRORIST OR NAZI ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY). ES UD. MIEMBRO O REPRESENTANTE DE UNA ORGANIZACION TERRORISTA? (ARE YOU A MEMBER OR A REPRESENTATIVE OF A TERRORIST ORGANIZATION?) NOMBRE Y DOMICILIO (NAME AND ADDRESS) DESDE/HA (FROM/TO) CATEGORIA DE MIEMBRO (TYPE OF MEMBERSHIP) No pertinente No pertinente No pestinente - - - 23. ENUMERE LAS FECHAS DE TODAS LAS RESIDENCIAS ANTERIORES 0 VISITAS A LOS ESTADOS UNIDOS. DECLARE SI NUNCA ESTUVO. ACLARE TIPO DE VISA SI TIENE. INDIQUE NUMERO DE I.N.S. \"A\", SI LO SABE. (LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES. (If never, so state) GIVE VISA STATUS IF ANY. GIVE I.N.S. \"A\" NUMBER IF KNOWN). LUGAR (LOCATION) DESDE/HASTA VISA No pertinente No pertinest (FROM/TO) No (VISA) No pertinent pestinente I.N.S. N° (I.N.S. FILE N°) No - - - - - - NUMERO DE CASO (CASE NUMBER) FECHA (DATE) X Hortencia Toledo 5NS1998599011 15-12-98 NOTA: Devuelva este formulario completo INMEDIATAMENTE a la oficina consular cuya dirección aparece en la carta adjunta. Este formulario formará parte de su solicitud de visa de inmigrante la cual no podrá ser procesada hasta que este formulario haya sido completado y devuelto. NOTE: Return this completed form inmediately to the consular office address on the covering letter. This form will become part of your inmigrant visa application which cannot be processed until this form is complete. *Public reporting burden for this collection of information is estimated to average 24 hears per response. including time required for searching existing data sources, gathering the necessary data, providing the information required. and reviewing the final collection Send commonts 00 the accuracy. of this estimate of the burden and recommendations for reducing it to: Department of State (018/RA/DR) Washington, D.C. 20520-0264 and to the Office of information and Regulatory Afferire. Office of Management and Budget, Paperwork Reduction Project (1405-0015), Washington D.C. 20503. 1-2"
}
