{
	"anumber": "A55742403",
	"id": "A55742403_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1999, 1995, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 1484974 ain République D Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti No 01932 C Extrait des Registres des Actes de NAISSANCE déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du16 Mai 1995 I'ALV mil neuf cent quatre vingt- dix-neuf , An 19 6eme de I'Indé- pendance et le lundi vingt decembre a dix heurps du matin. Par devant nous Daniel D. DESRCSIERS Officier de l'etat civil de Port-au-Prince B ANNEE - 1999 section nord soussigné; conformement au décret du 16 mai 1995 ; A PAGE - 221 comparu le sieur FIDEII JOSEPH , deneurant et domicilié a Port-au-Prince NUMERC- 441 commune de Port-au-Prince; Ieluel nous a présenté un enfant du sexe REG. LV 32 féminin qu' i] nous a déclaré etre sa fille naturelle née a la valleee de Jacne] le vingt-cinq A o ut mil neuf cent quinze a huit heures du ACT DE \"AISSANCE DE: soir de la dame DEZUIMA CESAR , demeurant et domiciliée à Port-au- ANDREA JOSEPH Prince ; A laquelle enfant il a donné le prénom de: up. ANDREA \" Dont \" ee lo 25 A out 1915 acte fait en notre bureau rue du centre en présence de Adrien JOSEPH et =de Fritz CESAR , tous deux majeurs, demeurant et domiciliés a ALVTT:A 148697 Port-au-Prince; Apres lecture faitepar nous du présent acte l'ayons KJB signé seul;- SIGNE:+ D. D. DESRCSIERS PORt-au-Prince le 13 juilJet POUR COPIE CONFORME COITATIONNES TO CIVIL BERTRAND ZZRECTEUR GENERAI Angle Rues Borgella et Geffrard, Port-au-Prince, Haüti Tél : 222-0227/222-8566/223-1077 Fax (509)222-6280-B.P.: 1299"
}
