{
	"anumber": "A55742403",
	"id": "A55742403_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0024/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Archives Nationales d'Haiti, 060488"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1999, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 an Répubiuque à Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti No 060488 A Extrait des Registres des Actes de NAISSANCE déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du16 Mai 1995 L'An mil neuf cent quinze, An 112ème de l'Independance et le vingt-six Novembre à huit heures du matin. Par devant nous, PHILIPPER CHARLES, Officier de l'Etat Civil de la Commune de la Vallée de Jacmel. Soussigné. A Comparu ANNEE = 1915 le sieurFIDELI JOSEPH, propriétaire, demeurant et domicilié à la Vallée de PAGE = 115 Jacmel. Lequel nous a présenté un enfant du sexe féminin qu'il nous a déclaré NUMERO = 229 être sa fille naturelle née à la Vallée de Jacmel le vingt-cing Aout mil neuf cent quinze à cinq heures du matin, de la dame DEZULMA CESAR, demeurant et don ACTE DE NAISSANCE DE: ciliée avec lui. Auquel enfant il a donné le prénom de \" ANDREA\". Dont acte \" ANDREA JOSEPH\" fait et passé en notre Bureau à la Vallée de Jacmel en présence de VOLCY JOSE- Née le 25 Août 1915 PH et de ANDRENA CESAR, tous deux majeurs demeurant et domiciliés à la Vallée de Jacmel, témoins choisis et amenés par le comparant. Après lecture faite ANH/B-34862 par nous du présent acte l'avons signé seul, non le père et les témoins pour ne le pouvoir. ( SIGNE ) PH. CHARLES.-- Port-au-Prince, le 4 Mai 1999. M.G.A. POUR COPIE CONFORME COLLATIONNEE the JEAN WILFRID BERTRAND DIRECTEUR GENERAL Angle Rues Borgella et Geffrard, Port-au-Prince, Haiti Tél. 22-0227/22-8566/23-1077 Fax: (509)22-6280 B.P. 1299"
}
