{
  "anumber": "A55742403",
  "id": "A55742403_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4. Eligibility to Sponsor ( (Continued), Form I-864 ( (1/21/98)Y Page 3"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 Part 4. Eligibility to Sponsor (Continued) D. Sponsor's Annual Household Income Enter total unadjusted income from your Federal income tax return for the most recent tax year below. If you last filed a joint income tax return but are using only your own income to qualify, list total earnings from your W-2 Forms, or, if necessary to reach the required income for your household size, include income from other sources listed on your tax return. If your individual income does not meet the income requirement for your household size, you may also list total income for anyone related to you by birth, marriage, or adoption currently living with you in your residence if they have lived in your residence for the previous 6 months, or any person shown as a dependent on your Federal income tax return for the most recent tax year, even if not living in the household. For their income to be considered, household members or dependents must be willing to make their income available for support of the sponsored immigrant(s) and to complete and sign Form I-864A, Contract Between Sponsor and Household Member. A sponsored immigrant/household member only need complete Form I-864A if his or her income will be used to determine your ability to support a spouse and/or children immigrating with him or her. You must attach evidence of current employment and copies of income tax returns as filed with the IRS for the most recent 3 tax years for yourself and all persons whose income is listed below. See \"Required Evidence\" in Instructions. Income from all 3 years will be considered in determining your ability to support the immigrant(s) you are sponsoring. I filed a single/separate tax return for the most recent tax year. I filed a joint return for the most recent tax year which includes only my own income. I filed a joint return for the most recent tax year which includes income for my spouse and myself. I am submitting documentation of my individual income (Form W-2 and 1099). I am qualifying using my spouse's income; my spouse is submitting a Form I-864A. Indicate most recent tax year 2003 (tax year) Sponsor's individual income $ FOIA (b)(6) or Sponsor and spouse's combined income (If joint tax return filed; spouse must submit Form I-864A.) Income of other qualifying persons. (List names; include spouse if applicable. Each person must complete Form I-864A.) Total Household Income $ Explain on separate sheet of paper if you or any of the above listed individuals are submitting Federal income tax returns for fewer than 3 years, or if other explanation of income, employment, or evidence is necessary. E. Determination of Eligibility Based on Income 1. I am subject to the 125 percent of poverty line requirement for sponsors. I am subject to the 100 percent of poverty line requirement for sponsors on active duty in the U.S. Armed Forces sponsoring their spouse or child. 2. Sponsor's total household size, from Part 4.C., line 5 3. Minimum income requirement from the Poverty Guidelines chart for the year of 2003 FOIA (b)(6) is $ for this household size. (year) If you are currently employed and your household income for your household size is equal to or greater than the applicable poverty line requirement (from line E.3.), you do not need to list assets (Part 4.F. and 5) or have a joint sponsor (Part 6) unless you are requested to do SO by a Consular or Immigration Officer. You may skip to Part 7, Use of the Affidavit of Support to Overcome Public Charge Ground of Admissibility. Otherwise, you should continue with Part 4.F. Form I-864 (1/21/98)Y Page 3"
}