{
  "anumber": "A55742403",
  "id": "A55742403_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIBERTÉ, REF. 38011"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1950,
        1987,
        1943
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 LIBERTE EGALITE 63213L REFUBLI D*HAITI Extrait des registres acte de naissance de la commu ne de Port-au-Prince deposés Bulbureau des Archives Natic VVV No 38011 1.50 nales de la Republ que L'AN Mil neuf cent cinquant an 14 'Indepen PAPIER FINARE dance et le mercredi vingt deux mars a dix heure du ma- 6.1.95 atima tin Par devant nous Pierre Augustin René Salgado, Officier TOUS de l'Etat civil de Port-au-Frince section sud soussigné A comparu le sieur LISSON RAYNAL ebenis te dementent et - domicilié a Port-au-Prince Lequel nous a déclard econnai ANNEE 1950 tre pour son enfant nature e IRMA .Née a 3'Hopi al gene- PAGE 73 ral le trente et us janvier mil neuf cent qualante trois NUMERO 289 a quatre heures du matin de la dame ANDREA JOSEPH, coutu riere demeurant et domiciliée a Port-au-Prince Voulant et ACTE DE RECONNAISSAN entendant que par suite de cette declaration du reconnais CE DE: IRMA RAYNAL sance la dite enfant ajoute a son prénom le nom as :RAY 31 janvier 1943 NAL de manier à porter à l'avenir le nom patronymique de 2276465 EE la famille du comparant Dont note faiten rue ferou en présence do Maxêne Joseph et de Bastier Joseph journaliers tous deax majeurs demeurant et Port-au-Prince temoins choisis et amenés par le comparent ANH A 223800 Après lecture Caite parnous du présent acte l'avons si- gné seul non le comparant et les temoins pour ne savoir S) ) P. R. SALGADO Port-au-Prince le 24 avril 1987 POUR COPIE CONFORME COLLATIONNEE JUE JEAN ILFRID BERTRAND DIRECTEUR GENERAL M/A/J"
}