{
	"anumber": "A55742403",
	"id": "A55742403_0007",
	"page_index": 7,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0007/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form 1237A, Screened by NARA, 8/17/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1980, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 PAGE 2 15. NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state and give year of death) Joseph , PHiDelis P-A-P, HAili HAIT 16. MAIDEN NAME OF MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state and give year of death) DelisMAr CeSAR RAVIP, HAIT HAITI 17. LIST BELOW ALL EMPLOYMENT FOR THE LAST TEN YEARS EMPLOYER LOCATION JOB TITLE FROM/TO NONe NONE In what occupation do you intend to work in the United States? BABYSIT 18. LIST BELOW ALL EDUCATIONAL INSTITUTIONS ATTENDED SCHOOL AND LOCATION FROM/TO COURSE OF STUDY DEGREE OR DIPLOMA NONe NONe Languages spoken or read: CREOLE Professional associations of which you are a member: NONE 19. MILITARY SERVICE: Yes No Branch: Dates of Service: Rank/Position: Military Speciality/Occupation: 20. LIST BELOW ALL PLACES YOU HAVE LIVED FOR AT LEAST SIX MONTHS SINCE REACHING THE AGE OF 16. BEGIN WITH YOUR PRESENT RESIDENCE CITY OR TOWN PROVINCE COUNTRY FROM/TO Delmas 19 ne AURIRA/ Killick #23 RAN.A 1980 To Resert 21. LIST DATES OF ALL PREVIOUS VISITS TO OR RESIDENCE IN THE UNITED STATES. (If never, so state) GIVE TYPE OF VISA STATUS, IF KNOWN. GIVE \"A\" NUMBER, IF ANY. FROM/TO LOCATION VISA TYPE OR \"A\" NO. (If known) N/A N/A SIGNATURE OF APPLICANT DATE + NOTE: Return this completed form immediately to the consular office address on the covering letter. This form will become part of your immigrant visa and your visa application cannot be processed until this form is complete. Public reporting burden for this collection of information is estimated to average 1 hour per response, including time required for searching existing data sources gathering the necessary data providing the information required and reviewing the final collection Send comments on the accuracy of this estimate"
}
