{
	"anumber": "A55742403",
	"id": "A55742403_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of State Medical Examination for Immigrant or Refugee Applicant, DS-2053"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [2004, 2023, 2001, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 U. S. Department of State OMB No. 1405-0113 EXPIRATION DATE: 1/31/2004 MEDICAL EXAMINATION FOR ESTIMATED BURDEN: 40 minutes IMMIGRANT OR REFUGEE APPLICANT (See Page 2 Back of Form) Name (Last, First, MI) ANDREA JOSEPH Photo, Birth Date (mm-dd-yyyy) 07-29-1913 SEX: M F Birthplace (City/County) PORT AU-PRINCE HAITT Present Country of Residence HAITI Prior Country U. S. Consul (City/Country) PORT-AU-PRINCE HAITI / Passport Number HA 784(8807-19-2000) Alien (Case) Number 2002682035 Date Exam Expires (6 months from examination date, if Class A or TB condition exists, otherwise 12 months) (mm-dd-yyyy)Q2-23-05 Exam Place (City/Country) PORT-AU-PRINCE HAITI Panel Physician (name) ISAAC A. YVON Radiology Services (name) ADVENTIST HOSPITAL Screening Site (name) ADVENTIST HOSPITAL Lab (name for HIV/syphilis/TB) BIOMED / BIOMED / BIOMED (1) Classification (check all boxes that apply): No apparent defect, disease, or disability (see Worksheets DS-3024, DS-3025 and DS-3026) Class A Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, infectious (Class A, from Chest X-Ray Worksheet) Human immunodeficiency virus (HIV) Syphilis, untreated Hansen's disease, lepromatous or multibacillary Chancroid, untreated Addiction or abuse of specific* substance without harmful behavior Gonorrhea, untreated Any physical or mental disorder (including other Granuloma inguinale, untreated substance-related disorder) with harmful behavior or history Lymphogranuloma venereum, untreated of such behavior likely to recur amphetamines, cannabis, cocaine, hallucinogens, inhalants, opioids, phencyclidines, sedative-hypnotics, and anxiolytics Class B Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, noninfectious (Class B1, from Chest X-Ray Worksheet) Hansen's disease, prior treatment Treatment: None Partial Completed Hansen's disease, tuberculoid, borderline, or paucibacillary TB, inactive (Class B2, from Chest X-Ray Worksheet) Sustained, full remission of addiction or abuse of specific* substances Treatment: None Partial Completed Any physical or mental disorder (excluding addiction or Syphilis, treated within last year abuse of specific * substance but including other substance-related disorder) without harmful behavior or Other sexually transmitted infections, treated within last year history of such behavior unlikely to recur Current pregnancy, number of weeks pregnant amphetamines, cannabis, cocaine, hallucinogens, inhalants, opioids, phencyclidines, sedative-hypnotics, and anxiolytics Other (specify or give details on checked conditions from worksheets) HIGH Scoous RECEIVER Dres YOPIA (2) Laboratory Findings (check all boxes that apply): Syphilis: Not done Test name Positive Notes KPR Date(s) run (mm-dd-yyyy) Negative Titer 1 Screening 02-23-04 Confirmatory Treated If treated, therapy: Dates(s) treatment given (3 doses for penicillin) Yes Benzathine penicillin, 2.4 MU IM No Other (therapy, dose): HIV: Not done Test name Date(s) run (mm-dd-yyyy) Negative Positive Indeterminate Notes Screening ELINA 02-27-04 Secondary Confirmatory DS-2053 (Formerly OF-157) Page 1 of 2 01-2001"
}
