{
  "anumber": "A56035718",
  "id": "A56035718_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56035718_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Liberté, Égalité, Fraternité, WWW No 10528"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA. 9/14/2023 LIBERTE EGALITE FRATERNITE REPUBLIQUE D'HAITI Extrait des registres des actes de naissance de la commune de Port- LOVE de-Paix déposés au bureau des archives Nles de la République. www No 10528 1,50 50 L'An mil neuf cent six, An 103ème de l'Indépendance et le Lundi vingt Avril à dix heures du matin. Par devant nous Jacques Pierre, officier de l'Etat civil de la commune de P- Une gourds cinguante centime REPUBLIQUE D'HAITI G.1.39 de-Paix, soussigné; A comparu le sieur Cetoute Louis-XV1, cul- JUSTICE TOUS POUR tivateur demeurant et domicilié à Moustique 3ème section ru- rale de la commune de Port-de-Paix. Leugel nous a présenté un ANNEE 1906 enfant du sexe masculin qu'il nous a déclaré être son fils PAGE 98 légitime né en son domicile le dix-huit MARS mil neuf cent- NUMERO 145 six à cnze heures de soir de la dame Orélia Laurensaint, cul- tivatrice demeurant in omiciliée à Moustique. Auqued enfant CE DE : les prén, 78 de MICHEL DIT TRAGE : Dont acte fait DIT TRAGE LOUIS-XV1 en notre bureau en présence de Lucien Louis-XVI et de Louise Né le 18 Mars 1906 Laurensaint, tous deux majeurs demeurants et domiciliés au même lieu. I émoins choisis et amenés par le comparant. Après lecture faite par nous du présent acte l'avons signé seul, KJB. avec le père et non les temoins pour ne le savoir. SIGNE : JACQUES PIERRE. RECEPISSE 2 5023- N. Port-au-prince le 12 Juillet 1987 ANH/A 587603 POUR COPIE CONFORME ADCHIVES COLLATIONNE JEAN WILFRID BERTRA DIRECTEUR GENERAL. DWAY"
}