{
  "anumber": "A56064388",
  "id": "A56064388_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56064388_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certification, 91488"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "LIBERTE ScreenedTby NARA, 8/11/2023 FRATERNITE REPUBLICUE D'HAITI E 4 91488 PREMIERE EXPEDITION RELATIVE AUX REGISTRES DES ACTES DE L'OFFICE DE L'ETAT CIVIL DE LA COMMUNE DE PORT-AU-PRINCE, SECTION NORD. 1,50 1,50 Gde. Gde. L'an deux mille. An 197ème de l'Indépendance et le Mardi Trois Octobre a dix heures du matin. NOUS, DANIEL D. DESROSIERS, OFFICIER DT L'ETAT CIVIL DE LA SEC TION NORD DE PORT-AU-PRINCE. Une Gourde cinquante centimes Soussigné; CERTIFIONS ANNER Avoir transcrit aux régistres y afférents, en conformité de la iSS loi du 20 Août 1974, le dispositif d'un jugement rendu par le NUMERO Tribunal civil de Port-au-Prince, séant au Falais de Justice de cette ville en audience civile et publique le quatorze Juillet deux mille, sur requête de la citoyenne CHARITE MILFON, ayant pour Avocat Me Henock VOLTAIRE du barreau de Fort-au-Prince dû- TENANT-LIRU D'ACTE DE ment identifié, patenté et imposé; NAISSANCE DE : LEQUEL DISPOSITIF TSST AINSI LIBELLE CHARITE MILEON PAR CES MOTIFS Le Tribunal, après examen et sur les con- clusions du Ministère public, déclare sous la réserve des droit née le 12 Mai 1906, de ceux qui ont intérêt et qualité que : CHARITE MILFON, de sexe féminin, est née Gros morne le douze Mai mil neuf cent six, à à Gros morne. sept heures du soir, des oeuvres naturelles de PIERISTE MILFON et de CAROLE JEAN, tous deux décédés. Dit que le dispositif du présent jugement tiendra lieu d'acte de naissance de : CHARITE MILEON Ordonne la transcription du dispositif du présent juge- ment sur le régistre spécial tenu en double à cet effe+ par l'of ficier de l'Etat civil de la section NCRD de Por't-au-Prince con- formément aux dispositions de loi sur le Service d'inspection et de contrôle de l'Etat civil. Ainsi jugé et prononcé par nous, Me Lise Pierre Pierre, Doyen du Tribunal civil de Port-au-Prince, en audience civile et publique en date du quatorze Juillet deux Mille, en présence de Me Magnol Francois, substitut du Commissaire du Gouvernement de ce ressort avec assistance de Monsieur Ascensio Jumelle, Greffier du siè- ge. Il est ordonné Fitc En foi de quoi etc POUR COPIE CONFORME"
}