{
	"anumber": "A56064388",
	"id": "A56064388_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56064388_0010/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petitic for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp PTP20017340120 A# DISTRICT DIRECTOR APPROVED 11/14/2000 EAC-01-033-50171 EACBAG01 G-28 or Volag # Section of Law: RUL 31 2001 Petition was filed on: 11/09/00 (priority date) 201 (b) spouse 203 (a)(1) 201 (b) child 203 (a)(2) Donnam Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet. Ben. \"A\" File Reviewed Stateside Criteria VSC 203 (a)(5) 10898 Field Investigations 1-485 Simultaneously AM CON: 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: IRS A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) MILEON CHARITE 2. Address (Number and Street) (Apartment Number) RUELLE ASSAD 6 # 2 BIZOTON CARREFOUR (Town or City) (State/Country) (ZIP/Postal Code) PORT-AU-PRINCE HAITI 3. Place of Birth (Town or City) (State/Country) GROSMORNE HAITI 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 05/12/06 Female Widowed Divorced 7. Other Names Used (including maiden name) 8. Date and Place of Present Marriage (if married) 9. Social Security Number 10. Alien Registration Number (if any) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) N/A OR Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 16. Has your relative ever been under immigration proceedings? Yes No Where When Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/13/98)N"
}
