{
  "anumber": "A56035718",
  "id": "A56035718_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56035718_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "VACCINATION DOCUMENTATION WORKSSHEET, DS-2053"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2002,
        2004,
        1906,
        2023,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/14/2023 U.S. Department of State OMB No. 1405 0113 VACCINATION DOCUMENTATION WORKSHEET EXPIRATION DATE: 1/31/2004 ESTIMATED BURDEN: 30 minutes For Use with DS-2053 To Be Completed by Panel Physician Only (See Page 2 Back of Form) Name (Last, First, MI) Exam Date (mm-dd-yyyy) REQUIRED FOR U.S. IMMIGRANT VISA APPLICANTS LOUIS-XVI MICHEL DIT TRAGE 05-23-2002 Birth Date (mm-dd-yyyy) Passport Number Alien (Case) Number NOT REQUIRED FOR REFUGEE APPLICANTS 03-18-1906 HAF10250 2001719036 NOTE FOR PANEL PHYSICIANS: For refugee applicants, please complete only if reliable vaccination 1. Immunization Record documents are available Vaccine History Transferred from a Written Record (list chronologically from left to right) Completed Series Blanket Waiver(s) To Be Requested. If Vaccination Not (v if completed, Medically Appropriate, Check Suitable Box(es) Below Vaccine given write \"VH\" if by Date Received Date Received Date Received varicella history, or Date Received write date of lab Not age Insufficient time Contra- Not fall Vaccine Panel Physician (mm/dd/yyyy) (mm/dd/yyyy) (mm/dd/yyyy) (mm/dd/yyyy) appropriate interval indicated (mm/dd/yyyy) (flu) season test DT/DTP/DTaP Td MAY 2 3 2002 Polio (OPV/IPV) Measles Mumps (or MMR) Rubella (or MR or MMR) Hib (Haemophilus influenzee type b) Hepatitis B Varicella MAY 23 2002 Pneumococcal PLAY 23 2002 Influenza 2. Results Vaccine history incomplete Dr. Michel THEARD Applicant may be eligible for blanket waiver(s) because 3. Panel Physician (name) Dr.vMichel PHYSICIAN vaccination(s) not medically appropriate (as indicated above) 31, Ave Charles Summer, Port-au-Prince, Haiti Tet: 510-4545 Applicant will request an individual waiver based on religious or moral convictions. Panel Physician (signature) Tels: Fax ($02) 245-0583 / (509) 245-4545 Vaccine history complete for each vaccine, all requirements met (documented above) Date (mm/dd/yyyy) 05-23-2002 Applicant does not meet vaccination requirements for one or more vaccines and no waiver is requested. DS-3025 Give copy to applicant Page 1 of 2 01-2001"
}