{
  "anumber": "A56064388",
  "id": "A56064388_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56064388_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/11/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 16. PERSONNES MENTIONNEES AUX RUBRIQUES 14 et 15 QUI M'ACCOMPAGNERONT ou ME REJOINDRONT AUX ETATS-UNIS. N/A 17. NOM DU PERE, DATE ET LIEU DE NAISSANCE ET ADRESSE (en cas de décès, indiquer la date du décès) N/A Decide 18. NOM DE JEUNE FILLE DE LA MERE, DATE ET LIEU DE NAISSANCE ET ADRESSE (en cas de décès, indiquer la date du décès) N/A secide 19. SI vos PARENTS SONT DECEDES, INDIQUER LE NOM ET L'ADRESSE DE VOTRE PLUS PROCHE PARENT DANS VOTRE PAYS D'ORIGINE. GUERDA MILEON Ruelle ASSAGE 6 #2 PART PRINCE, HAIR T1 20. LANGUES PARLEES, LUES, ECRITES LANGUES CREOLE PARLEES LUES ECRITES 21. LIEUX DE RESIDENCE SUCCESSIFS POUR SEJOURS DE PLUS DE SIX MOIS A PARTIR DE L'AGE DE 16 ANS. COMMENCER PAR VOTRE DOMICILE ACTUEL. PORT-AV PRINCE Haiti 22. MENTIONNER CI-DESSOUS LES ORGANISATIONS POLITIQUES ou SOCIO-PROFESSIONNELLES AFFILIEES A UN PARTI COMMUNISTE, TOTA- LITAIRE, TERRORISTE OU NAZI, DONT vous ETES OU AVEZ ETE MEMBRE ou ADHERENT DEPUIS L'AGE DE 16 ANS. NOM ET ADRESSE DATES AFFILIATION AUCUNE 23. MENTIONNER LES DATES DE vos SEJOURS OU VISITES SUCCESSIVES AUX ETATS-UNIS ET PRECISER EVENTUELLEMENT LA CATEGO- RIE DE VISA OBTENUE. INDIQUER S'IL Y A LIEU LE NUMERO D'ENREGISTREMENT DE VOTRE DOSSIER AU SERVICE D'IMMIGRATION. LIEU AUCUNE DATES VISA N° DE DOSSIER SIGNATURE DU DEMANDEUR DATE FOIA (b)(6) 7/2/02 MENT REMPLI A L'ADRESSE DES SERVICES CONSULAIRES. EUT SE FAIRE QUE SUR ETUDE DE CE FORMULAIRE. . Public reporting burden for this collection of information is estimated to average 24 hours per response. Including time required for searching existing data sources, gathering the necessary data. providing the information required, and reviewing the final collection. Send comments on the accuracy of this estimate of the burden and recommendations for reducing it to Department of State (OIS/RA/DR) Washington D.C. 20520-0264, and to the Office of Information and Regulatory Affairs. Office of Management and Budget Paperwork Reduction Project (1405-0015). Washington D.C. 20603. IMP. H. DESCHAMPS"
}