{
	"anumber": "A56064388",
	"id": "A56064388_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56064388_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Liberty, Equality, Fraternity, E-4 91488"
		},
		"years": {
			"ms_years_nlp_v1": [2002, 1974, 1906, 2023, 2000]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 Liberty Equality Fraternity Republic of Haiti E-4 91488 First Expedition Accordingly to the Registry of Certificates of Civil Status Office from the Town-Hall of Port-au-Prince, North Section. The year two thousand, 197th of the Independence and Tuesday October 3 at 10:00AM. We, Daniel D. Desrosiers, officer of the civil status of north section of Port-au-Prince. Undersigned; Certify having transcribed to the registry, in accordance with the law of August 20, 1974, the result of a judgement rendered by the Civil Court of Port-au-Prince, at the Palace of Justice of the aforesaid city in civil and public hearing on July 14, 2000, under the request of the citizen, Charite Mileon, having for legal counselor, Attorney Henock Voltaire from the Port-au-Prince Bar duly patented and identified, which document below presented: Under those grounds, the Court after having examined the and under the findings of the public prosecutor, states under the reservation of the rights of the interested party that: Charite Mileon of female sex, born in Gros Morne on May 12, 1906 at 7:00PM, daughter of Pieriste Mileon and Carole Jean, both deceased. State that the document of the present judgement replace the birth certificate of Charite Mileon. Authorize the transcript of this document of the present judgement in the special registry held for this effect by the officer of the civil status of the north section of Port-au-Prince accordingly to the disposition of the law of the service of inspection and controle of civil status. So judged and pronounced before us, Atty. Lise Pierre Pierre, dean of the civil court of port-au-Prince, in public and civil hearing on July 14, 2000, with the presence of Atty. Magnol Francois, substitute commissary of the governement with the assistance of Mr. Ascencio Jumelle, clerk of the court. Replace Birth Certificate of Charite Mileon, born on May 12, 1906 in Gros Morne. Signed by: Lionel A. Sajous, General Director I certify that the above translation is correct and true and that I have the knowledge of both, English and French languages. Sworn and subscribed before me this 30th day of June 2002 L Notarv Public Translator"
}
