{
  "anumber": "A56035718",
  "id": "A56035718_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56035718_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 10/13/98)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        2000,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petitiv or Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp PTP2001719036C A# APPROVED corr DIRECTOR G-28 or Volag # E/ 11/29/2000 SRC-01-044-50465 SRCBAH01 Section of Law: JUL 1 2 2001 Petition was filed on: 201 (b) spouse 203 (a)(1) 11/27/00 (priority date) 201 (b) child 203 (a)(2) Recommended Station Kunti Personal Interview Previously Forwarded 201 (b) parent 203 (a)(4) Pet. Ben. \"A\" File Reviewed Stateside Criteria VSC 9976 203 (a)(5) Field Investigations 1-485 Simultaneously AM CON: NYC 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) BAZile Odette Louis XVI michel Dit TRAGE 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) 6211 N.W 18th PLACE DE/mAS 18 Rue PEAN 26 (Apartment Number) (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) SUNRiSE FlA 33313 Port-Au- PRiNCE Haiti (W.I.) 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) BASSIN-Blen HAiTI MOUST que Port. de-PAix HAit, 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 10/01/31 Female Widowed Divorced 03/18/1906 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) SAme Above Louis S/A 110 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) NONE N/A 7X0887 9. '00 FOIA (b)(6) 9. Social Security Number 10. Alien Registration Number (if any N/A N/A 11. Names of Prior Husbands/Wives, 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended BAZITE milius 05/20/85 EliZABETH GARGON 7/85 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) 2303579 1/17/97 Miami NO Parents copy attached Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued NO 2303579 1/17/97 MIAMI FlA 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: N/A 16. Has your relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form 1-130 (Rev. 10/13/98)N"
}