{
  "anumber": "A56035718",
  "id": "A56035718_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56035718_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4. Eligibility to Sponsor ( Continued"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Part 4. Eligibility to Sponsor (Continued) F. Sponsor's Assets and Liabilities Your assets and those of your qualifying household members and dependents may be used to demonstrate ability to maintain an income at or above 125 percent (or 100 percent, if applicable) of the poverty line if they are available for the support of the sponsored immigrant(s) and can readily be converted into cash within 1 year. The household member, other than the immigrant(s) you are sponsoring, must complete and sign Form I-864A, Contract Between Sponsor and Household Member. List the cash value of each asset after any debts or liens are subtracted. Supporting evidence must be attached to establish location, ownership, date of acquisition, and value of each asset listed, including any liens and liabilities related to each asset listed. See \"Evidence of Assets\" in Instructions. Type of Asset Cash Value of Assets (Subtract any debts) Savings deposits $ FOIA (b)(6) Stocks, bonds, certificates of deposit $ Life insurance cash value $ Real estate $ Other (specify) checking $ Total Cash Value of Assets $ Part 5. Immigrant's Assets and Offsetting Liabilities The sponsored immigrant's assets may also be used in support of your ability to maintain income at or above 125 percent of the poverty line if the assets are or will be available in the United States for the support of the sponsored immigrant(s) and can readily be converted into cash within 1 year. The sponsored immigrant should provide information on his or her assets in a format similar to part 4.F. above. Supporting evidence must be attached to establish location, ownership, and value of each asset listed, including any liens and liabilities for each asset listed. See \"Evidence of Assets\" in Instructions. Part 6. Joint Sponsors If household income and assets do not meet the appropriate poverty line for your household size, a joint sponsor is required. There may be more than one joint sponsor, but each joint sponsor must individually meet the 125 percent of poverty line requirement based on his or her household income and/or assets, including any assets of the sponsored immigrant. By submitting a separate Affidavit of Support under Section 213A of the Act (Form I-864), a joint sponsor accepts joint responsibility with the petitioner for the sponsored immigrant(s) until they become U.S. citizens, can be credited with 40 quarters of work, leave the United States permanently, or die. Part 7. Use of the Affidavit of Support to Overcome Public Charge Ground of Inadmissibility Section 212(a)(4)(C) of the Immigration and Nationality Act provides that an alien seeking permanent residence as an immediate relative (including an orphan), as a family-sponsored immigrant, or as an alien who will accompany or follow to join another alien is considered to be likely to become a public charge and is inadmissible to the United States unless a sponsor submits a legally enforceable affidavit of support on behalf of the alien. Section 212(a)(4)(D) imposes the same requirement on an employment-based immigrant, and those aliens who accompany or follow to join the employment- based immigrant, if the employment-based immigrant will be employed by a relative, or by a firm in which a relative owns a significant interest. Separate affidavits of support are required for family members at the time they immigrate if they are not included on this affidavit of support or do not apply for an immigrant visa or adjustment of status within 6 months of the date this affidavit of support is originally signed. The sponsor must provide the sponsored immigrant(s) whatever support is necessary to maintain them at an income that is at least 125 percent of the Federal poverty guidelines. I submit this affidavit of support in consideration of the sponsored immigrant(s) not being found inadmissible to the United States under section 212(a)(4)(C) (or 212(a)(4)(D) for an employment-based immigrant) and to enable the sponsored immigrant(s) to overcome this ground of inadmissibility. I agree to provide the sponsored immigrant(s) whatever support is necessary to maintain the sponsored immigrant(s) at an income that is at least 125 percent of the Federal poverty guidelines. I understand that my obligation will continue until my death or the sponsored immigrant(s) have become U.S. citizens, can be credited with 40 quarters of work, depart the United States permanently, or die. Form I-864 (1/21/98)Y Page 4"
}