{
  "anumber": "A56064388",
  "id": "A56064388_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56064388_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Archives Nationales d’Haiti, 0028370 F"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        2002
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 République à Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti No 0028370 F Extrait des Registres des Actes de NAISSANCE ANNEE déposés au bureau des Archives Nationales 2000 de la République et délivré sur papier non timbré suivant l'article 2 du décret du 12 mai 1995 PAGE L'an deux mille an 197e de l'Indépendance et le mardi trois octobre a dix NUMERO 85 heures du matin. Nous Daniel D.Desrosiers officier de l'Etat civil de la com- mune de Port au Prince section nord soussigné. Certifions avoir transcrit aux TENANT LIEU D'ACTE registres y afférents en conformité de la loi du 20 aout 1974 le dispositif DE NAISSANCE DE d'un jugement rendu car le tribunal civil de Port au Prince séant au palais CHARITE MILEON de justice de cette ville en audience civile et publique le quatorze juillet née le 12 mai 1906 deux mille sur requete de la citoyenne CHARITE MILEON ayant pour avocat Me He- a Gros-Morne nock Voltaire du barreau de Port au Prince dument identifié, patenté et impo- sé Lequel dispositif est ainsi libellé PAR CES MOTIFS le tribunal après examen et sur les conclusions du ministére public déclare sous la réserve des droits de ceux qui ont intéret et qualité que CHARITE MILEON de sexe féminin est née a Gros-Morne le douze mai mil neuf cent six a sept heures du soir des oeuvres naturelles de PIERISTE MILEON et de CAROLE JISAN tous deux décédés. Dint que le dispositif du présent jugement ANE/E78834 tiendra lieu d'acte de naissance de CHARITE MILEON Ordonne la transcription du dispositif du présent jugement sur le registre spécial tenu en double a cet effet par l'officier de l'Etat civil de la section nord de Port au Prince conformément aux dispositions de loi sur le service d'inspection et de controle de l'Etat civil Ainsi jugé et prononcé par nous Me Lise Pierre Pierre doyen du tribunal civil de Port au Prince en audience civile et publique en date du quatorze juillet deux mille en présence de Me Magnol François subs du gou- vernement de ce ressort avec l'assistance de monateur Ascenc ©amelle greffier du siège.II est ordonné etc..en foi de quoi etain SIGNE) D.D.Desrosiers Port au Prince le ler mars 2002 BALENCOURT POUR COPIE CO N FORME GENERAL a.i. COLLITIONNES ETAT CM MAB Angle Rues Borgella et Geffrard, Port-au-Prince, Haüti Tél : 222-0227/222-8566/223-1077 Fax (509) 222-6280 B.P. 1299"
}