{
	"anumber": "A56035718",
	"id": "A56035718_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56035718_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 9/14/2023, I-1155"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 If you are filing for your: 10. Where should you file this form? A. A. husband or wife, give INS If you live in the United States, send or take the form to the INS I) your marriage certificate office that has jurisdiction over where you live. B. If you live outside the United States, contact the nearest 2) a color photo of you and one of your husband or wife, American Consulate to find out where to send or take the taken within 30 days of the date of this petition. These completed form. photos must have a white background. They must be glossy, unretouched, and not mounted. The dimension of the facial image should be about 1 inch from chin to top of 11. What is the fee? hair in 3/4 frontal view, showing the right side of the face You must pay one hundred ten dollars ($110.00) to file this form. with the right ear visible. Using pencil or felt pen, lightly The fee will not be refunded, whether the petition is approved print name (and Alien Registration Number, if known) on or not. DO NOT MAIL CASH. All checks or money orders, the back of each photograph. whether U.S. or foreign, must be payable in U.S. currency at a 3) a completed and signed G-325A (Biographic Information) financial institution in the United States. When a check is drawn on for you and one for your husband or wife. Except for name the account of a person other than yourself, write your name on the and signature, you do not have to repeat on the G-325A face of the check. If the check is not honored, INS will charge you the information given on your I-130 petition. $30.00. B. child and you are the mother, give the child's birth certificate Pay by check or money order in the exact amount. Make the check showing your name and the name of your child. Or money order payable to \"Immigration and Naturalization Service\". C. child and you are the father or stepparent, give the child's However, birth certificate showing both parents' names and your marriage A. if you live in Guam: Make the check or money order payable to certificate. Child born out of wedlock and you are the father, Treasurer, Guam\", or give proof that a parent/child relationship exists or existed. For B. if you live in the U.S. Virgin Islands: Make the check or money example, the child's birth certificate showing your name and order payable to \"Commissioner of Finance of the Virgin evidence that you have financially supported the child. (A blood Islands\". test may be necessary). D. brother or sister, your birth certificate and the birth certificate 12. When will a visa become available? of your brother or sister showing both parents' names. If you do When a petition is approved for the husband, wife, parent, or not have the same mother, you must also give the marriage unmarried minor child of a United States citizen, these relatives do not certificates of your father to both mothers. have to wait for a visa number, as they are not subject to the E. mother, give your birth certificate showing your name and the name of your mother. immigrant visa limit. However, for a child to qualify for this category, F. father, give your birth certificate showing the names of both all processing must be completed and the child must enter the United parents and your parents' marriage certificate. States before his or her 21st birthday. G. stepparent, give your birth certificate showing the names of both natural parents and the marriage certificate of your parent For all other alien relatives there are only a limited number of to your stepparent. immigrant visas each year. The visas are given out in the order in H. adoptive parent or adopted child, give a certified copy of the which INS receives properly filed petitions. To be considered properly adoption decree, the legal custody decree if you obtained filed, a petition must be completed accurately and signed, the required custody of the child before adoption, and a statement showing documents must be attached, and the fee must be paid. the dates and places you have lived together with the child. For a monthly update on the dates for which immigrant visas are 8. What if a document is not available? available, you may call (202) 647-0508. If the documents needed above are not available, you can give INS the following instead. (INS may require a statement from the 13. What are the penalties for committing marriage fraud or appropriate civil authority certifying that the needed document is not submitting false information or both? available.) Title 8, United States Code, Section 1325 states that any individual A. Church record: A certificate under the seal of the church where who knowingly enters into a marriage contract for the purpose of the baptism, dedication, or comparable rite occurred within two evading any provision of the immigration laws shall be imprisoned for months after birth, showing the date and place of child's birth, not more than five years, or fined not more than $250,000.00 or both. date of the religious ccremony, and the names of the child's Title 18, United States Code, Section 1001 states that whoever parents. willfully and knowingly falsifies a material fact, makes a false B. School record: A letter from the authorities of the school statement, or makes use of a false document will be fined up to attended (preferably the first school), showing the date of $10,000 or imprisoned up to five years, or both. admission to the school, child's date and place of birth, and the names and places of birth parents, if shown in the school records. 14. What is our authority for collecting this information? C. Census record: State or federal census record showing the We request the information on the form to carry out the immigration names, place of birth, and date of birth or the age of the person laws contained in Title 8, United States Code, Section 1154(a). We listed. need this information to determine whether a person is eligible for D. Affidavits: Written statements sworn to or affirmed by two immigration benefits. The information you provide may also be persons who were living at the time and who have personal disclosed to other federal, state, local, and foreign law enforcement knowledge of the event you are trying to prove; for example, the and regulatory agencies during the course of the investigation date and place of birth, marriage, or death. The persons making required by this Service. You do not have to give this information. the affidavits need not be citizens of the United States. Each However, if you refuse to give some or all of it, your petition may be affidavit should contain the following information regarding the denied. person making the affidavit his or her full name, address, date 15. Reporting Burden. and place of birth, and his or her relationship to you, if any; full A person is not required to respond to a collection of information information concerning the event; and complete details unless it displays a currently valid OMB control number. Public concerning how the person acquired knowledge of the event. reporting burden for this collection of information is estimated to 9. How should you prepare this form? average 30 minutes per response, including the time for reviewing A. Type or print legibly in ink. instructions, searching existing data sources, gathering and B. If you need extra space to complete any item, attach a maintaining the data needed, and completing and reviewing the continuation sheet, indicate the item number, and date and sign collection of information. Send comments regarding this burden each sheet estimate or any other aspect of this collection of information, including C. Answer all questions fully and accurately. If any item does not suggestions for reducing this burden, to: U.S. Department of Justice, apply, please write \"N/A\". Immigration and Naturalization Service (Room 5307), Washington, D.C. 20536; OMB No.1115-0054. DO NOT MAIL YOUR COMPLETED APPLICATION TO THIS ADDRESS. It is not possible to cover all the con ons for eligibility or to give instructi for every situation. If you have C fully read all the instructions and S aave questions, please contact your nea INS office."
}
