{
  "anumber": "A56126907",
  "id": "A56126907_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PAR CES MOTIFS"
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 PAR CES MOTIFS: Le Tribunal, après examen, et sur les conclusions conformes du ministere public, rectifie l'aote de Mariage de: Nestor Dely Gauman dit Barron et de SERENA DOSSOUS BERNARD, dressé le 21 Mai 1942, pour la commune du Borgne, insorit au No 22. page 22 pour qu'on puisse lire d'abord dans le oorps du dit aote; 10) RPOUX : FLORVILUS GOMAN et non Mestor Dely Gauman dit Barron, oultivateur, identifié, 20) fils legitime de BARRON GOMAN et non Dely Gauman dit Barrond et de Julienne Julien, 30) repouses CERENA DOSSOUS et non Serana Dos sous Perhard, oultivatrice, domioiliee, 4) fille naturelle de: BERNARD DOSSOUS et non Dossous Bernard.- et en marge du dit acte; Annee 1942 , page 22, No 22, Aote de Mariage de: FLORVILUS GOMAN at de CERENA DOSSOUS?, le 21 Mai 1942: en lieu et place de Mariage de Nestor Dely Goman dit Barron de Serena Dossous Bernard. Dit et déolare en outre FLORVILUS GOMAN ou Nestor Dely Gauman dit Barron, epoux de la oitoyenne CERENA DOSSOUS et non Serena Dossous Bernard, ne designent respectivement qu'une seule et meme personne physique. Dit que le père du sieur FLORVILUS GOMAN se nomme BARRON GOMAN et non Dely Gauman dit Barrond, le sieur Bernard Dossous et non Dossous Bernard-etan le père de l'epouse du sieur FLORVILUS GOMAN, espectivement meme personne physique, Fait défense aux détenteurs des susdits registres de n'en délivrer aucun extrait aass oes men tion de THE rectifications au sein des dits aotes. Donne delegation au Doyen du tribunal oivil de P-au-Poe aux fins de oommise d'huissier pour la signification de la presentedecision au Direoteur des Archives Nles de la Republique-qui en oas de non transcription ou de la lerte des registres est autorise a garder au rang des minutes l'extrait reotifié comme oopie ou extrait a etre délivré au besoin avec les rectifications ordonnées. Clest droit CE QUI SERA EXECUTE:+ Rendu de: nous, Frederio P. Calixte av. juge d-doyen au tribunal oivil du Cap-Haitien, en audience ordinaire et publique du lundi vingt-et-un novembre mil neuf oent quatre vingt-quatorze, an 191eme de Independance en présence de Me Henri Claude Adhemar, av. substitut du oommissaire du Gvt avec assistance de Monsieur Gerard Charanfant freffier de siège;- Port-auDPrince le 15 decembre 1994 JEAN WILFRID BERTRAND DIRECTBIX GENERAL"
}