{
  "anumber": "A56126907",
  "id": "A56126907_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support Under Section 2 of the Act, I-864 (09/26/00)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2002
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 net OMB No. 1115-0214 U.S. Department of Justice Affidavit of Support Under Section Immigration and Naturalization Service 213A of the Act START HERE - Please Type or Print Part 1. Information on Sponsor (You) Last Name FOIA (b)(6) First Nam FOIA (b)(6) Middle Name Mailing Address (Street Number and Name) FOIA (b)(6) Ap /Suita Number FOIA (b)(6) City SFOIA (b)(6) Province Country ZIP/Postal Code Telephone Number FOIA (b)(6) N-A Place of Residence if different from above (Street Number and Name) Apt/Suite Number SAME AS ABOVE N-A FOR AGENCY USE ONLY City State or Province This Affidavit Receipt N-A N-A Meets Country ZIP/Postal Code Telephone Number N-A N-A N-A [ ] Does not meet Date of Birth (Month Day Year) Place of Birth (Cin State, Country) Are you a U.S. Citizen? FOIA (b) (6) FOIA (b)(6) FOIA (b)(6) Requirements of Section 213A Social Security Number A. Number 11r and FOIA (b)(6) FOIA (b)(6) ye Part 2. Basis for Filing Affidavit of Support I am filing this affidavit of support because (check one): Officer or I.J. Signature a. I filed/am filing the alien relative pe b. I filed/am filing an alien worker peti Pet RP immigrant, who is related to me as Location C. I have ownership interest of at least 39k/3 +2 petition) 26 NOV. 2002 which filed an alien worker petition immigrant, who is related to me as OR . d. I am a joint sponsor willing to acce nsor(s). Part 3. Information on the Immigrant(s) You Are Sponsoring Last Name First Name Middle Name GOMAN FLORVILUS Date of Birth (Month, Day, Year) Sex Social Security Number (If any) 02-14-1901 Male Female N-A Country of Citizenship A-Number (If any) HAITI N-A Current Address (Street Number and Name) Apt/Suite Number City CITE CHAUREL RUELLE JESSIFRA #59 N-A N-A State/Province Country ZIP/Postal Code Telephone Number CAP-HAITIAN HAITI W.I. N-A List any spouse and/or children immigrating with the immigrant named above in this Part: (Use additional sheet of paper if necessary.) Relationship to Sponsored Name Immigrant Date of Birth A-Number Social Security Number (If any) (If any) Spouse Son Daughter Mo. Day Yr. N-A Form 1-864 (09/26/00)Y"
}