{
	"anumber": "A56126907",
	"id": "A56126907_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 8/11/2023, Form Number: ARB-29"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 g. Tout ressortissant étranger qui ne peut prétendre à la nationalité américaine; quiconque aura quitté les Etats-Unis pour échapper au service militaire en période de guerre (212) (a) (8). OUI NON h. Tout ressortissant étranger qui se rendrait aux Etats-Unis pour pratiquer la polygamie; tout ressortissant étranger à qui aura été confié le droit de garde d'un individu, objet d'une mesure d'exclusion; tout ressortissant qui retiendra hors des Etats-Unis un enfant dont le droit de garde avait été confié à un ressortissant américain (212) (a) (9). OUI NON i. Tout ressortissant étranger qui aurait récemment participé à un programme d'échange et n'aurait pas satisfait à l'obligation de résidence de deux ans à l'étranger (212) (e). OUI NON j. Tout ressortissant étranger qui serait représentant ou qui ferait partie d'une organisation terroriste (212) (a)(3)B OUI NON Pour toute réponse positive ou incertaine, à l'une des questions ci-dessus enoncées, fournir l'explication dans l'espace réservé à cet usage, ou sur une feuille séparée. 34. Avez-vous été l'objet de mesures d'arrestation ou de condamnation: avez-vous été incarcéré ou hébergé dans un foyer de sans-abri; avez-vous bénéficié d'une mesure de clémence ou d'amnistie; avez-vous été soigné dans un hôpital (ou autre établissement de soins psychiatriques? (222) (a). OUI NON 35. Je n'envisage pas de recourir à l'aide publique pour les raisons suivantes Ressources financières personnelles (préciser) Emploi (justificatif à joindre) Lettre de cautionnement (à joindre) 36. Avez-vous déjà sollicité un visa pour les Etats-Unis? OUI NON (En cas de réponse positive, indiquer la catégorie du visa (immigration ou séjour temporaire), les date et lieu de délivrance; mentionner tout refus de visa). 37. Avez-vous été refoulé à votre arrivée aux États-Unis? OUI NON (si oui, pourquoi?) 38. Vous a-t-on aidé à remplir ce formulaire? OUI NON (Si oui, indiquez le nom et l'adresse de la personne qui vous a aidé, en précisant s'il s'agit d'un parent, d'un ami, d'un agent de voyage, d'un avocat ou autre). NOM ADRESSE TITRE OU LIEN DE PARENTE 39. Les documents suivants sont soumis à l'appui de cette demande Passeport Livret militaire Justificatifs de propriété Certificat de naissance Extrait de casier judiciaire Lettre de cautionnement Certificat de mariage Carnet de santé Offre d'emploi Certificat de décès Photographies Autres Jugement de divorce Extrait d'acte de naissance pour chacun des enfants n'émigrant pas à cette date (mentionner le nom des enfants pour lesquels ce document n'aura pu être obtenu) NE RIEN ECRIRE EN DESSOUS DE CETTE LIGNE NE REPONDRE AUX QUESTIONS 40 ET 41 L'AIDE DE L'OFFICIER CONSULAIRE 40. Je déclare être habilité à recevoir un visa et ne pas être l'objet de mesures d'exclusion au titre du paragraphe article 33, pour les raisons suivantes 212 (a) (5) Dérogation au titre de l'article Restriction non applicable (212) (a) (3)(D)(ii). 212 (e) 212 (h) Exemption non requise (212) (a) (3)(D)(iii). 212 (g) (1) 212 (i) Jointe (212) (a) (3)(D)(iv). 212 (g) (2) 41. Je déclare: Etre bénéficiaire d'une requête au titre Je peux me prévaloir du droit Je suis assujetti du regroupement familial à l'immigration au titre de l'article 202(b) A la catégorie de Préférence Etre bénéficiaire d'une requête déposée du fait de ma naissance par mon futur employeur A la limitation numérique Relever d'une autre catégorie d'immigration (Pays) Relever de la catégorie spéciale suivante (Ex-bénéficiaire du statut de résident permanent, ressortissant de Hong-Kong, Tibétain, ou bénéficiaire d'un décret émanant du Congrès, etc.). Je reconnais avoir l'obligation de remettre mon visa à l'officier d'immigration du lieu où je sollicite mon admission aux Etats-Unis et note que les droits attachés à la pos- session d'un visa ne m'autorisent pas à être admis aux Etats-Unis si ledit officier juge devoir me refuser l'admission aux Etats-Unis, aux termes de la loi sur l'Immigration Je reconnais que toute déclaration volontairement erronée ou trompeuse, de même que toute dissimulation de faits, m'expose à des poursuites judiciaires et/ou à des mesures d'expulsion. Je, soussigné, demandeur d'un visa d'immigration aux Etats-Unis, affirme sur l'honneur avoir personnellement répondu dans leur intégralité aux questions du formulaire 230 (1re et 2e partie), dont celles énoncées aux articles 1 à 41 inclus, avec exactitude sauf erreur ou omission. En outre, je déclare sur l'honneur, dans l'éventualité de mon admission aux Etats-Unis, ne pas vouloir me livrer à des activités contraires à l'intérêt public, portant atteinte à l'ordre et à la sécurité des Etats-Unis, ou tous actes prohibés d'espionnage, de sabotage, où à l'encontre de l'ordre public, ou autres activités subversives, ou dont l'objectif serait de s'opposer, de prendre le contrôle, ou de renverser le Gouvernement des Etats-Unis, par la force, la violence ou autres moyens anticonstitutionnels. Je déclare avoir pleine connaissance des dispositions ci-dessus énoncées, avoir sollicité et obtenu tout éclaircissement utili Le lien de parenté déclaré aux articles 14 et 15, est attesté par les documents soumis à l'officier consulaire, sauf annotation contraire AMERICAN EMBASS PRINCE. HAITY Signature du demandeur Etabli et attesté sur l'honneur par devant l'officier consulaire le TARIF: se référer à la rubrique 20 Droits consulaires PORT-AU, Officie Consulaire AREP"
}
