{
  "anumber": "A56126907",
  "id": "A56126907_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0031/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U. S. Department of State MEDICAL EXAMINATION FOR IMMIGRANT OR REFUGEE APPLICANT, DS-2053"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2004,
        1901,
        2023,
        2001,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U. S. Department of State OMB No. 1405-0113 MEDICAL EXAMINATION FOR EXPIRATION DATE: 1/31/2004 ESTIMATED BURDEN: 40 minutes IMMIGRANT OR REFUGEE APPLICANT (See Page 2 Back of Form) GOMAN FLORVILUS Name (Last, First, MI) irth Date (mm-dd-yyyy) D sep 14 1901 SEX: M F rthplace (City/County) HAITI / esent Country of Residence HAITI Prior Country N/A S. Consul (City/Country) HAITI HAI19147/Sep 09 07 / sport Number Alien (Case) Number 2001767054 Date Exam Expires (6 months from examination date, if Class A or TB condition exists, otherwise 12 months) Exam Place (City/Country) HAITI Panel Physician (name) Dr. Jean henold BUteau Radiology Services (name) Cabinet CHarlier MOntas Screening Site (name) CHemin des DAlles 17-19 Lab (name for HIV/syphilisXTB LabBOncy (1) Classif cation check all boxes that apply): No apparent defect, disease, or disability (see Worksheets DS-3024, DS-3025 and DS-3026) Class A Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, infectious (Class A, from Chest X-Ray Worksheet) Human immunodeficiency virus (HIV) Syphilis, untreated Hansen's disease, lepromatous or multibacillary Chancroid, untreated Addiction or abuse of specific* substance without harmful Gonorrhea, untreated behavior Granuloma inguinale, untreated Any physical or mental disorder (including other substance-related disorder) with harmful behavior or history Lymphogranuloma venereum, untreated of such behavior likely to recur amphetamines, cannabis, cocaine, hallucinogens, inhalants, opioids, phencyclidines, sedative-hypnotics, and anxiolytics Class B Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, noninfectious (Class B1, from Chest X-Ray Worksheet) Hansen's disease, prior treatment Treatment: None Partial Completed Hansen's disease, tuberculoid, borderline, or paucibacillary TB, inactive (Class B2, from Chest X-Ray Worksheet) Sustained, full remission of addiction or abuse of specific* substances Treatment: None Partial Completed Any physical or mental disorder (excluding addiction or Syphilis, treated within last year abuse of specific substance but including other substance-related disorder) without harmful behavior or Other sexually transmitted infections, treated within last year history of such behavior unlikely to recur Current pregnancy, number of weeks pregnant amphetamines, cannabis, cocaine, hallucinogens, inhalants, Visual opioids, phencyclidines, sedative-hypnotics, and anxiolytics Other (specify or give details on checked conditions from worksheets) loss (2) Laboratory Findings (check all boxes that apply): Syphilis: Not done Test name Date(s) run (mm-dd-yyyy) Negative Positive Titer 1 Notes RPR Screening SEP 23 2003 324 Confirmatory 3+ Treated If treated, therapy: Dates(s) treatment given (3 doses for penicillin) Yes Benzathine penicillin, 2.4 MU IM 22.10.02 29.10.02 05.11.02 No Other (therapy, dose): HIV: Not done Test name Date(s) run (mm-dd-yyyy) Negative Positive Indeterminate Notes ELISA Screening SEP 23 2003 Secondary Confirmatory DS-2053 (Formerly OF-157) 01-2001 Page 1 of 2"
}