{
  "anumber": "A56126907",
  "id": "A56126907_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE Case ID# Action Stamp PTP20017670545 A# H.N.S. DISTRICT DIAECTOR APPROVED G-28 or Volag # Section of Lay without SEP 08 2008 03/14/2001 SRC-01-123-52454 SRCMLW01 Petition was 20 (b) spouse 203 (a)(1) Personal filed Interview on Viana (priority date) Previously Forwarded 20 (b) child 203 (a)(2) Pet Ben. \"A\" File Reviewed Stateside Criteria 20 (b) parent 203 (a)(4) TSC 203 (a)(5) 10767 Field Investigations I-485 Simultaneously AM CON: 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: IDS A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) GOMAN FLORVILUS 2. Address (Number and Street) (Apartment Number) CAP-HAITIAN - (Town or City) (State/Country) (ZIP/Postal Code) HAITI 3. Place of Birth (Town or City) (State/Country) CAP - HAITIAN 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 02-14-1901 Female Widowed Divorced 7. Other Names Used (including maiden name) Same as above 8. Date and Place of Present Marriage (if married) 05-21-42 HAITI 9. Social Security Number 10. Alien Registration Number (if any) N/A N / A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A N/A 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) N/A Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Date authorized stay expired, or will expire, as shown on Form 1-94 or 1-95 N /A 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) N/A 16. Has you relative ever been under immigration proceedings? Yes x No Where When Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4/11/91) Y"
}