{
	"anumber": "A56126907",
	"id": "A56126907_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A56126907_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Ministère de la Culture Archives Nationales d’Haiti, 0014975 F"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1901, 1993, 2023, 2002]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 République à Haiti MINISTERE DE LA CULTURE Archives Nationales d'Haifi No To 0014975 F Extrait des Registres des Actes de NAISSANCE déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du 12 mai 1995 L'An mil neuf cent quatre vingt-treize, an 190e o.e l'Indépendance et le Lundi vingt neuf Novembre à dix heures du matin. Par aevant Nous AUGUSTIN CESAR Officiar de l'Etat Civil du Cap-Haitien, Section Nord ANNES - 1993 Soussigné, en verturu'un jugement remit par le tribunal de première PACE - 97 instance du ressort du Cap-Haitien, rendu en date du dix Novembre mil NUMERO 251 neuf cent quatre-treize, nous commettent à cette fin. A compari Ke ANDRE HEROLD LUMA, Avocat au Barren du Cap-Haitien, y demeurant et d. TANANT LIEU DE NAISSANCE micilié identifié pour le présent exercice sous les no 101-63-801; DE 3 FLORVIJUS GOMAN, Né fiscalement immatriculé sous les no 094-09-954 patenté ali No A-39257 le 14 Février 1901.- et imposé sur le revenu professionnel sou les nos 34658-JJJ, élo tion de domicile au Cabinet a' avocats ANTOIN F. ETTENNE sis en la VI le du Cap-Haitien rue 16F, no 65. Lequel nous a demandé de transcri dans les registres de naissance de l'année en cours le dispositif J2 gement dont teneur suit: PAR CES MOTIFS : Le tribunal après examen et sur les conclusions conformes du Ministére Public, dit et déclare que sans préjudicier aux droits des tiers FLORVILUS GOBLAN, et de la dame JULIENN JULIEN demeurant et domiciliés à Masclary, en la sec- tion Communale de Petit-Bourg de Borgne, est né le quatorze février mil neuf cent un. Ordonna 3a transcription au aispositif du présent jugement o.ans les registres de naissance de Trannée en cours et se- AND Bio- 74571 lon le voeu de la loi lui en délivret qui sera execu- M.T.G té. Il est ordonné etc... in foi quois minuted. présent juse ment est signée ae nous et de notre dreffier LOUIS, AV. ju- go Doyen et RENE FRANCOIS JPH, Yreffier SIGNIS : ADJUSTIN CESAR Fort-au-Prince le 14 Janvier 2002 POUR COPIE CONFORME COLLATIONN.C years BERTHAND WINDOTAGE GENERAL Angle Rues Borgella et Geffrard, Port-au-Prince, Haüti Téi. 222-0227 / 222-8566 / 223-1077 Fax : (509) 222-6280 B.P. T299"
}
