{
  "anumber": "A57734494",
  "id": "A57734494_0118",
  "page_index": 118,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0118/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "PAR CES MOTIFS: le tribunal après examen sur les conclusions du Ministre, VU"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2002,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 PAR CES MOTIFS: le tribunal apres examen sur les conclusions du Minis tere public, Ordonne la rectification de l'Acte de Naissance de l'exposant dressé le vingt trois Février mil neuf cent quatre vingt dix par l'Officier do 1! Etat Civil de la Section Sud de Port-au-Prince Dit qu'il sera écrit in marges ACTE DE NAISSANCE DE: TALMECOIT BENOIT, Dit FALMECOY RENOIT di+ PALMECOIS BENOIT, né le 24 Mars 1913. Dit que TATMECOIT RENOIT et PALMICOIS BENOIT, né désignent qu'une seule et même Personne physique. Ordonne l'insorip tion du présent jugement sur les registres du dit Officier et Ba mention en marge du dit Acte. Fait défense & tour dpoisutures Ass registres de l'Etat civil d'en délivrer extrait, copie ou expedition sans les rectifications Ordonnées. AINSI JUGE ET PRONONCE PAR NOUS: LISE PIERRE FIERRE, Doyen du Aribunal civil de Port-au- rince, en audience civile et publique de ce jour Juin deux mille un, en presence de Me ROCKY PIERRE, Subs ti tut du commissaire du Couver- nement de ce Ressort, avec l'assistance du Greffier FRITZ VICTORIN Port-au-Frince le 11 Février 2002. John HEAD WILTHED BEHORANT DIRECTEER GENERAL. PAR CES MOTIFS: le tribunal apres examen sur IAS conclusions écrites du Mi- nistere public, Ordonne la rectification de l'Acte de Naissance de l'exoo- sant dressé le vingt trois Février mil neuf cent evatre vingt dix par l'Offi- cier de l'Etat Civil de la Section Sid de Port- illine Dit qu'il seri écrit au corps de l'Acter lo ) Sur requete du sieur MESOIS BENOIT, sous La cons- titution de...2u lieu de Talmecoit Benoit..2 20) cour qui ont intérêt at qualité que FALMESOIS RENOIT, de sexe masculin né a Cavaillon le virgt quatre Mars mil neuf cent treize au lieu de Talmecoit Benoit...Et en Marge ACTE DE NAISSANCE DE: PALMESOIS BENOIT, né le 24 Mars 1913. Ordonne l'irs- cription du présent jugerent sur les registres du dit Officier de l'Eta Civil et sa mention en marge du dit acte. Fait défense a tous dépositaires des dits registres d'en délivrer extrait, oopie on expedition sana les fications ordonnées.- AINSI JUGE ET PRONONCE PAR NCUS: LISE PIERRF PYERRE audience ivile et publique de ce jour quinze Janvier deux mille An l'Indivan- dance, en présence de Me BARTRELEMY ALTENOR, Substitut this disfor vernement de ce Ressort avec assistance du Grefflyi FRITZ-VICTORIN Fort-au-Prince le 11 Février 2002. JEAN WILFRID CERTRANT DIRECTEUR GENERAL. VU : Uniquement pour la légalisation ae la signature de ME JEAN WILFRII CERTRAND Directeur \"énéral des Archives d'Haiti. écépissé I.o B 2262812 Parquet, le 25/02/02 tris Josur Milk LOUIS COMMISSION EVEMENT"
}