{
	"anumber": "A57734494",
	"id": "A57734494_0117",
	"page_index": 117,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0117/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2002, 1974, 2023, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 République à Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti N8 0091712 F Extrait des Registres des Actes de NAISSANCE déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du 12 mai 1995 L'An mil neuf cent quatre vinit dix, An 187e de l'Indépen- dance et le Vendredi vingt trois Février à dix heures du matin. No us EMERAN CINEAS, Officier de l'Etat Civil de la Section Sud de t-au-Frince soussigné; Certifions avoir inscrit aux regi tres y afférents en conformité de la loi du 20 Août 1974 le dis positif d'un jugement rendu par le tribunal oivil do Fort-au- ANNEE 1990 Prince séant au Palais de Justice de cette Ville en audience civile et publique en date du huit Février 1990. sur requete du PAGE 33 sieur PALMESOIS BENOIT, sous la constitution de Me PIERRE NUMERO 88 DELVA, Avocat de ce Barreau dûment patenté et imposé lequel dispositig est ainsi conçu.- PAR CES MOTIFS: le tribunal apres examen sur les conclu- ACTE DE NAISSANCE DE: sions du ministere public, dit et déclare sous la réserve des 11 PALMESOIS BENOIT 11 droits de ceux qui ont intéret et qualité que: PALMESOIS BENOIT Né le 24 Mars 1913. de sexe masculin est né a Cavaillon le vingt quatre Mars mil neuf cent treize des oeuvres légitimes de: TALIN BENOIT et de la dame son épouse née YSMERA SEIZEME tous deur décédés. Dit A.N.H. 77672.-E. que le dispositif du présent jugement tiendra lieu d'Acte de Naissance. Ordonne la transcription du présent jugement sur le registre spécial tenu en double a cet 1.Officier de l'Etat Civil de la 'Section Sud de Por air Prince AINSI JUGE ET PRONONCE PAR NOUS: ARNOLD CHARLES Doyen en audience civile et publique du huit Février 1990 en présence de e LARIVE LOMINY, Substitut du commissaire du de CE ressort, avec l'assistance du Greffier ASCENCIO Il est ordonné etc. En foi de quoi etc. SIGNE: EMERAN CINEAS.- Port-au Prince le 11,Février 2002. K.C.O POUR COPIE CONFORME JEAN WILFIED BERTRAND FAR CES NOTIPS COLLATIONIES DIRECTEUR GENERAL. Angle Rues Borgella et Geffrard. Port-au-Prince Haiti Tél 222-0227 /222-8566/223-1077 For (509) ?22-6280 B.P. 1299"
}
