{
	"anumber": "A57734494",
	"id": "A57734494_0081",
	"page_index": 81,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0081/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 OMB No. 1115-0214 Affidavit of Support Under Section U.S. Department of Justice Immigration and Naturalization Service 213A of the Act START HERE - Please Type or Print Part 1. Information on Sponsor (You) FOIA (b)(6) Place of Residence if different from above (Street Number and Name) Apt/Suite Number FOR AGENCY USE ONLY SAME AS ABOVE State or Province This Affidavit Receipt City Meets Country ZIP/Postal Code Telephone Number [ Does not meet Requirements of FOIA (b)(6) Section 213A Part 2. Basis for Filing Affidavit of Support CH Officer or I.J. I am filing this affidavit of support because (check one): Signature a. I filed/am filing the alien relative petition. b. I filed/am filing an alien worker petition on behalf of the intending P&P GRAND\" FATHER Location immigrant, who is related to me as my (relationship) 5/19/05 c. I have ownership interest of at least 5% . Date (name of entity which filed visa petition) which filed an alien worker petition on behalf of the intending immigrant, who is related to me as my . (relationship) d. I am a joint sponsor willing to accept the legal obligations with any other sponsor(s). Part 3. Information on the Immigrant(s) You Are Sponsoring Last Name First Name Middle Name BENOIT PALMESOIS NONE Date of Birth (Month,Day, Year) Sex Social Security Number (If any) 03/24/1913 Male Female N/A Country of Citizenship A-Number (If any) HAITI N/A Current Address (Street Number and Name) Apt/Suite Number City DELMAS 24 RUE CASIMIR # 9 BIS NONE PORT-AU-PRINCE State/Province Country ZIP/Postal Code Telephone Number PORT-AU-PRINCE HAITI WI NONE List any spouse and/or children immigrating with the immigrant named above in this Part: (Use additional sheet of paper if necessary.) Relationship to Sponsored Immigrant Date of Birth A-Number Name Social Security (If any) (If any) Spouse Son Daughter Mo. Day Yr. NONE Form 1-864 (Rev. 11/05/01)Y"
}
