{
  "anumber": "A57734494",
  "id": "A57734494_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information About Your Parents (continued, N-4 03/26/16 N"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Part 6. Information About Your Parents (continued) A- 057734494 A. Current Legal Name of U.S. Citizen Mother Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) B. Mother's Country of Birth C. Mother's Date of Birth (mm/dd/yyyy) D. Date Mother Became a U.S. Citizen E. Mother's A-Number (if known) (mm/dd/yyyy) (if any) A- Information About Your Father 3. Is your father a U.S. citizen? Yes No If you answered \"Yes,\" complete the information below. If you answered \"No,\" go to Part 7. A. Current Legal Name of U.S. Citizen Father Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) B. Father's Country of Birth C. Father's Date of Birth (mm/dd/yyyy) D. Date Father Became a U.S. Citizen E. Father's A-Number (if known) (mm/dd/yyyy) (if any) A- Part 7. Biographic Information NOTE: USCIS requires you to complete the categories below to conduct background checks. (See the Form N-400 Instructions for more information.) 1. Ethnicity (Select only one box) Hispanic or Latino x Not Hispanic or Latino 2. Race (Select all applicable boxes) White Asian X Black or American Indian Native Hawaiian or African American or Alaska Native Other Pacific Islander 3. Height Feet 5 Inches 6 4. Weight Pounds 165 5. Eye color (Select only one box) Black Blue x Brown Gray Green Hazel Maroon Pink Unknown/ Other 6. Hair color (Select only one box) Bald Black Blond Brown x Gray Red Sandy White Unknown/ (No hair) Other Form N-400 03/26/16 N Page 5 of 20 2016184932450 2900761 021939 63 e785929 100516 12:10 100416 N400_ELIS-660060"
}