{
	"anumber": "A57734494",
	"id": "A57734494_0120",
	"page_index": 120,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0120/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Marriage Certificate, F-5 No. 020543"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1947, 2002]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 LIBERTE EGALITE FRATERNITE REPUBLIQUE D'HAITI F-5 No. 020543 EGALITE Extrait des registres des actes de mariage de la commune de 1.50 1.50 Cavaillon déposés au bureau des Archives Nationales de la Gde. Gde. République.- DIRECTION GENERALE IMPOTS Le trente Janvier mil neuf cent quarante sept à huit heure$ PAPIER TIMBREC du matin. Je soussigné ouré de la paroisse de Cavaillon Cer- Une Gourde cinquante centimes tifie qu'après les [publications dûment faites aucune opposi- RECUBLIQUE D'HAITI G.1.35 tion ne m'ayant été signifiée \" PALMESOIS BENOIT\" agricul- JUSTICE teur âgéd.de trente ans, né à benoit cinquième section rurale de Cavaillon domicilié à Benoit fils de TALAIN BENOIT, agri- culteur et de YSMERA SEIZEME, agricultrice, domiciliés à WORLD Benoit. Et 111 GENIA FERVIL \"agricultreice, âgée de trente ans, née PORT à Bacon cinquième section rurale de Cavaillon, domiciliée à 1947 Benoit, même section fille de VILMEUS FERVIL, agriculteur, PAGE 71 décédé et de CATHERINISE GUILLAUME, agricultrice, domiciliés NUMERO 130 à Bacon. Se sont présentés pour être unis par Ie sacrement de maria CIE DE MARTAGE DE: ge. A laquestion s'ils consentaient à Se prendre pour époux PALMESOIS BENOIT ils ont répondu chacun séparément et affirmativement en pré- DE SECURITY Sence des témoins qualifiés et nommés ci-après ont été té- GENIA FERVIL moins LISIMA FERVIL cultivateur âgé de quarante cinq ans, domicilié à Bacon, cinquième Section Cavaillon et Mme ALTEUS) ANH E 77473 BURY, agricultrice, âgée de quarante six ans, domioiliée à G/M Marc Laserre, même section ainsi signé LUD BRIERE, nous PIERRE VERPILE, officier de l'Etat civil de la commune de Cavaillon, soussigné certifions et attestons d'avoir trans- crit sur les registres des acteside mariage de cette commune l'acte ci-dessus pour par le dit VERNATIONAL tous los effets légaux par devant l'offic THE de line de cette commune. Ce jour vingt deux Port-au-Prince le 14 Février 2002 POUR COPIE CONFORME BEATRAND COLLATIONNEE GENERAL"
}
