{
  "anumber": "A57734494",
  "id": "A57734494_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2016,
        2017,
        2023,
        2019
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 DEPARTMENT Application for Naturalization USCIS OF Form N-400 HOMELAND SECURITY Department of Homeland Security OMB No. 1615-0052 U.S. Citizenship and Immigration Services Expires 03/31/2019 N400 Date Stamp Action Block U.S. Department of Homeland Security For USCIS Use NBC*007064742 10/04/2016 APPROVED Only MAR 18 2017 Remarks Gui U.S. Chizenship and Immigration Services) START HERE - Type or print in black ink. Type or print \"N/A\" if an item is not applicable OF the answer 13 none, unless otherwise indicated. Failure to answer all of the questions may delay U.S. Citizenship and Immigration Services (USCIS) processing your Form N-400. NOTE: You must complete Parts 1. - 15. If your biological or legal adoptive mother or father is a U.S. citizen by birth, or was naturalized before you reached your 18th birthday, you may already be a U.S. citizen. Before you consider filing this application, please visit the USCIS Website at www.uscis.gov for more information on this topic and to review the instructions for Form N-600, Application for Certificate of Citizenship, and Form N-600K, Application for Citizenship and Issuance of Certificate Under Section 322. NOTE: Are either of your parents a United States citizen? If you answer \"Yes,\" then complete Part 6. Information About Your Parents as part of this application. If you answer \"No,\" then skip Part 6. and go to Part 7. Biographic Information. Part 1. Information About Your Eligibility (Select only one box or your Enter Your 9 Digit A-Number: Form N-400 may be delayed) A- 057734494 1. You are at least 18 years of age and: A. Have been a lawful permanent resident of the United States for at least 5 years. B. Have been a lawful permanent resident of the United States for at least 3 years. In addition, you have been married to and living with the same U.S. citizen spouse for the last 3 years, and your spouse has been a U.S. citizen for the last 3 years at the time you filed your Form N-400. C. Are a lawful permanent resident of the United States and you are the spouse of a U.S. citizen and your U.S. citizen spouse is regularly engaged in specified employment abroad. (See the Immigration and Nationality Act (INA) section 319(b).) If your residential address is outside the United States and you are filing under Section 319(b), select the USCIS Field Office from the list below where you would like to have your naturalization interview: D. Are applying on the basis of qualifying military service. E. Other (Explain): Part 2. Information About You (Person applying for naturalization) 1. Your Current Legal Name (do not provide a nickname) Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) BENOIT PALMESOIS 2. Your Name Exactly As It Appears on Your Permanent Resident Card (if applicable) Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) BENOIT PALMESOIS Form N-400 03/26/16 N Page 1 of 20 2016184932450 2900761 021939 63 e785929 100516 12:10 100416 N400_ELIS-G60060"
}