{
	"anumber": "A57734494",
	"id": "A57734494_0110",
	"page_index": 110,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0110/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2002, 1974, 2023, 1913]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI BIRTH CERTIFICATE NO. 0091712 Extract from the registries of Birth Certificate, filed in the National records of the Republic and delivered On paper non stamped following the article 2 of decree of May 12, 1995 The year nineteen hundred and ninety, with 187th years of the Independence and on Friday February twenty third at Ten o'clock in the morning. Us, Emeran Cineas, Officer of the civil state of the South Section of Port-Au-Prince the Undersigned. Certifying inscribe in the registries in conformity of the law of August 20, 1974. The dispositif of the judgement rendered by the civil court of Port-Au-Prince court of justice in the city in civil audience And public dated February eight, nineteen hundred and ninety. On request of Mr. Palmesois Benoit, under the constitution Of Mr. Pierre Delva, lawyer. BY THESE MOTIVES, The court after examination and the conclusion of the public ministry said and declared under the reserve to all that have Interest and quality that Palmesois Benoit a male child born at Cavaillon on March twenty four, nineteen hundred and thirteen Of: Talin Benoit and of the lady his spouse born Ysmera Seizeme. Both deceased. Said the dispositif of the present judgement holding place birth certificate. Ordered the inscription of the present judgement On the registrie special hold in double at this effect by the Officer of the Civil State of the South Section of Port-Au-Prince. It was judged and pronounced by us, Arnold Charles, super intendent in civil audience and public of February eight, nineteen Hundred and ninety in the presence of the ressort, with the assistance of the clerk of the court Ascencio Jumelle. It was an order etc. SIGNED: EMERAN CINEAS. PORT-AU-PRINCE, ON FEBRUARY 11, 2002 CERTIFY TRUE COPY. JEAN WILFRID BERTRAND : GENERAL DIRECTOR YEAR: 1990 PAGE: 33 NUMBER: 88 BIRTH CERTIFICATE OF: PALMESOOIS BENOIT BORN ON MARCH 24, 1913. ANH 77672E BY THESE MOTIVES, The court after examination and the conclusion of the public ministry, ordered the rectification of the birth certificate drawn On February twenty third, nineteen hundred and ninety by the Officer of the civil state of the South section of Port-Au-Prince Said it will be write in margin. Birth Certificate of: Talmecoit Benoit, said Palmecoy Benoit said Palmecois Benoit, born on March Twenty four, nineteen hundred and thirteen. Said that Talmecoit Benoit and Palmecois Benoit is the only one person and same person Ordered the inscription of the present judgement on the registries of the said officer and his mention in margin of the said Certificate. Do defense to all depositaries in the registries of the civil state to delivered extract, copy or expedition without The rectification ordered. It was judged and pronounced by us, Lise Pierre Pierre, super intendent in civil court of Port-Au-Prince, in civil audience and Public that day June twentieth, two thousand one in the presence of Mr. Rocky Pierre, substitut of the commissary of the Government With the assistance of the Clerk of the Court Fritz Victorin. Port-Au-Prince, on February 11, 2002 JEAN WILFRID BERTRAND : GENERAL DIRECTOR By these Motives, The court after examination and the conclusion of the public ministry ordered the rectification of the birth certificate drawn On February twenty third, nineteen hundred and ninety by the Officer of the civil state of the South Section of Port-Au-PRINCE Said it will be write in the bottom of the certificate. On request of Mr. Palmesois Benoit, under the constitution instead of Talmecoit Benoit. To all that have interest and quality that Palmesois Benoit a male child born at Cavaillon on March twenty four, nineteen Hundred and thirteen instead of Talmecoit Benoit and in margin Birth Certificate of: Palmesois Benoit, born on March Twenty four, nineteen hundred and thirteen. Ordered the inscription of the present judgement on the registries of the said Officer of the civil state and his mention in margin Of the said certificate. Do defense to all depositaries of the said registries to delivered extract, copy or expedition without the rectification ordered. It was judged and pronounced by us, Lise Pierre Pierre, super intendent in civil audience and public that day January fifteen, Two thousand two, with 198th years of the Independence in the presence of Mr. Barthelemy Altenor, substitut of the commissary Of the Government with the assistance of the clerk of the court Fritz Victorin. PORT-AU-PRINCE, ON FEBRUARY 11, 2002 JEAN WILFRID BERTRAND : GENERAL DIRECTOR Unique for the legalization of the signature of Mr. Jean Wilfrid Bertrand , General Director Mr. Josue Pierre Louis : Commissary of the Government"
}
