{
	"anumber": "A57734494",
	"id": "A57734494_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0001/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 DEPARTMENT N-44 Notice of Naturalization Oath Ceremony USCIS Form N-445 HOMELAND SECURITY Department of Homeland Security OMB No. 1615-0054 U.S. Citizenship and Immigration Services Expires 06/30/2019 A-Number Date April 27, 2017 Sworn Statement A- 057734494 For USCIS Other PALMESOIS BENOIT Use APT 2 Only FCO: BOS 7 MESHARA STREET OFFICE: BOS WEST ROXBURY MA 02132 NBC*007064742 APPLICANT COPY United States Citizenship and Immigration Services (USCIS) thanks you for your interest in becoming a United States citizen. You must now appear at a Naturalization Oath Ceremony to complete the naturalization process. eligibility verified by: You are scheduled to appear for a Naturalization Oath Ceremony on: to station; Date and Time: Tuesday, May 9 2017 12:05 PM Location: U.S. DISTRICT COURT - DISTRICT OF MASSACHUSETTS MERCHANTS ROW BOSTON. MA 02203 I-551 Surrengered FANEUIL HALL. SECOND FLOOR. NO GATE YOU ARE ALLOWED TO BRING ONLY 1 (ONE) GUEST Please bring the following with you: PLEASE BRING AN INTERPRETER WITH YOU This notice with the reverse side completed. Please refer to instructions on the reverse side. Your Permanent Resident Card (\"green card\"). All Reentry Permits or Refugee Travel Documents you may have. valid or expired. Any other documents USCIS issued to you. The naturalization ceremony is a solemn and meaningful event. USCIS asks that you dress in proper attire to respect the dignity of this event. If you cannot come to this ceremony, return this notice immediately with a written explanation on why you cannot attend. You will then receive an appointment for a ceremony at a later date. If you require an accommodation, such as a sign language interpreter, please contact the USCIS National Customer Service Center at 1-800-375-5283, at least 10 days prior to your scheduled ceremony. Please answer the questionnaire on the reverse side of this notice on the day of your scheduled ceremony. Print clearly in black ink. Please read the instructions before answering the questions, which concern events that may have occurred since your interview. If you answer \"YES\" to any of the questions, bring documents to support your answers. For example, if you married or divorced after your interview, bring your marriage certificate or divorce decree. If you were arrested after your interview, bring your arrest records and court dispositions. If you were serving in the military and have been discharged, bring your DD214 or other discharge papers. Form N-445 10/31/16 N Page 1 of 3"
}
