{
  "anumber": "A57734494",
  "id": "A57734494_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Applicant's Name USCIS A-Number A- 057734494 12. Was an interpreter used during your examination of the applicant? Yes (If \"Yes,\" the interpreter must complete the \"Interpreter Certification\" section.) No Additional Comments (Optional) MEDICAL PROFESSIONAL' CERTIFICATION Complete the following if an interpreter was not used during your examination of the applicant between the applicant and medical professional pertaining to the examination(s) that form the basis of this Form N-648 certification. I am fluent in English and CREOLE-HAITIAN , the language spoken by this patient. Therefore, an interpreter was not used during my examination(s) of this applicant. All medical professionals must complete the certification below. I certify that this applicant's identity has been verified through the following United States or State government-issued photographic identity document: Permanent Resident Card State ID Number: Other Identification (State type and ID Number): I certify, under penalty of perjury under the laws of the United States of America, that the information on this form and any evidence submitted with it are all true and correct. I will furnish relevant medical records to USCIS, if requested to do so by USCIS, based on the applicant's consent. I am aware that the knowing placement of false information on Form N-648 and related documents may also subject me to criminal penalties including under Title 18, U.S.C. Section 1546, civil penalties under Title 18, U.S.C. Section 247c of the Immigration and Nationality Act, and civil license suspension or revocation Licensed Medical Professional Sign FOIA (b)(6) Date (mm/dd/yyyy) 03/09/2017 Form N-648 03/11/15 Y Page 5"
}