{
  "anumber": "A57734494",
  "id": "A57734494_0123",
  "page_index": 123,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0123/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U. S. Department of State MEDICAL EXAMINATION FOR IMMIGRANT OR REFUGEE APPLICANT, OMB No. 1405-0113"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2006,
        2007,
        2004,
        2023,
        1913,
        2005
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 U. S. Department of State OMB No. 1405-0113 MEDICAL EXAMINATION FOR EXPIRATION DATE: 05/31/2007 ESTIMATED BURDEN: 10 minutes (See Page 2 IMMIGRANT OR REFUGEE APPLICANT Back of Form) BENOIT PALMESOIS Name (Last, First, MI) Mar 24 1913 Birth Date (mm-dd-yyyy) SEX: M F Port-au-Prince HAITI Birthplace (City/County) N/A Present Country of Residence HAITI Prior Country u S. Consul (City/Country) Port-au-Prince HAITI / Passport Number PP1214324/May 10 Alien (Case) Number Date (mm-dd-yyyy) of Medical Exam Date (mm-dd-yyyy) of Prior Exam, if any MAY 07 2006 Date Exam Expires (s-months from examination date, if Class A or TB condition exists, otherwise 12 months) (mm-dd-yyyy) Dr. Jean-Henold BUteau Exam Place (City(Country) crau-Prince HAITI Panel Physician (name) Cabinet Charlier/Montas Radiology Services (name) Screening Site (name) Chemin des Dalles 17-19 Lab (name for HIV/syphilis/ Lab Boney (1) Classification (check all boxes that apply): No apparent defect, disease, or disability (see Worksheets DS-3024, DS-3025 and DS-3026) Class A Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, infectious (Class A, from Chest X-Ray Worksheet) Human immunodeficiency virus (HIV) Syphilis, untreated Hansen's disease, lepromatous or multibacillary Chancroid, untreated Addiction or abuse of specific* substance without harmful behavior Gonorrhea, untreated Any physical or mental disorder (including other substance-related disorder) with Granuloma inguinale, untreated harmful behavior or history of such behavior likely to recur Lymphogranuloma venereum, untreated \"amphetamines, cannabis, cocaine, hallucinogens, inhalants, opioids, phencyclidines, sedative-hypnotics, and anxiolytics Class B Conditions (From Past Medical History and Physical Examination Worksheets) TB, active, noninfectious (Class B1, from Chest X-Ray Worksheet) Hansen's disease, prior treatment Treatment: None Partial Completed Hansen's disease, tuberculoid, borderline, or paucibacillary TB, inactive (Class B2, from Chest X-Ray Worksheet) Sustained, full remission of addiction or abuse of specific* substances Treatment: None Partial Completed Any physical or mental disorder (excluding addiction or abuse of specific See Section #4 on page 2 for TB treatment details substance but including other substance-related disorder) without harmful behavior Syphilis (with residual deficit), treated within the last year or history of such behavior unlikely to recur Other sexually transmitted infections, treated within last year *amphetamines, cannabis, cocaine, hallucinogens, inhalants, opioids, Current pregnancy, number of weeks pregnant phencyclidines, sedative-hypnotics, and anxiolytics Other (specify or give details on checked conditions from worksheets) (2) Laboratory Findings (check all boxes that apply): Syphilis: Not done Test name MAY 07 2005 Date(s) run (mm,dd Negative Positive Titer 1 Notes RPR Screening Confirmatory Treated If treated, therapy: Dates(s) treatment given (3 doses for penicillin) Yes Benzathine penicillin, 2.4 MU IM No Other (therapy, dose):E HIV: Not done Test name Date(s) run (mm-dd-yyyy) Negative Positive Indeterminate Notes ELISA I MAY 01/2005) Screening Secondary Confirmatory DS-2053 (Formerly OF-1571 Page 1 of 2 05.2004"
}