{
  "anumber": "A57734494",
  "id": "A57734494_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Part 2. Notice of Appearance as Attorney or Part 3. Eligibility Information for Attorney or Accredited Representative (continued) Accredited Representative Information About Applicant, Petitioner, Select all applicable items. Requestor, or Respondent (continued) 1.a. I am an attorney eligible to practice law in, and a 7. USCIS ELIS Account Number (if any) member in good standing of, the bar of the highest courts of the following states, possessions, territories, commonwealths, or the District of Columbia. (If you 8. Alien Registration Number (A-Number) or Receipt Number need additional space, use Part 6.) Licensing Authority 057734494 FOIA (b)(6) 9. Daytime Telephone Number FOIA (b)(6) 1.b. Bar Number (if applicable) FOIA (b)(6) 10. Mobile Telephone Number (if any) 1.c. Name of Law Firm FOIA (b)(6) 11. E-Mail Address (if any) 1.d. I (choose one) am not am subject to any order of any court or administrative agency Mailing Address of Applicant, Petitioner, disbarring, suspending, enjoining, restraining, or otherwise Requestor, or Respondent restricting me in the practice of law. If you are subject to any orders, explain in the space below. (If you need NOTE: Provide the mailing address of the applicant, petitioner, additional space, use Part 6.) requestor, or respondent. Do not provide the business mailing address of the attorney or accredited representative unless it serves as the safe mailing address on the application, petition, or 2.a. I am an accredited representative of the following request being filed with this Form G-28. qualified nonprofit religious, charitable, social 12.a. Street Number service, or similar organization established in the 7 Meshaka Street and Name United States, so recognized by the Department of Justice, Board of Immigration Appeals, in accordance 12.b. Apt. Ste. Flr. 2 with 8 CFR 292.2. Provide the name of the organization and the expiration date of accreditation. 12.c. City or Town West Roxbury 2.b. Name of Recognized Organization 12.d. State MA 12.e. ZIP Code 02119 12.f. Province 2.c. Date accreditation expires (mm/dd/yyyy) 12.g. Postal Code 12.h. Country USA Form G-28 05/05/16 Y Page 2 of 4"
}