{
  "anumber": "A57734494",
  "id": "A57734494_0121",
  "page_index": 121,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0121/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificat de rectification d'acte de mariage"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2002
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 vu Po Comn Appos Au M An Du R Récé Ordonne PAR CES MOTIFS: Le tribunal, après examen isur les conclusions du Ministère la rectification de l'acte de mariage de l'exposant dressé le trente Public, Janvie mil neuf cent quarante sept par l'officier de l'Etat civil de Cavaillon. Dit qu'i Sera écrit au corps de l'acte : PALMESOIS BENOIT, au lieu de Palmesoy; Fils lieu BENOIT, de agriculteur et de YSMERA SEIZEME, agricultrice, domicilies, àcBenoit, de TAL ciliés à Benoit. Et en marge: Acte de Mariage de PALMESOIS BENOIT agricultrice, ET DE dom fils de Calin Benoit agriculteur et de Erxemera Suzemai, au Ordonne l'inscription du présent jugement sur les registres du dit officier GENIA FERV civil et sa mention en marge du dit acte. Fait défense à tous dépositaires de l' registres d'en délivrer extrait copie ou expédition sans les rectifications des ordon d AINSI JUGE ET PRONONCE PAR NOUS LISE PIERRE PIERRE, Doyen en audience civile Publique de ce jour vingt deux Janvier deux mille deux, An 199ène de 1' Indépendar et Ressort avec l'assistance du greffier Fritz Victorin.- en présence de Me. Rocky. Pierre, Substitut du commissaire du governement de ee Port-au-Prince le 14 Février 2002 JEAN BERTRAND DIRECTOUR NATIONALES VU : Uniquement pour la légalisation de la signature de ME JEAN WILFRID BERTRAND Directeur Général des Archives d'Haiti, Récépissé No B 2262813 It Parquet, le 25/02/02 Ja R h. ME JOSUE Fr UET PO JEA DEPARTMENT COMMISSAIRE DU GOUVE ANENOME Uni Mr"
}