{
  "anumber": "A57734494",
  "id": "A57734494_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Time Outside the United States, N-400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Part 9. Time Outside the United States A- 057734494 1. How many total days (24 hours or longer) did you spend outside the United States during the last 5 years? d/days 2. How many trips of 24 hours or longer have you taken outside the United States during the last 5 years? trips 3. List below all the trips of 24 hours or longer that you have taken outside the United States during the last 5 years. Start with your most recent trip and work backwards. If you need extra space, use additional sheets of paper. Date You Left the Date You Returned Did Trip Last Countries to Total Days United States to the United States 6 Months or Which You Outside the (mm/dd/yyyy) (mm/dd/yyyy) More? Traveled United States Yes No Yes No Yes No H Yies No Yes No alait Yes No pis 5th Part 10. Information About Your Marital History 1. What is your current marital status? Single, Never Married Married Divorced X Widowed Separated Marriage Annulled If you are single and have never married, go to Part 11. 2. If you are married, is your spouse a current member of the U.S. armed forces? Yes X No 3. How many times have you been married (including annulled marriages, marriages to other people, and marriages to the same person)? 4. If you are married now, provide the following information about your current spouse. A. Current Spouse's Legal Name Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) B. Current Spouse's Previous Legal Name Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) C. Other Names Used by Current Spouse (include nicknames, aliases, and maiden name, if applicable) Family Name (Last Name) Given Name (First Name) Middle Name (if applicable) D. Current Spouse's Date of Birth E. Date You Entered into Marriage (mm/dd/yyyy) with Current Spouse (mm/dd/yyyy) Form N-400 03/26/16 N Page 7 of 20 2016184932450 2900761 021939 63 e785929 100516 12:10 100416 N400_ELIS-660060"
}