{
  "anumber": "A57734494",
  "id": "A57734494_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INTERPRETER'S CERTIFICATION, Form N-648"
    },
    "years": {
      "ms_years_nlp_v1": [
        2017,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Applicant's Name USCIS A-Number A- 057734494 INTERPRETER'S CERTIFICATION An interpreter must complete, and certify, the section below if an interpreter translated communications between the applicant and medical professional on the day of the examination that formed the basis of this Form N-648 certification. Interpreter Information Last Name First Name Middle Name Address (Street Number and Name) City State or Province Zip Code or Postal Code Was a phone interpreter used? Yes (If yes, the interpreter is not required to complete the information below.) No (If no, the interpreter is required to complete the information below.) Interpreter Certification I am fluent As the interpreter, I certify that I am fluent in English and the following language: I further certify that I have accurately and completely translated all communications between the medical professional and the applicant that occurred on , the date(s) of the examination(s) that form the basis of this certification. Interpreter Signature Date (mm/dd/yyyy) APPLICANT (PATIENT) ATTESTATION/RELEASE OF INFORMATION PALMESOIS BENOIT I, , authorize FOIA (b)(6) (Applicant's Name) (Licensed medical doctor, doctor of osteopathy, or clinical psychologist) to release to U.S. Citizenship and Immigration Services all relevant physical and mental health information related to my medical status for the purpose of applying for an exception from the English language and U.S. civics requirements for naturalization. I certify under penalty of perjury, pursuant to Title 28, U.S.C. Section 1746, that the information I provided to the medical professional is true and correct. I am aware that the knowing placement of false information on Form N-648 and related documents may also subject me to civil penalties under Title 8, U.S.C. Section 1324c. I understand that if this form is not completely filled out or if I fail to submit any required documentation, I may not be found eligible for the requested disability exception. Applicant or Applicant's Authorized Representative Signature Date (mm/dd/yyyy) XX 03/09/2017 Form N-648 03/11/15 Y Page 6"
}