{
	"anumber": "A57734494",
	"id": "A57734494_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0033/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 OMB No. 1615-0060; Expires 03/31/2017 Form N-648, Medical Certification for Department of Homeland Security U.S. Citizenship and Immigration Services Disability Exceptions ALL parts of this form, except the \"APPLICANT ATTESTATION\" and \"INTERPRETER'S CERTIFICATION\" must be certified by a licensed medical professional as provided in the instructions for Form N-648. Before certifying this form, the medical professional must conduct an in-person examination of the applicant. (See instructions for Form N-648 for additional information which is also located in the \"FORMS\" section at www.uscis.gov.) Reminder About Eligibility Requirements Completing and Certifying This Form This form is intended for an applicant who seeks an exception to the All questions or items must be answered fully and accurately. English and/or civics requirements due to a physical or Responses should utilize common terminology, without developmental disability or mental impairment that has lasted, or is abbreviations, that a person without medical training can understand. expected to last, 12 months or more. An applicant who with U.S. Citizenship and Immigration Services (USCIS) recommends reasonable accommodations provided under the Rehabilitation Act of that the certifying medical professional use the electronic Form 1973 can satisfy the English and civics requirements does not need to N-648 located in the \"FORMS\" section www.uscis.gov. If the submit this form. Reasonable accommodations include, but are not medical professional completes the form by hand, then responses limited to, sign language interpreters, extended time for testing, and must be legible and appear in black ink. off-site testing. Type or print clearly in black ink. Part I. APPLICANT INFORMATION USCIS USE ONLY I certify that I have examined: This N-648 is: @cc Last Name First Name Middle Name USCIS A-Number Sufficient 3-18th BENOIT PALMESOIS A- 057734494 Insufficient Continued/RFE Address (Street Number and Name) U.S. Social Security Number Reviewer 7 MESHAKA STREET APT2 772401481 City State or Province Zip Code or Postal Code Location & Date WEST ROXBURY MA 02132 Telephone Number E-Mail Address (if any) Date of Birth Gender 6179427912 03/24/1913 Male Female Part II. MEDICAL PROFESSIONAL INFORMATION Type or print clearly in black ink. If you need more space to complete an answer, use a separate sheet of paper. Write the applicant's name and Alien Registration Number (A-Number), at the top of each sheet of paper and indicate the part and number of the item to which the answer refers. You must sign and date each continuation sheet. You must answer and complete each question since USCIS will not accept an incomplete Form N-648. You may, but are not required to, attach to this completed form supportive medical diagnostic reports or records regarding the applicant. NOTE: Only medical doctors, doctors of osteopathy, or clinical psychologists licensed to practice in the United States (including the U.S. territories of Guam, Puerto Rico, and the Virgin Islands) are authorized to certify the form. While staff of the medical practice associated with the medical professional certifying the form may assist in its completion, the medical professional is responsible for the accuracy of the form's content. FOIA (b)(6) Form N-648 03/11/15 Y Page I"
}
