{
	"anumber": "A57734494",
	"id": "A57734494_0083",
	"page_index": 83,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0083/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 Part 4. Eligibility to Sponsor (Continued) C. Sponsor's Annual Household Income Enter total unadjusted income from your Federal income tax return for the most recent tax year below. If you last filed a joint income tax return but are using only your own income to qualify, list total earnings from your W-2 Forms, or, if necessary to reach the required income for your household size, include income from other sources listed on your tax return. If your individual income does not meet the income requirement for your household size, you may also list total income for anyone related to you by birth, marriage, or adoption currently living with you in your residence if they have lived in your residence for the previous 6 months, or any person shown as a dependent on your Federal income tax return for the most recent tax year, even if not living in the household. For their income to be considered, household members or dependents must be willing to make their income available for support of the sponsored immigrant(s) and to complete and sign Form I-864A, Contract Between Sponsor and Household Member. A sponsored immigrant/household member only need complete Form I-864A if his or her income will be used to determine your ability to support a spouse and/or children immigrating with him or her. You must attach evidence of current employment and copies of income tax returns as filed with the IRS for the most recent 3 tax years for yourself and all persons whose income is listed below. See \"Required Evidence 'in Instructions. Income from all 3 years will be considered in determining your ability to support the immigrant(s) you are sponsoring. FOIA (b)(6) Indicate most recent tax year 2004 (tax year) Sponsor's individual income FOIA (b) (6) $ or Sponsor and spouse's combined income $ (If spouse's income is to be considered, spouse must submit Form I-864A.) Income of other qualifying persons. (List names; include spouse if applicable. Each person must complete Form I-864A.) $ $ $ Total Household Income $ FOIA (b)(6 Explain on separate sheet of paper if you or any of the above listed individuals were not required to file Federal income tax returns for the most recent 3 years, or if other explanation of income, employment, or evidence is necessary. D. Determination of Eligibility Based on Income 1. 2. 3. FOIA (b)(6) If you are currently employed and your household income for your household size is equal to or greater than the applicable poverty line requirement (from line D.3.), you do not need to list assets (Parts 4.E. and 5) or have a joint sponsor (Part 6) unless you are requested to do so by a Consular or Immigration Officer. You may skip to Part 7, Use of the Affidavit of Support to Overcome Public Charge Ground of Admissibility. Otherwise, you should continue with Part 4.E. Form I-864 (Rev. 11/05/01)Y Page 3"
}
