{
  "anumber": "A57734494",
  "id": "A57734494_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0000/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Certificate of Naturalization, Form N-550 ( (Rev 10/23)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2017,
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 JUICE No. 38751069 Personal description of holder USCIS Registration No. A057734494 as of date of natur ralization: I certify that the description given is true, and that the photograph affixced Date of birth: MARCH 24, 1913 hereto is a likeness of me. Sex: MALE (Complete and true signature of holder) Height: 5 feet 6 inches Be it known that, pursuant to an application filed with the Secretary of Marital status: WIDOWED Homeland Security Country of former nationality: at: BOSTON, MASSACHUSETTS HAITI The Secretary having found that: PALMESOIS BENOIT residing at: WEST ROXBURY, MASSACHUSETTS having complied in all respects with all of the applicable provisions of the naturalization laws of the United States, being entitled to be admitted as a citizen of the United States, and having taken the oath of allegiance at a ceremony conducted by U.S. DISTRICT COURT - DISTRICT OF MASSACHUSETTS at: BOSTON, MASSACHUSETTS on: MAY 09, 2017 such person is admitted as a citizen of the United States of America. ALTERATION OR MISUSE OF THIS DOCUMENT IS A FEDERAL OFFENSE AND PUNISHABLE BY LAW U. S. Citizenship and Immigration Services DDEPARTMENT OF HOMIELAND SECURITY SRT BUREAU OF ENGRAVING AND PRINTING FORM 10/12)"
}