{
  "anumber": "A57734494",
  "id": "A57734494_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0072/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Action, I-797C, Notice of Action"
    },
    "years": {
      "ms_years_nlp_v1": [
        2005,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 Department of Homeland Security U.S. Citizenship and Immigration Serv GR66 I-797C, Notice of Action CA RECEIPT NUMBER CASE TYPE OS155A SRC-05-180-53103 IMMIGRANT VISA AND ALIEN REGISTRATION APPLICANT A57734494 BENOIT, PALMESOIS NOTICE DATE PAGE PRINCIPAL ALIEN JUNE 16, 2005 1 of 1 PALMESOIS BENOIT Notice Type: Unsuitable Biometrics 667 BLUE JAY RD DELRAY BEACH FL 33444 APPLICANT ANUMBER NOTICE This office received your application. However, the pictures you provided were not usabie and processing cannot be completed to create your I-551 Legal Permanent Resident Card. Please submit two PASSPORT STYLE photos that were taken within the past 30 days. Use a pencil to lightly print your name and A number, shown on this notice, on the back of each photo. Place the photos in a small envelope, and carefully staple them to this notice, ensuring that you do not staple through the photo. Additional information about the photo requirements can be found at WWW.STATE.GOV. Please mail the photos, along with this notice, to the Texas Service Center at the address specified below. Once the photos are received we will continue processing your application. to produce your I-551 Legal Permanent Resident Card. You will be notified separately about any other cases you have filed. IMMIGRATION & NATURALIZATION SERVICE TEXAS SERVICE CENTER P O BOX 851488 - DEPT A MESQUITE, TX 751851488 Customer Service Telephone: (800) 375-5283 JUL 0 1 2005 P.M. 2 4 Form I-797C (Rev. 08/31/04) N"
}