{
	"anumber": "A57734494",
	"id": "A57734494_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 12. Additional Information About You ( (Person Applying for Naturalization) (continued), N-400"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/14/2023 Part 12. Additional Information About You (Person Applying for A- 057734494 Naturalization) (continued) 19. Did you EVER receive any type of military, paramilitary (a group of people who act like a military group Yes No but are not part of the official military), or weapons training? 20. Did you EVER recruit (ask), enlist (sign up), conscript (require), or use any person under 15 years of age Yes No to serve in or help an armed force or group? 21. Did you EVER use any person under 15 years of age to do anything that helped or supported people in Yes No combat? If any of Item Numbers 22. 28. apply to you, you must answer \"Yes\" even if your records have been sealed, expunged, or otherwise cleared. You must disclose this information even if someone, including a judge, law enforcement officer, or attorney, told you that it no longer constitutes a record or told you that you do not have to disclose the information. 22. Have you EVER committed, assisted in committing, or attempted to commit, a crime or offense for which Yes No you were NOT arrested? 23. Have you EVER been arrested, cited, or detained by any law enforcement officer (including any Yes No immigration official or any official of the U.S. armed forces) for any reason? 24. Have you EVER been charged with committing, attempting to commit, or assisting in committing a crime Yes No or offense? 25. Have you EVER been convicted of a crime or offense? Yes No 26. Have you EVER been placed in an alternative sentencing or a rehabilitative program (for example, Yes No diversion, deferred prosecution, withheld adjudication, deferred adjudication)? 27. A. Have you EVER received a suspended sentence, been placed on probation, or been paroled? Yes No B. If you answered \"Yes,\" have you completed the probation or parole? Yes No 28. A. Have you EVER been in jail or prison? Yes No B. If you answered \"Yes,\" how long were you in jail or prison? Years Months Days 29. If you answered \"No\" to ALL questions in Item Numbers 23. 28., then skip this item and go to Item Number 30. If you answered \"Yes\" to any question in Item Numbers 23. - 28., then complete this table. If you need extra space, use additional sheets of paper and provide any evidence to support your answers. Why were you Date arrested, cited, Where were you Outcome or disposition of the arrested, cited, detained, or arrested, cited, detained, or arrest, citation, detention, or detained, or charged. charged? (City or Town, charge (no charges filed, charges charged? (mm/dd/yyyy) State, Country) dismissed, jail, probation, etc.) Form N-400 03/26/16 N Page 14 of 20 2016184932450 2900761 021939 63 e785929 100516 12:10 100416 N400_ELIS-660060"
}
