{
  "anumber": "A57734494",
  "id": "A57734494_0078",
  "page_index": 78,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A57734494_0078/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 9/14/2023, DS-230 Part I"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/14/2023 19. List Names, Dates and Places of Birth, Addresses of ALL Children. NAME D (mm-dd-yyyy) PLACE OF BIRTH ADDRESS (If different from your own) NONE 20. List below all places YOU have lived for at least six months since reaching the age of 16, including places in your country of nationality. Begin with your present residence. CITY OR TOWN PROVINCE COUNTRY FROM/TO (mm-yyyy) DELMAS 24, PORT-au-PRINCE HAITI 77TO PRESENT 21a. Person(s) named in 14 and 19 who will accompany you to the United States now. NONE 21b. Person(s) named in 14 and 19 who will follow you to the United States at a later date. NONE 22. List below all employment for the last ten years. EMPLOYER LOCATION JOB TITLE FROM/TO (mm-yyyy) SELF EMLPOYED ) In what occupation do you intend to work in the United States? NONE 23. List below all educational institutions attended. SCHOOL AND LOCATION FROM/TO (mm-yyyy) COURSE OF STUDY DEGREE OR DIPLOMA UNKNOWN Languages spoken or read: Professional associations to which you belong: TA LOR 24. Previous Military Service Yes No Branch: Dates (mm-dd-yyyy) of Service: Rank/Position: Military Speciality/Occupation: 25. List dates of all previous visits to or residence in the United States. (If never, write \"never\") Give type of visa status, if known. Give INS \"A\" number if any. FROM/TO (mm-yyyy) LOCATION TYPE OF VISA \"A\" NO. (If known) NEVER SIGNATURE OF APPLICANT DATE (mm-dd-yyyy) 05/11/05 Privacy Act and Paperwork Reduction Act Statements INAREP The information asked for on this form is requested pursuant to Section 222 of the Immigration and Nationality Act. The U.S. Department of State uses the facts you provide on this form primarily to determine your classification and eligibility for a U.S. immigrant visa. Individuals who fail to submit this form or who do not provide all the requested information may be denied a U.S. immigrant visa. If you are issued an immigrant visa and are subsequently admitted to the United States as an immigrant, the Immigration and Naturalization Service will use the information on this form to issue you a Permanent Resident Card, and, if you so indicate, the Social Security Administration will use the information to issue you a social security number and card. Public reporting burden for this collection of information is estimated to average 1 hour per response, including time required for searching existing data sources, gathering the necessary data, providing the information required, and reviewing the final collection. In accordance with 5 CFR 1320 5(b), persons are not required to respond to the collection of this information unless this form displays a currently valid OMB control number. Send comments on the accuracy of this estimate of the burden and recommendations for reducing it to: U.S. Department of State (A/RPS/DIR) Washington, D.C. 20520. DS-230 Part I Page 2 of 4"
}