{
  "anumber": "A58402012",
  "id": "A58402012_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58402012_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Extract from the Minutes of the Clerk of the Court of Peace of the Southern Section of Port-au-Prince, GH 209693"
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 Stamp from the General Office of Income Tax Seal of the Court of Peace of Port-au--Prince Amount: 1.50 Gourdes GH 209693 Freeddom Equality Fraternity EXTRACT FROM THE MINUTES OF THE CLERK OF THE COURT OF PEACE OF THE SOUTHERN SECTION OF PORT-AU-PRINCE The year two thousand three and Friday the fourth day of the month of July, 200th Year of the Independence, at ten o'clock in the morning. Before us, Berge O. SURPRIS, Justice of the Peace of the Southern Section of Port-au-Prince, assisted by our court clerk Hermano Alexandre. Have appeared: 1) Andre PIERRE, id. at the No: 004-624-222-6 2) Fabienne JOSEPH, id. at the No: 005-214-610-3 3) Gustave JEAN, id. at the No: 006-512-014-5 All three major, Haitians, owners, living and residing in Port-au-Prince, enjoying their civil and political rights. Which appearers have declared to us knowing perfectly well the person named Lamercie Cylotte VILLARD, born on March 12, 1914 at Port-de-Paix from natural works of Sir Samuel VILLARD and of the Lady Prophéline PROPHÈTE; the said appearers have declared to us that all researchers made at the Archives Nationales de la Répubique d'Haiti to recover the extract relating to her birth certificate have remained vain and fruitless; that in accordance to the articles 70-71 and follow the Civil Code, the said appearers have asked us to draw up the Act of Public Notoriety to compensate for the one of her birth. On what we have given Act of the appearers to their say and declarations to serve and be worthy to whom it may concern, In trust of whom, this present act is drawn and closed, after reading before us, our court clerk and the appearers. Thus signed: André PIERRE, Fabienne JOSEPH, Gustave JEAN, Berge O. SURPRIS, Justice of the Peace, Hermano ALEXANDRE, Clerk of the Court. Seen by the Justice of the Peace of the For Conform Southern Section of Port-au-Prince Verified for the legislation of the signature Expedition of the clerk of the court. Signature Seal of The Court of Signature Berge O. SURPRIS Peace Port-au-Prince Hermano ALEXANDRE Justice of the Peace Clerk of the Court Seen only for the legislation of the signature of Signature Sir Berge O. SURPRIS, Justice of the Peace Sir Josue Pierre Louis of the Southern Section of Port-au-Prince Commissioner of the Government Prosecution Service Receipt, July 8, 2003"
}