{
	"anumber": "A58402012",
	"id": "A58402012_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58402012_0038/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Acte de naissance, 069575"
		},
		"years": {
			"ms_years_nlp_v1": [2002, 2006, 1914, 2023, 2003]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 COPIE an République à Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti No 069575 S Extrait des Registres des Actes de Naissance déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du 12 mai 1995 L'an Deux Mille trois An 200ème de l' Indépendance et le Commune : PORT-AU-PRINCE Lundi quatorze Juillet à huit heures du matin. Bureau : SUD Par-devant Nous Jean Chenier GOURDET, Avocat Officier de l'Etat Civil de Port-au-Prince, Section Sud Soussigné; \\cte n° : 410 Année : 2003 conformément au décret du 1er Février 2002. Registre FJOJ A comparu le sieur Jacques MATHIEU demeurant et domicilié 'age : 205-2 à Port-au-Prince. Lequel nous a déclaré que le douze Mars mil neuf cent quatorze à six heures du matin est née à ACTE DE NAISSANCE DE: Port de Paix un enfant du sexe féminin qu'il a déclaré être la fille naturelle de Samuel VILLARD, décédé de la Lamercie Cylotte VILLARD dame Prophéline PROPHETE, décédée. Née le A laquelle enfant il a donné les prénoms de Lamercie Cylotte. 12 mars 1914 Dont acte fait en notre Bureau, Rue d'Ennery en présence de Paul CADET et de André JEAN tous deux majeurs, demeurant et domiciliés à Port-au-Prince. Après lecture faite par nous du présent acte, l'avons signé seul. RECEPISSE DE LA DIRECTION GENERALE DES IMPOTS No. Signé: Comparant Témoins Officier J.C.G. Fait à Port-au-Prince, le 14 décembre 2006 POUR COPIE CONFORME COLLATIONNEE ARCHYSE PAUL QUERU DALENCOURT CMV DIRECTEUR GENERAL ai SECURITY Angle Rues Borgella et Geffrard. Port-au-Prince, Haüti Tél : 222-0227/222-8566 / 223-1077 Fax : (509) 222-6280 B.P.: 1299"
}
