{
  "anumber": "A58402012",
  "id": "A58402012_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58402012_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of State APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, DS-230 Part II"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2007,
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 PTP2005582026 U.S. Department of State OMB APPROVAL NO. 1405-0015 APPLICATION FOR IMMIGRANT VISA AND EXPIRES: 07/31/2007 ESTIMATED BURDEN: 1 HOUR' ALIEN REGISTRATION PART II - SWORN STATEMENT INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answers to all questions. Mark questions that are Not Applicable with \"N/A\". If there is insufficient room on the form, answer on a separate sheet using the same numbers that appear on the form. Attach any additional sheets to this form. The fee should be paid in United States dollars or local currency equivalent, or by bank draft. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even if you are issued an immigrant visa and are subsequently admitted to the United States, providing false information on this form could be grounds for your prosecution and/or deportation. This form (DS-230 PART II), together with Form DS-230 PART I, constitutes the complete Application for Immigrant Visa and Alien Registration. 26. Family Name First Name Middle Name JEAN LAMERCIE CYLOTTE 27. Other Names Used or Aliases (If married woman, give maiden name) VILLARD 28. Full Name in Native Alphabet (If Roman letters not used) 29 Name and Address of Detirinner FOIA (b)(6) Te 30. United States laws governing the issuance visas require each applicant to state whether or not he or she is a member of any class of individuals excluded from admission into the United States. The excludable classes are described below in general terms. You should read carefully the following list and answer YES or NO to each category. The answers you give will assist the consular officer to reach a decision on your eligibility to receive a visa. EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN THE FOLLOWING CLASSIFICATIONS ARE INELIGIBLE TO RECEIVE A VISA. DO ANY OF THE FOLLOWING CLASSES APPLY TO YOU? a. An alien who has a communicable disease of public health significance; who has failed to present documentation of having received vaccinations in accordance with Yes No U.S. law; who has or has had a physical or mental disorder that poses or is likely to pose a threat to the safety or welfare of the alien or others; or who is a drug abuser or addict. b. An alien convicted of, or who admits having committed, a crime involving moral turpitude or violation of any law relating to a controlled substance or who is the spouse, Yes No son or daughter of such a trafficker who knowingly has benefited from the trafficking activities in the past five years; who has been convicted of 2 or more offenses for which the aggregate sentences were 5 years or more; who is coming to the United States to engage in prostitution or commercialized vice or who has engaged in prostitution or procuring within the past 10 years; who is or has been an illicit trafficker in any controlled substance; who has committed a serious criminal offense in the United States and who has asserted immunity from prosecution; who, while serving as a foreign government official and within the previous 24-month period, was responsible for or directly carried out particularly severe violations of religious freedom; or whom the President has identified as a person who plays a significant role in a severe form of trafficking in persons, who otherwise has knowingly aided, abetted, assisted or colluded with such a trafficker in severe forms of trafficking in persons, or who is the spouse, son or daughter of such a trafficker who knowingly has benefited from the trafficking activities within the past five years. C. An alien who seeks to enter the United States to engage in espionage, sabotage, export control violations, terrorist activities, the overthrow of the Government of the Yes No United States or other unlawful activity: who is a member of or affiliated with the Communist or other totalitarian party; who participated in Nazi persecutions or genocide; who has engaged in genocide; or who is a member or representative of a terrorist organization as currently designated by the U.S. Secretary of State. d. An alien who is likely to become a public charge. Yes No e. An alien who seeks to enter for the purpose of performing skilled or unskilled labor who has not been certified by the Secretary of Labor; who is a graduate of a foreign Yes No medical school seeking to perform medical services who has not passed the NBME exam or its equivalent; or who is a health care worker seeking to perform such work without a certificate from the CGFNS or from an equivalent approved independent credentialing organization. f. An alien who failed to attend a hearing on deportation or inadmissibility within the last 5 years; who seeks or has sought a visa, entry into the United States, or any Yes No immigration benefit by fraud or misrepresentation; who knowingly assisted any other alien to enter or try to enter the United States in violation of law; who, after November 30, 1996, attended in student (F) visa status a U.S. public elementary school or who attended a U.S. public secondary school without reimbursing the school; or who is subject to a civil penalty under INA 274C. Privacy Act and Paperwork Reduction Act Statements The information asked for on this form is requested pursuant to Section 222 of the Immigration and Nationality Act. The U.S. Department of State uses the facts you provide on this form primarily to determine your classification and eligibility for a U.S. immigrant visa. Individuals who fail to submit this form or who do not provide all the requested information may be denied a U.S. immigrant visa. If you are issued an immigrant visa and are subsequently admitted to the United States as an immigrant, the Department of Homeland Security will use the information on this form to issue you a Permanent Resident Card, and, if you SO indicate, the Social Security Administration will use the information to issue you a social security number and card. *Public reporting burden for this collection of information is estimated to average 1 hour per response, including time required for searching existing data sources, gathering the necessary data, providing the information required, and reviewing the final collection. In accordance with 5 CFR 1320 persons are not required to respond to the collection of this information unless this form displays a currently valid OMB control number. Send comments on the accuracy of this estimate of the burden and recommendations for reducing it to: U.S. Department of State (A/RPS/DIR) Washington, DC 20520. DS-230 Part II PREVIOUS EDITIONS OBSOLETE Page 3 of 4"
}