{
  "anumber": "A58402012",
  "id": "A58402012_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58402012_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Action"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2004,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 EB713 U.S. Departmen of Homeland Security Notice of Action United States Citizenship and Immigration Services Page 1 Applicant/Petitioner A# Application/Petition Petition for Alien Relative (Form I-130) Receipt # EAC0502051428 FOIA (b)(6) Notice Date Page Beneficiary December 7, 2004 1 JEAN, LAMERCIE FOIA (b)(6) 11/08/2004 EAC-05-020-51428 EACLRM01 IMPORTANT: THIS NOTICE CONTAINS YOUR UNIQUE NUMBER AND MUST BE RESUBMITTED IN THE ORIGINAL WITH THE REQUESTED INFORMATION. WHEN YOU HAVE COMPLIED WITH THE INSTRUCTIONS ON THIS FORM, RESUBMIT THIS NOTICE AND ALL REQUESTED DOCUMENTS AND/OR INFORMATION. PURSUANT TO 8 CFR 204.1 (h), YOU HAVE 60 DAYS TO PRESENT ADDITIONAL EVIDENCE, TO WITHDRAW THE PETITION, TO REQUEST A DECISION BASED ON THE EVIDENCE SUBMITTED, OR TO REQUEST ADDITIONAL TIME TO RESPOND. AN ADDITIONAL 60 DAYS MAY BE AUTHORIZED. THE TOTAL TIME SHALL NOT EXCEED 120 DAYS. IF YOUR RESPONSE IS NOT RECEIVED BY THIS OFFICE WITHIN THESE TIME LIMITS, A DECISION WILL BE RENDERED BASED ON THE EVIDENCE PREVIOUSLY SUBMITTED. REQUESTS FOR ADDITIONAL TIME TO RESPOND SHOULD BE IN WRITING AND ATTACHED TQ A COPY OF THIS NOTICE. 38 From the date this office receives your resubmission a minimum of 14 days will be required to process your form. If you have not heard from us within 60 days then you may contact the USCIS National Customer Service Center (NCSC) at 1- 800-375-5283. If you are hearing impaired, please call the NCSC TDD at 1-800-767-1833. This Service is in receipt of the evidence you submitted on November 5, 2004, in support of your petition(s) filed on behalf of Lamercie Cylotte Jean. It is noted however, that your mother's name appears differently on your birth certificate than as it appears on the Form I-130. For these reasons, you are requested to comply with the following: Submit documentary evidence showing that Lamercie Cylotte Jean and Cylotte Villard (as it appears on your birth certificate) are the same person. Documentary evidence of a name change may include, but is not limited to, a birth certificate, marriage certificate, divorce decree, death certificate (of the spouse whose name you used), or other legal document. Acceptable evidence must show that the statistic or event was registered with civil authority. The mere fact that you have been using a modified version of your name for an extended period of time is not acceptable proof of a name change. You will be notified separately about any other applications or petitions you filed. Please enclose this original notice with your response. You may wish to make a copy of it for your records. If you write to us about this case, or if you file another application based on this decision, please enclose a copy of this notice. Our address is: UNITED STATES CITIZENSHIP AND IMMIGRATION SERVICES VERMONT SERVICE CENTER 010E 75 LOWER WELDEN STREET E ST. ALBANS, VT 05479-0001 Form I-797 (8/03/90) Y"
}