{
  "anumber": "A58718608",
  "id": "A58718608_0060",
  "page_index": 60,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0060/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "VACCINATION DOCUMENTATION WORKS SHEET, DS-2053"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2007,
        2004,
        2023,
        1913,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 U.S. Department of State OMB No. 1405 0113 VACCINATION DOCUMENTATION WORKSHEET EXPIRATION DATE 1/31/2004 ESTIMATED BURDEN: 30 minutes For Use with DS-2053 To Be Completed by Panel Physician Only (See Page 2 Back of Form) Name (Last, First, MI) Exam Date (mm-dd-yyyy) REQUIRED FOR U.S. IMMIGRANT VISA APPLICANTS DEMELUS LESPERANCE 01-19-2007 Birth Date (mm-dd-yyyy) Passport Number Alien (Case) Number NOT REQUIRED FOR REFUGEE APPLICANTS 08-04-1913 070119001 2005674119 NOTE FOR PANEL PHYSICIANS: 1. Immunization Record For refugee applicants. please complete only if reliable vaccination documents are available Vaccine History Transferred from a Written Record Completed Series (list chronologically from left to right) (v if completed, Blanket Waiver(s) To Be Requested. If Vaccination Not Vaccine given write \"VH\" if Medically Appropriate, Check Suitable Box(es) Below by varicella history, or Date Received Date Received Date Received Date Received Panel Physician write date of lab test Not age Insufficient time Contra- Not fall Vaccine (mm/dd/yyyy) (mm/dd/yyyy) (mm/dd/yyyy) (mm/dd/yyyy) (mm/dd/yyyy) if immune) appropriate interval indicated (flu) season DTP/DTaP Td 01/19/2007 Polio (OPV/IPV) Measles Mumps (or MMR) Rubella (or MR or MMR) Hib (Haemophilus influenzee type b) Hepatitis B Varicella 01/19/2007 eumococcal 01/19/2007 Influenza 2. Results Vaccine history incomplete Applicant may be eligible for blanket waiver(s) because 3. Panel Physician (name) Dr. THEARD vaccination(s) not medically appropriate (as indicated above) VISA PHYSICIAN Applicant will request an individual waiver based on religious or moral convictions. 31, Avex Charles Summer Panel Physician (signature) Portan Prince, Haiti Vaccine history complete for each vaccine, all requirements met (documented above) Fel: :510-4545 Date (mm/dd/yyyy) 745-0583/(509)245-4545 Applicant does not meet vaccination requirements for one or more vaccines and no waiver is requested. DS-3025 Give copy to applicant Page 1 of 2 01-2001"
}