{
  "anumber": "A58718608",
  "id": "A58718608_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR ADDITIONAL TIME, SRC-04-128-509744, SRC-04-1228-50946"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2005,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 REQUEST FOR ADDITIONAL TIME February 12, 2005 USCIS / CSC P.O. BOX # 10590 LAGUNA NIGUEL, CA 92607-0590 RE: SRC-04-128-50874 SRC-04-128-50946 Dear USCIS Officer: Through the foregoing letter I am respectfully requesting that you grant me an additional time SO that I can obtain the documents you requested in the above-mentioned cases. From the moment I received your request, I immediately contacted my relatives in Haiti so that they can obtain the documents. Unfortunately, the documents you request have to be obtained from the National Archives which is located in Port au Prince, Haiti. My relatives live in a city called St. Michel de l'Attalaye, which is 6 hours away from Port au Prince. My relatives have made several trips to Port au Prince to try to obtain the documents, but it has been a mission impossible. Because of all the political instability that Haiti has been going through in the past months, government offices close on a regular basis and this month due to the Carnival, the National Archives closed for a week and the General Director went on vacation. I talked to my relatives yesterday and they told me they expect to be sending the documents to me on March 5th the latest. I wish to state that it will result in extreme hardship for me and my relatives if I am not granted additional time because it will take even longer for us to be reunited. I thank you in advance for your help in this matter and for any consideration that you may render to my request. FOIA (b)(6)"
}