{
  "anumber": "A58718608",
  "id": "A58718608_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Initial Evidence Request - I-130, I--130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 SRC0412850946 Page 2 INITIAL EVIDENCE REQUEST - I-130 Birth Certificate: According to the Foreign Affairs Manual, birth records in Haiti are available. The following civil records are available in two forms. At the time of registration, a handwritten certificate (Acte de Naissance) on official, stamped paper is issued by the registrar of the section in which registration takes place. The record is also entered into an official register, which is transferred to the National Archives in Port-au-Prince, usually after one year. Once this transfer occurs, a transcript of the record, known as an Extrait de Naissance (birth extract), can be obtained from the National Archives. Official, double-folded stamped paper first must be obtained from the Bureau de Contributions. The National Archives prepares requested extraits on the official paper. The interested party must have an original certificate or must know the year and place of registry. All extraits should bear two different seals, the signature of the Archives Director and a dry seal. All alterations to the original text are authorized by judgement of the Tribunal Civil and are recorded on the reverse of the front page of every extrait. Only the birth extract (Extrait de Naissance) are legally valid, and even then, only when they indicate a timely registration. Submit the Extrait de Naissance for the petitioner, FOIA (6) showing the date and place of birth and both parents' names, issued by the National Archives as noted above. If the document does not exist or is unavailable, please submit a document from a governmental authority stating that the document does not exist or is unavailable, and submit secondary evidence to substantiate this document. Examples of secondary evidence include, but are not limited to: a copy of a baptismal certificate, or other supporting documents such as the medical and/or school records, that show the child's parents' names and the child's date of birth, and any correspondence between the petitioner and parents, etc. Foreign Language Documents: Any document containing a language other than English must be submitted with a full English language translation. The translator must certify that the translation is complete and accurate and that he or she is competent to translate. NOTE: The requested foreign language document must be submitted with the English translation. The decision of whether to approve or deny the petition will be based upon the type(s) of evidence submitted and its credibility. ATTACHMENT TO I-797 CSC12000/WS22602/DIV VI/11/19/04"
}