{
	"anumber": "A58718608",
	"id": "A58718608_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0038/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Instructions, EOIR-29"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2002]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 INSTRUCTIONS 1. Filing. You must file this Notice of Appeal with the U.S. Citizenship and Immigration Services (USCIS). If the 4. Counsel. An Appellant may be represented, at no expense decision was handed to you by an USCIS Officer, you must to the Government, by an attorney or other duly authorized file this Notice of Appeal within 30 calendar days. If the representative. An Attorney or authorized representative decision was mailed to you by the USCIS, this Notice of must file a separate notice of appearance (Form EOIR-27) Appeal must be received within 30 calendar days from the with this Notice of Appeal. In presenting and prosecuting date the decision was mailed to you. Follow the this appeal, the USCIS may be represented by appropriate instructions included with the USCIS decision. Do not send counsel. this Notice of Appeal directly to the Board of Immigration Appeals (Board). 5. Briefs. When a brief is filed, it shall be submitted to the USCIS office having administrative control over the Record If you are appealing a decision by a USCIS officer denying of Proceedings in this matter within the time designated by a visa petition (I-130 application), please note the following: the USCIS. A copy shall be served on the opposing party. List the name and the \"A\" number of the beneficiary at the The USCIS, or the Board, for good cause may extend the top of Form EOIR-29. The beneficiary is not allowed to sign time of filing a brief or reply brief. The Board, in its Form EOIR-29. Only the petitioner is allowed to sign Form discretion, may authorize the filing of briefs directly with the EOIR-29. Board. Reply briefs are allowed by leave of the Board. 2. Review. Most appeals are reviewed by a single Board 6. Oral Argument. The Board will consider every case on the Member. If you assert that your appeal warrants review by record submitted, whether or not oral representations are a three-Board Member panel, you may identify the specific made. Oral argument may be requested. If approved, you factual or legal basis for your contention. will be notified. The case will be reviewed by a three-member panel only if 7. Summary Dismissal of Appeal. The Board may it presents one of these circumstances: summarily dismiss any appeal or portion of any appeal in which: (1) The appellant fails to specify the reasons for the The need to establish a precedent construing the appeal: (2) The only reason specified by the appellant for meaning of laws, regulations, or procedures; his/her appeal involves a finding of fact or conclusion of law The need to review a decision by the USCIS that is not which was conceded by him/her at a prior proceeding; (3) in conformity with the law or with applicable The appeal is from an order that granted the appellant the precedents; relief that had been requested; (4) The appeal is filed for an The need to resolve a case or controversy of major improper purpose, such as unnecessary delay, or lacks an national import; arguable basis in fact or law, unless the Board determines The need to reserve the decision of the USCIS, other that it is supported by a good faith argument for extension, than a reversal under 8 C.F.R ยง 3.1 (e) (5). modification, or reversal of existing law; (5) The appellant indicates on Form EOIR-29 that he/she will file a separate brief or statement in support of the appeal and, thereafter 3. Fees. A fee of one hundred and ten U.S. dollars ($110.00) does not file such brief or statement, or reasonably explain must be paid for filing this appeal. It cannot be refunded his/her failure to do so, within the same set for filing; (6) The regardless of the action taken on the appeal. All fees must appeal does not fall within the Board's jurisdiction; (7) The be submitted in the exact amount. (Only a single fee appeal is untimely or barred by an affirmative waiver of the need be paid if two or more persons are covered by a right to appeal that is clear on record; or (8) The appeal fails single decision.) Do not mail cash. Payment by check or to meet essential statutory or regulatory requirements or is money order must be drawn on a bank or another institution expressly excluded by statute or regulation. located in the United States and be payable in United States currency. If appellant resides in Guam, the check or money order must be payable to the \"Treasurer of Guam.\" If appellant resides in the Virgin Islands, the check or For further guidance please see the Board of Immigration money order must be payable to the \"Commissioner of Appeals Practice Manual and Questions and Answers, Finance of the Virgin Islands.\" All other appellants must which are available on the EOIR website at make the check or money order payable to the \"U.S. www.usdoj.gov/eoir. Citizenship and Immigration Services.\" When a check is drawn on the account of a person other than the appellant, the name of the appellant must be entered on the face of the check. If the appeal is submitted from outside the Under the Paperwork Reduction Act. a person in not required to respond to a collection of information unless it displays a valid United States, remittance may be made by bank OMB control number. We try to create forms and instructions international money order or foreign draft drawn on a that are accurate. can be easily understood, and which impose the financial institution in the United States and payable to the least possible burden on you to provide us with information The \"U.S. Citizenship and Immigration Services\" in United estimated average time to complete this form is thirty (30) States currency. Personal checks are accepted subject to minutes. If you have comments regarding the accuracy of this collectibility. An uncollectible check will render the appeal estimate, or suggestions for making this form simper. you can write to the Executive Office for Immigration Review. Office of invalid. General Counsel, 5107 Leesburg Pike, Suite 2600. Falls Church, Virginia 22041. Form EOIR-29 Sept. 2002"
}
