{
	"anumber": "A58718608",
	"id": "A58718608_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form I-864 ( (Rev. 11/01/06)N Page '7'"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 What If I Do Not Fulfill My Obligations? If you do not provide sufficient support to the person who becomes a permanent resident based on the Form I-864 that you signed, that person may sue you for this support. If a Federal, State or local agency, or a private agency provides any covered means-tested public benefit to the person who becomes a permanent resident based on the Form I-864 that you signed, the agency may ask you to reimburse them for the amount of the benefits they provided. If you do not make the reimbursement, the agency may sue you for the amount that the agency believes you owe. If you are sued, and the court enters a judgment against you, the person or agency that sued you may use any legally permitted procedures for enforcing or collecting the judgment. You may also be required to pay the costs of collection, including attorney fees. If you do not file a properly completed Form I-865 within 30 days of any change of address, USCIS may impose a civil fine for your failing to do so. When Will These Obligations End? Your obligations under a Form I-864 will end if the person who becomes a permanent resident based on a Form I-864 that you signed: Becomes a U.S. citizen; Has worked, or can be credited with, 40 quarters of coverage under the Social Security Act; No longer has lawful permanent resident status, and has departed the United States; Becomes subject to removal, but applies for and obtains in removal proceedings a new grant of adjustment of status, based on a new affidavit of support, if one is required; or Dies. Note that divorce does not terminate your obligations under this Form I-864. Your obligations under a Form I-864 also end if you die. Therefore, if you die, your Estate will not be required to take responsibility for the person's support after your death. Your Estate may, however, be responsible for any support that you owed before you died. 30. I, ELIPHETE DEMELUS , (Print Sponsor's Name) certify under penalty of perjury under the laws of the United States that: a. I know the contents of this affidavit of support that I signed. b. All the factual statements in this affidavit of support are true and correct. c. I have read and I understand each of the obligations described in Part 8, and I agree, freely and without any mental reservation or purpose of evasion, to accept each of those obligations in order to make it possible for the immigrants indicated in Part 3 to become permanent residents of the United States; d. I agree to submit to the personal jurisdiction of any Federal or State court that has subject matter jurisdiction of a lawsuit against me to enforce my obligations under this Form I-864; e. Each of the Federal income tax returns submitted in support of this affidavit are true copies, or are unaltered tax transcripts, of the tax returns I filed with the U.S. Internal Revenue Service; and Sign on following page. Form I-864 (Rev. 11/01/06)N Page 7"
}
