{
	"anumber": "A58718608",
	"id": "A58718608_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0042/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, for classification of the beneficiary under section 201(b)(2)(A)(i) of the Immigration and Nationality Act,"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2004, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 SRC0412850946 Page 2 The petitioner filed Form I-130, Petition for Alien Relative, for classification of the beneficiary under section 201(b)(2)(A)(i) of the Immigration and Nationality Act, as a parent of a citizen of the United States. When a petition is filed to classify a beneficiary as a parent under section 201(b)(2)(A)(i) of the Act, the petitioner must establish that he/she once qualified as the beneficiary's child as defined in section 101(b)(1) of the Act. Section 101(b) of the Act states in pertinent part: (1) The term \"child\" means an unmarried person under twenty-one years of age who is- (A) a child born in wedlock; 8 C.F.R. 204.2(f)(2) states: Evidence to support a petition for a parent. In addition to evidence of United States citizenship the petitioner must also provide evidence of the claimed relationship. 8 C.F.R. 204.2(f)(2)(i) states, in pertinent part: Primary evidence if a petitioner is a legitimate son or daughter. If a petition is submitted in behalf of the mother, the birth certificate of the petitioner showing the mother's name must accompany the petition If a petition is submitted in behalf of the father, the birth certificate of the petitioner, a marriage certificate of the parents, and legal termination of the parents' prior marriages, if any... A review of the record reflects that the petitioner did not initially submit sufficient documentation to establish the claimed relationship as required by federal regulation. Therefore, the U.S. Citizenship and Immigration Services (USCIS) afforded the petitioner an opportunity to submit the required evidence. On November 24, 2004, the petitioner was advised to submit within 84 days the following evidence: Extrait de Naissance for FOIA (b)(6) showing the date and place of birth and both parents' names, issued by the National Archives. The records show that as of this date, the petitioner has not responded to the USCIS' request for evidence. As such, a decision has been made based upon the evidence of record. The petitioner has not submitted the required evidence to establish the claimed relationship. As such the petitioner has failed to qualify the beneficiary for classification as a parent within the meaning of section 201(b)(2)(A)(i) of the Act. Therefore, the petition is denied. ATTACHMENT TO I-292"
}
