{
	"anumber": "A58718608",
	"id": "A58718608_0044",
	"page_index": 44,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0044/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Initial Screening Notice, F012-29"
		},
		"years": {
			"ms_years_nlp_v1": [2005, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 U.S. Department of Homeland Security P.O. Box 30111 Laguna Niguel CA 92607-0111 DEPARTMENT U.S. OF U.S. Citizenship 4/08/2005 HOMELAND SECURITY and Immigration Services Date: FOIA (b)(6) File No.: Form No: FOTR-29 This is an initial screening. Your application(s)/petition(s) is/are being returned to you for the following reason(s): 50 1. The fee for the application(s)/petition(s) submitted is $110, you 2. The date on the check must be within the last six (6) months. 3. The United States Citizenship and Immigration Services (USCIS) California Service Center does not accept altered money orders/cashiers checks. Please resubmit correct payment. 4. Please resubmit check or money order made payable to USCIS. 5. Furnish proof of payment of fee for FORM . (e.g., copy of front and back of remitted check, copy of cash receipt) 6. Application(s)/petition(s) received in this office without a fee are returned to the applicant/petitioner. Resubmit your application petition with appropriate fee and return both to the California Service Center. Please do not resubmit separately; the check/money order and the petition must be submitted together. 7. Please contact your local USCIS office for assistance. Your local office sees customers by appointment only. To schedule an appointment, visit the USCIS web site at www.uscis.gov and select \"InfoPass\". 8. Please provide the receipt number of the approved application/petition on which you are requesting action. PLEASE SEE PAGE 2 FOR MORE REASONS. ID# 3100336 USCIS Conc. Reject Notice A (Rev 9/27/04) Page I of 2. www.uscis.gov"
}
