{
  "anumber": "A58718608",
  "id": "A58718608_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, DS-230 Part I"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2004,
        2007,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 U.S. Department of State OMB APPROVAL NO. 1405-0015 EXPIRES: 07/31/2007 ESTIMATED BURDEN: 1 HOUR* (See Page 2) APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART I - BIOGRAPHIC DATA INSTRUCTIONS: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answers to all questions. Mark questions that are Not Applicable with \"N/A\". If there is insufficient room on the form, answer on a separate sheet using the same numbers that appear on the form. Attach any additional sheets to this form. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. This form (DS-230 PART I) is the first of two parts. This part, together with Form DS-230 PART II, constitutes the complete Application for Immigrant Visa and Alien Registration. 1. Family Name First Demders Name \"Sesperance\" Middle Name 2. Other Names Used or Aliases (If married woman, give maiden name) NONe 3. Full Name in Native Alphabet (If Roman letters not used) 4. Date of Birth (mm-dd-yyyy) 5. Age 6. Place of Birth 04 Awg AOWI13 (City or town) (Province) (Country) 93 ST michel DELATT HTi Haiti 7. Nationality (If dual national, 8. Gender 9. Marital Status give both) Male Single (Never married) Married Widowed Divorced Separated Haitienne Female Including my present marriage, I have been married times. 10. Permanent address in the United States where you intend to live, if known (street address 11. Address in the United States where you want your Permanent Resident Card (Green including zip code). Include the name of a person who currently lives there. Card) mailed, if different from address in item #10 (include the name of a person who currently lives there). FOIA (b)(6) FOIA (b)(6) Telephone number: 12. Your Present Occupation 13. Present Address (Street Address) (City or Town) (Province) (Country) cultivater St michel de lett HT; Telephone number: Home Office First Name Middle Name FOIA (b)(6) Date of marriage (mm-dd-yyyy): 15, Father's Family Name First Name Middle Name Sesperance Demelies 16. Father's Date of Birth (mm-dd-yyyy) Place of Birth Current Address If deceased, give year of death 04/08/13 St michel debt 17. Mother's Family Name at Birth First Name Middle Name ELWCIE Jenome 18. Mother's Date of Birth (mm -dd-yyyy) Place of Birth Current Address If deceased, give year of death 24 June 23 michel dé bath DS-230 Part I THIS FORM MAY BE OBTAINED FREE AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA 07-2004 PREVIOUS EDITIONS OBSOLETE Page 1 of 4"
}