{
  "anumber": "A58718608",
  "id": "A58718608_0052",
  "page_index": 52,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A58718608_0052/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "masculin"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 481448A ain République à Hatti MINISTERE DE LA CULTURE Archives Nationales d'Haiti 014206 H Extrait des Registres des Actes de NAISSANCE déposés au bureau des Archives Nationales de la République et délivré sur papier non timbré suivant l'article 2 du décret du 12 mai 1995 L'an mil neuf cent quatre vingt treize, an 190e de l'Indépendano et le vendredi trente et un décembre à deux heures 50 de l'aprés midi. ANNEE - 1993 Par devant nous JULES A. MESIDOR Officier de l'Etat civil de Grison PAGE - 390 Garde soussigné. Conf au décret du 14 novembre 1988. A comparu le sieur NUMERO - 777 TIODATE DEMELUS cultivateur demeurant et domicilié à Canathe . Lequel nous a présenté un enfant du sexe masculin qu'il nous a déclaré etre SO ACTE DE NAISSANCE DE : fils légitime né à Saint Michel de l'Attalaye le quatre aout mil neuf LESPERANCE DEMELUS cent treize a cinq heures du matin de la dame ne GHRISTALINE ULYSSE né le 4 aout 1913 a cultivatrice demeurant et domiciliée à Camathe Auquel enfant il a don Saint Michel de l'Atta- né le prénom de LESPERANCE. Dont acte fait en notre bureau rue du marc laye en présence de Mme NORCIN DEROSIERS et de DANMA ULYSSE tous deux ma- jeurs demeurant et domiciliés à camathe. Aprés lecture faite par nous d présent acte l'avons signé seul. SIGNS : J. A. MESIDOR Port-au-Prince le 7 ANE/A POUR COPIE CONFORT novembress.002 EMERGENCY COLLATION BERTRAND DIRECTEUR GENERAL L.C.A Angle Rues Borgella et Geffrard, Port-au-Prince, Haüti Tél :222-0227/222-8566/223-1077 Fax (509) 222-6280 - B. P. : 1299"
}