{
  "anumber": "A61070647",
  "id": "A61070647_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "VACCINATION DOCUMENTATION WORKSSHEET, DS-2053 or DS-2054"
    },
    "years": {
      "ms_years_nlp_v1": [
        2008,
        2009,
        2023,
        2012,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 U.S. Department of State OMB No. 1405-0113 VACCINATION DOCUMENTATION WORKSHEET EXPIRATION DATE 04/30/2012 ESTIMATED BURDEN 30 minutes For Use with DS-2053 or DS-2054 To be completed by Panel Physician Only (See Page 2) Name (Last, First, MI) Exam Date (mm-dd-yyyy) REQUIRED FOR U.S. IMMIGRANT VISA APPLICANTS CHARLESTON CHarlesia DEC 01 2009 NOT REQUIRED FOR REFUGEE APPLICANTS Birth Date (mm-dd-yyyy) Alien (Case) Number APR 28 1915 Pp2063085 2008843017 NOTE FOR PANEL PHYSICIAN : For refugee applicants, please complete only if reliable 1. Immunization Record vaccination documents are available . Vaccine History Transferred From a Written Record Completed Series Blanket Waiver(s) To Be Requested If Vaccination Not Vaccine Given (List Chronologically from Left to Right) if Completed, Medically Appropriate, Check Suitable Box(es) Below by Write \"VH\" if Varicella Date Received Date Received Date Received Date Received Panel Physician History, or write Date Not Age Insufficient Time Contra- Not Routinely Not Fall Vaccine (mm-dd-yyyy) (mm-dd-yyyy) (mm-dd-yyyy) (mm-dd-yyyy) (mm-dd-yyyy) of Lab Test if immune) Appropriate Interval Indicated Available (Flu) Season Specify (check) vaccine : DT DTP DTaP Specify (check) vaccine : Td Tdap OCT 0 1 2008 Specify (check) vaccine : Polio - OPV IPV Specify (check) vaccine : MMR (Measles-Mumps-Rubella) Rubella Specify (check) vaccine : Measles Meales Rubella Specify (check) vaccine : Mumps Mumps Rubella Rotavirus Hib Hepatitis A Hepatitis B Meningococcal Human papillomavirus Varicella OCT 01 2009 Zoster Pneumococcal OCT 0 1 2009 Influenza DC 01 2009 2. Results Vaccine History Incomplete DR. Jean denoldButeau Applicant may be eligible for blanket waiver(s) because vaccination(s) not medically appropriate (as indicated above) 3. Panel Physician (Name) Applicant will request an individual waiver based on religious or moral convictions Panel Physician (Signature) Vaccine history complete for each vaccine, all requirements met (Documented above) Jany Date (mm-dd-yyyy) Applicant does not meet vaccination requirements for one or more vaccines and no waiver is requested DEC 09-2009 Give Copy to Applicant Page 1 of 2 DS-3025 05-2009"
}