{
  "anumber": "A61070647",
  "id": "A61070647_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 Departmen. of Homeland Security OMB #1615-0012; Expires 01/31/11 U.S. Citizenship and Immigration Services I-130, Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR USCIS OFFIC A# Action Stamp Fee U.S. Department of Homeland Security PTP2588543017C Section of Law/Visa Category 201(b) Spouse IR-1/CR-1 201(b) Child IR-2/CR-2 APPROVED EAC-08-359-12253 09/22/2008 201(b) Parent IR-5 203(a)(1) Unm. S or D F1-1 C 0 3 2008 203(a)(2)(A) Spouse F2-1 Petition was filed on: (priority date) M 9/22/2008 203(a)(2)(A) Child F2-2 Personal Interview Previously Forwarded 203(a)(2)(B) Unm. S or D - F2-4 003869 Pet Ben. \"A\" File Reviewed I-485 Filed Simultaneously 203(a)(3) Married S or D F3-1 U.S Citizenship and Immigration Services Field Investigation 204(g) Resolved 203(a)(4) Brother/Sister - F4-1 203(a)(2)(A) Resolved 203(g) Resolved Remarks: NVC A. Relationship You are the petitioner. Your relative is the beneficiary. 1. I am filing this petition for my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your relative 1. Name (Family Name in CAPS) (First) (Middle) FOIA (b)(6) CHARLESTON, CHARLESIA 2. Address (Number and Street) (Apt. No.) CABARET DERRIERE TOTAL #18 (Town or City) (State/Country) (Zip/Postal Code) CABARET HAITI NONE 3. Place of Birth (Town or City) (State/Country) GONAIVES, N/A HAITI 4. Date of Birth 5. Gender 6. Marital Status Male Married Single 04/28/1915 Female Widowed Divorced 7. Other Names Used (including maiden name) NONE 8. Date and Place of Present Marriage (if married) NONE NONE 9. U.S. Social Security (if any) 10. Alien Registration Number NONE NONE 11. Name(s) of Prior Husband(s)/Wive(s) 12. Date(s) Marriage(s) Ended NONE NONE NONE 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a: NN/A (visitor, student, stowaway, without inspection, etc.) Arrival/Departure Record (I-94) Date arrived NONE NONE Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 NONE 15. Name and address of present employer (if any) NONE NONE Date this employment began NONE 16. Has your relative ever been under immigration proceedings? No Yes Where When Removal Exclusion/Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED Rec'd Sent COMPLETED Appv'd Denied Ret'd Form I-130 (Rev. 05/27/08)Y"
}