{
	"anumber": "A61070647",
	"id": "A61070647_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0032/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FOIA ( (b)(6), Form I-130 ( (Rev. 05/27/08)Y Page 2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 1990, 2023, 2008]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 C. Information about your relative (continued) 17. List husband/wife and all children of your relative. (Name) (Relationship) (Date of Birth) (Country of Birth) N/A N/A N/A N/A N/A FOIA (b)(6) 18. Address in the United States where your relative intends to live. (Street Address) (Town or City) (State) 910 WEST NEW MARKET ROAD IMMOKALEE FLORIDA 19. Your relative's address abroad (Include street, city, province and country) Phone Number (if any) CABARET DERRIERE TOTAL #18 CABARET HAITI (509)751-4587 20. If your relative's native alphabet is other than Roman letters, write his or her name and foreign address in the native alphabet. (Name) Address (Include street, city, province and country): 21. If filing for your husband/wife, give last address at which you lived together. (Include street, city, province, if any, and country): From: To: N/A N/A N/A 22. Complete the information below if your relative is in the United States and will apply for adjustment of status. Your relative is in the United States and will apply for adjustment of status to that of a lawful permanent resident at the USCIS office in: If your relative is not eligible for adjustment of status, he or she will apply for a visa abroad at the American consular post in N/A N/A PORT-AU-PRINCE, HAITI (City) (State) (City) (Country) NOTE: Designation of an American embassy or consulate outside the country of your relative's last residence does not guarantee acceptance for processing by that post. Acceptance is at the discretion of the designated embassy or consulate. D. Other information 1. If separate petitions are also being submitted for other relatives, give names of each and relationship. N/A 2. Have you ever filed a petition for this or any other alien? Yes No If \"Yes\", give name, place and date of filing and result. GERMAIN & FRANCOISE LOUIS, SONS, 1989-1990 TSC/APPROVED WARNING: USCIS investigates claimed relationships and verifies the validity of documents. USCIS seeks criminal prosecutions when family relationships are falsified to obtain visas. PENALTIES: By law, you may be imprisoned for not more than five years or fined $250,000, or both, for entering into a marriage contract for the purpose of evading any provision of the immigration laws. In addition, you may be fined up to $10,000 and imprisoned for up to five years, or both, for knowingly and willfully falsifying or concealing a material fact or using any false document in submitting this petition. YOUR CERTIFICATION: I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records that the U.S. Citizenship and Immigration Services needs to determine eligibility for the benefit that I am seeking. E. Signature of petitioner. FOIA (b)(6) Date 9/17/08 Phone Number FOIA (b)(6) F. Signature 01 person preparing ums form, if other than the petitioner. I declare that I prepared this document at the request of the person above and that it is based on all information of which I have any knowledge. JEAN VOLCY, PARALEGAL Print Name 716 N. 15TH ST., IMMOKALEE, FL 34142 Address G-28 ID or VOLAG Number, if any. Jan 09/17/2008 Signature Date Form I-130 (Rev. 05/27/08)Y Page 2"
}
