{
  "anumber": "A61070647",
  "id": "A61070647_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FOIA ( (b)(6), DS-230 Part I"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2009,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 29. List Names, Dates and Places of Birth, and Addresses of ALL Children Name Date (mm-dd-yyyy) Place of Birth Address (If different from your own) FOIA (b)(6) 30. List below all places you have lived for at least six months since reaching the age of 16, including places in your country of nationality. Begin with your present residence. City or Town Province Country From/To (mm-yyyy) or \"Present\" GONAIVES N/A HAITI 04/1915 07/2009 31a. Person(s) named in 14 and 19 who will accompany you to the United States now. N/A 31b. Person(s) named in 14 and 19 who will follow you to the United States at a later date. N/A 32. List below all employment for the last ten years. Employer Location Job Title From/To (mm-yyyy) or \"Present\" NONE NONE NONE NONE NONE In what occupation do you intend to work in the United States? N/A retaid 33. List below all educational institutions attended. School and Location From/To (mm-yyyy) Course of Study Degree or Diploma NONE NONE NONE NONE NONE NONE CREOLE YES Languages spoken or read N/A Professional associations to which you belong 34. Previous Military Service Yes No Branch NONE Dates of Service (mm-dd-yyyy) NONE Rank/Position NONE Military Specialty/Occupation NONE 35. List dates of all previous visits to or residence in the United States. (If never, write \"never\") Give type of visa status, if known. Give DHS \"A\" number if any. From/To (mm-yyyy) Location Type of Visa \"A\" Number (If known) NONE NONE NONE NONE NONE Signature of Applicant Date (mm-dd-yyyy) (her best mark she Cannot sign) 7/5/09 Privacy Act and Paperwork Reduction Act Statements The information asked for on this form is requested pursuant to Section 222 of the Immigration and Nationality Act. The U.S. Department of State uses the facts you provide on this form primarily to determine your classification and eligibility for a U.S. immigrant visa. individuals who fail to submit this form or who do not provide all the requested information may be denied a U.S. immigrant visa. If you are issued an immigrant visa and are subsequently admitted to the United States as an immigrant, the Department of Homeland Security will use the information on this form to issue you a Permanent Resident Card, and, if you so indicate, the Social Security Administration will use the information to issue you a social security number and card. \"Public reporting burden for this collection of information is estimated to average 1 hour per response, including time required for searching existing data sources, gathering the necessary documentation, providing the information and/or documents required, and reviewing the final collection. You do not have to supply this information unless this collection displays a currently valid OMB control number. If you have comments on the accuracy of this burden estimate and/or recommendations for reducing it, please send them to A/GIS/DIR, Room 2400 SA-22, U.S. Department of State, Washington, DC 20522-2202 DS-230 Part I Page 2 of 4"
}