{
	"anumber": "A61070647",
	"id": "A61070647_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 8. Sponsor's Contract., Form I-864 ( (Rev. 10/18/07)Y Page 6"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 Part 8. Sponsor's Contract. Please note that, by signing this Form I-864, you agree to assume certain specific obligations under the Immigration and Nationality Act and other Federal laws. The following paragraphs describe those obligations. Please read the following information carefully before you sign the Form I-864. If you do not understand the obligations, you may wish to consult an attorney or accredited representative. What is the Legal Effect of My Signing a Form I-864? if you sign a Form I-864 on behalf of any person (called the \"intending immigrant\") who is applying for an immigrant visa or for adjustment of status to a permanent resident, and that intending immigrant submits the Form I-864 to the U.S. Government with his or her application for an immigrant visa or adjustment of status, under section 213A of the Immigration and Nationality Act these actions create a contract between you and the U.S. Government. The intending immigrant's becoming a permanent resident is the \"consideration\" for the contract. Under this contract, you agree that, in deciding whether the intending immigrant can establish that he or she is not inadmissible to the United States as an alien likely to become a public charge, the U.S. Government can consider your income and assets to be available for the support of the intending immigrant. What If I choose Not to Sign a Form I-864? You cannot be made to sign a Form I-864 if you do not want to do so. But if you do not sign the Form I-864, the intending immigrant may not be able to become a permanent resident in the United States. What Does Signing the Form I-864 Require Me to do? If an intending immigrant becomes a permanent resident in the United States based on a Form I-864 that you have signed, then, until your obligations under the Form I-864 terminate, you must: Provide the intending immigrant any support necessary to maintain him or her at an income that is a least 125 percent of the Federal Poverty Guide lines for his or her household size (100 percent if you are the petitioning sponsor and are on active duty in the U.S. Armed Forces and the person is your husband, wife, unmarried child under 21 years old.) Notify USCIS of any change in your address, within 30 days of the change, by filing Form I-865. What Other Consequences Are There? If an intending immigrant becomes a permanent resident in the United States based on a Form I-864 that you have signed, then until your obligations under the Form I-864 terminate, your income and assets may be considered (\"deemed\") to be available to that person, in determining whether he or she is eligible for certain Federal means-tested public benefits and also for State or local means-tested public benefits, if the State or local government's rules provide for consideration (\"deeming\") of your income and assets as available to the person. This provision does not apply to public benefits specified in section 403(c) of the Welfare Reform Act such as, but not limited to, emergency Medicaid, short-term, non-cash emergency relief; services provided under the National School Lunch and Child Nutrition Acts; immunizations and testing and treatment for communicable diseases; and means-tested programs under the Elementary and Secondary Education Act. Contract continued on following page. Form I-864 (Rev. 10/18/07)Y Page 6"
}
