{
	"anumber": "A61070647",
	"id": "A61070647_0034",
	"page_index": 34,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0034/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "TRANSLATION OF A BIRTH CERTIFICATE, Q2208/153056"
		},
		"years": {
			"ms_years_nlp_v1": [2008, 1995, 1974, 1993, 2023, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 TRANSLATION OF A BIRTH CERTIFICATE Republic of Haiti Q2008/153056 MINISTER OF THE CULTURE National Archives of Haiti No. 099908 W Extract of Registers of Acts of BIRTH deposed to the bureau of National Archives of the Republic and delivered on no stamped paper according the article 2 of the decree of the 12th day of May 1995. The year nineteen ninety-three In 190th of the Independence and on Tuesday, April 20 at 08:00 o'clock of the morning. We, Jean Chenier GOURDET, Officer of the State Civil of Port-au-Prince Undersigned. Certified to have registered on our archives to this destiny the transcript of this judgment thus followed in conformity of the law of August 20, 1974. On request of the Citizen Charlesia CHARLESTON and under the Constitution of Me. Remy LEANDRE duly identified, licensed and imposed. By these motives. The tribunal after exams on the conclusions of the Minister Public. Declare under the reserve of rights of those who have interest and quality that Charlesia CHARLESTON of the feminine sex is born aux Gonaives on April 28, 1915 of natural deeds of Mr. Charles CHARLESTON and of Marie Claire DESCARTE both of them deceased. State that the act of the present judgment will hold place of act of birth. Order the transcription of the decree of the present judgment on the register Special held in double to this effect by the Officer of the State Civil of the Section South of Port-au-Prince conformably to the dispositions of the law on the service of Control and of Inspection of the State Civil. Thus judged and pronounced by Us, Henock VOLTAIRE, Judge in hearing Civil and Public in date of the 4th day of March 1993 In 190th of the Independence in witness of Me Franck DORCELY, Substitute of the Commissary of the government of this resort with the assistance of the Clerk Ascencio JUMELLE. It is ordered etc In faith of what etc The Officer J. C. G. Commune: PORT-AU-PRINCE Bureau: SOUTH Act no: 30 Year: 1993 Register: CFZZ Page: 10-3 ACT OF BIRTH OF: Charlesia CHARLESTON Born the 28th day of April 1915 Done in Port-au-Prince, the 8th day of October 2008 FOR COPY CERTIFIED COLLATED"
}
