{
	"anumber": "A61070647",
	"id": "A61070647_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A61070647_0004/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, DS-230 Part I"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2012, 2023, 2009, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/17/2023 U.S. Department of State OMB APPROVAL NO 1405-0015 APPLICATION FOR EXPIRES: 02/29/2012 IMMIGRANT VISA AND ESTIMATED BURDEN: 1 HOUR* ALIEN REGISTRATION RECEIVED JUL 1 7 2009 PART I - BIOGRAPHIC DATA Instructions: Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please CMR print or type your answer to all questions. Mark questions that areNot Applicable with \"N/A\". If there is insufficient room on the form, answer on a separate sheet using the same numbers that appear on the formAttach any additional sheets to this form. Warning: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. This form (DS-230 Part I) is the first of two parts. This part, together with Form DS-230 Part II, constitutes the complete Application for Immigrant Visa and Alien Registration. 1. Family Name First Name Middle Name CHARLESTON, CHARLESIA 2. Other Names Used or Aliases (If married woman, give maiden name) NONE 3. Full Name in Native Alphabet (If Roman letters not used) 4. Date of Birth (mm-dd-yyyy) 5. Age 6. Place of Birth (City or Town) (Province) (Country) 04/28/1915 85 GONAIVES, N/A HAITI 7. Nationality (If dual national, 8. Gender 9. Marital Status give both.) Female Single (Never married) Married Widowed Divorced Separated HAITIAN Male Including my present marriage, I have been married 0 times. 10. Permanent address in the United States where you intend to live, if 11. Address in the United States where you want your Permanent known (street address including ZIP codenclude the name of a person Resident Card (Green Card) mailed, if different from address in item #10 who currently lives there. (include the name of a person who currently lives there). SAME AS THE ABOVE FOIA (b)(6) N/A N/A N/A Telephone number FOIA (b)(6) Telephone number N/A 12. Present Occupation 13. Present Address (Street Address) (City or Town) (Province) (Country) RETIRED CABARET DERRIERE TOTAL #18 CABARET N/A NONE HAITI Telephone mber(Home) Telephone Number(Office) Email Address NONE NONE NONE 14. Spouse's Maiden or Family Name First Name Middle Name NONE NONE NONE 15. Date (mm-dd-yyyy) and Place of Birth of Spouse NONE NONE NONE NONE 16. Address of Spouse (If different from your own) 17. Spouse's Occupation NONE NONE 18. Date of Marriage (mm-dd-yyyy) NONE NONE 19. Father's Family Name First Name Middle Name CHARLESTON, CHARLES 20. Father's Date of Birth 21. Place of Birth 22. Current Address 23. If Deceased, Give (mm-dd-yyyy) DECEASED IN HAITI Year of Death UNKNOWN GONAIVES, HAITI UNKNOWN 24. Mother's Family Name at Birth First Name Middle Name DESCARTE, MARIE CLAIRE 25. Mother's Date of Birth 26. Place of Birth 27. Current Address 28. If Deceased, Give (mm-dd-yyyy) DECEASED IN HAITI Year of Death UNKNOWN GONAIVES, HAITI UNKNOWN DS-230 Part I This Form May be Obtained Free at Consular Offices of the United States of America 05-2009 Previous Editions Obsolete Page 1 of 4"
}
