{
	"anumber": "A70022932",
	"id": "A70022932_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70022932_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 02-28-87) N"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# APPROVE DIRECTOR Fee G-28 or Volag # LOS of JUL 31 1990 Ac. FEEPOUS Section of Law: Petition was filed on 201 (b) spouse 203 (a)(1) (priority date) 201 (b) child 203 (a)(2) Jack Personal Interview Previously Forwarded Pet Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field Investigations 1-485 Simultaneously 204 (a)(2)(A) Resolved 204 (h) Resolved AM CON: SERVICE REMARKS: A. Relationship 1. The alien relative is my: arther 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) NOLASCO Vda. SANCHEZ ISABEL 2. Address (Number and Street) (Apartment Number) 3538 Percy St. (Town or City) (State/Country) (ZIP/Postal Code) Los Angeles, California U.S.A. 3. Place of Birth (Town or City) (State/Country) SanSalvador E1Salvador 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single Female Widowed Divorced 06-17-12 7. Other Names Used (including maiden name) Isabel Nolasco 8. Date and Place of Present Marriage (if married) None 9. Social Security number 10. Alien Registration Number (if any) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended PEnedino Sanchez 10-09-79 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Visitorx Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) 4 7 3 01-25-90 Date authorized stay expired, or will expire as shown on Form I-94 or I-95 07-26-90 15. Name and address of present employer (if any) None Date this employment began (Month/Day/Year) None 16. Has your relative ever been under immigration proceedings? Yes No Where When Exclusion Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}
