{
	"anumber": "A70091406",
	"id": "A70091406_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70091406_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Memorandum or Creation of Record of Lawful Permanent Residence, FY-92"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 FY-92 U.S. DEPARTMENT OF JUSTICE Memorandum or Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A70 091 406 Status as a lawful permanent resident of the United States is accorded: I-94# 050 74795002 Sex 1 Male Date of Birth (Month/Day/Year) Name In Care Of 2 In-Chun CHI Female 03-25-14 Street City of Birth Country of Birth 9422 Julie Beth Street Address CHANG LI HSIEN CHINA Apt. No. Cypres, CA. 90630 Country of Nationality Country of Last Residence City, State, Zip CHINA CHINA Marital Status 1 Single 2 XK Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) 3 Widowed 4 Divorced 5 Separated HOU B-2 89 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) N/A N/A N/A Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification X Applicable TSE TAE Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification HONG KONG 04-24-89 041162 of Last NIV B2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session X Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act OCT 0 7 1991 LOS As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE IRO # 3 Class of admission (Insert Symbol) REMARKS RECOMMEND D\\BY: (Immigration Officer) (Date) Dassry APPROVED OCT 07 1991 I.N.S DISTRICT DIRECTOR DATE OF ACTION 10-01-91 vrm AD 10-07-91 Recommanded by: Happy 1991 DD DISTRICT FOR USE BY VISA CONTROL OFFICE LOS 4343 Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I. 181 (Rev.3-1-83) N 1. FILE COPY"
}
