{
	"anumber": "A70022932",
	"id": "A70022932_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70022932_0023/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, G-325A"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"g325a": {
			"occupation": {
				"occupation_llm_v1": "['housewife']"
			},
			"nationality": {
				"nationality_llm_v1": "Salvadoran"
			}
		}
	},
	"is_g325a": true,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice FORM G-325A OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION Approval expires 4-30-85 (Family name) (First name) (Middle name) MALE BIRTHDATE (Mo.-Day-Yr.) NATIONALITY FILE NUMBER NOLASCO-Vda. Sanchez, ISABEL FEMALE 06-17-12 SalvadoreanA ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) Isabel Nolasco San Salvador, E1 Salvador FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH (If known) CITY AND COUNTRY OF RESIDENCE. FATHER Nolasco, Prudencio Union. E1 Salvador Deceased MOTHER (Maiden name) Ramirez, Dolores Unkn. El Salvador Deceased HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE NONE FORMER HUSBANDS OR WIVES (if none, SO state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE Sanchez Enedino 1899 9-21-30 El Salvador 10-9-79 E1 Salvador APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR STREET AND NUMBER PRESENT TIME 3538 Percy St., Los Angeles, California U.S.A. 01 90 Calle 15 de Septiembre # 140, San Marcos, San Salvador, EL Salvador 60 01 90 APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Same as above APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR FULL NAME AND ADDRESS OF EMPLOYER Homechores 01 90 PRESENT TIME Housewife 60 01 90 Show below last occupation abroad if not shown above. (Include all information requested above.) Same as above DATE THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT NATURALIZATION STATUS AS PERMANENT RESIDENT 3/17/90 OTHER (SPECIFY): IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS, WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes None PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN APPLICANT: THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) NOLASCO-Vda. de SANCHEZ ISABEL (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: Form G-325 A (Rev. 10-1-82) (4) CONSUL"
}
