{
	"anumber": "A70091526",
	"id": "A70091526_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70091526_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ELIMINATION OF CERTIFICATION REQUIREMENTS FOR SUPPORTING DOCUMENTS FOR PETITIONS AND APPLICATIONS, I-130 Application fee is $40.00 payable by personal checks or money orders"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/7/2023 U.S. Department of Justice Immigration and Naturalization Service District Director 300 North Los Angeles Street Los Angeles, CA. 90012 ELIMINATION OF CERTIFICATION REQUIREMENTS FOR SUPPORTING DOCUMENTS FOR PETITIONS AND APPLICATIONS AFTER EXTENSIVE REVIEW AND CONSIDERATION, COMMISSIONER GENE MC NARY HAS ALTERED SIGNIFICANTLY SERVICE POLICY REGARDING SUBMISSION OF SUPPORTING DOCUMENTS REQUIRED FOR VARIOUS APPLICATIONS AND PETITIONS. EFFECTIVE IMMEDIATELY, THE SERVICE WILL NO LONGER ROUTINELY REQUIRE SUBMISSION OF ORIGINAL DOCUMENTS OR \"CERTIFIED COPIES.\" INSTEAD, ORDINARY LEGIBLE PHOTOCOPIES OF SUCH DOCUMENTS (INCLUDING NATURALIZATION CERTIFICATES AND ALIEN REGISTRATION CARDS) WILL BE ACCEPTABLE FOR INITIAL FILING AND APPROVAL OF PETITIONS AND APPLICATIONS. AT THE DISCRETION OF THE IMMIGRATION AND NATURALIZATION SERVICE ORIGINAL DOCUMENTS MAY STILL BE REQUIRED IN INDIVIDUAL CASES. IN ADDITION, WHENEVER A PERSONAL INTERVIEW IS REQUIRED, ORIGINAL DOCUMENTS WILL BE PRESENTED FOR REVIEW AND COMPARISON AND RETURNED TO THE APPLICANT OR PETITIONER AT THE TIME OF THE INTERVIEW. INSTRUCTIONS ON ALL FORMS WILL BE AMENDED AND CONFORMING REGULATIONS. AS OF NOVEMBER 19, 1990, VERIFICATION OF PERMANENT RESIDENCE AND CITIZENSHIP BY IMMIGRATION AND NATURALIZATION SERVICE OFFICERS WILL NO LONGER BE REQUIRED. APPLICATIONS NORMALLY VERIFIED BY SERVICE OFFICERS WILL BE MAILED DIRECTLY TO THE APPROPRIATE REGIONAL SERVICE CENTER HAVING JURISDICTION OVER THE APPLICATION WITH THE PHOTOCOPY OF THE ALTEN REGISTRATION CARD OR NATURALIZATION CERTIFICATE AND COPIES OF ALL SUPPORTING DOCUMENTS REQUIRED IN THE APPLICATION. \"SPECIAL NOTE\" UNTIL SUCH TIME AS FORMS AND INSTRUCTIONS ARE AMENDED, PETITIONERS AND APPLICANTS SHOULD BE ADVISED TO SUBMIT A SIGNED STATEMENT WHICH READS: \"COPIES OF DOCUMENTS SUBMITTED ARE EXACT PHOTOCOPIES OF UNALTERED ORIGINAL DOCUMENTS AND I UNDERSTAND THAT I MAY BE REQUIRED TO SUBMIT ORIGINAL DOCUMENTS TO AN IMMIGRATION OR CONSULAR OFFICIAL AT A LATER DATE. THE WESTERN SERVICE CENTER ACCEPTS ONLY APPLICATTONS/PETITIONS SUBMITTED BY MAIL. PLEASE SUBMIT THE NECESSARY DOCUMENTS TO THE APPROPRIATE ADDRESS BELOW: DIRECT MAIL Begawa fraus U.S. Immigration and Naturalization Service Western Service Center P.O. Box 30111 4-18-91 Laguna Niguel, CA 92677-8111 I-130 Application fee is $40.00 payable by personal checks or money orders"
}
