{
	"anumber": "A70027789",
	"id": "A70027789_0013",
	"page_index": 13,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70027789_0013/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICADO, 0023226, T.R. 0038852"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/15/2023 No 0023226 SECURITY DE EL SIGNATURE / CORTE DE GUENTAS CUARENTA CENTAVOS T.R. 0038852 E1 infrascrito Jefe del Registro Civil de ésta ciudad.- 1 CERTIFICA: que a la página número cuatro del libro de Parti- 2 das de Matrimonios, que ésta oficina llevó durante el año de mil 3 5 novecientos treinta y seis,se encuentra la Partida que literalmen- 4 te dice: P. No. 3. - -En la Alcaldía Municipal: Juayúa, a las nue 5 ve horas del día veinte y siete de Enero de mil novecientos trein- 6 ta y seis.-En esta oficina, a las quince horas del día veinticin- 7 CO del corriente mes, ante el suscrito Alcalde y Secretario que - 8 autoriza, contrajeron Matrimonio Civil los Señores CARLOS HIDALGO 9 VALENCIA con la senorita MARIA ORBELINA REGALADO, el primero sol- 10 tero, Tipógrafo, de veinte y tres años de edad, hijo natural de - 11 Francisca Valencia, originario de San Salvador y la segunda de -- 12 veintidos años de edad, Tenedor de Libros, soltera, hija natural 13 de Teresa Regalado ambos de éste domicilio. - -E1 acto se verificó - 14 ante los testigos Señores don Daniel Cea de cincuenta y seis años 15 y don Humberto Aguirre de treinta años, ambos Tenedores de Libros 16 hábiles para testificar y ambos de este domicilio. -Vicente A. Ma- 17 18 gaña/C.Estrada M. Srio. RUBRICADAS.- ES CONFORME, con su original con el cual se confronto. Y 19 20 para los efectos de Ley, extiende la presente en la Sección del - Registro Civil de la Alcaldía Municipal y Jefatura del Distrito:- 21 Juayúa, a los siete días del mes de febrero de mil novecientos se- 22 tenta y tres. -Enmendado= se= Vale.- 23 24 Remberto Ramirez JEFE DEL REGISTRO CIVIL.- 25 JEFFREY Jeffer 43-9 for"
}
