{
	"anumber": "A70022932",
	"id": "A70022932_0005",
	"page_index": 5,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70022932_0005/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Permanent Residence, I-485 ( (Rev. 06-23-86) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 U.S. Department of Justice OMB # 1115-0053 Immigration and Naturalization Service (INS, Application for Permanel Residence DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp PROVED Fee Stamp DEFEST DIRECTOR A# G-28 or Volag# JUL 31 1990 Section of Law Eligibility Under Sec. 245 by Sec. 209(b), INA Approved Visa Petition Sec. 214(d), INA LOS 2745 Dependent of Principal Alien Sec. 13, Act of 9/11/57 Special Immigrant Sec. 245, INA Other 130485 10 100.00 Sec. 249, INA Country Chargeable Preference EMPI 00 03/26/90 A. Reason for this application 100022228324*09:27 I am applying for lawful permanent residence for the following reason: (check the box that applies) 1. An immigrant visa number is immediately available to me because A visa petition has already been approved for me (approval notice is attached) KX A visa petition is being filed with this application 2. I entered as the fiance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are attached) 3. I am an asylee eligible for adjustment 4. Other: B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? NOLASCO Vda. SANCHEZ, ISABEL 01-25-90 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 3538 Percy St , Los Angeles, California (Town or City) (State/Country) (ZIP/Postal Code) 13. What means of travel did you use? (Plane, car, etc.) Los Angeles, California 20023 Plane 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? San Salvador, E1 Salvador Yes No 4. Date of Birth 5 Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) Male Married Single (Visitor, student, exchange alien, crewman, temporary worker, without inspection, etc.) 06-17-12 Female Widowed Divorced Visitor B2/ 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure none A70-022-932 Record (Form I-94). 9. Country of Citizenship Isabel Nolasco de Sanehez EL SALVADOR 17. Arrival/Departure Record (I-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? Yes No 7 6 2 001082 (If Yes, give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date (Mo/Day/Yr) San Salvador, E1 Salvador 10-4-85 20. Have you ever been married before? XX Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) Enedino Sanchez E1 Salvador 10-09-79 21. Has your husband/wife ever been married before? Yes No N/A. If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-485 (Rev. 06-23-86) Y"
}
