{
  "anumber": "A70091406",
  "id": "A70091406_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70091406_0021/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1914,
        2023,
        1991
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['n.a']"
      },
      "reason": {
        "reason_llm_v1": "NATURALIZATION"
      },
      "nationality": {
        "nationality_llm_v1": "Taiwan, R.O.C"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 U.S. Department of Justice FORM G-325A OMB No. 1115-0066 Immigration and Naturalization Service BIOGRAPHIC INFORMATION (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY FILE NUMBER CHI Ju-chun FEMALE 3-25-1914 Taiwan,R.OC A 70091406 ALL OTHER NAMES USED (Including names by previous marriages) 1991007056 CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE FATHER Lee R.S. Roug ise MOTHER(Maiden name) Tae Tz HUSBAND (If none, so state) FAMILY NAME OR FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH (For wife, give maiden name) DATE OF MARRIAGE PLACE OF MARRIAGE WIFE china Husband chi shih-chi changLittsien, Hopei Aug.11'34 Hope, Khina FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE none APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 9422 Julie Beth st. Cypress CA U.S.A Dec 90 PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR #20-5, Alleys 4, Love 341 chungchingRd Taipei Taiwan R.O.C. Apr. 89 Dec. 90 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION SPECIFY) MONTH YEAR MONTH YEAR w/a PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT DATE NATURALIZATION STATUS AS PERMANENT RESIDENT JCC OTHER (SPECIFY): Dec.27 190 IF YOUR NATIVE ALPHABET is IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes Tha 621 10-7-91 PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) CHI TII-CHUN A70 091 406 (OTHER AGENCY USE) INS USE (Office of Origin) Consul lease check I'c ISOFFICE:CODE Part IV, App. D. N. S., Section 8. f PeatÉred, reply to U. S. Dept. If Justice, Imm. & Natz. Service. EOS B2 LIC 6 245 5) mbol SEP 29 1991 le Visa issued 04-24-89 (DATE) Form G-325 A (Rev. 10-1-82) (4) Consul CHI,JU CHUN Taipin(C) mbassy onsulate Hong Kong"
}