{
  "anumber": "A70108430",
  "id": "A70108430_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70108430_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 FY92 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A70 108 430 Status as a lawful permanent resident of the United States is accorded: NA Name Sex 1 Male Date of Birth (Month/Day/Year) In Care Of Maria Portana CASILDO 2 Female 10-14-15 Street 426 W. 105th St City of Birth Country of Birth Address Los Angeles, Ca 90003 Plaplaya Honduras Apt. No. Country of Nationality Country of Last Residence City, State, Zip Honduras Honduras Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present Widowed 4 Divorced 5 Separated HOU B-2 NI Class (whichever most recent) 90 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) NA NA NA Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable Juana Catarino Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification Tegucigalpa 105447 1-5-90 of Last NIV B-2 Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I& N Act Sec. 214 (d) of the I & N Act MAR 30 1992 LOS As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE IRO# 3 Class of admission (Insert Symhol) REMARKS RECOMMENDED BY: (Immigration Officer) (Date) DISTRICT DARE DATE OF ACTION MAR 307 1992 MAR 30 1992 DD ad/3-30-92/ 3-25-92sh FOR USE BY VISA CONTROL OFFICE DISTRICT LOS 4338 Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I- 181 (Rev.3-1-83) N 1 FILE COPY"
}