{
	"anumber": "A70108430",
	"id": "A70108430_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70108430_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 1992, 2023, 1991, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 FOIA (b)(6) U.S. Department of Justice (INS) Petition for Alien Relative CMB No. 1115-0054 DO NO WRITE II. THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp allow A# APPROVED G-28 or Volag # IN.S DISTRICT DARECTOR Wac 91-123-01134 3-25 Section of Law: 201 (b) spouse 203 (a)(1) MAR 30 1992 Petition was filed on 26 PeB 9, (priority date) x 201 (b) child (a)(2) Personal Interview Previously Forwarded 201 (b) parent 203 3 (a)(4) Pet Ben. \"A\" File Reviewed Stateside Criteria 0117 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: Tequagalpa 4538 204 (a)(2)(A) Resolved 204 (h) Resolved REMARKS: A. Relationship 1. The alien relative is my: MOTHER 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) CASILDO MARIA PORTANA 2 Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) FOIA (b)(6) *MAILING ADDRESS 426 W. 105th St. (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOIA (b)(6) LOS ANGELES CA/USA 90003 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) FOIA (b)(6) Plaplaya, Gracias a Dios Dept. Honduras A. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) FOIA (t) FOIA Male Married FOIA Single (Mo/Day/Year) Male Married Single FOIA (b)(6) Female Widowed Divorced 10/14/1915 Female Widowed Divorced 7. Other Names Used (including maiden name) Other Names Used (including maiden name) FOIA (b)(6) NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) FOIA )(6) N/A 9. Social Security number 10. Alien Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA )(6) FOIA (b)(6) None N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? Yes No FOIA (b)(6) 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) Visitor Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) February 23, 1990 Date authorized stay expired, or will expire as shown on Form I-94 or I-95 August 1990 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident alien, complete the following: Date and place of admission for, or adjustment to, lawful permanent residence, N/A and class of admission: 16. Has your relative ever been under immigration proceedings? Yes No Where When 14b. Did you gain permanent resident status through marriage to a United States citizen or lawful permanent resident? Yes No Exclusion Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED JUN 26 1991 Rec'd Sent Approved Denied Returned FEB 26 1991 Form I-130 (Rev. 02-28-87) N CH JUL 16 1991L4"
}
