{
	"anumber": "A70108430",
	"id": "A70108430_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70108430_0023/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificación, 3203634"
		},
		"years": {
			"ms_years_nlp_v1": [1980, 2023, 1917, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 of COPY trus me by seen 3832 Service Center gional California PRIMERA CLASS CINCUENTA CENTAVOS CERTIFICACION 1980-1983 No 3203634 El Infrascrito secretario municipal y encargado del registro civil del Pueblo de Iriona Dpto. de Colon CERTIFICA: Que a fo- lio- 64-Del Libro de Registro que corresponde al año de mil-915 a 1917, se encuentra la partida de nacimientos que DICE: MARIA PORTANA CASTLD O).- En El Pueblo de Iriona a los diesiocho dias del mes de octubre de mil novecientros quince.- Ante mi Ramon Madrid Secretario Mcpl. y ante los testigos Do Victoriano Velas- quez y don Luciano Alvarez ,mayores de edadc solteros y de este vesindario, se presento; Don A. D . Velasquez, tambien mayor de edad y de este domicilio, manifestando. - Que el dia jueves cato- rce del presente , como a las tres de la tarde en la Aldea de Pla- playa.nacio'una niña aquien se dio por nombre (Maria Portana Casil- OPERAT do .-h. 1. de Catarino Casildo y Juana F. Martinez de Casildo.- Sus abuelos paternos Abrahan Casildo y Leocadia Fuentes y maternos Victoriano Martinez y Paula Ortiz de Martinez.- - Lei lo escrito al denunciante y encontrandolo comforme con su innanifestacio firmo' conmigo to testigos.- - A. D. Velasquez.- Victoriano Velasquez. -Ra- 1S mon Madrid.- - Srio. Extendida a solicitud por parte interesada en Iriona a los veintissis dias del mes de marso de mil novecientos Tuborerfood nta y tres. 21 BLANCA O. MARTIMEZ SRI MCPL. Monday, Hernanting TOMAS C. MATINEZ ALDE.Mcpl. Colon. Hondare"
}
