{
  "anumber": "A70370800",
  "id": "A70370800_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70370800_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, FOIA (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 U.S. Department of Justice Immigration and Naturalization Service AMERICAN EMBASSY NAIROBI AMERICAN EMBASSY BOX 21 P. O. BOX 30137 APO NY 09675 NAIROBI, KENYA A# 70370800 NAME: MOHAMED HADJI DATE DEC IV 1992 ADDRESS: FOIA (b)(6) Dear Applicant: The U.S. Immigration and Naturalization Service (INS) has determined that you are eligible for resettlement in the United States as a refugee under Section 207 of the U.S. Immigration and Nationality Act. Now that INS has approved your eligibility, you will need a medical examination. Chest x-rays will also be required. Please contact the International Organization for Migration, International House, 3rd Floor, Nairobi, for your medical appointment Office hours are from 8 A.M - 12 P.M Monday through Friday. The exam nation will be free of charge. The results of the medical examination will be sent directly to this office. Arrangements will be made for you to have seven photos taken, four should be given to the medical doctor and the remaining three turned in to J.V.A for inclusion in your travel documents. When all admission requirements are completed, and this office has received authority to do so, travel to the United States will be arranged for you. Your name will then appear on a travel list posted at the J.V.A office. You should then report to I.O.M for final exit clearances on the date indicated on the travel list. You must also report for Cultural Orientation Classes on the scheduled dates. These dates are posted at J.V.A and O.M. Sincerely, 15.DEC 1992 \"Report to 1.0.M on Officer 10/92 NRB FOIA (b)(6)"
}