{
  "anumber": "A70370800",
  "id": "A70370800_0092",
  "page_index": 92,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70370800_0092/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TO WHOM IT MAY CONCER, 25th September 1992"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 DR. J. K. M. KAHIUKI, M.R. Ch M Med (SURGERY) ARGWINGS-KODHEK ROAD Telephone: 720726. 722160 Residence: 17426 P.O Box 57874. NAIDORI, KENYA 25th September 1992 TO WHOM IT MAY CONCERN RE: HAJI MOHAMMED - 82 MEDICAL REPORT The above named patient was first seen in my office on the 7th August 1992. 110 had been referred to me by Dr Meyerhold. His presenting complaints were those of a mass in the right upper abdomen. The mass had been going on for many years. \"Many\" years ago' he had had it aspirated and it had not bothered him until recently. He presented with a C.T. scan which showed a huge cyst in the liver. This was palpable clinically. His problem therefore was a large simple cyst in the liver that was causing pressure symptoms. After a long discussion it was agreed that the cyst be aspirated to reduce the pressure symptoms. On the 10th of August 1992 he was taken to the emergency room theatre and 700 ml of clear fluid aspirated from the liver cyst. He had a dramatic improvement in his symptoms. After about 48 hours he presented to my office with further complaints of discomfort. At. this stage he was advised to have the cyst drained through laparotomy. He was taken to the operating room on 17th August 1992 and under general endotracheal annesthesia, a transverse laparotomy was carried out. There was a huge cyst in the inferior aspect of the liver which was half full because of the previous drainage. This was excised in its entirety. At the same time he was found to have a gall bladder full of stones. Since some of his symptoms may have been due to cholelithiasis, his gall bladder was removed. He had a good immediate post operative recovery and requested to be discharged on the 3rd day after surgery. On 22nd August 1992, the day before his stitches were to be removed, he came into Nairobi Hospital with a dehisced abdomen. He was taken to the operating room and the abdomen closed again. There had been a break in the No. 1 nylon that had been used to close his abdomen the first time. After that he has had a very good progress and his complaints have been mainly those of old age i.e lack of sleep and generalised aches here and there. 1 have tried to reassure him and his family that nothing else appears to be wrong in the abdomen but he still has an apprehension that something might be wrong. This is because of the induration under the scar. This will go off in a matter of weeks and should not cause any alarm. Hoping this information suffices. Johnk Karrishi Mr John K.N. KariuRT, Med (SURGERY)"
}