{
  "anumber": "A70396768",
  "id": "A70396768_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70396768_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place SPM File No. 70 396 768 Status as a lawful permanent resident of the United States is accorded: 810249120 03 Sex 1 Name Male Date of Birth (Month/Day/Year) Osman Abdi SAED In Care Of 2 Female 01 01 95 Street #E1208 City of Birth Country of Birth Address 1515 S. 4th St. #F411 Mogadishu Somalia Apt. No. Minneapolis, MN 55454 Country of Nationality Country of Last Residence City, State, Zip Somalia Somalia Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present 3 Widowed 4 Divorced 5 Separated UNR RE NI Class (whichever most recent) 1993 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable unknown unknown Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification of Last NIV Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I & N Act Sec. 214 (d) of the I & N Act 12 15 93 SPM As of at (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE RE6 Class of admission (Insert Symbol) REMARKS APPROVED RECOMMENDED BY: (Immigration Officer) (Date) I.N.S DISTRICT DIRECTOR DATE OF ACTION APR 11 1995 DD Recommended have Park DISTRICT SPM 6675 FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I- 181 (Rev.3-1-83) N 1. FILE COPY"
}