{
	"anumber": "A70395460",
	"id": "A70395460_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70395460_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 5/12/2023 1-17 (Rev. 7-10-91) U.S. Department of Justice Federal Bureau of Investigation FEB 2 7 1995 Washington, D.C. 20537-9700 The fingerprints appearing on the attached fingerprint card(s) are not adequate for accurate classification and/ or identification purposes and cannot be retained in the Identification Division's files. The reason(s) for return are set out below and indicated on the back of the fingerprint card(s). (1) Fingerprint pattern(s) not discernible. (2) Insufficient pattern area(s) recorded for classification/identification purposes. If bent, deformed or paralyzed use a spoon. (3) Erroneous or incomplete fingerprint(s) on card(s): fingers or hands out of sequence; printed twice; or missing with no reason given. (4) Abnormal electronic image(s) recorded. (5) Not permanent fingerprint ink. (6) Not acceptable card stock. Due to the volume of fingerprints contained in the FBI fingerprint files, and the use of super breakups and extensions in the classification system, it is necessary to determine the correct pattern types, as well as ridge counts and tracings of all ten fingers, in order to search these files and, when appropriate, retain the fingerprints for record purposes. It is requested that the individual(s) be reprinted and fully and clearly recorded fingerprint card(s) be forwarded to the FBI. When submitting reprints, it is not necessary to return the original fingerprint card(s), as only one copy of each individual(s) fingerprints is necessary for retention in the Identification Division's files. Note: Unclassifiable fingerprint cards submitted in connection with licensing or employment for which you are paying a fee must be returned with your resubmission of prints in order to receive credit for your original payment. For your information, a name check only was made on the enclosed fingerprints with negative results. Thank you for your cooperation in this matter. Identification Division FBI Please Note Instructions on Reverse Side. FBI/DOJ"
}
