{
	"anumber": "A70396768",
	"id": "A70396768_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70396768_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REGISTRATION FOR CLASSIFICATION AS REFUGEE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya", "United States", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [1895, 1992, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 REGISTRATION Form Approved Budget Bureau No. 43-20408 FOR CLASSIFICATION AS REFUGEE UNITED STATES DEPARTMENT OF JUSTICE Section 207 IMMIGRATION AND NATURALIZATION SERVICE File No. Immigration and Nationality Act A 70 396 788 REGISTRANT TO FURNISH THE FOLLOWING INFORMATION (READ INSTRUCTIONS ON REVERSE) TYPE OR PRINT 1. My name 101 First Middle Last osman Abdi Saed 2. My present address 18: Refuse Camp \"Utange \" Mombasa Kenga 3. I was born oni (month)(day)(year) Place of birth (city or town) (Province) (Country) My present nationality las 111/1895 AF MADOW KISMAYO SOMAha So mal 4. Height Weight Eyes Half 1.70m Back Complexion 60Kg Black Marks or Scare Black Nil White 5. I lied or was displaced from (Name of country) Somalia On or about (month) (day) (year) 1992 6. Reasons: (State In detail) because of the Somale cevel war 7. My present Immigration status In Kenya (Country in which residing) lot Asylum - -Seeker The evidence of my Immigration status In the country In which I am residing is: refugee in MARRIED (Describe) Manage Auto MUSIA- Camp Deceased momba D Sexain B. My spouse's name la: 9. (Hie) (Her) present address 10, 10. Spouse's nationality las 11. My spouse will will not accompany me to the United States 17. Name of child (ren) Date of birth Place of birth Present address be Malamed DSm.Ab 1024 m Miradis deceased 3c 2- 5- FOIA (b)(6) 4- Place a mark (x) In front of name of each child who will accompany you to the United States 13. Schooling or Education Name and location of school Type Dates attended Title of Degree or Diploma NONE Merchant 14. Military Service Country Branch and Dates Serial No. Rank Attained Organisation Form I-590 (Rev. 5-1-80) N"
}
