{
	"anumber": "A70370800",
	"id": "A70370800_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70370800_0026/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, NSN 7540-00-139-0058"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1992, 2023, 1988]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 70 370 800 PLACE MEDICAL EXAMINATION OF APPLICANTS BRUCE HOUSE FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) December 19 1992 CITY COUNTRY At the request of the American Consul at NAIROBI KENYA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F I certify that on the above date I examined AHMED MOHAMED HADJI M 1907 WHO BEARS PASSPORT NO. ISSUED BY ON GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Gonorrhea Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Insanity Mental Defect More Attacks of Insanity IBILATERAL CATARACT DEFICIENT Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism HEARING3 BRONCHIECTASI) EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm There are mottled opacities in the left lower zone. Not Done There may be underlying bronchiectasis. There is opacification in the right lower zone suggestive of DOCTOR'S NAME (Please print) P.T.O. DOCTOR'S NAME (Please print) DATE READ THE NAIROBI HOSPITAL DATE READ 16 DEC 92 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: HIV ANTIBODY SCREENING DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY DR. ZIMMERMAN 19 DEC 92 DR. ZIMMERMAN 19 DEC 92 OTHER SPECIAL REPORT(S) (When needed) Urine routine: Protein - nil, Glucose - nil Stool routine: Negative DR. C. S. SHETH DOCTOR'S NAME (Please print) REMARKS ? Uretric calculus. Surgical scar + CLASS B: 1. Bilateral cataract. Needs Ophthalmic evaluation 2. Bilateral deficient hearing P.T.O. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. 19 THUMB 15 DEC 1992 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. C. S. SHETH 50157-103 I 31 DEC 92 NSN 7540-00-139-0058 OPTIONAL FORM 157 REVISED 2-88 U.S.GOVERNMENT PRINTING OFFICE : 1988 o - 213-238 DEPT. OF STATE"
}
