{
	"anumber": "A70396768",
	"id": "A70396768_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70396768_0017/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXAMINATION OF APPLICANTS OR UNITED STATES VISAS, OPTIONAL FORM 157"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya"]
		},
		"years": {
			"ms_years_nlp_v1": [1895, 1938, 1992, 1993, 2023, 1933]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/20/2023 PLACE L EXAMINATION OF APPLICANTS MOMBASA HOSPITAL OR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 18 MAY 1993 CITY COUNTRY e American Consul at NAIROBI KENYA 396 NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX OSMAN ABDI SAED (Mo., Day, Yr.) I certify that on the above date I examined F M JAN 1 1895 WHO BEARS PASSPORT NO. ISSUED BY ON A70 396 768 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Gonorrhea Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma ingulnale Human Immunodeficiency Hansen's Disease, Not Infectious Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Insanity Mental Defect see Remarks More Attacks of Insanity Sexual Deviation Narcotic Drug Addiction Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm BLUNTING OF COSTOPHRENIC ANGLES, MINIMAL EARLY Not Done TENTING, LEFT OUTER HEMIDIAPHRAGM DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ Staff radiologist MOMBASA HOSPITAL 18 MAY 1933 DATE READ SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally rellable test) Nonreactive Negative Not Done Not Done TEST TYPE: TEST TYPE: DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Mombasa Hospital 19 MAY 1933 Mombasa Hospital 19 MAY 1938 OTHER SPECIAL REPORT (S) (When needed) DOCTOR'S NAME (Please print) REMARKS Class B2 TUBERUCULOSIS, NOT CLINICALLY ACTIVE, SPUTUM SMEARS NOT REQUIRED. CLASS B. HISTORY OF RIGHT HIP JOINT DISLOCATION, WALKS WITH CRUTCHES CLASS B. GORSS VISUAL IMPAIRMENT LEFT EYE; RIGHT EYE POST ENUCLEATION(post trauma) QUARANTINESPHS STATION APPLICANT CERTIFICATION DEC 1 5 1993 I certify that I understand the purpose of the medical examination and Dauthorize the required tests to be completed. The information on this form refers to me. NEW YORK, N.Y. #15 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE Dr. N. MOTUS mentions IOM MEDICAL OFFICER 20 MAY 1993 NSN 7540-00-139-0058 50157-103 OPTIONAL FORM 157 REVISED 2-88 U.S. GOVERNMENT PRINTING OFFICE : 1992 0 - 316-148 DEPT. OF STATE"
}
