{
  "anumber": "A70370800",
  "id": "A70370800_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70370800_0075/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF RELATIONSHIP"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023,
        1944
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 MINGTON STATES 915 S. WAKEFIELD STREET Aul DIOCESE OF ARLINGTON VA 22204 AFFIDA VIT OF RELATIONSHIP CONFERENCE Date filed: 09/02/92 SECTION 1 I em filing this Affidavit for the following person (s) Date of arrival in located in MOMEASA KENYA that country: 08/32 (Country of asy lum overseas) NAME AND A/K/A SEX PLACE/DATE OF BIRTH RELATION PRESENT LOCATION (underline family name) TO YOU OR ADDRESS AHMED ASAD M SOMALIA /1944 BROTHER Keuya AHMED HASSAN M SOMALIA/ 1944 1 BROTHER Kenya FOIA (b)(6) FOIA (b)(6) The case number for this family is (if available) : SECTION II Your name FOIA (b)(6) Alien Number (if applicable) FOIA (b)(6) (and A/K/A) FOIA (b)(6) Your U.S. Immigration Status (Check one) : Date of birth FOIA (b)(6) Sex ( ) U.S. Citizen Certificate # Place of birth ITnclude Country) Permanent Resident FOIA (b)(6) ( ) Refugee ( ) Asylee Current address # FOIA (b)(6) ) Other (Please Explain) : Your Original Case Number: FOIA (b)(6) Phone Number (home) Country of first asylum (work) Date you arrived in the U.S Your Social Security Number Agency through which you came to the United States N/A I have filed an I-I30 (Immigrant Visa Petition) for each of my relative (s) prior to submitting this affidavit Yes No. If yes, date submitted: and date approved: YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR 1-94 OR YOUR PERMANENT RESIDENT ALIEN CARD (1-151, 1-551, GREEN CARD). WITHOUT THESE DOCUMENTS, YOUR AFFIDAVIT IS NOT VALID. The purpose of this Affidavit is to verify your relationship to refugees overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the U.S. If the information is unknown to you, indicate \"unknown\". If anyone uses an alias, provide it. If anyone is deceased or their present location is unknown, please indicate. Besure to include all relatives as specified, anywhere in the world, living, deceased or missing. Use the space marked \"Additons/Explanations\" to explain any unusual relationships including adopted, half, or step relatives. (Revised 10/86) FOIA (b)(6) Tum Signature of Notary Public My commission expires 10/08/1994"
}