{
  "anumber": "A70917977",
  "id": "A70917977_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70917977_0001/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( Rev. 10/01/89"
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "IRO Screened by NARA, 7/25/2023 U.S. Department of Justice H-b OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONI y Case ID# Action Stamp A# 70917977 I.N.S 0 03/04/94 WAC-94-099-51051 WACMXC01 G-28 or Volag MAR 31 1994 Section of Law: Petition was filed on: MAT.3,1994 (priority date) 201 (b) spouse 203 (a)(1) Recommended Personal Interview 201 (b) child Previously Forwarded 203 (a)(2) 201 (b) parent WAC 3902 203 (a)(4) Pet. Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: 201 (b) (2) (A) A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) NAVARRO ROSA FELIPA 2. Address (Number and Street) (Apartment Number) 1556 LAKESHORE AVE. (Town or City) (State/Country) (ZIP/Postal Code) LOS ANGELES, CALIFORNIA 90026 3. Place of Birth (Town or City) (State/Country) POTOSI NICARAGUA 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 05-26-14 Female Widowed Divorced 7. Other Names Used (including maiden name) ROSA FELIPA NAVARRO JIMENEZ 8. Date and Place of Present Marriage (if married) UNK 9. Social Security Number 10. Alien Registration Number (if any) N/A N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A N/A 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) VISITOR Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) 962 65953803 12-29-93 Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 06-28-94 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) N/A 16. Has you relative ever been under immigration proceedings? Yes No Where When Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED FEB 24 1994 Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y 3-31-94"
}