{
	"anumber": "A70917977",
	"id": "A70917977_0006",
	"page_index": 6,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70917977_0006/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE WESTERN SERVICE CENTER, FORM NO: I-130"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/25/2023 J.S. DEPARTMENT OF JUSTICE IMMIGRATION and NATURALIZATION SERVICE WESTERN SERVICE CENTER P.O. BOX 30111 LAGUNA NIGUEL, CA 32607-0111 NAME & ADDRESS OF APPLICANT/PETITIONER DATE: 2.25.94 FILE NO: WAC-94-099-5105 FORM NO: I-130 This is an initial screening. It may be necessary to _return the application (s) / petition (s) for additional information of documentation. Your application(s)/petition (s) is/are being returned to you for the following reason: 1. Please submit check or money order made payable to INS. 2. Post dated check or money order is not acceptable. I. Stale dated check or money order is not acceptable. 4. Please submit check or money order payable through a Unite States bank. 5. Please submit check or money order in. English. 6. Please submit check or money order with corrected written guarantee amount. 7. X Unsigned check or money order is not acceptable. 8. The service does not accept altered money order or:chack. Please submit correct payment. 9. is have been informed that \"General Money Orders\" or. \"PAN American are no longer negotiable. Please resubmit with proper fee. 10. Please complete the omitted items checked in red. 11. The fee for your application(s)/petition(s) has been received and processed. Your check or money order in the amount of $ is returned. 12. Please resubmit the application(s)/petition(s) with the correct fee. The total fee for the application (s)/petition (s) is/are $ . 13. x Other the many Order is not dated. IMPORTANT NOTICE Please put this notice on top of the application (s) /petition (s) and return with correction(s) to the above address."
}
