{
  "anumber": "A70917977",
  "id": "A70917977_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A70917977_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ACTION, I130"
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 RECEIPT NUMBER NOTICE DATE NOTICE OF ACTION PAGE WAC-94-099-51051 February 25, 1994 1 of 1 CASE TYPE RECEIPT DATE I130 IMMIGRANT PETITION FOR RELATIVE, FIANCE (E), OR ORPHAN FOIA (b)(6) FILE NUMBER FOIA (b)(6) BENEFICIARY FILE NUMBER NAVARRO, ROSA FELIPA FOIA (b)(6) Rejection Notice The above application or petition, along with any check or other form of fee payment, is attached. The application or petition cannot be accepted because: the application or petition form has not been properly signed; and the check or other form of payment is not signed. ersdated Since the case is not properly filed, a priority or processing date cannot be assigned. The applicant or petitioner must sign the application or petition form in the appropriate place. Any preparer must also sign in the appropriate place. After the application or petition form is properly signed, and the check or other form of payment has also been signed, please resubmit this entire package to the address listed below. To speed processing, please leave this notice on top. Enclosures NoTs: Sending 03-01-94 Correct Money orders Thank you You will be notified separately about other applications or petitions you filed. Please save this notice for your records. Please enclose a copy of it if you have to write to us about this case, or if you file another application based on this decision. If you have any questions concerning your case, please call us at: Our address is: IMMIGRATION & NATURALIZATION SERVICE WESTERN SERVICE CENTER P. O. BOX 30111 LAGUNA NIGUEL CA 92607-0111 Tel: (714) 643-4880 Form I797C (93) Please see additional information on the back."
}