{
	"anumber": "A71666754",
	"id": "A71666754_0059",
	"page_index": 59,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0059/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF RELATIONSHIP, FOIA ( (b)(6)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Ethiopia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1991, 1990, 2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA 07/26/2023 STATES 04 MAY 1995 present case size 16 AFFIDAVIT OF RELATIONSHIP # 42. 17PAX DATE RECEIVED 6/10/94 DIOCESE OF: Atlanta CONFERENCE NAT so N-2 DATE FILED: March 30,1990 27 APR 1995 DUP. LIST LASH DEPT. RECORD N/A # 43 - 7 PAY SECTION 1: am filing this Affidavit for the following persons(s) FAX NEEDED [ located in ETHIOPIA Date of arrival in that cou # MAY 1991 (Country of asylum overseas) are Npresent 44 45 8 PAY PAX NAME AND A.K.A SEX PLACE/DATE OF BIRTH RELATION TO YO ODRESS/ ATION 2 FOIA (b)(6) SECTION II: Notreex Your name FOIA (b)(6 Alien Number (if applicable) FOIA (b)(6) (and A.K.A) Date of birth Your U.S. Immigration Status Place of birth FOIA (b)(6) (Check one) (Include country) ( ) U.S. Citizen: Certificate # Current address_ ( ) Permanent Resident Refugee ( ) Asylee Phone number (Home) FOIA (b)(6) ( ) Other (Please explain) (Work) Country of first asylur Your Original Case Number: Date you arrived in th Social Security Numb Agency through which you came to the United States USCC - ATLANTA. [ have filed an I-130 (Immigrant Visa Petition) for each of my relatives mentioned above prior to submitting this affidavit Yes No. If yes, date submitted: and date approved: YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR I-94 OR YOUR PERMANENT RESIDENT ALIEN CARD (I-151, I-551, GREEN CARD). WITHOUT THESE DOCUMENTS, YOUR AFFIDAVIT IS NOT VALID. The purpose of this Affidavit is to verify your relationship to refugees overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the U.S.. If the information is unknown to you, indicate \"unknown\". If anyone uses an alias, provide it. If anyone is deceased or their present location is unknown, please indicate. Be sure to include all relatives as specified, anywhere in the world, living, deceased or missing. Use the space marked \"Additions/Explanations\" to explain any unusual relationships including adopted, half, or step relatives. C/S verifies."
}
