{
  "anumber": "A71666754",
  "id": "A71666754_0078",
  "page_index": 78,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0078/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/26/2023, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Ethiopia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 refugee relatives of his wife simply because they chose the wrong country to become refugees in. Right now FOIA (b) (6) is working for the FOIA (b)(6) FOIA (b)(6) This job will end in September and FOIA (b)(6) will need to find other employment CADE and Save The Children have expressed interest in having FOIA (b)(6) work for them, but the positions offered would entail working on projects overseas since that is where FOIA (b) (6) has the most experience. FOIA (b)(6) have no relatives here in the U.S. and FOIA (b)(6) is apprehensive about leaving his wife and four young children alone for extended periods of time should he take an overseas assignment. FOIA (b) (6) would not have a problem with working abroad if his wife and children had some other family members to rely on. If FOIA (b)(6) relatives were allowed to come to the U.S. the benefits would be psychological, physical and financial safety for the family. I understand the enormous burdens that are placed on UNHCR to help relieve the suffering of refugees around the world and how this might seem like a trivial almost petty request. If at all possible could an exception be granted in this case and a request be made to the U.S. embassy in Ethiopia to see what could be done to process this Somali family as refugees and help bring them to the United States. I realize how busy your organization is and I would be very grateful if you could find the time to advise me on the proper course of action. I have included a copy of the AOR filed by FOIA (b) (6) for her family and a copy of FOIA (b)(6) resume with references that could be contacted to verify his work history and commitment to refugees. I do this not to seek employment for FOIA (b) (6) but to illustrate the irony of someone who has worked so hard for refugees only to become one himself unable to help those who are closest to his family. My direct telephone line is 404/885-7243 and my fax # is 404/888- 7816. Please try and contact me or FOIA (b)(6) FOIA (b)(6) His home phone # is FOIA (b)(6) and his work number is FOIA (b)(6) His address is FOIA (b)(6) Thank you for your consideration. Sincerely, CATHOLIC SOCIAL SERVICES, INC Bot Karad Bob Kamack, Case Manager Migration and Refugee Services Enclosures (3) AOR, Resume, Rudy Ramp letter"
}