{
  "anumber": "A71668532",
  "id": "A71668532_0052",
  "page_index": 52,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71668532_0052/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form N-659, Naturalization Interview Document Checklist, Department of Homeland Security U.S. Citizenship and Immigration Services"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/18/2023 Department of Homeland Security Form N-659, Naturalization U.S. Citizenship and Immigration Services Interview Document Check List NOTICE TO NATURALIZATION APPLICANTS. Please bring the original and a photocopy of the applicable items listed below to your naturalization interview. Any document in a foreign language must be accompanied by an English language translation. The translator must certify that he or she is competent to translate and that the translation is accurate. You should be on time for your interview. Late arrival may result in the need to reschedule your interview. Please note that rescheduling can cause significat delays in the processing of your application. Additionally, please wear proper attire to your interview in the event that you are able to take the oath of allegiance the same day as your interview. DOCUMENT CHECKLIST. 1. You must bring: Your Permanent Resident Card (previously known as \"Alien Registration Card\" or \"Green Card\"); and Government ussied photo identification; and All passports and travel documents issued to you by any government. Although not required, it is recommended that you bring two additional passport-style photos (2\"x2\"). The photos must be in color with full face, frontal view on a white to off-white background. Head height should measure 1\" to 1 3/8\" from top of hair to bottom of chin, and eye height is between 1 1/8\" to 1 3/8\" from bottom of photo. For additional specification, refer to <http://travel.state.gov/passport/pptphotos/index.html>. 2. If your current name is different than the name on your Permanent Resident Card, bring: The document that legally changed your name (e.g., marriage license, divorce decree, court document). 3. If you are applying for naturalization on the basis of marriage to a U.S. citizen, bring: Proof that your spouse has been a U.S. citizen for at least the past three years (birth certificate, naturalization certificated, certificate of citizenship, your spouse's valid U.S. passport, or Form FS240, Report of Birth Abroad of a Citizen of the United States of America); and Your current marriage certificate registered by a civil authority; and Proof of termination of all of your spouse's prior marriages (e.g., divorce decree, death certificate, etc. as registered by a civil authority); and An original Internal Revenue Service (IRS) Form 1722 listing tax information for the past three years (call IRS toll-free at 1-800-829-1040), or copies of the income tax forms you filed for the past three years; and Proof of marital union as well as proof of residence; and Certified copies of birth certificates for all your children born in the United States. 4. If you were previously married, bring: Proof of termination of all your prior marriages (e.g., divorce decree, death certificate, etc. as registered by a civil authority). 5. If you have ever been in the U.S. military, are applying based on military service (see the Immigration and Nationality Act, section 328 and 329), and have not previously submitted the two forms listed below with your Form N-400, bring: An original Form N-426, Request for Certification of Military or Naval Service; and An original Form G-325B, Biographic Information. 6. If you have taken a trip outside the United States that lasted for six months or more since becoming a Permanent Resident, bring: Evidence you did not abandon your residence or terminate your employment in the U.S nor abandon your U.S. abode; and (Continued on Next Page) Form N-659 (Rev. 11/17/06) N"
}