{
  "anumber": "A71666754",
  "id": "A71666754_0079",
  "page_index": 79,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0079/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Catholic Social Services, Inc., 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Ethiopia",
        "Kenya"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 JL CATHOLIC SOCIAL SERVICES, INC. 8-17-94 Adrianna USCC NewYork BOARD OF DIRECTORS August 5, 1994 replied (212)387-8337 PRESIDENT said talk to Mrs Brown Archbishop John F. Donoghue, D.D. CHAIRMAN she wash D.C. UNHCR (202)387-854 Martha Lee Doyle Mr. Mitiku Ashebir VICE CHAIRMAN Director-Eastern Regional Office MsBrown said write a Walter Denero Migration And Refugee Services letter to UNHCR D.C. SECRETARY 902 Broadway, 8th Floor Stuart A. Cashin, Jr., C.P.A. New York, New York 10010 I replied I have sent / addressed to Lurry Youngk TREASURER James F. Harrington, C.P.A. Dear Mr. Ashebir: letter to UNHCR D.C. with Nathan Andereck If possible could you intervene in the following situation. FOIA (b)(6) no response Judge Charles Auslander FOIA (b)(6); and her husband FOIA (b)(6) are BIC Roland E. Blanding. Jr. Somali clients of ours who arrived a year ago as a free case with no Bot Hand Paula Bonds, Esq. relatives in the U.S. FOIA (b)(6) father, brothers and sister reside in Dennis Crean Ethiopia as refugees. Our office has attempted without success to see Henry deGive, Esq. what can be done to process her family as refugees out of Ethiopia. Lee DeHihns, Esq. The family is currently unwilling to travel to Kenya due to the age and Becky Fratesi health of the father and the dangers of cross border travel. Jerry Lett ReverendHugh Marren FOIA (b)(6) husband, FOIA (b)(6) use to be a projects manager for Sally Ann McNuity CARE and has an extensive background working with refugees. John Murphy FOIA (b)(6) current job with a refugee employment agency will end in Sr. Josephine Patti, G.N.S.H. William M. Rich, Esq. September. His best bet for employment would be with CARE or Sr. Louise Sommer, C.S.J. Save The Children but the assignments would involve working Lorne Twiner overseas for long periods. FOIA (b)(6) is apprehensive about leaving his Danny Vargas wife and four young children alone without blood relatives on which they could rely. EXECUTIVE DIRECTOR Pam Buckmaster I have written to various UNHCR offices but have received no response. After consulting with Mr. Tam he recommended writing you to see if you could advocate for this case. Please let us know what you think and thanks for your consideration. Sincerely, CATHOLIC SOCIAL SERVICES, INC. Bob Kamach Bob Kamack Migration And Refugee Services Enclosures (5): Copy of AOR filed for Ahmed H. Omar 4 Copies of letters sent to UNHCR 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
}