{
	"anumber": "A71668532",
	"id": "A71668532_0066",
	"page_index": 66,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71668532_0066/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, A 71 668 532"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 1993, 2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 A 71 668 532 PLACE MEDICAL EXAMINATION OF APPLICANTS BRUCE HOUSE FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo. Day, Yr.) October 2 1995 CITY COUNTRY At the request of the American Consul at NAIROBI KENYA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) F M I certify that on the above date I examined DOYOW YAREY ALIYOW 1905 WHO BEARS PASSPORT NO. ISSUED BY ON GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Gonorrhea Tuberculosis, Not Active Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Previous Occurrence of One or Mental Defect Insanity IDENTAL (ARIE) 2 HIPERTENSION More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism DORSAL KYPHOSCOLIOSU EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT 4 BILATERAL CATARACTS No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ DR. P. P. SHAH 22 SEPT 95 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: HIV ANTIBODY SCREENING DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY THE NAIROBI HOSPITAL 2 OCT 95 THE NAIROBI HOSPITAL 2 OCT 95 OTHER SPECIAL REPORT(S) (When needed) Urine routine- Protein - nil, Glucose - nil DR. C. S. SHETH Stool routine- Ova of Trichuris trichiura DOCTOR'S NAME (Please print) REMARKSBranding scars - upper chest - posteriorly. Stool - Ova of Trichuris trichiura. Prescribed Zentel CLASS B - 1. Dental Caries + 2. Hypertension. B.P. 160/100. Aorta is grossly unfolded. 3. Dorsal Kyphoscoliosis. P.T.O. APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. R. THUMS - 2 OCT 1995 Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. C. S. SHETH 50157-103 (p) 9 OCT 95 NSN 7540-00-139-0058 OPTIONAL FORM 157 REVISED 2-88 GPO : 1993 o - 349-729 DEPT. OF STATE"
}
