{
  "anumber": "A71689640",
  "id": "A71689640_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71689640_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Form, I-1297"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1995,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "creened by NARA, 7/21/202 Page 2 14. Political, professional or social organizations of which I am now or have been a member or with which I am now or have been affiliated since my 16th birthday (If you have never been a member of any organization, state \"None.\") NONE 15. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date, place and nature of each charge and the final result.) 16. I have have not been in the United States. (If you have ever been in the United States, show the dates of entry and departure and the purpose of your entry (visitor, permanent resident, student, seaman, etc.). File or Alien Registration Number: 17. I have the following close relatives in the United States: Name Relationship Present address Ahmed Dalmar Abdurahman SON 4227 Wi HAW thorne Traced RD 107 Brown Deer, W153209 18. I am being sponsored by Name and address of United States sponsor): Ahmed Dalmar Abdurahman 4227 WI Hawthorne Trace RD 107 Brown Dear W15320Q Date: 12 JUN 1995 Signature of registrant: DolounD DO NOT WRITE BELOW THIS LINE I, do swear (affirm) that I know the contents of this registration subscribed by me including the attached documents, that the same are true to the best of my knowledge, and that corrections numbered to ) were made by me or at my request, and that this registration was signed by me with my full, true name: Dolmo (Complete and true signature of registrant) \"NAIROBI, Kenya Subscribed and sworn to before me by the above-named registrant at on 01 NOV 1995 (month/day/year) (Signature and title of officer) organ I.N.S DISTRICT DIRECTOR 01 NOV 1995 X2 DATE DATE THE OF TIME. IF YOU PERIOD INA FOR AN INDEFINITE OF THE TO SECTION 207 URSUANT UNITED AS A REFUGEE INTERVIEW APPROVED AT \"NAIROBI, Kenya Recommended by: Z RETURN. PERMISSION FROM INS TO U.S. YOU WILL NEED DEPART PRIOR RIT 6615 PLOYMENT AUTHORIZED. BYC Immigration Officer Officer in Charge DATE PASSED COPPS QUAPANTINE (MM/OFF. STATION MAR 27 1996 INSTRUCTIONS a EMAR 27.1996 NYC 2088 This form should be executed, signed and submitted to the Officer in Charge of the nearest overseas office of the United States Immigration and #02 Naturalization Service. When your name has been reached as a registrant you will be furnished additional instructions. NEW YORK, N.Y. Registration A separate Registration Form must be executed by each registrant and submitted in one copy. A Registration Form in behalf of a child under 14 years of age shall be executed by the parent of guardian. shou Public reporting burden for this collection of information is estimated to average 35 minutes per response. If you have comments regarding the accuracy of this estimate or suggestions for simplifying this form, you can write to both the U.S. Department of Justice, Immigration and Naturalization Service Policy Directives and Instructions Branch (HQPDIB), Washington, D.C. 20536 and to the Office of Management and Budget, Paperwork Reduction Project: OMB No. 1115-0057, Washington, D.C. 20503."
}