{
	"anumber": "A71668532",
	"id": "A71668532_0053",
	"page_index": 53,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71668532_0053/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 4/18/2023"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1960]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 4/18/2023 An original IRS 1722 letter (call IRS toll-free at 1-800-829-1040), listing tax information for the past five years (or for the past three years if you are applying on the basis of marriage to a U.S. citizen). 7. If you have a dependent spouse or children and have been ordered to provide financial support, bring: Copies of the court or government order to provide financial support; and Evidence that you have complied with the court or government order (cancelled check, money order receipts, a court or agency printout of child support payments or evidence of wage garnishments). 8. If you have ever been arrested or detained by any law enforcement officer for any reason and no charges were filed, bring: An official, certified statement from the arresting agency or applicable court indicating that no charges were filed. 9. If you have ever been arrested or detained by any law enforcement officer for any reason and charges were filed, bring: An original or certified copy of the arrest record(s) and the complete court disposition for each incident (dismissal order, conviction record or acquittal order). 10. If you have ever been convicted or placed in an alternative sentencing program or rehabilitative program, bring: The sentencing record for each incident; and Evidence that you completed your sentence (probation record, parole record or evidence that you completed an alternative sentencing program or rehabilitative probram). 11. If you have ever had any arrest or conviction vacated, set aside, sealed, expunged or otherwise removed from your records, bring: An original or a certified copy of the court order, vacating, setting aside, sealing, expunging or otherwise removing the arrest or conviction. NOTE: Unless a traffic incident was alcohol or drug related or serious personal injury to another person occured, you do not need to submit documentation for traffic fines and incidents that did not involve an actual arrest if the only penalty was a fine of less than $500 and/or points on your driver's license. 12. If you have any federal, state or local taxes that are overdue, bring: A signed agreement from the IRS, state or local tax office showing that you have filed a tax return and arranged to pay the taxes you owe; and Documentation from the IRS, state or local tax office showing the current status of your repayment program. 13. If you are applying for a disability exception to the testing requirement and have not submitted Form N-648, bring: An original Form N-648, Medical Certification for Disability Exceptions, completed by a licensed medical doctor, licensed clinical psychologist or licensed doctor of osteopathy. 14. If registered with the Selective Service, bring proof of such. If you did not register with the Selective Service and you (1) are male, (2) over 26 years old, (3) were born on or after January 1, 1960, and (4) were a Permanent Resident between the ages of 18 and 26 when you failed to register, explain your failure to register and bring: A \"Status Information Letter\" from the Selective Service. (Call 1-847-688-6888 for more information.) 15. If you are requesting expeditious naturalization (319(b) of the Immigration and Nationality Act) through military service, bring: The U.S. citizen spouse's travel orders showing the name of the alien spouse and establishing that the overseas assignment will end more than 12 months after the date of the naturalization interview. NOTE: Please bring the required documents to avoid delays in processing your case. This is a general check list. Since each case is unique, you may be required to submit additional documentation. Form N-659 (Rev. 11/17/06 N Page 2"
}
