{
  "anumber": "A71666754",
  "id": "A71666754_0110",
  "page_index": 110,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0110/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: MEDICAL EXAMINATION OF APPLICANTS FOR UNITED STATES VISAS, Form Number: 157"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Ethiopia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "creened by NARA, 7/26/202 PLACE MEDICAL EXAMINATION OF APPLICANTS ST- JOHN CLINIC FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) 06-14-95 At the request of the American Consul at CITY ADDIS ABABA COUNTRY ETHIOPIA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX I certify that on the above date I examined OMER AHMED HASSAN (Mo., Day, Yr.) F M 1-1-04 WHO BEARS PASSPORT NO. ISSUED BY ON 71-662-754 INS, NAIROBI May 16, 1995 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Human Immunodeficiency Hansen's Disease, Not Infectious Granuloma Inguinale Syphills, Infectious Virus (HIV) Infection Other Physical Defect, Disease or Disability: Mental Retardation Previous Occurrence of One or Mental Defect Insanity More Attacks of Insanity Narcotic Drug Addiction Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT No reaction Normal Abnormal Not Done Describe findings: Reaction mm Not Done DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ Dr. DANIEL ADMASSIE DATE READ 06-14-95 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done TEST TYPE: RPR TEST TYPE: SANOFI PROCEDURE Not Done DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY Milliston HEBISTV 06-15-95 Dr. ARSHAVIR TERZIAN 06-30-95 OTHER SPECIAL REPORT and needed) of Flogen side vd (When rithes 07 41 95 on hoquac9 DOCTOR'S NAME (Please print) REMARKS HE HAS MODERATE HYPERTENSION. Not on treatment refraction HE require a stick to walk. He will require REDUCTION of Hrg vision with error of a sight glass APPLICANT CERTIFICATION I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information on this form refers to me. Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE GETACHEW ADERAYE M.D. ARER Dek DATE 20 07-08-95 10-11 285 PATO ***** mLT NSN 7540-00-109-0058 Pulmonologist 50157-103 OPTIONAL FORM 157 REVISED 2-88 GPO : 1988 0 - 209-342 DEPT. OF STATE"
}