{
	"anumber": "A71666754",
	"id": "A71666754_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, P O Box 82521"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE P O Box 82521 Lincoln, Nebraska 68508-2521 November 30, 1998 Refer To File No. LIN9818852770 AHMED H OMAR 3681 N DECATUR RD APT 15 DECATUR GA 30032 Dear Sir or Madam: Re: YOURSELF This refers to the above noted application or petition. The record shows that you were given 87 days in which to submit additional evidence in support of the application or petition. A response was not received by the required date. Therefore, in accordance with Title 8, Code of Federal Regulations, Part 103. 2 (b) (13), the application or petition is hereby denied due to abandonment. There is no appeal from this decision. However, you may file a new application with a new fee. You may also file a motion to reopen within 30 days of the date of this decision. The fee for a motion to reopen is $110.00. A motion to reopen an application or petition denied due to abandonment must be filed with evidence that the decision was in error because: (i) The requested evidence was not material to the issue of eligibility; (ii) The required initial evidence was submitted with the application or petition, or the request for initial evidence or additional information or appearance was complied with during the allotted period; or (iii) The request for additional information or appearance was sent to an address other than that on the application, petition, or notice of representation, or that the applicant or petitioner advised the Service, in writing, of a change of address or change of representation subsequent to filing and before the Service's request was sent, and the request did not go to the new address. Sincerely, NatakeVedder Natalie Vedder Director KLJ/lmd"
}
