{
	"anumber": "A71613243",
	"id": "A71613243_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71613243_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Disposiciones de la Ley de Pasaportes decreta-da por el Congreso, Nacional el 3 de febrero de 1971., No. 522312"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "1 2 Disposiciones de la Ley de Pasaportes decreta- REPUBLICA DE HONDURAS da por el Congreso Nacional el 3 de febrero de DE Secretaría de Estado en.el Despacho 1971. de Relaciones Exteriores Art. 1o. Para salir del territorio de la República, los hondureños tienen el derecho de proveerse de un Pasaporte que será extendido por la Secretaría de PASAPORTE CORRIENTE Relaciones Exteriores de conformidad a los requisitos Regular Passport - Passeport Ordinaire exigidos en la presente Ley. En los Departamentos, las Oficinas de Migración podrán recibir solicitudes de pasa- No 525312 portes con los documentos requeridos, debiendo remitir- los a la Secretaría de Relaciones Exteriores para su reso- lución. Es obligatorio para todos los hondureños obtener de la Secretaría de Relaciones Exteriores o de las Ofici- Otorgado Issued to - Délivré á: nas Departamentales de Migración visa para salir del te- Conupron rritorio nacional. Los hondureños no necesitan visar sus Nombre First name Prénom: pasaportes para regresar al país Art. 7o En el exterior sólo los representantes diplo- allodary Varcow Apellidos - Surname - Nom: máticos o consulares de Honduras, excep- tuando los de carácter Ad-Honorem, podrán expedir pa- De nacionalidad hondureña por saportes previa autorización de la Secretaría de Relacio- De nationalité honduriennepar nes Exteriores, siempre que el solicitante presentare Honduran citizen by: Mallimunto ante aquellos funcionarios, los documentos auténticos con que acredite la nacionalidad hondureña o que estén inscritos en los registros que se llevan en esas oficinas, por section Etabli posopate par le: Extendido el - Issued by remitiendo a la misma Secretaría de Estado, un duplica- DC do de la solicitud que recibieren, y acompañando tam- bién el razonamiento del documento o documentos En in A Augar, Place Lieu necesarios para su resolución. 1991 En - On - Le Fecha Date Sello Seal Sceau SIGUE EN LA ULTIMA PAGINA Firma Signature the"
}
