{
  "anumber": "A71613243",
  "id": "A71613243_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71613243_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, Form I-134 ( (Rev. 12-1-84)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1940
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1 S. Department of Justice Immigration and Naturalization ice Affidavit of Support ANSWER AIL ITEMS: FILI. IN WITH TY PEWRITER OR PRINT IN BLOCK 1. Pedro Enrique Torres residing a1 17040 E. Lawnwood Name) (Street and Number Valinda, CA 91744 USA (City) (State) (ZIP Code if in US) (Country BEING DULY SWORN DEPOSE AND SAY: 1. I was born on November 8, 1940 Honduras, Central America at (Date: (Cay) \" country) If you are not a native born United States citizen. answer the following as appropriate: a If a United States citizen through naturalization, give certificate of naturalization number 034167846 b. If a United States citizen through parent(s) or marriage. give citizenship certificate number C. If United States citizenship was derived by some other method. attach a statement of explanation. d. If a law fully admitted permanent resident of the United States, give \"A\" number 2. That I am 52 years of age and have resided in the United States since (date) 1973 3. 1 hat this affidavit IS executed in behalf of the following person: Name Sex Age Concepcion Valladares F 81 Citizen of (Country) Marital Status Relationship 10 Deponent Honduras Central America Single Mother - in - law Presently resides at --(Street and Number) (City) (State) (Country) 17040 E Lawnwood Valinda, CA USA Name of spouse and children accompanying or following to join person: Spouse Sex Age Child Sex Age None Child Sex Age Child Sex Age Child Sex Age Child Sex Age 4. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become a public charge in the United States. 5. That I am willing and able to receive, maintain and support the person(s) named in item 3. That I am ready and willing 10 deposit a bond. if necessary 10 guarantee that such person(s) will not become a public charge during his or her stay in the United States. or 10 guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior 10 the expiration of h.. or her authorized stay in the United States 6 That I understand this affidavit will be binding upon me for a period of three (3) years after entry of the person(s) named in item 3 and that the information and documentation provided by me may be made available to the Secretary of Health and Human Services and the Secretary of Agriculture, who may make it available to a public assistance agency. 7. That I am employed as, or engaged in the business of Mechanic with Peerless Truckin (Type of Business) (Name of concern) Company 5833 S. Malt Ave. City of Commerce CA at 90040 (Street and Number) (City) (State) (Zip Code, I derive an annual income of (if self-employed. I have attached a copy of my last income tax return or report of commercial rating concern which / certify 10 be true and correct 10 the best of my knowledge and belief. See instruction for nature of evidence of net worth 10 be submitted.) $ 30,100.00 I have on deposit in savings banks in the United States S 8,895.00 I have other personal property, the reasonable value of which IS S 10,000.00 } orm 1-134 (Rev. 12-1-84) Y OVER"
}