{
  "anumber": "A71689640",
  "id": "A71689640_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71689640_0009/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECEPTION AND PLACEMENT PROGRAM ACCOUNTANCE FORM, KE-689640"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SENT BY REFUGEE VATA CENTER Screened by NARA 2-22-96 REFUGEE DAIA CENTER- # 3 REFUGEE RECEPTION AND PLACEMENT PROGRAM ASSURANCE FORM Page 1 of 1 IMMIGRATION AND REFUGEE Placement code: 1/3 SERVICES OF AMERICA 1717 MASSACHUSETTS AVE NW ETA/ESL completion WASHINGTON, DC 20036 (202) 347-3507 (formerly American Council for Nationalities Service) DATE: 96-02-21 File ID No. KE-689640 Present Location: JVA KENYA The following persons have been accepted for resettlement under our auspices: Name A Number DOB MC Sex POB 1. AHMED DALMAR ABDURAHMAN 06-01-01 M so 2. 3. 4. FOIA (b)(6) 5. 6. 7. 8. 9. 10. 11. 12. Affiliate Local Sponsor Relative (if applicable) Int'l Institute of Wisconsin AHMED ABDURAHMAN (SO) 1110 N. Old World 3rd St. 4227 W.HAWTHORNE TRACE RD Suite 420 APT. 107 Milwaukee, WI 53203 BROWN DEER, WI 53209 Telephone: 414-225-6220 Home Telephone: 414-354-9724 Airport of Final Destination: MKE Placement Location (city, state) : BROWN DEER, WI Special Instruction: The affiliate has an agreement with the national agency to provide, or ensure the provision of, reception and placement services to the above named refugee (s) 111 accordance with the U.O. Department of Cento Cooperative Agreement Signature: Authorized Agency Representative REFUGEE DATA CENTER 200 PARK AVENUE SOUTH NEW YORK, NEW YORK 10003 FEB 22 1996 RDC"
}