{
  "anumber": "A71666754",
  "id": "A71666754_0093",
  "page_index": 93,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0093/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/26/2023, Catholic Social Services, Inc."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "Ethiopia",
        "Georgia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 9P CATHOLIC SOCIAL SERVICES, INC. BOARD OF DIRECTORS April 17, 1995 PRESIDENT Archbishop John F. Donoghue, D.D. CHAIRMAN Martha Lee Doyle Pamela Hutchings VICE CHAIRMAN JVA Kenya Walter Denero P.O. Box 14176 SECRETARY Stuart A. Cashin, Jr., C.P.A. Nairobi, Kenya Nathan Andereck Dear Ms. Hutchings: Judge Charles Auslander Roland E. Blanding, Jr. Enclosed are copies of three AOR's that you should have on file in your Dennis Crean office for refugees in Ethiopia. They were are filed in 1994. I have heard Henry deGive, Esq. rumors that there will be a trip by your agency to Ethiopia at the end of Lee DeHihns, Esq. Fr. John Druding April. I have received no information from our New York office regarding W. Eyzaguirre, M.D. this SO I do not know if this is the case, or what, if anything that I could be Becky Fratesi doing to help your agency and the refugees in regards to processing. If there Jerry Lett is anyling I could do on my part to help out please let me know. I will also try Reverend Hugh Marren faxing the copies today so this letter might be redundant. Sally Ann McNulty John Murphy Sincerely, Sr. Josephine Patti, G.N.S.H. CATHOLIC SOCIAL SERVICES, INC William M. Rich, Esq. Sr. Louise Sommer, C.S.J. Lome Twiner Danny Vargas Bob Kamack EXECUTIVE DIRECTOR Pam Buckmaster Migration & Refugee Services United Wey 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
}