{
  "anumber": "A71666754",
  "id": "A71666754_0094",
  "page_index": 94,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0094/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF RELATIONSHIP, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Ethiopia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2595,
        1994,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 AMRI ID STATES don. \"ust is safe AFFIDAVIT OF RELATIONSHIP amount N DIOCESE OF: Atlanta DATE RECEIVED APR 2595 CONFERENCE NAT P. DATE FILED: March 30,1994 Your heart DUP. LIST DEPT. RECORD SECTION 1: FAX NEEDED I am filing this Affidavit for the following persons located in ETHIOPIA Date of arrival in that country: MAY, 1991 (Country of asylum overseas) FOIA (b)(6) The case number for this family is (if available): SECTION II: Your name FOIA (b)(6) Alien Number (if applicable) FOIA (b)(6) (and A.K.A) Date of birth FOIA (b)(6) Your U.S. Immigration Status Place of birth (Check one) (Include country) ( ) U.S. Citizen: Certificate # Current address FOIA (b)(6) ( ) Permanent Resident ( Refugee ( ) Asylee Phone number (Home ( ) Other (Please explain) (Work) Country of first asylu FOIA (b)(6) Your Original Case Number: Date you arrived in th Social Security Numb Agency through which you came to the United States USCC - ATLANTA. I have filed an I-130 (Immigrant Visa Petition) for each of my relatives mentioned above prior to submitting this affidavit, Yes No. If yes, date submitted: and date approved: YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR I-94 OR YOUR PERMANENT RESIDENT ALIEN CARD (I-151, I-551, GREEN CARD). WITHOUT THESE DOCUMENTS, YOUR AFFIDAVIT IS NOT VALID. The purpose of this Affidavit is to verify your relationship to refugees overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the U.S.. If the information is unknown to you, indicate \"unknown\". If anyone uses an alias, provide it. If anyone is deceased or their present location is unknown, please indicate. Be sure to include all relatives as specified, anywhere in the world, living, deceased or missing. \" Use the space marked \"Additions/Explanations\" to explain any unusual relationships including adopted, half, or step relatives."
}