{
  "anumber": "A71666754",
  "id": "A71666754_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/26/2023, Catholic Social Services, Inc."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "Ethiopia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 JL CATHOLIC SOCIAL SERVICES, INC. BOARD OF DIRECTORS PRESIDENT September 28, 1994 Archbishop John F. Donoghue, D.D. CHAIRMAN Martha Lee Doyle VICE CHAIRMAN Pamela Hutchings Walter Denero JVA Represenative SECRETARY P.O. Box 14176 Stuart A. Cashin, Jr., C.P.A. Nairobi, Kenya TREASURER James F. Harrington, C.P.A. Nathan Andereck Dear Ms. Hutchings: Judge Charles Auslander Roland E. Blanding, Jr. The enclosed AOR has been filed with the U.S. Embassy in Addis Paula Bonds, Esq. Ababa Ethiopia. Copies of the AOR have also been sent to the Dennis Crean UNHCR office in Addis and in Washington D.C. Embassy and Henry deGive, Esq. UNHCR people appear unwilling or unable to see if these people can Lee DeHihns, Esq. be processed as refugees. Becky Fratesi Jerry Lett The family is unwilling to travel to Kenya to be processed due to the Reverend Hugh Marren inherent risk of travel and the age of Hassan Omar who is an old man Sally Ann McNulty in declining health. John Murphy Sr. Josephine Patti, G.N.S.H. USCC New York has informed me that JVA Kenya will be making a William M. Rich, Esq. trip in the near future to Addis to process Somali refugees. Please Sr. Louise Sommer, C.S.J. consider the enclosed AOR if a trip is made to Ethiopia in the future. Lorne Twiner Danny Vargas My phone # is 404/885-7243 and my fax is 404/888-7816. EXECUTIVE DIRECTOR Pam Buckmaster Sincerely, CATHOLIC SOCIAL SERVICES, INC. BLCard Bob Kamack Migration & Refugee Services United 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
}