{
  "anumber": "A71689640",
  "id": "A71689640_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71689640_0019/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/202 SENT BY: 5-10-95 10:07PM : Kinko's -Brown Deer- 254 2 216800;# 5/ 5 AFFIDAVIT OF RELATIONSHIP I'AGE 7. SECTION III: NAME and AKA Place/Date of Birth Present Loentlon/Addrees I.E Known 11 Known Your Father Dalmer Abdurahman Somalia, 1-1-1906 Somalia Your Mother Halima Issa Somalia, 1922 Deceased Step-Father Step-Hother Spouse FOIA (b)(6) Date(s)/Place(s) of Marriage( (s) and/or Ulvorce(s) FOIA (b)(6) SECTION IV: List ALL your Children (living, deceased or missing; blood, step, half & adopted) NAME and AKA Sex Place/Date of Birth Present Logiction/Address Dalmar, Mohamed A. I.E known II Known M USA, 11-01-91 4133 W. Cherrywood Lane Brown Deer, WI 53209 SECTION V: List ALL your Brothers & Sisters (living, deceased or missing; blood, step, hall OF adopted) NAME and AKA Sex Place/Unte of Birth Frevent FOIA (b)(6) SECTION VI: Additionn/Explanatlous Anchor Relative came to the USA with A-2 Visa (Course in Health Science Academy of U.S. Army, Fort Houston, Texas) J. swear that the information I'll this statement is true to the best of my knowledge, and understand that any Enloa statement could jeopardize my immigration status In the United States. Abound D Hedunchinew Subscribed and RWOKU to before me this Your Signature 24th day of February 1.9 94 . Stump or Seal of Notary . Thaucha R-Karic signature of Notary Public My commission expires: 10-22-1995 Name and Signature of agency representative who assisted In preparing this Allidavit INTERNATIONAL INSTITUTE OF WISCONSIN INC. (If applicable) 1110N. Old World Third Street, Suite 420 Milwaukee w 53203"
}