{
	"anumber": "A71689640",
	"id": "A71689640_0045",
	"page_index": 45,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71689640_0045/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/21/2023, A71689640"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Kenya", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1992, 1990, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 PA Dalmar Abdurahman Ahmed Date 9.6.12.30151995 Case # Refager A71689640 1. Relative in the United States. (Date of arrival) 8-17-1990 2. Employment with the U.S. Govt./U.S. companies or agencies, in country of orgin. (Documents) NO 3. Military experience or government in the country of orgin. NO 4. Applicants perception of the circumstances in the event that he/she returned to the country of orgin. Its not Possible at this moment 5. Employment since arrival in Kenya. 100 6. Reason for leaving country of national orgin. (Give concise but exact history of events). My Experience was not unique. Many other SemaLis have suffered a SimiLar fate as mine. fo flowing account represents The facts of my case 1- my two Sons Mahsimud and Abdullahi were Murdered in my presence in Mogodisho in 1991 2- my doughter in law the wife of my Son mahamud FOIA (b)(6) JUN was also killed in Mopodisho (3) my doughter was shot and wounder on The Ack While Resisting an att empt to rape her (4) I my self was subjected to Cruce psychological torture when I was blind folded and shots were fired over my head finally, and Elderly man Ordered The bandits to release me because of myadranced age. (5) my older children left mopedisho in 1991, but my doughter FOIA (b)(6) and I Came to Dhobley in June 1992 and Hence Kenye las 1/1/90. my wife and some of my children have fled to Elhopia"
}
