{
	"anumber": "A71666754",
	"id": "A71666754_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 3. Processing Information ( (continued), NARA Form Number: NARA-19560243"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened NARA 7/26/2023 Part 3. Processing Information. (continued) Where do you want this travel document sent? (check one) a. Address in Part 2, above b. American Consulate at (give City and Country, below) C. INS overseas office at (give City and Country, below) ThE ADRESS iN PART 1 City Country If you checked b. or C., above, give your overseas address: Part 4. Information about the Proposed Travel. Purpose of trip. If you need more room, continue on a separate sheet of paper. List the countries you intend to visit. I Am GOING A visit To RELATIVES ETHiopin Part 5. Complete only if applying for a Reentry Permit. less than 6 months 2 to 3 years Since becoming a Permanent Resident (or during the past five years, whichever is less) how 6 months to 1 year 3 to 4 years much total time have you spent outside the United States? 1 to 2 years more than 4 years Since you became a Permanent Resident, have you ever filed a federal income tax return as a nonresident, or failed to file a federal return because you considered yourself to be a nonresident? (if yes, give details on a separate sheet of paper). Yes No Part 6. Complete only if applying for a Refugee Travel Document. Country from which you are a refugee or asylee: SOMALiA If you answer yes to any of the following questions, explain on a separate sheet of paper. Do you plan to travel to the above-named country? Yes No Since you were accorded Refugee/Asylee status, have you ever: returned to the above-named country; applied for an/or obtained a national passport, passport renewal, or entry permit into this country; or applied for an/or received any benefit from such country (for example, health insurance benefits)? Yes No Since being accorded Refugee/Asylee status, have you, by any legal procedure or voluntary act, re-acquired the nationality of the above-named country, acquired a new nationality, or been granted refugee or asylee status in any other country? Yes No Part 7. Complete only if applying for an Advance Parole. On a separate sheet of paper, please explain how you qualify for an Advance Parole and what circumstances warrant issuance of Advance Parole. Include copies of any documents you wish considered. (See instructions.) For how may trips do you intend to use this document? 1 trip More than 1 trip If outside the U.S., at right give the U.S. Consulate or INS office you wish notified if this application is approved. Part 8. Signature. Read the information on penalties in the instructions before completing this section. You must file this application while in the United States if filing for a reentry permit or refugee travel document. I certify under penalty of perjury under the laws of the United States of America that this petition, and the evidence submitted with it, is all true and correct. I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit I am seeking. Signature D Date 6-4-98 Daytime Telephone # 298-7389 Please Note: you do not completely fill out this form, or fail to submit required documents listed in the instructions, you may not be found eligible for the requested document and this application will have to be denied. Part 9. Signature of person preparing form if other than above. (sign below) I declare that I prepared this application at the request of the above person and it is based on all information of which I have knowledge. Signature AUGHMES HASSAN Print Your Name OMAR, Date 6-4-98 Firm Name OMAR A. HASSAN Daytime Telephone # and Address 463 ELECTRIC Av.78 DEGATUR GA 30030 (378-2516 *U.S. Government Printing Office. 1595 387-154/22701"
}
