{
	"anumber": "A71666754",
	"id": "A71666754_0043",
	"page_index": 43,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0043/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, FORM G-325C"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Ethiopia", "Somalia"]
		},
		"years": {
			"ms_years_nlp_v1": [1949, 1995, 1972, 1992, 2023, 1904, 1963, 1964, 1991, 1930, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 U.S. Department of Justice FORM G-325C Immigration and Naturalization Service BIOGRAPHIC INFORMATION ( OMB No. 1115-0066 A71666754 (FAMILY NAME) (FIRST NAME) (MIDDLE NAME) MALE BIRTHDATE (MO DAY YR NATIONALITY OMAR AHMED HASSAN FEMALE 1-1-1904 SOMALI ALL OTHER NAMESUSED CITY AND COUNTRY OF BIRTH NONE KISMANYO SOMALIA FAMILY NAME FIRST NAME DATE. CITY AND COUNTRY OF BIRTH (IF KNOWN) OMAR ALi CITKAND COUNTRY OF RESIDENCE HASAN Somalia Deceased FATHER MOTHER (MAIDEN NAME) SHARIF-NUR MUMINA Somatia Deceased HUSBAND OR WIFE FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE! CIF NONE. so STATE) (FOR WIFE. GIVE MAIDEN NAME) FARAHABDI HAWEYA Somplin Somatia 1930 DANANE 1963 DANAWE FORMER HUSBANDS OR WIVES (FILL IN THE BLOCKS BELOW IF NONE. STATE *NONE*) FAMILY NAME (FOR WIFE GIVE MAIDEN NAME) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE MOHAMED AMINA - 1949 Som DIED 1972 HASSAN KhadilA 1959 Som. Divorced 1964 APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 1991 GODEY HARARSEY ETHIOPIA PRESENT TIME 1992-1995 DIRE Dawa HARARGEY ETHIOPIA APPLICANTS EMPLOYMENT LAST FIVE YEARS OF NONE. so STATE) LIST PRESENT EMPLOYMENT FIRST FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION MONTH YEAR MONTH YEAR PRESENT TIME No IF YOUR NATIVE ALPHABET IS IN OTHER THAN ROMAN LETTERS. WRITE YOUR NAME IN YOUR NATIVE ALPHABET BELOW: APPLICANT FOR REFUGEE STATUS XASAN CUMAR PENALTIES SEVERE PENALTIES ARE PROVIDED BY LAW 04 MAY 1995 FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. DATE (SIGNATURE OF APPLICANT) APPLICANT: BE SURE TO PUT YOUR NAME IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (FAMILY NAME) (GIVEN NAME) (MIDDLE NAME) OMAR AXMED HASAN FORM G-325C (Rev. 10-1-82)Y"
}
