{
  "anumber": "A71600737",
  "id": "A71600737_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71600737_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, I-181 ( Rev.(3-1-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        1910,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/20/2023 FY 92 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place LOS File No. A71 600 737 Status as a lawful permanent resident of the United States is accorded: 415 25263102 Sex XD Male Date of Birth (Month/Day/Year) Name 01-09-1910 In Care Of 2 Female Street Manuel De Jesus DIAZ City of Birth Country of Birth Address 8609 Lubao Avenue Sinuapa Honduras Apt. No. Canoga Park, CA 91306 Country of Nationality Country of Last Residence City, State, Zip Honduras Honduras Marital Status 1 Single Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present 3 4 Divorced 5 SLS B-2 NI Class (whichever most recent) Widowed Separated 91 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) N/A N/A N/A Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted Labor Certification 3xxxx Applicable Jesus UKN Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification N/A N/A N/A of Last NIV N/A Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the I & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session KYec. 245 of the I & N Act Sec. 214 (d) of the I & N Act As of AUG11 1992 at LOS (Month) (Day) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert Symbol) IRO #3 REMARKS RECOMMENDED BY: (Immigration Officer) (Date) APPROVED INS DISTRICT DIRECTOR DATE OF ACTION AUG 11 1992 AUG 1 1992 DD AD 08/11/92 srw Recommended DISTRICT FOR USE BY VISA CONTROL OFFICE LOS 4449 Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I. 181 (Rev.3-1-83) N 1. FILE COPY"
}