{
	"anumber": "A71666754",
	"id": "A71666754_0082",
	"page_index": 82,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0082/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF RELATIONSHIP, # 16 ( (02)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Ethiopia", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1999, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 STATES AFFIDAVIT OF RELATIONSHIP # 16 (DZ) DATE RECEIVED APR 19TH 95 DIOCESE OF: Atlanta CONFERENCE NÄT P. four DATE FILED: March 30,1999 DUP, LIST DEPT. RECORD SECTION 1; I am filing this Affidavit for the following persons(s) FAX. NEEDED located in ETHIOPIA Date of arrival in that country: MAY, 1991 (Country of asylum overseas) NAME AND A.K.A SEX PLACE/DATE OF BIRTH RELATION TO YOU ADDRESS/LOCATION FOIA (b)(6) The case number for this family is (if available): SECTION II: Your name FOIA (b)(6) Alien Number (if applicable) FOIA (b)(6) (and A.K.A) Date of birth Your U.S. Immigration Status Place of birth FOIA (b)(6) (Check one) (Include country) ( ) U.S. Citizen: Certificate # Current address ( ) Permanent Resident (L) Refugee ( ) Asylee Phone number (Home) Country of first asylum FOIA (b)(6) ( ) Other (Please explain) (Work). Your Original Case Number: Date you arrived in the Social Security Numbe Agency through which you came to the United States USCC ATLANTA I have filed an I-130 (Immigrant Visa Petition) for each of my relatives mentioned above prior to submitting this affidavit Yes No. If yes, date submitted: and date approved YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR I-94 OR YOUR PERMANENT RESIDENT ALIEN CARD (1-151, I-551, GREEN CARD). WITHOUT THESE DOCUMENTS, YOUR AFFIDAVIT IS NOT VALID. The purpose of this Affidavit is to verify your relationship to refugees overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the U.S.. If the information is unknown to you, indicate \"unknown\". If anyone uses an allas, provide it. If anyone is deceased or their present location is unknown, please indicate. Be sure to include all relatives as specified, anywher in the world, living, deceased or missing. Use the space marked \"Additions/Explanations\" to explain any unusual relationships Including adopted, half, or step relatives. LOS is $ 0"
}
