{
  "anumber": "A71666754",
  "id": "A71666754_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Travel Document, I-131 ( (Rev. 12/10/91)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1904
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 U.S. Department of Justice OMB #1115-0005 Immigration and Naturalization Service Application for Travel Document START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Name OMAR Given Name AHMEY Initial Middle Hassin Address C/O Resubmitted SKC Street Number and Name 3681 N. DECATUR RI # Apt. 15 City State or DECATUR Province GA 30032 Country ZIP/Postal Reloc Sent Code Date of Birth (Month/Day/Year) 1-1-1904 Country of Birth SOMALIA Security Social # 254-95-3482 A # 71 666 754 Reloc Rec'd Part 2. Application Type (check one). a. am a permanent resident or conditional resident of the United States and I am applying for a Reentry Permit. -20-00 b. I now hold U.S. refugee or asylee status and I am applying for a Refugee Travel Document. TX0200 Applicant Interviewed I am a permanent resident as a direct result of refugee or asylee status, and am on C. for a Refugee Travel Document. d. I am applying for an Advance Parole to allow me to return to the U.S. after temporary Document Issued foreign travel. Reentry Permit e. I am outside the U.S. and am applying for an Advance Parole. Refugee Travel Document Single Advance Parole f. I am applying for an Advance Parole for another person who is outside the U.S. Give Multiple Advance Parole the following information about that person: Validity to Family Given Middle If Reentry Permit or Refugee Travel Name Name Initial Document Date of Birth Country Mail to Address in Part 2 (Month/Day/Year) of Birth Mail to American Consulate Foreign Address - C/O Mail to INS overseas office Street Number N/A AT Apt. Remarks: and Name # Document Hand Delivered City State or Province On By Action Block Country ZIP/Postal Code Part 3. Processing Information. Date of Intended departure (Month/Day/Year) Expected length of trip, 9-27-98 Two month Are you, or any person included in this application, now in exclusion or deportation proceedings? No Yes, at (give office name) If applying for an Advance Parole Document, skip to Part 7. Rome Have you, ever before been issued a Reentry Permit or Refugee Travel Document? To Be Completed by No Yes (give the following for the last document issued to you) Attorney or Representative, if any Date Issued Disposition (attached, lost, etc.) Fill in box if G-28 is attached to represent the applicant VOLAG# Form I-131 (Rev. 12/10/91) N Continued on back. ATTY State License #"
}