{
  "anumber": "A71666754",
  "id": "A71666754_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0075/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/26/2023, Catholic Social Services, Inc."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Ethiopia",
        "Somalia",
        "Kenya",
        "Georgia",
        "Sudan"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 JL CATHOLIC SOCIAL SERVICES, INC. July 20, 1994 BOARD OF DIRECTORS PRESIDENT United Nations High Commissioner for Refugees Archbishop John F. Donoghue, D.D. 1718 Connecticut Avenue, NW, #200 CHAIRMAN Washington D.C. 20009 Martha Lee Doyle VICE CHAIRMAN Walter Denero Dear Sir/Madam: SECRETARY Stuart A. Cashin, Jr., C.P.A. I am writing in regards to a Somali refugee family TREASURER residing in Ethiopia. The family understands that to James F. Harrington, C.P.A. be processed as refugees the best place is Kenya. The family is afraid to travel to Kenya for two Nathan Andereck reasons. First; the head of family, Ahmed Hassan Judge Charles Auslander Omar, is an old man in deteriorating health and the Roland E. Blanding. Jr. family feels he would not be able to make the Paula Bonds, Esq. journey. Second, the family is afraid to make the Dennis Crean trip due to the threat of banditry. Henry deGive, Esq. Lee DeHihns, Esq. The family has approached the U.S. Embassy in Addis Becky Fratesi Ababa and were referred to a UNHCR office in Jerry Lett Ethiopia. Evidently they were told that for UNHCR to Reverend Hugh Marren get involved in this case they would need special Sally Ann McNulty permission. The family was not clear on exactly what John Murphy they meant by special permission, but evidently it Sr. Josephine Patti, G.N.S.H. would have to come from a UNHCR office or official William M. Rich. Esq. having jurisdiction over the office in Addis Ababa. Sr. Louise Sommer. C.S.J. I have written two letters to the UNHCR office in Lome Twiner Addis as to how I should proceed in this case but as Danny Vargas of now have received no reply. EXECUTIVE DIRECTOR Pam Buckmaster FOIA (b)(6) who filed the AOR, and her husband FOIA (b)(6) are very discouraged over their relatives situation. Because family members sought safety in Ethiopia they are basically not even eligible to be considered for the U.S. refugee program. Had they the presence of mind when escaping Somalia to become refugees in Kenya they might have some chance at reuniting their family and starting over. Now, just to get that chance, they would have to become refugees twice over. FOIA (b)(6) husband, FOIA (b)(6), worked for many years for the international relief organization CARE as a projects manager. He worked both in Somalia and Sudan. FOIA (b)(6) has dedicated the better part of his adult life to helping refugees in need. Now he feels grossly inadequate that he is unable to help the 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
}