{
	"anumber": "A71666754",
	"id": "A71666754_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR EVIDENCE"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "UNITED STATES DEPARTMENT OF JUSTICE Screened by NARA 7/26/2023 IMMIGRATION AND NATURALIZATION SERVICE P.O. Box 82521 Lincoln, Nebraska 68501-2521 Date: August 17, 1998 Refer to File No. AHMED H. OMAR 3681 N DECATUR RD APT 15 06/26/98 LIN-98-188-52770 LINLXN01 DECATUR GA 30032- REQUEST FOR EVIDENCE DOCUMENTATION SUBMITTED WITH YOUR FORM I-131, (Application for OF Travel YOUR THE INITIAL IS NOT SUFFICIENT TO WARRANT FAVORABLE CONSIDERATION will assist APPLICATION. Document), Submittal of the following items and/or additional information in the processing of your application. Please submit or comply with the items checked below: are a lawful permanent resident or conditional resident, the you documentation must submit 1. documentation show your status, provide your biographic information, lawful permanent If you verifying your status. To be accepted as evidence, and must include must your photo. clearly Any of the following may be accepted as evidence of your or conditional resident status: I. A and front sides, as proof of your status as a lawful permanent show photocopy of your I-551, Alien Registration Card (ARC), showing both the or back conditional resident of the United States. The copies must clearly your photograph and card information. If have not received your Alien Registration Card, submit a admission copy of the as II. you and the page of your passport indicating initial biographic a permanent page, or conditional resident, or other evidence that you are a permanent or conditional resident. Or, of the approval notice of a separate application for replacement conditional of your III. alien A copy registration card or temporary evidence of permanent or resident status. (131E.A) evidence that you qualify as a refugee for the purpose of issuance or granted of a 2. Submit travel document. To qualify, you must have been admitted, paroled, have been admitted refugee the United States as a refugee or an asylee, or you must claim. status in to lawful permanent resident status based on a refugee or front asylee and back, or You adjusted photocopy of your I-94 card, your I-551 or card (both to show must submit shows a the photo and identity information) or other documentation travel document which that you clearly have been granted a status making you eligible for a refugee do not have an alien registration card you must submit a copy driver's of your Form license, -94 If you with a of a photo identity document such as a passport, birth. a The identity along document copy showing your photo, your name and date of (131J) or document another copy must clearly show the photograph and identity information. 3. Since becoming a Permanent Resident (or during the past five states? years, whichever is less), how much total time have you spent outside the United 1 to 2 years Have not been outside the U.S. during the mentioned time period 2 to 3 years 3 to 4 years less than 6 months more than 4 years 6 months to 1 year (CONTINUED ON REVERSE SIDE)"
}
