{
  "anumber": "A71689640",
  "id": "A71689640_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71689640_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "American Council for Nationalities Service, 62492 UW"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/202 DATE RECEIVE 3RD MARCH 94 163 NAT so 3 DUP. Em US: EM American Council for Nationalities ServiceEPT. RECORD N/A 95 Madison Avenue, New York, N.Y. 10016 TEL. (212) 532-5950 NEEDED Telex Number: 62492 UW Cable Address: NAISERVE NEW YORK AFFIDAVIT OF RELATIONSHIP (Please type or print legibly) SECTION I: Date filed 2-22-94 I am filing this Affidavit for the following person (s) Date of arrival in that country: located in: Somalia 8-17-90 Country of asylum overseas NAME and AKA Sex Place/Date of Birth Relation to You Present Location underline family name) If Known or Address Abdurahman, Dalmar Ahmed Somalia 1-1-1906 Father Refugee Camp in Mombasa, Kenya Africa FOIA , (b)(6) 06 JUN 1995 A X5 PA: Dalmar Abdurahman 04 Need-proof of status MAY 1995 B PA: C XI PA FOIA (b)(6) GET A FILE D XI PA The Case Number for this family is: (If available) Case #11981 TO VERIFY SECTION II: Social Security Number FOIA (b)(6) Your Name Ahmed Abdurahman Alien Number (if applicable) FOIA (b)(6) (and AKA) Date of Birth 10-27-46 Sex M Your US Immigration Status is: (Check One) Place of Birth Somalia US Citizen Address 4133 W. Cherrywood Lane Permanent Resident Brown Deer, WI 53209 Refugee : Asylee Phone Number (Home) (414) 354-2142 Other (Please Explain) Date you Arrived in the US 8-17-90 (Work) 873-3600 672-8282 -Work Your original case number N/A Your country of first asylum USA Agency through which you came to the United States N/A YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR I-94 OR YOUR PERMANENT RESIDENT ALIEN CARD, (PRA card, green card, or I-151) WITHOUT THESE DOCUMENTS YOUR AFFIDAVIT MAY NOT BE VALID. The purpose of this Affidavit is to verify your relationship to refugee overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the US. If information is unknown to you, indicate \"unknown\". If anyone uses an alias, provide it. If anyone is deceased or their present location is unknown, please indicate. Be sure to include all relatives as specified, anywhere in the world, living, deceased or missing. Use the space marked \"Additions/Explanations\" to explain any unusual relationships including adopted, half or step relatives. (Retired 1/08)"
}