{
	"anumber": "A71666754",
	"id": "A71666754_0071",
	"page_index": 71,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0071/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "madam"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/26/2023, Catholic Social Services, Inc."
		},
		"countries": {
			"ms_countries_nlp_v1": ["Ethiopia", "Georgia", "Kenya"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/26/2023 JL r CATHOLIC SOCIAL SERVICES, INC. busy BOARD OF DIRECTORS July 05, 1994 PRESIDENT 5 Archbishop John F. Donoghue, D.D. CHAIRMAN Martha Lee Doyle United Nations High Commisioner For Refugees VICE CHAIRMAN P.O. Box 1076 Walter Denero Addis Ababa, Ethiopia SECRETARY FAX # 2511510114 Stuart A. Cashin, Jr., C.P.A. TREASURER James F. Harrington, C.P.A. Dear Sir/ Madam: Nathan Andereck I am faxing you this letter in regard to a Somali family who are Judge Charles Auslander residing as refugees in Ethiopia. Please note the copy of the Affidavit Roland E. Blanding, Jr. of Relationship I am also faxing. The family knows they are supposed Paula Bonds, Esq. to go to Kenya to be processed as refugeess but they fear that the trip Rev. Stephen Churchwell would be too dangerous and risky for the father of the family, Ahmed Henry deGive, Esq. Hassan Omar, who is an old man in deteriorating health. Lee Dehihns, Esq. Becky Fratesi The family approached the U.S. Embassy in Addis who reffered them Jerry Lett to you. To the best of my understanding your agency, UNHCR, could Reverend Hugh Marren not proceed until they had a request from our agency USCC. Sally Ann McNulty Marta Miller If at all possible could you make an exception and help facilitate the John Murphy processing of this case with the U.S. Embassy. The family members Sr. Josephine Patti, G.N.S.H. here in the U.S. are worried about their realtives situation and have William M. Rich, Esq. expressed concern over fighting in Ethiopia between government Janet Rechtman Lorne Twiner forces and Ethiopians of Somali descent. Danny Vargas I had written a letter to you before about this matter but have not EXECUTIVE DIRECTOR received any response so I hope this gets thru to someone Please Pam Buckmaster advise me how I should proceed in this matter. My telephone # is 404/885-7243 and my fax # is 404/888-7816. Sincerely, CATHOLIC SOCIAL SERVICES, INC. Bank Kanach Bob Kamack Migration and Refugee Services USCC 680 West Peachtree St., NW, Atlanta, Georgia 30308-1984, 404/881-6571, FAX 404/888-7816"
}
