{
  "anumber": "A71666754",
  "id": "A71666754_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666754_0041/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Form, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1995,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/26/2023 'age 14. Political, professional or social organizations of which I am now or have been R member or with which I am now or have been affiliated since my 16th birthday (If you have never been a member of any organization, state \"None.\") NO 15. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date, place and nature of each charge and the final result.) 16. I have have not been in the United States. (If you have ever been in the United States, show the dates of entry and departure and the purpose of your entry (visitor, permanent resident, student, seaman, etc.). File or Alien Registration Number: No 17. I have the following close relatives in the United States: Name FOIA (b)(6) Present address 18. I am being sponsored by Name an address of United States USCC FOIA (b)(6) FOIA (b)(6) Date: 04 MAY 1995 Signature of registrant DO NOT WRITE BELOW THIS LINE I, do swear (affirm) that I know the contents of this registration subscribed by me including the attached documents, that the same are true to the best of my knowledge, and that corrections numbered ) to ( ) were made by me or at my request, and that this registration was signed by me with my full, true name: (Complete and/true signature of registrant) Subscribed sworn to before me by the above-named and registrant at Jyiga, ET on 16 MAY 1995 (month/day/year) (Signature and title of officer) INTERVIEW APPROVED ROVED ADMITTED AS A REFUGEE INS DISTRICT DIRECTOR PURSUANT TO SECTION 207 OF DATE 16 MAY 1995 THE INA FOR int If EFINITE DATE PERICO LF TIME IF YOU DEPART AT Ayiga ET MAY 16 1995 THE U.S. YOU WILL NEED PRIOR PERMISSION FROM INS TO RETURN Recommended by: EMPLOYMENT AUTHORIZED PASSED USPHS Immigration Officer Officer in Charge QUARANTINE STATION NYC DATE IMM.OFF. 1996 INSTRUCTIONS REV JAN 2 41996 This form should be executed, signed and submitted to the Officer in Charge of the nearest overseas office of the United States Immigration and #014 Naturalization Service. When your name has been reached as a registrant you will be furnished additional instructions. N. Registration - A separate Registration Form must be executed by each registrant and submitted in one copy. A Registration Form in behalf of a child under 14 years of age shall be executed by the parent of guardian. Public reporting burden for this collection of information is estimated to average 35 minutes per response. If you have comments regarding the accuracy of this estimate or suggestions for simplifying this form, you can write to both the U.S. Department of Justice, Immigration and Naturalization Service Policy Directives and Instructions Branch (HQPDIB), Washington, D.C. 20536 and to the Office of Management and Budget, Paperwork Reduction Project: OMB No. 1115-0057, Washington, D.C. 20503. *U.S. GPO: 1993-342-483/72355"
}