{
  "anumber": "A71829679",
  "id": "A71829679_0104",
  "page_index": 104,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71829679_0104/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "HEPATITIS INTERPRETATION & ACTION GUIDE, NARA, 7/25/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 HEPATITIS INTERPRETATION ACTION GUIDE Clinical correlation required DETECTION AND DIAGNOSIS OF ACUTE HEPATITIS HBsAg HBcAbIgM HBcAbIgG/M HBeAG HAVAblgG/M HAVAblgM HDAb Action EARLY/ASYMP B 2 ACUTE HEP NON-A, B 2 VIRAL HEP, OTHER 2 TOXIC HEP 2 ACUTE HEP A 1 ACUTE HEP B + 2 ACUTE HEP B + + + 3 ACUTE HEP B + + + + 3 HEPATITIS DELTA AGENT 3 MONITORING OF INFECTIVITY/RESOLUTION OF HEPATITIS B INFECTION DIAGNOSIS OF CHRONIC HEPATITIS B. HBsAg HBeAg HBcAbIgM HBeAb HBcAblgG HBsAB Action HIGHLY INFECTIVE ASYMP - 3 HIGHLY INFECTIVE, EARLY + 3 HIGHLY INFECTIVE + + 3 DIMINISHED INFECTIVITY +/- + +/- + 3 DIMINISHED INFECTIVITY +/- +/- + 3 PROB NOT INFECTIVE - + + +/- + 3 ADEQ IMMUNITY + POSS INADEQ IMMUNITY + +/- +/- +/- +/- 4 CHRONIC HEPATITIS + +/- +/- + +/- 5 ACTION GUIDE 1 HBsAg, HBcAb IgM, HBeAg and HBcAb IgG/M in 7-14 days. 2 HBsAg, HAVAb lgG/M, and HBeAg in 7-14 days. 3 Monthly HBsAg, HBEAg, HbeAb, HAVAb IgM, and HBsAb. Consider Hepatitis D if severe or risk group. 4 Quarterly HBsAg, HBeAg, HbeAb, HBcAb IgM, and HBsAb. Clinical correlation required. 5 Quarterly HBsAg. HBeAg, HbeAb, HBcAb IgG, and HBsAb; consider liver biopsy. Clinical correlation required. At risk for long term development of cirrhosis and increased risk of liver cancer. INTERPRETIVE GUIDE FOR CHOLESTEROL Cutoff values recommended by National Cholesterol Education Program. Desirable Borderline High Risk Result: < 200 mg/dL 200-239 mg/dL 240mg/dL LIPID SCORE The lipid score valu is a percentile ranking of the person, based on measurement of their important blood lipids and performance of multivariate analysis of those lipid levels, together with their age and sex. The ranking is referenced to a large study population Coronary heart disease (CHD) risk is assigned to groups defined by division of the total population (1-100 percentiles) into 5 groups. The lipid score places persons in one of these risk groups. LIPID SCORES AND CHD RISK GROUPS 0 5 26 50 51 - 75 76 89 90 100 LOWEST LOW MODERATE HIGH HIGHEST Cholesterol/HDL Cholesterol Ratio CHD Risk Groups Men Women Percentile Lowest Less Than 3.8 Less Than 2.9 Less Than 25 Low 3.9-4.7 3.0-3.6 26-50 Moderate 4.8-5.9 3.7-4.6 51-75 High 6.0-6.9 4.7-5.6 76-89 Highest Greater Than or equal to 7.0 Greater Than or equal to 5.7 Greater Than or equal to 90 Studies should be performed in the fasting state. Due to variability of blood lipids, trend analysis by a series of studies provides a better understanding of a person's risk than does a single study."
}