{
	"anumber": "A71817091",
	"id": "A71817091_0023",
	"page_index": 23,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71817091_0023/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificate of Naturalization, N-550 ( (REV. 11-1-87)Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United Kingdom", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1938]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 No. 14160152 Pelilion No 00822296 ORIGINAL IN Registration no. FOIA (b)(6) Personal,description, of holderus, effection Dale of birth OCTOBER 11, 1938 seen MALE ; complexion MEDIUM coloroboyes BROWN color of hair BLACK sheight 5 feel 8 inches; weight 178 pounds; visible edistendive marks NONE MARRIED Country of formoraulionality UNITED KINGDOM I certify that the description, above given is truse and Heart the photograph.offixed, herelo, is a likeness ofine Wing On Lan / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beitknown, that abatormolthe District bouriof The United States held/pursuantion lawab Los Angeles on JUNE 22ND, 1990 the WING ON LAI them/residingar 751 KATHERINE LANE, ARCADIA, CA inlends loveside permanently in the United States when sorequired by the Naturalization laws of the United States), had in allotherrespects, complied with the applicable provisions of such naturalization laws, and was entilled.lobe Seal admitted liociliseenship such person be and(s)hewas admitted,as, a citizena he United Gales of America, Indestimony 22ND day of JUNE mineteerhundredand NINETY in LEONARD A. BROSNAN Glerk of the U.S. District Court 11 IS PUNISHABLE BY 11 S LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY By freetis Deputy Glerk. FORM N-550 (REV. 11-1-87)Y"
}
