{
  "anumber": "A71807696",
  "id": "A71807696_0057",
  "page_index": 57,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807696_0057/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPUBLICaA DE EL SALVADOR EN LA AMERICA CENTRAL, Serie A"
    },
    "years": {
      "ms_years_nlp_v1": [
        1915,
        1991,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "SERIE \"A\" REPUBLICA DE EL SALVADOR EN LA AMERICA CENTRAL REPUBLICA DE EL SALVADOR EN LA AMERICA CENTRAL OCHENTA COLONES Pasaporte Ordinario Registro/ Register En el nombre de LA REPUBLICA DE EL SALVADOR La Direccion General de Migracion, pide a todas las No 052487 N° 623539 autoridades civiles y militares de los Palses amigos permitir al portador de el presente pasaporte pasar Fecha de expedicion/ Date of issue libremente sin ningún obstaculo y prestarle la 20 de novembre de 1991 debida protección y asistencia siempre que sea necesario. Lugar de expedicion Place of expedition In the name of THE REPUBLIC OF EL SALVADOR, the Department of Immigration requests all Authorities San Fatrador civilian and military of Friendly Countries to allow the bearer of the present passport to pass freely without let or hindrance and to afford the bearer Fecha de Expiracion/ Date of Expiration every assistance and protection which may be necessary. 19 de naviembre de 1996 Autoridad que to expided Expedite By. Divinion OTHERAL Gral. de Migrain INTERNATIONAL PASAPBETES DEPTO. BE SECURITY Maesas Organized Presportes Melima Apellidos/Surnames aguilar Engility No 052487 MENORES QUE LE ACOMPANAN Nombres/Given names Main Emilia Nombre Edad Parentesco NACIONALIDAD SALVADORENA SEXO/SEX Nacimiento Naturalizacion M F Lugar Chuschopany de Nacighiento/Place 12-05-1915 and date of Birth Fecha Domicilio/ Address 6-av. Sun 17.e.P. apartamenton fauchy st. ann Estado civjl Estatura Tipo de sangre Civil Status Height Blood pottern 1,48 Color Ojos Color Pelo Color of yes Color of hair BY BE DEPARTMENT cafes unlicaup En caso de accidente o muerte del titular avisar la misma Huellas Direccion/Address Entragand 2 Firma del Titular 3 Holden's signature"
}