{
	"anumber": "A71807945",
	"id": "A71807945_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: FOIA ( (b)(6), Form Number: Not explicitly mentioned in the visible text, but typically found on the form itself."
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "I have stocks and bonds with the following markernallue! NAS indicated on the attached list FOIA (b)(6 which I certify to be true and correct to the best of my knowledge and belief. $ I have life insurance in the sum of $ With a cash surrender value of $ I own real estate valued at FOIA (b)(6) $ With mortgages or other encumbrances thereon amounting to $ Which is located at FOIA (b)(6 (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me FOIA (b)(6) 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted NONE 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted Efigenia de Jesus Murillo Vda de GUIFARRO Mother 5-18-92 (Complete this block only if the person named in item 3 will be in the United States temporarily.) That I do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly, or for how long.) OATH OR AFFIRMATION OF DEPONENT I acknowledge at that I have read Part III of the Instructions, Sponsor and Alien Liability, and am aware of my responsibilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that I kn FOIA (b)(6) by me and the statements are true and correct. Signature of deponent Subscribed and sworn to (affirmed) before me this 10 day of October 19 92 at Van nuys , CA, OFFICIAL NOTARY SEAL My commission expires on PATRICIA A. TODD June 30, 1995 Notary Public - California Signature of Officer Administering Oath LOS ANGELES COUNTY My Comm. Expires JUN 30,1995 If affidavit prepared by other than deponent, please complete the following: I declare that this do American was prepared by me at the request of the deponent and is based on all information of which I have knowledge. (Signature) (A ddress) (Date)"
}
