{
	"anumber": "A71817091",
	"id": "A71817091_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71817091_0029/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Balance Your Checking Account, FORM 5554 (8/91"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 How To alance Your Checking Account FIRST, start with your Checkbook: 1. List your Checkbook Balance here $ 2. Subtract any service charges or other deductions not previously recorded $ 3. Add any credits not previously recorded, for example interest $ 4. This is your NEW CHECKBOOK BALANCE $ NOW, with your Checking Statement: 1. List your Statement Balance here $ 2. Add any current deposits not shown on this statement $ SUBTOTAL $ 3. List and total all outstanding checks, ATM withdrawals and automatic payments: ATM & Automatic Payments Check # Amount Check # Amount Date Amount TOTAL OF OUTSTANDING CHECKS $ 4. This balance should match your new Checkbook Balance (subtract total outstanding checks from subtotal) $ Both Balances Should Be Equal (2) Describe the error or transfer you are unsure about. and explain as (4) If you need more information describe the item you are unsure about clearly as you can why you believe there is an error or why you need If your account does not balance check the following carefully You do not have to pay any amount in question while we are more information investigating but you are still obligated to pay the parts of your bill that Have you correctly entered the amount of each check in your (3) Tell us the dollar amount of the suspected error. are not in question While we investigate your question we cannot checkbook? We will investigate your complaint and will correct any error promptly report you as delinquent or take any action to collect the amount Do the amounts of your deposits entered in your checkbook agree with If we take more than 10 business days to do this, we will recredit your you question your statement? account for the amount you think is in error. so that you will have use of Have all checks been deducted from your checkbook balance? the money during the time il will take us to complete our investigation Have you deducted all bank charges from your checkbook balance? We ask that you put your complaint or question in writing II you tell US Special Rule for Credit Card Purchases orally. we require that you send us your complaint or question in writing Have you added interest earned on your checking account? within 10 business days If we do not receive it within 10 business days, If you have a problem with the quality of property or services that you Have you carried the correct balance forward from one checkbook we will not recredit your account If we decide that there was no error we purchased with a credit card, and you have tried in good faith to correct register to the next? will send you a written explanation within three business days after we the problem with the merchant you may have the right not to pay the Have you checked all additions and subtractions in your checkbook? finish our investigation You may ask for copies of the documents that we remaining amount due on the property or services There are two Have you forgotten to enter an ATM transaction? used in our investigation limitations on this right (a) You must have made the purchase in your home state or, if not within your home state, within 100 miles of your current mailing address: and (b) the purchase price must have been more Automated Teller Machine Transactions, and Billing Rights Summary than $50 These limitations do not apply if we own or operate the In case of errors or questions about your bill. merchant or if we mailed you the advertisement for the property or Other Electronic Fund Transfers services. In case of errors or questions about your automatic teller machine If you think your bill is wrong, or if you need more information about a transactions or other electronic fund transfers transaction on your bill, write us on a separate sheet at the address shown on the reverse side as soon as possible We must hear from you Telephone or write us as soon as you can at the telephone number or Household Bank is owned by Household International which also no later than 60 days after we sent you the first bill on which the error or address shown on the reverse side il you think your statement or receipt owns Hamilton Investments, a registered broker-daaler. Hamilton problem appeared You can telephone US, but doing SO will not preserve is wrong or if you need more information about a transfer listed on this Investments is a separate corporation from Household Bank and the your rights In your letter. please give us the following information: statement or a receipt We must hear from you no later than 60 days Investments recommended offered and sold by (1) Your name and account number after we sent you the FIRST statement on which the error or problem it are not obligations of, guaranteed by, or (2) The dollar amount of the suspected error. appeared Insured by Household Bank or the FDIC. (3) Describe the error and explain, if you can, why you believe that there (1) Tell us your name and account number is an error. EQUAL HOUSING LENDER Household Bank, I.s.b. is a federal savings bank. Insured by the FDIC. A HOUSEHOLD FORM 5554 (8/91) INTERNATIONAL COMPANY"
}
