{
  "anumber": "A71829679",
  "id": "A71829679_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71829679_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Professional Certified Opinion"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 Applicant Name Alien Registration Number Julia A Lopez A-071 829 679 PROFESSIONAL CERTIFIED OPINION The law requires that in order to be eligible for the disability exception, the applicant must be unable to fulfill the requirements for English proficiency and/or knowledge of U.S. history and civics. An applicant's difficulty in fulfilling the requirements is not sufficient to support a waiver. In addition, illiteracy in the applicant's native language is not sufficient, by itself, to support a finding of inability to learn and/or demonstrate knowledge. 4. English Requirement (a) In your professional opinion, has the impairment(s) described above affected the applicant's functioning to such a degree that he or she is unable to learn and/or demonstrate an ability to speak, read, or write English? Yes No (b) If Yes, which of the following is the applicant unable to learn and/or demonstrate? (Check all that apply) Speaking Reading Writing 5. U.S. History and Civics Requirement In your professional opinion, has the impairment(s) described above affected the applicant's functioning to such a degree that he or she is unable to learn and/or demonstrate knowledge of U.S. history and civics, even in a language the applicant understands? Yes No BACKGROUND INFORMATION 6. Date of your most recent examination of the applicant (mm/dd/yyyy), 12/8/03 7. Is this your first examination of the individual? Yes If Yes, from whom does the applicant usually receive medical care (i.e., name of doctor/clinic; if the applicant does not have an ongoing source of medical care, please write' \"N/A\") No If No, for how long and for what conditions have you been treating the applicant? (If the conditions are the same as in Part II. 2, specify the length of time and write \"Conditions -- Same as Part II. 2' 1. Angina pictoris 2. general Arterialselenosis 4 Neurological myseingand 8. What is the nature of your medical practice? (e.g., family/general practice, internal medicine, psychiatry, cardiology) Medicine carebology I certify, under penalty of perjury under the laws of the United States of America, that the information on the form and any evidence submitted with it are all true and correct. Upon consent of the applicant, I agree to release this applicant's relevant medical records upon request from the U.S. Immigration and Naturalization Service. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to criminal penalites under Title 18, U.S.C. 1546 and civil penalties under 8 Signature U.S.C. Section Whith 1324c. Dharm Date 148103 Type or print the following information: First Name Middle Name Last Name Mohinder S Sohal MD Inc 2105 Beverly Blvd # 227 Business Address Angeles, CA 90057 City, State, ZIP Code Telephone (213) 484-8186 License Number DEA# FOIA (b)(6) FOIA (b)(6) Form N-648 (Rev. 04/09/02)N Page 3"
}