{
  "anumber": "A71807945",
  "id": "A71807945_0058",
  "page_index": 58,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0058/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICACION, 4 4 4 568137"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1991,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 ORAY PRIMERA CLASE UN LEMPIRA 1988-1991 No 4568137 1 CERTIFICACION 2 El infrascrito Registrador Civil Municipal CERTIFICA?, que en el 3 libro de matrimonios del año 1942 se encuentra el acta de matri- 4 monio # 00002 a folio 24/25 del tomo # 7 y que pertenece a: Mi- - 5 guel Guifarro y Efigenia Murtllo 6 En salamá a los cinco dias del mes de febrero de mil novecientos 7 cuarenta y dos. - Constituido el alcalde municipal en casa de Za- 8 carias Murillo sita en este pueblo a las 4 p.m. con los testigos GENERAL Manuel Dominguez y Ramiro Obando, presentes los contrayentes don HOMELAND CONTRALOR DE G 10 STATE Miguel Guifarro de veinte y nueve años de edad, soltero, labrador HONDURAS- vecino de este pueblo hijo legitimo de Paulino Guifarro y Domiti- 12 la Escalante(ya difuntos) y señorita Efigenia Murillo de veinte HACIENDA DE GROUND SECURITY 136 y ocho años de edad, soltera, de oficios domesticos, vecina de es- te pueblo hija legitima de Zacarias Murillo y Efigenia Obando; Honduras, 15 y dijerón que desean se proceda a la celebración del matrimonio CENTRAL DAG que tienen solicitado.- no habiendo incombeniente para efectuar- SECURITY lo el secretario dio lectura a los articulos 97,98,99 del codigo * AMERICA 18 civil.- acto seguido el alcalde municipal interrogo a cada uno 19 ITEMS de los contrayentes en la siguiente forma.- señor Miguel Guifa- 20 rro i quereis por esposa a la señorita Efigenia Murillo? contes- 21 to i si quieroi. . - señorita Efigenia Murillo ¿ quereis por esposo 22 al señor Miguel Guifarro? contesto isi quieroi en seguida el al- - 23 calde pronuncio las siguientes palabras\" quedais unidos en matri - 24 monio civil en nombre de la ley\" se firma la presente acta por 25 ante el secretario que da fe."
}