{
	"anumber": "A71817091",
	"id": "A71817091_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71817091_0024/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INTERNATIONAL CERTIFICATE OF VACCINATION OR REVACCINATION AGAINST SMALLPOX, C N° 602907"
		},
		"years": {
			"ms_years_nlp_v1": [1910, 2023, 1978]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 Proof of Applicant's C No 602907 HONG KONG MEDICAL ASSOCIATI birth date HONG KONG INTERNATIONAL CERTIFICATE OF VACCINATION OR REVACCINATION AGAINSI SMALLIVA CERTIFICAT INTERNATIONAL DE VACCINATION OU DE REVACCINATION CONTRE LA VARIOLE This is to certify that Je soussigné(e) certifie que Po Kam young date of birth né(e) le 25.11.1910 sexe sex } Female whose signature follows dont la signature suit E/E tx P jay has on the date indicated been vaccinated or revaccinated against smallpox with a freeze-dried or liquid vaccine certified to fulfil the recommended requirements of the World Health Organization. a été vacciné(e) ou revacciné(e) contre la variole à la date indiquée ci-dessous, avec un vaccin lyophilisé ou liquide certifié conforme aux normes recommandées par l'Organisation mondiale de la Santé. Show by \"X\" whether- Signature and professional Manufacturer and status of vaccinator batch No. Approved stamp Date Indiquer par \"X\" s'il of vaccine Cachet s'agit de- Signature et titre Fabricant du vaccin autorisé du vaccinateur et numéro du lot 1 Primary vaccination Primovaccination 1 (a) performed (a) (a) effectuée (b) read as successful prise 1 or/ou (b) (b) unsuccessful pas de prise Hathological w 2 Honk 2 5 MAY 1978 Revaccination X APPROVED Tomo LOSS A Kung. SLAMP Batch No76.05 NO, 543 a 3 3 Revaccination The validity of this certificate shall extend for a period of three years, beginning eight days after the date of a successful primary vaccination, or, in the event of a revaccination, on the date of that révaccination. The approved stamp mentioned above must be in a form prescribed by the health administration of the territory in which the vaccination is performed. This certificate must be signed by a medical practitioner in his own hand, his official stamp is not an accepted substitute for the signature, Any amendment of this certificate, or erasure, or failure to complete any part of it, may render it invalid. La validité de ce certificat couvre une periode de trois ans commencant huit jours après la date de la primovaccination effectuée avec succes (prise) ou, dans le cas d'une revaccination, le jour de cette revaccination. Le cachet d'authentification doit étre conforme au modele prescrit par l'administration sanitaire du territoire ou la vaccination est effectuée. Ce certificat doit Tetre signé par. un medeein de sa propre main, son cachet official ne pouvant etre considéré comme tenant lieu de signature. Toute correction ou rature. sur le certificat ou entions qu'il comporte peut affecter sa validité. Exhibit 2"
}
