{
	"anumber": "A71807945",
	"id": "A71807945_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition to Remove the Conditions on Residence, 1115-01445"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 CQ6 111992 U.S. Department of Justice OMB No. 1115-0145 Immigration and Naturalization Service Petition to Remove the Conditions on Residence START HERE - Please Type or Print FORINS USE ONLY Returned Receipt Part 1. Information about you. Family FOIA (b)(6) Given FOIA (b)(6) FOIA (b)(6) Middle Name Name Initial Address - C/O: Resubmitted FOIA (b)(6) Street Numbe Apt. and Name # NONE Cit State or FOIA (b)(6) Reloc Sent FOIA (b)(6) Province Country ZIP/Postal U.S.A FOIA (b)(6) Code Date of Birth (month/day/year) FOIA (b)(6) Country of Birth FOIA (b)(6) Reloc Rec'd Social Security # FOIA (b)(6) A # FOIA (b)(6) Conditional residence expires on (month/day/year) FOIA (b)(6) Applicant Interviewed Mailing address if different from residence in C/O: N/A Street Number Apt and Name # City State or Province Remarks Country ZIP/Postal Code Part 2. Basis for petition (check one). a. My conditional residence is based on my marriage to a U.S. citizen or permanent resident, and we are filing this petition together. b. 1 am a child who entered as a conditional permanent resident and I am unable to be included in a Joint Petition to Remove the Conditional Basis of Alien's Permanent Residence (Form I-751) filed by my parent(s). Mv conditional residence is based on my marriage to a U.S. citizen or permanent resident, but I am unable to file a joint petition and I request a waiver because: (check one) C. My spouse is deceased. d. I entered into the marriage in good faith, but the marriage was terminated though divorce/annulment. e. I am a conditional resident spouse who entered in to the marriage in good faith, or I am a Action conditional resident child, who has been battered or subjected to extreme mental cruelty by my citizen or permanent resident spouse or parent. f. The termination of my status and deportation from the United States would result in an extreme hardship. Part 3. Additional information about you. a Other names used (including maiden name): Telephone FOIA (b)(6) FOIA (b)(6) 12/1994 Date of Marriage FOIA (b)(6) Place of Marriage FOIA (b)(6) If your spouse is deceased, give the date of death (month/day/year) To Be Completed by Attorney or Representative, if any Are you in deportation or exclusion proceedings? Yes No Fill in box if G-28 is attached to represent the applicant Was a fee paid to anyone other than an attorney in connection with this petition? Yes No VOLAG# ATTY State License # Form I-751 (Rev. 12-4-91) Continued on back."
}
