{
	"anumber": "A71807945",
	"id": "A71807945_0011",
	"page_index": 11,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0011/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT ( (FINGERPRINTS)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT (FINGERPRINTS) APPLICANT NAME: EFICENIA MIRILLO FILE NO 07/ fo? 965 DATE DE CUFFRRU DEC 8 1998 EXECUTED AT FAST VALLEY - M. HOLLYWOOD, as officer of the U.S. Immigration and Naturalization Service: CENTROSO /. TOCODO PM Before the following (NAME AND TITLE) SPANISH language. Interpreter ASTRID 2. FISHBEIN used. in the I, EFIGENIA MURILLO DE GalFaRRo acknowledge that the above named officer has identified himself/herself to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He/she has informed me the he/she desires to take my sworn statement regarding: M-400 over 75YRS OLD He/she has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: Q. What is your true, full and complete name? A. EFIGENIA MURILLO DE GUIFFRRO Q. What is your place and date of birth? A. HONDURAS- 07-14-1913 Q. Have you ever been arrested or detained by a law enforcement officer? A. xo Q. Have you had your fingerprints taken for any reason by a law enforcement officer? A. xw H Have you ever been issued a ticket or been taken into custody by a law enforcement officer? NO Q. Have you ever been ordered by a court to: pay a fine; go to jail; serve a probationary sentence; perform community service; make restitution; or have your wages garnished (e.g., for failure to make child support payments)? A. NO Q. Have you ever received an expungement, parole, pardon, or successfully completed a diversion or rehabilitation program? A. 100 Q. If you have answered \"yes\" to any of the above questions, please explain below: A. NIA I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking. WITNESS BY: BY! Custrid Fishe Signature of Applicant X EFICEMIN MURILLO Do CUITFRED 8th day of DECEMBER 9 19 98 , Sworn and subscribed before me: & Taleds - Dro SHallin Signature INS Officer Signature of Witness (Rev. 11/1/98)"
}
