{
	"anumber": "A71807696",
	"id": "A71807696_0008",
	"page_index": 8,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807696_0008/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1992, 4675, 2023, 1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 U.S. Depa ment of Justice OMB 1115-0009 Immigration and Naturalization Servic Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. 2 Receipt Family AGUILAR GONZALEZ Given Name Name Maria Middle EMILIA n Initial U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 3142 VERA AVENUE # City County LOS ANGELES LOS ANGELES State ZIP CALIFORNIA 90034 Reloc Sent Code Date of Birth Country (month/day/year) 05-05-15 of Birth EL SALVADOR Social A Security # 613-62-0609 # 071807696 Reloc Rec'd Part 2 Basis for Eligibility (check one). a. I have been a permanent resident for at least live (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S 12/8/98 and have attached completed Forms N-426 and G-325B At interview C Other (Please specify section of law) request naturalization ceremony at 10/12/99 Part 3. Additional information about you. Remarks ,Name commectibly Date you became a permanent Port admitted with an immigrant visa or INS Office 314MARA GONZA LEZ\" MARIA EMILIA AGULLAR resident (month/day/year) where granted adjustment of status NOVEMBER 18, 1992 LOS ANGELES IRO e Citizenship SALVADORIAN 11/18/1992 WR821 UWE WOB 12/8/98 Name on alien registration card (if different than in Part 1) NG48 acceptid/pain NONE SAME Other names used since you became a permanent resident (including maiden name) NONE NoNe Sex Male Height Marital Status: Single Divorced Female 5'0\" Married Widowed Can you speak read and write English ? No Yes ARC:8/R Action Absences from the U.S.: APPROVED Have you been absent from the U.S. since becoming a permanent resident? No Yes INS DISTRICT DIRECTOR If you answered \"Yes\" complete the following Begin with your most recent absence If you need more room to explain the reason for an absence or to list more trips, continue on separate paper his JAN 12 1999 Did absence last Reed ommended by: Date/left U.S. Date returned 6 months or more? Destination Reason for trip phil other LOS 4675 NONE Yes No Yes No To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev 07/17/91)N Continued on back."
}
