{
  "anumber": "A71829679",
  "id": "A71829679_0101",
  "page_index": 101,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71829679_0101/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TEST REQUISITION ( (REV 8/92) 80121, TEST REQUISITION FORM"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 AV MetWest 18408 OXNARD STREET Clinical TARZANA, CA 91356 DIRECT ND PATHOLOGIST Laboratories 18) 996-7300 CALIF. (800) 339-4299 PAUL T. RTLAKE, M.D. STAT (ADDITIONAL FEE FOR PICK-UP) LOCAL ROUTE 004 RC ( ) - PARK PLACE MED CTR. CALL RESULTS IN A.M. (NO ADDITIONAL FEE) 3400 E. FLORENCE AVENUE ( ) - HUNTINGTON PARK, CA 90255 FAX RESULTS 213-582-8425 90414 ( ) - PLEASE PRINT CLEARLY ALL INFORMATION MUST BE PROVIDED OR ACCOUNT WILL BE BILLED. PATIENT'S LAST NAME FIRST AGE JUINA M.I. D.O.B. SEX SOCIAL SECURITY/I.D NO. LOVER / / REFERRING PHYSICIAN DATE COLLECTED M F LANDONS / OTHER I.D. DRAW TIME ROOM NO. URINE VOL. 24 HRS. FASTING RANDOM HRS. PP Put ML. COMPLETE FOR ALL BILLING TYPES COMPLETE FOR ALL THIRD PARTY BILLING BILL TO: OUR ACCOUNT PATIENT INSURANCE IPA/HMO MEDICARE MEDICAL/CAID (Please attach copy of P.O.E. Sticker) RESPONSIBLE PARTY INSURANCE COMPANY DOB / / ADDRESS ADDRESS CITY/STATE/ZIP CODE CITY/STATE/ZIP CODE PHONE NO CERTIFICATE NO. GROUP NO. ( ) - ICD9 CODE (DX) (SEE BACK) MEDICAID/MEDICARE NO. STATE DIAGNOSTIC PROFILES (PLEASE MARK BOX FOR DESIRED PROFILES) 2211 CHEMPANEL S 5015 ARTHRITIC (RA, CRP, ESR. ASO, URIC ACID. Ca., PHOS.) S.L 6272 COMPREHENSIVE HEPATITIS B PROFILE (SEE BACK) S 2312 CHEMPANEL TM* T, S 2817 ARTHRITIC (5015, ANA FLOURESCENT) S.L 7010 COMPREHENSIVE HEPATITIS PROFILE (6272, HEP. C) S 2402 CHEMPANELTM* CBC S.L 5050 CHD RISK (CHOL, TRIG, HDL/LDL. APO A1/B, LIPID SCORE) S 5020 LIVER PROF. 1 (HEPATIC CHEMISTRIES) S 3000 CHEMPANELTM* CBC. T S.L 2806 CHD RISK (5050, LIPID PHENOTYPE) S 5033 LIVER PROF. 2 (5020, HEP B SURFACE ANTIGEN) S 2403 CHEMPANEL CBC. UA S.L.U 6726 DIABETIC PROFILE (GLYCOHEMOGLOBIN, GLUCOSE PBG) S.L 2691 COMP. EPSTEIN BARR PROFILE (SEE BACK) S 3976 CHEMPANEL CBC, UA. T3U, T RIA, T, S.L.U 5009 ELECTROLYTE PROFILE (Na, K. CHLORIDE CO2) S 5335 COMPREHENSIVE LUPUS PROFILE (SEE BACK) S 2372 CHEMPANEL™ CBC. UA. RPR. T3U, T, RIA, T1 S.L.U 5005 THYROID PROFILE #1 (T3U, T, RIA, T7) S 1855 HIV (ANTIBODY WESTERN BLOT REFLEX) S 6311 CHEMPANEL W/O HDL, LDL. PBG. TIBC OR REFLEX FERRITIN S 2642 HYPOTHYROID PROFILE (T3U, T, RIA, T7, HS-TSH) S 3659 CHLAMYDIA & GONORRHEA PROFILE (DNA PROBES) .. 3279 ANEMIA PROFILE (FOLIC ACID, VIT. B12 CBC) S.L 3416 INITIAL DIAGNOSTIC HEPATITIS PROFILE (SEE BACK) S 3347 PRENATAL #1 (W/IRREG. ANTIBODY SCREEN) S.L.YB 3341 ANEMIA PROFILE (3279, FERRITIN, TIBC, RETIC. COUNT) S.L 6825 INITIAL HEPATITIS ABC PROFILE (3416, HEPATITIS C) S 5704 PRENATAL #2 ( 3347 W/HEP B SURFACE ANTIGEN) S.L.YB MICROBIOLOGY INDIVIDUAL TESTS (PLEASE MARK BOX FOR DESIRED TEST(S)) SEE BACK FOR SPEC. REQ 0395 ACID PHOSPHATASE TOTAL FS 0311 ELECTROPHORESIS PROTEIN S 8885 LYME DISEASE AB S 0320 RUBELLA S 0388 CHLAMYDIA DNA PROBE 0833 ACID PHOSPHATASE RIA (P.A.P.) FS 0832 FERRITIN S 8224 LH S 0380 RPR S 0420 GONORRHEA. DNA PROBE 0108 AMYLASE S 0650 FSH S 0246 MONO SPOT S 0327 SED. RATE L 3659 CHLAMYDIA & GC DNA PROBE 0611 ANA FLUORESCENT 0512 FOLIC ACID S 0291 OCCULT BLOOD .. S 0622 T3 BY RIA S 0234 GRAM STAIN 0822 BETA HCG, QUANT. S 0535 GLUCOSE FASTING Gy 0777 PHENOBARBITAL R 0353 T RIA (THYROXINE) S 0292 OVA & PARASITES 0360 BLOOD TYPE/RH YB 0780 GLUCOSE RANDOM Gy 0309 PT B 1357 FREE T S 1354 UREA/MYCOPLASMA CULTURE 0132 BUN S 1387 HELPER/SUPRESSOR T-CELL YA,L 0296 PTT B 8455 TESTOS. TOTAL S 0100 CULTURE/SENS. GENITAL ROUT. 0129 CBC W/PLATELET COUNT L 0967 HERPES I, IGG, SERUM S 0556 PREGNANCY QUAL S 0671 HS-TSH S 1378 CULTURE HERPES 0387 CEA S 0968 HERPES II, IGG, SERUM S 5013 PREMARITAL, FEMALE S 0823 THEOPHYLLINE S 0100 CULTURE/SENS.. URINE ROUT. 0151 CHOLESTEROL S 0560 HDL CHOLESTEROL S 0308 PREMARITAL, MALE S 0372 URIC ACID S 0100 CULTURE STOOL 0785 CORTISOL S 0672 HEP B SURFACE ANTIGEN S 0306 POTASSIUM S 0218 UA W/MICRO U 0486 CULTURE THROAT, BETA-STREP 0160 CREATININE SERUM S 0467 HEPATITIS C ANTIBODY S 0858 PROGESTERONE S 0119 VIT B12 S 0100 CULTURE/SENS. THROAT ROUT. 0841 CYTOMEGALOVIRUS (CMV) IGG S 1855 HIV (ANTIBODY) S 8040 PROLACTIN S 0100 CULTURE/SENS. ROUT. 0118 DIGOXIN S 0257 IRON AND TIBC S 2422 MALE PAP & PSA FS 0223 DILANTIN S 0510 LITHIUM R 0316 RA FACTOR S SOURCE: CUSTOM PROFILES & ADDITIONAL TESTS - PLEASE CIRCLE DESIRED PROFILE(S) TEST NUMBER(S) 2046 *The MetWest CHEMPANEL is customized for each client. The standard CHEMPANEL includes Protein Bound Glucose, TIBC, Percent Transferrin Saturation, LDL/HDL Determinations and Reflex Ferritin when requested by the client and TIBC and/or percent Transferrin Saturation is outside established normal limits. S = Spun. Barrier Tube R Red Top (no gel) Gn = Green Top Lavender Top (For CBC, inc. Blood Smear) YA Yellow Top (ACDA) = See Reference Manual) FS Frozen Serum B Blue Top Gy Grey Top U = Random Urine YB Yellow Top (ACDB) FL = Frozen Lavender FPL = Frozen Plasma 24U 24 Hour Urine TEST REQUISITION (REV 8/92) 80121"
}