{
  "anumber": "A71807945",
  "id": "A71807945_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Certification for Disability Exceptions, NARA# 1115-0205"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 U.S. Department of Justice OMB# 1115-0205 Immigration and Naturalization Medical Certification for Disability Exceptions Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please print or type information) Last Name First Name Middle Name Social Security Number MURILLO FIGENIA DE JESUS 625-60-9380 Address Alien Number 8327 CORBIN AVE. A071807945 City State ZIP Code CANOGA PARK CAL IFORNIA 91306 Telephone Number Date of Birth Sex (818) 886-8443 JULY 14, 1913 FEMALE I, EFIGENIA MURILLO authorize, DANIEL BERDAKIN, M.D. (Applicant's Name) (Licensed medical doctor or licensed clinical psychologist) to release all relevant physical and mental health information related to my medical status to the INS for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty or perjury pursuant to Title 8 U.S.C. Section 1746, that the information on the form and any evidence submitted with it is all true and correct. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. section 1324c. Signature Date 7-29-97 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception- from the English language and U.S. history and civics tests required of applicants for naturalization. The Immigration and Naturalization Service's regulations require that applicants for an exception based on disability submit this certification form, completed by a licensed medical doctor or licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complete words and phrases. proge, 1. Date of your most recent examination of the applicant JULY 29 19.97 2. Is this your first examination of the individual? Yes XXX No If yes, who is the regular attending physician? N/A 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, in your professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English language and/or history and civics. Describe in detail. If applicant has a mental disability or impairment, please provide DSM diagnosis. SECURITY PATIENT HAS SEVERE ALZHEIMER'S DISEASE, SECONDARY TO CEREBROVASCULAR DISEASE, CHRONIC HYPERTENS ION, CHRONIC VENOUS INSUFFICIENCY, BOTH LOWER EXTREMITIES. ALZHEIMER'S DISEASE : IT IS A DISEASE WHICH IMPAIRS THE PERSON'S ABILITY TO USE THEIR SKILLS AND IMPAIRS THE IR MEMORY. IT'S VERY DIFFICULT FOR SOMEONE TO RETAIN ANY INFORMATION."
}