{
  "anumber": "A71807945",
  "id": "A71807945_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4 (Rev 07/19)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 U.S. Department of Justice CBD OMB 1115-0009 Immigration and Naturalization Servi. Mn 639 , Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Name MURILLO de Name Given EFIGENIA Middle Initial U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 8327 CORBIN AVE # City CANOGA PARK County LA Amples State CAL Code ZIP Reloc Sent 0050 001 003 09/10/97 13:19 N400 95.00 Date of Birth Country (month/day/year) 7-14-13 of Birth HONDURAS Social A Security 625-60-9580 # 071807945 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. 12-8-98 and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Date you became a permanent Port admitted with an immmigrant visa or INS Office Remarks over75 resident (month/day/year) 11-17-92 where granted adjustment of status, LOS Ind 3c() Citizenship HONDURAS Name on alien registration card (if different than in Part 1) MURILLO DE GUIFARRO, EFIGENIA Other names used since you became a permanent resident (including maiden name) Sex Male Height plan (the 58 Marital Status: Single Divorced Female Married Widowed Can you speak, read and write English ? No Yes. Action and APPROVED Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes If you answered \"Yes\" , complete the following. Begin with your most recent absence. If you DEC 8 1998 need more room to explain the reason for an absence or to list more trips, continue on separate paper. Fold Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip 8200 9.94 9-94 Yes No Handwrew Vacotion To Be Completed by Yes No Yes No (I/ Attorney or Representative, if any (I) 2 Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No Matthe (16) ATTY State License # Form N-400 (Rev 07/17/91)N Continued on back."
}