{
  "anumber": "A71833821",
  "id": "A71833821_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71833821_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certification of Birth Certificate Translation, Form Number 138C"
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 The Underwritten Director of the Civil Registry Office from this city. Certifies: In page 104; from the supplemental book of birth certificates in 1971; you will find as is written: Birth Certificate number one hundred and three. Book \"F\" a preceding from the Third Court of Justice from this District. The person concerned has presented to this Municipal Office, the executory of the jedgement was pronounced by the court of judgement, on the Eleventh hour from the Nineth of August of Nineteen Seventy One and the veridict of judgement was on the Sixteen of August of Nineteen Hundred and Seventy One at 8:00 am, in which says: Josue Benjamin Vides Moreno, son of Benjamin Vides Trujillo and Margarita Moreno whose civil matrimony took place at the same time their son was born in this city on the Twenty Six of November of Nineteen Forty Seven. Municipal Office: Santa Ana, Twenty Four of August of Nineteen Seventy One. Federico Antonio Escobar P., Director of the Civil Registry. RUBRICATED, and is written as follows: According to Article #138C. Josue Benjamin Vides Moreno united in marriage with Delmy Del Carmen Ferrufino Gomez, before the oficial from the government of San Salvador on the Eleventh of October of Nineteen Seventy Two in Santa Ana o Written and signed on the book of Records on the Third of November of Nineteen Seventy Two by Jose Tovar. This was compared against the original article 307C. This was issued on the Civil-Registry Office. Municipal Office: Santa Ana, Sixteen of November of Nineteen Eighty Two. Signed By: Jose Gonzalo Fajardo Mendoza Francisco Rene Padilla Castro Director, Civil Registry Assistant Director, Civil Registry KAD I certify that this is a true and correct translation from Spanish to English 3/22/83 Band COUNTY OF LOS ANGELES ) ) STATE OF CALIFORNIA )"
}