{
  "anumber": "A71807945",
  "id": "A71807945_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "East Valley Multipurpose Center Citizenship & Immigration Service, N648"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 EAST VALLEY MULTIPURPOSE CENTER (Sif) 909-0412 CITIZENSHIP & IMMIGRATION SERVICE Valley A PROGRAM OF VALLEY INTERFAITH COUNCIL Intertaith Council THIS IS YOUR APPOINTMENT FOR YOUR I.N.S. INTERVIEW This letter is to inform you of your upcoming interview with the Immigration and Naturalization Service. The Immigration Officers will be doing your interview at: Efigenia Murillo East Valley Multipurpose Center 8327 Corbin Ave. 5000 Colfax Ave. Canoga Park, Ca 91306 N. Hollywood, CA 91601 A# 071807945 The time and date of your interview is DEC 08 1998 09 A.M. Please arrive at least 15 minutes early. Spanshi. You Are Required To Bring The Following With You: # This letter # Your Resident Alien Green Card. # Your California drivers license or ID card # Your Citizenship Test Certificate if you took the written test. Otherwise the officer will give you the oral test. # \"IF\" you require a doctors letter, please bring the enclosed Form N648, completed by your own personal physician. The form should ONLY be TYPED or PRINTED. \"IF\" You Previously Submitted a Doctors Letter and It Was NOT Written on This New Government Form, You MUST Return to Your Doctor to Have Him Fill it out Before You Arrive for Your Interview. # Any other documents which may pertain to your application, such as court disposition, selective service number, evidence of three years marriage, or other documents suggested by your counselor when you first filed your application. ALSO 1. If you require an interpreter, one will be provided for a nominal fee of $20.00. You are not allowed to bring your own interpreter. Please call ahead to let us know what language you will need. 2. If you do not drive, you may only bring ONE person with you. 3. Children are NOT allowed at this interview. 4. There are TWO parking lots. Park FREE in either lot. 5. Effective August 24, 1998, INS has declared that anyone missing their first interview for ANY reason, will NOT recieve a second interview unless they file a \"motion to re-open\" within 30 days. If this happens to you, you should contact us immediately \"after\" your scheduled interview date to file the appeal for you. Otherwise, you will have to start your application all over again. 6. There will be a $20.00 charge in the event we are able to get INS to excuse your absense and give you a second interview THANK YOU FOR YOUR FULL COOPERATION (818) 761-7395 Fax: (818) 763-3927"
}