{
  "anumber": "A71807945",
  "id": "A71807945_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0037/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Permanent Residence"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/21/2023 U.S. Department of Justice OMB # 1115-0053 Immigration and Naturalization Service (INS) Application for Permanent Residence DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp APPROVED Fee Stamp A# INS DISTRICT DIRECTOR G-28 or Volag# NOV 17 1992 Section of Law Recommended by: effected Eligibility Under Sec. 245 Sec. 209(b), INA Approved Visa Petition Sec. 214(d), INA LOS Dependent of Principal Alien Sec. 13, Act of 9/11/57 Special Immigrant Sec. 245, INA Other Sec. 249, INA Country Chargeable Preference 0032 001 R 1 05/18/92 8:38 1485 120.00 A. Reason for this application I am applying for lawful permanent residence for the following reason: (check the box that applies) 1. An immigrant visa number is immediately available to me because A visa petition has already been approved for me (approval notice is attached) A visa petition is being filed with this application 2. I entered as the fiance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are attached) 3. I am an asylee eligible for adjustment 4. Other: B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? MURILLO Vda. De GUIFARRO Efigênia de Jesus 12-02-84 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 8327 Corbin Ave Houston, Texas (Town or City) (State/Country) (ZIP/Postal Code) 13. What means of travel did you use? (Plane, car, etc.) Canoga Park, CA/ 91306 Plane 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? Salama Olancho, Honduras Yes No 4. Date of Birth 5. Sex 6. Marital Status 15. In what status did you last enter the U.S.? (Mo/Day/Yr) (Visitor, student, exchange alien, crewman, temporary worker, Male Married Single without inspection, etc.) 07-14-13 Female Widowed Divorced B-2 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure Record (Form I-94). 9. Country of Citizenship MURILLO Obando, Efigenia 17. Arrival/Departure Record (1-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? Yes No 0 4 3 82 9 1 5 011459 (If Yes, give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date (Mo/Day/Yr) Tegucigalpa, Honduras 06-07-84 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) Miguel de los Santos GUIFARRO- Escalante Honduras deceased 21. Has your husband/wife ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned FORM I-485 (REV. 2-27-87)N"
}