{
	"anumber": "A71817091",
	"id": "A71817091_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71817091_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "RESIDENTIAL APPRAISAL REPORT, Fannie Mae Form 1044"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 9/13/2023 Property Description & Analysis UNI RESIDENTIAL APPRAISA REPORT File Ng HEIEFNENE Property Address 751 KATHERINE Census Tract 430L LENDER DISCRETIONARY USE City ARCADIA County LOS ANGELES State CA. Zip Code 91006 Sale Price $ Legal Description 2 TR 32584 APN 5769-026-026 Date Owner/Occupant LAI/OWNER Map Reference 28-C3 Mortgage Amount $ Sale Price $ N/A Date of Sale N/A PROPERTY RIGHTS APPRAISED Mortgage Type Loan charges/concessions to be paid by seller $ N/A Fee Simple Discount Points and Other Concessions R.E. Taxes $ 2,399.05 Tax Year 91 HOA $/Mo. N/A Leasehold Paid by Seller $ Lender/Client ENTRUST FINANCIAL Condominium (HUD/VA) 5911 CLOVERLY AVE.. TEMPLE CITY, CA De Minimis PUD Source LOCATION Urban Suburban Rural NEIGHBORHOOD ANALYSIS Good Avg. Fair Poor BUILT UP Over 75% 25-75% Under 25% Employment Stability GROWTH RATE Rapid Stable Slow Convenience to Employment PROPERTY VALUES Increasing Stable Declining Convenience to Shopping DEMAND/SUPPLY Shortage In Balance Over Supply Convenience to Schools MARKETING TIME Under 3 Mos. 3-6 Mos. Over 6 Mos. Adequacy of Public Transportation PRESENT LAND USE % LAND USE CHANGE PREDOMINANT SINGLE FAMILY HOUSING Recreation Facilities Single Family 100 Not Likely OCCUPANCY PRICE AGE $ (000) Adequacy of Utilities (yrs) 2.1 Family Likely Owner Property Compatibility X Multi-family In process Tenant 270 Low 91 Protection from Detrimental Cond. Commercial To: Vacant (0.5%) 980 High 43 Police & Fire Protection Industrial Vacant (over 5%) Predominant General Appearance of Properties Vacant 500 - 39 Appeal to Market Note: Race or the racial composition of the neighborhood are not considered reliable appraisal factors. COMMENTS: ( SEE ATTACHED ADDENDUM. ) Dimensions 100 X 100 Topography LEVEL Site Area 10,000 +/- SQ. FT. Corner Lot NO Size TYPICAL Zoning Classification SINGLE FAMILY RESID. Zoning Compliance YES Shape RECTANGULAR HIGHEST & BEST USE: Present Use YES Other Use Drainage ADEQUATE UTILITIES Public Other SITE IMPROVEMENTS Type Public Private View NONE Electricity Street ASPHALT Landscaping GOOD Gas Curb/Gutter CONCRETE Driveway CONCRETE Water Sidewalk CONCRETE Apparent Easements UTILITY Sanitary Sewer Street Lights ELECTRIC FEMA Flood Hazard Yes* No * Storm Sewer Alley NONE FEMA* Map/Zone 06543-0856B / D COMMENTS (Apparent adverse easements, encroachments, special assessments, slide areas, etc.): SUBJECT SITE BACKS TO FOOTHILL BLVD & IS LOCATED 1 BLOCK FROM FOOTHILL FRWY. MODERATE BLVD NOISE OBSERVED. FRWY NOISE IS SUFFICIENTLY BUFFERED. APPRAISER WAS NOT FURNISHED TITLE REPORT. GENERAL DESCRIPTION EXTERIOR DESCRIPTION FOUNDATION BASEMENT INSULATION Units 1 Foundation CONCRETE Slab CONCRETE Area Sq. Ft. NONE Roof Stories 1 Exterior Walls STUCCO Crawl Space NONE % Finished Ceiling AVER Type (Det./Att.) DET. Roof Surface WD. SHAKE Basement NONE Ceiling Walls AVER Design (Style) CONV. Gutters & Dwnspts. ADQ. DVRHG Sump Pump NONE Walls Floor Existing YES Window Type ALUM SLDR Dampness NONE Floor None Proposed NO Storm Sash NONE Settlement NONE Outside Entry Adequacy AVER X Under Construction NO Screens YES Infestation Energy Efficient Items: Age (Yrs.) 16 Manufactured House NO NO OBVIOUS SIGN Effective Age (Yrs.) 10 INFESTATION NONE ROOMS Foyer Living Dining Kitchen Den Family Rm. Rec. Rm. Bedrooms # Baths Laundry Other Area Sq. Ft. Basement Level 1 X 1 1 1 1 4 2 2344 Level 2 Finished area above grade contains: 8 Rooms; 4 Bedroom(s); 2.0 Bath(s); 2344 Square Feet of Gross Living Area SURFACES Materials/Condition HEATING KITCHEN EQUIP ATTIG IMPROVEMENT ANALYSIS Good Avg. Fair Poor Floors CPT./GOOD Type FAU Refrigerator None Quality of Construction Walls DRYWALL/GOOD Fuel GAS Range/Oven Stairs Condition of Improvements Trim/Finish WOOD/GOOD Condition GOOD Disposal Drop Stair Room Sizes/Layout Bath Floor CARPET/GOOD Adequacy GOOD Dishwasher Scuttle Closets and Storage Bath Wainscot TILE/GOOD GOOLING Fan/Hood Floor Energy Efficiency Doors WD/HOLLWCORE Central YES Compactor Heated Plumbing-Adequacy & Condition INTERIOR, SOLID Other NONE Washer/Dryer Finished Electrical-Adequacy & Condition EXTERIOR/GOOD Condition GOOD Microwave Kitchen Cabinets-Adequacy & Cond. Fireplace(s) BRICK AdequacyGoo Intercom Compatibility to Neighborhood CAR STORAGE: Garage X Attached Adequate House Entry Appeal & Marketability No Cars 2 Carport Detached Inadequate Outside Entry Estimated Remaining Economic Life 55-60 Yrs. Condition GOOD None Built-In Electric Door Basement Entry Estimated Remaining Physical Life 60-65 Yrs. Additional features: COVERED PATIO. TILE ENTRY, FORMAL DINING ROOM, HARDWOOD CABINETS IN KITCHEN AND BATHS, TILE COUNTER TOPS IN KITCHEN, CULTURED MARBLE COUNTER TOPS IN BATHS. Depreciation (Physical, functional and external inadequacies. repairs needed, modernization, etc.): NO PHYSICAL OR FUNCTIONAL INADEQUACIES. EXTERNAL QBSOLESCENCE NOTED FOR TRAFFIC NOISE. SUBJECT HAS HAD GOOD CARE AND MAINTENANCE. General market conditions and prevalence and impact in subject/market area regarding loan discounts, interest buydowns and concessions: CONVENTIONAL FINANCING IS AVAILABLE. LOCAL MARKET CONDITIONS CONSTITUTE HEALTHY SUPPLY AND DEMAND RELATIONSHIPS. Freddie Mac Form 70 10/86 10Ch. DS Forms and Worms Inc., 315 Whitney Ave., New Haven, CT 06611 1(800) 243-4545 Item #130810 Fannie Mae Form 1004 10/86"
}
