{
  "anumber": "A71829679",
  "id": "A71829679_0058",
  "page_index": 58,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71829679_0058/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/25/2023 Department of Homeland Security U.S. Citizenship and Immigration Services N-652, Naturalization Interview Results A#: 71 829679 10 2005 On , you were interviewed by USCIS officer S.M.Kim You passed the tests of English and U.S. history and government. You passed the tests of U.S. history and government and the English language requirement was waived. USCIS has accepted your request for a Disability Exception. You are exempted from the requirement to demonstrate English language ability and/or a knowledge of U.S. history and government. You will be given another opportunity to be tested on your ability to speak/ read/ write English. You will be given another opportunity to be tested on your knowledge of U.S. history and government. Please follow the intructions on Form N-14. USCIS will send you a written decision about your application. You did not pass the second and final test of your English ability/ knowledge of U.S. history and government. You will not be rescheduled for another interview for this Form N-400. USCIS will send you a written decision about your application. A) Congratulations! Your application has been recommended for approval. At this time it appears that you have established your eligibility for naturlaization. If final approval is granted, you will be notified when and where to report for the Oath Ceremony. B) A decision cannot yet be made about your application. It is very important that you: Notify USCIS if you change your address Come to any scheduled interview. Submit all requested documents. Send any questions about this application in writing to the officer named above. Include your full name, Alien Registration Number (A#,) and a copy of this paper. Go to any Oath Ceremony that you are scheduled to attend. Notify USCIS as soon as possible in writing if you cannot come to any scheduled interview or Oath Ceremony. Include a copy of this paper and a copy of the scheduling notice. NOTE: Please be advised that under section 336 of the Immigration and Nationality Act, you have the right to request a hearing before an immigration officer if your application is denied, or before the U.S. district court if USCIS had not made a determination on your application within 120 days of the date of your examination. Form N-652 (Rev. 01/14/05)N"
}