{
	"anumber": "A71807945",
	"id": "A71807945_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA. 7/21/2023"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA. 7/21/2023 clinic popular JULY 29, 1997 5223 Laurel Canyon North Hollywood, Ca. 91907 U.S. DEPARTMENTFORDE JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RE: PATIENT: MURILLO, EFIGENIA D.O.B. : 07/14/13 ALIEN #: A071807945 S. S. # : 625-60-9380 PAST HISTORY: Mrs. Murillo is an eighty-four - year old hispanic female with a history of SEVERE ALZHEIMER'S DISEASE: MOST LIKELY HAS DEMENTIA SECONDARY TO HYPERTENSIVE CEREBROVASCULAR DISEASE. HYPERTENSION: CHRONIC VENOUS INSUFFICIENCY WITH STASIS DEMARTITIS OF (RP) LOWER EXTREMITY FREQUENT EPISODES OF RT. LEG CELLULITIS. CAUSE: Mrs.Murillo has Severe Alzheimer's Disease DSM IV 290.10. Other symptoms include: Hypertension, chronic venous disease, Osteoarthritis, and vascular insufficiency at both lower extremities. CONNECTION: As a result of these conditions, the patient does not have the ability to learn a new language or to recall what she may have learned in the past. Physical examination is consistent with the above given history. CONSEQUENCE: Due to Mrs. Murillo's health conditions we strongly suggest that she be exempt from the Immigration Naturalization Examination. If you have any questions regarding this patient, please do not hesitate to contact me. Sincerely, 'S'N'I working MA 92006 to STATE S07 268921 X08 O'd Daniel Berdakin, M. D. TEIN DANIEL BERDANIK, WI.D. CLINICA POPULAR, INC. P.O. BOX 76892 LOS ANGELES, CA 90076 Daniel Berdakin, M.D. Authorized Civil Surgeon DIRECTOR I.N.S."
}
