{
  "anumber": "A71817091",
  "id": "A71817091_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71817091_0012/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "男"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "COPY OF AN ENTRY IN A REGISTER KEPT IN THE COLONY OF HONG KONG. IN TERMS OF THE BIRTHSS AND DEATHSS REGISTRATION ORDINANCE, 1934., 24436"
    },
    "years": {
      "ms_years_nlp_v1": [
        1873,
        2023,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/13/2023 G. 25. R.F. 9. G. R. 24436 No. COPY OF AN ENTRY IN A REGISTER KEPT IN THE COLONY OF HONG KONG. IN TERMS OF THE BIRTHS AND DEATHS REGISTRATION ORDINANCE, 1934. No. When and Name and Surname Name and Maiden Rank, or Profession Signature, Descrip- Sex. When Signature Name if added where born. Name if any. of Father. Surname of Mother. tion and Residence of Father. of Informant. Registered. of after Registration Registrar. of Birth 910 // th October, KA Li Kurai 17th yin thing 1938 altered Yin Chung male Lai Pui 35, Mong Po Kam Motor Car Cheong. Midwite October, sang Driver Ying 58, Shaukwan 1938 Wing On Lung, Street West that Deputy Registran 24-12-55 Copy of an entry in the Register of Births in the Colony of Hong Kong this 7th day of March FEE $1.00. True Copy. p. George 1039 Registrat General of Births d Deaths. The Registers of Births, or Deaths, which have occurred in the Colony of Hong Kong since the First day of January, 1873, are kept in the Medical Department Every person is entilled to Fearch and Indexes, in the custody of the Registrar, upon every week day except General and Public Holidays between 10 a.m. and 4 p.m. and every Saturday between 10 a.m. and 1 p.m. For every general search of an Registers index the charge is five dollars and for every particular search one dollar and for every single copy of an entry one dollar. By general search is meant a search during any number of successive hours not exceeding six, without stating the object of the search, while by particular search is meant a search over any period not exceeding five years for any given entry. Indexes are kept and certified copies of Entries can be obtained only at the Medical Department. Every certified and sealed copy of an entry in a registry book kept Ander the provisions of the Births and Deaths Registration Ordinance, 1934, is receivable as deemed to be proof of the birth or death to which it relates without other or further evidence thereof.\" evidence williani other or further proof of such entry, provided that such entry purports to be signed or made as mentioned in section 23(2) of the said Ordinance. No entry in a post register book will be The XXVth. Section of the Births and Deaths Registration Ordinance, No. 21 of 1934, enacts that \"Every person who wilfully destroys or inj ures, or causes to be destroyed, or injured, any such register book or any part or certified copy of any part thereof, shall be guilty of felony, and shall be liable to imprisonment for any term not exceeding two years."
}