{
	"anumber": "A71807945",
	"id": "A71807945_0053",
	"page_index": 53,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807945_0053/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-135"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2021]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 U.S. Department of Justice OMB # #1115-0054 Immigration and Naturalization Service*(INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp APPROVED A# INS DISTRICT DIPLETO G-28 or Volag # NOV 7-1992 Section of Law: 201 (b) spouse ig Petition was filed on: (priority date) 203 (a)(1) Recommended Personal Interview 203 (a)(2) LOS Previously Forwarded 201 (b) child Pet. Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) 203 (a)(5) Field Investigations I-485 Simultaneously 0032 AM CON: 204 (a)(2)(A) Resolved 001 R 1 05/18/2021 Resolved 2:30 1130 Remarks: A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child FOIA (b)(6) B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) MURILLO Vda. De GUIFARRO, Efigenia de Jesus 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) FOIA b)(6) 8327 Corbin Ave. (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) FOIA (b)(6) Canoga Park, CA 91306 3. Place of Birth (Town or City) State/Country) 3. Place of Birth (Town or City) (State/Country) FOIA (b)(6 Salama, Olancho, Honduras 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status FOIA (b)(6) FOIA (b)(6) Male FOIA FOIA (b)(6) (Mo/Day/Yr) Married Single (Mo/Day/Yr) Male Married Single Female Widowed Divorced 07-14-13 Female Widowed Divorced 7 Other Names Used lincluding maiden name) 7. Other Names Used (including maiden name) FOIA (b)(6) Murillo - Obando; MURILLO DE GUIFARRO 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) FOIA (b)(6) N/A (widowed) 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) FOIA (b)(6) 11. Names of Prior Hush nds/Wive 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended none N/A Miguel de los Santos GUIFARRO - : 07-12-12 Escalante (deceased) 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? Yes No FOIA (b)(6) 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) USA Visitor Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) 0 3 12 - 02 - 84 - Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 05- 29- 85 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: none (senior)Citizen) Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission: N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen lawful permanent resident? FOIA (b)(6) or Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y"
}
