{
	"anumber": "A71807696",
	"id": "A71807696_0060",
	"page_index": 60,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807696_0060/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Oath or Affirmation of Deponent, NARA-1023456"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/21/2023 I have stocks and bonds with the following market value, as indicated on the attached list which I certify to be true and correct to the best of my knowledge and belief. $ 0 I have life insurance in the sum of $ 0 With a cash surrender value of $ 0 I own real estate valued at $ 240,000 With mortgages or other encumbrances thereon amounting to $ 20,000 Which is located at 3142 VERA AVENUE LOS ANGELES , CALIFORNIA 90034 (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me N/A. N/A. N/A. N/A. N/A. 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted N/A N/A. 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted N/A. N/A. 11.(Complete this block only if the person named in Item 3 will be in the United States temporarily.) That I do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\". indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board. state for how long and, if money. state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly. or for how long.) OFFICIAL NOTARY SEAL JOHNNY A. SANCHEZ Notary Public California LOS ANGELES COUNTY My Comm. Expires JUL 04,1994 OATH OR AFFIRMATION OF DEPONENT , acknowledge or that , have read Part IN of the Instructions, Sponsor and A Item Liability, and am aware of my responsib ilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that , know the contents of this affidavit signed by me and the statements are true and correct. Signature of deponent Morin drabul Can to Subscribed and sworn to (affirmed) before me this 13 day of MAY 19 92 SANTA MONICA-CALIFORNIA Signature at affidavit of prepared Officer by Administering other than deponent, Oath Jalany please complete family the following: My commission I declare expires that on Title NOTARY JULY 04, 1994 PUBLIC If this document was prepared by me or the request of the deponent and is based on all information of which I have knowledge. (Signature) (Address)"
}
