{
  "anumber": "A72034343",
  "id": "A72034343_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "KROME CENTRE DE SERVICE DE LEGALISATION, Screened by NARA, 8/11/293"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 KROME Centre De Service De Legalisation ICENCIT Miami, Florida I. LE BUREAU DE PROCEDURE: obstruces afin d' assure la libre circulation d' air dans le building. chaque building. Des repas speciaux peuvent etre commandes. A. Des votre arrivee au centre, vous etes demande'de 2). Les portes, murs, fenetres et moubles doivent etre tenus La commande doit avoir l'approbation d'un agent medical du cooperer EVER 1' officier de service en lui fournissant les intacts: pas d' enseignes, affiches, portraits et autres capables service de sante Publique. II est strictement defendu de sortir informations personnelles qui vous seront demandeesl. Votre de bloquer la lumiere ou enlaidir la propriete'. evec des aliments en Dehors du Cafeteria. photographie et vas empreintes digitales seront prises pour la 3). II est interdit d' ecrire sur lea murs ou de les deteriorer VI. VISITE: constitution de Votre dossier administratif. Un numero de It de mene que les portes, les meubles et autres proprietes do la La visite au camp est permise sux journ suivants designes: vous SCIN assigne) au meme instant. facilite. lee semedis, les dimanches et les jours feries de 09:00 a° 11:30 B. Vous etes demande\" de deposer, pourraison de securite'. 4). Ne tripotez pas les machines do vente, les equipements a de 13.30 a' 15:30. La visite est permise aux membres de tcut scontant d' argent depassant $40.00 Nons vous conscillions da service des pompiers a les devises ou systemed do support famille. Le nombre de visiteurs est limite #* deux par detenu. de donner en securite tout bijoux de valeur, L'argent et les de vic. La direction du centre se reserve le droit objects de valeur seront deposes contre remise de recus signes 5). Seulement les articles comestibles actetes des VII, COURRIER: per deux officers CA charge. machines de consommation sont permis 30 dortois, coux venant a n'y a pas de restritions Concernant le nombre de lettres C. Aprea avoir passe a la procedure d' interrogation, on du cafeteria sont interdits. qu' un determ peut envoyer ou recevior, Les letters personnelles von dannera un jeu d' articles et de votements 6). Les fumeurs utiliseront des cendriers appropries pour les no soot normalement ni ouvertes ni censurees a' moins qu'elles is ionnels. Attention, s'il VOUE plait: ees vetements et ces megots et les candyes. No deposez pts de cigarettes allumens sur sout auspectes de contrebande ou s'il y a cause raisonnable articles delivres' sont la propriete' du Gouvernment des Etals- le parquet ou sur du mobilier. Finnez au His or tont-a-fait qui poste a' croire qu'elles continent des informations qui This. Vous nc posses pas les Abimer, les changer on les defendu. Peuvent Nuire are la serrite\" de cette facilite. Les detends sont detruire: Aprea use douche et s'etre change au veterpent 7). Entro 8.00 m. or 5,00 p.m. vous devez are completement permis de recevoir. des mandat-postes, des cheques) des institutionel, vous serez accompagne\" au Centre du Service de cyclus chaque fais que, VOIS Sortiez do votre section. documents personnels all moyéa des lettres recompatide Sante publique pour em examen physique avant de faire partier 8). Account conduite turbulente et tapageuse no seen toleree. ou assure's L' arrives' de tel courrier sera de In population generale de la facilites. 9). Vous etes personnellement responsable du mettoyage de Is cabine de control postale et la distribution were II, LOGEMENT: yoire it et de la surface qui l'occupe Les determs sont le SIDO/OIC do l' enclive. La remise de tel courrier Exigo Les boinmes sout assignes au Building#8 de Sections collectivement responsables du mainties et de la proprete.\" do de la recipient use identification positive at is signature Les fernines soint assignees all. #11. La section ct le donoir. Let occupants THE sont pas permis do laisser le dostoir ou la reception d' tax tel courries II assigned soul finals. Augus changement ne peut sost nestoye satisfiction de 12 officier des tribunaux et d' offices Publics Tic says l'authorisation de officier assigne su Dortoir. responsable: La tenue en boxing condition du doctoir est de In Afin de simplifier et de faciliter us systems do B. SEPARATION ADMINISTRATIVE: responsabilite' de chaoin. livrance personelle et expeditive, vous etes deinaude La acparation administrative sera accordee aux detenus qui 10). Tout Fatras doit etre jete' dans les recipients inclure dans votre adresse de retour le numero de votre lie ont besoin d! city mis past du reste de is population pour deposes travers le building. voips numero d'immigrant. des miscos de protection individuelle owestres ou par \"crante\" Ei stricts soumission sux ordres a aux commandaman rettle imagmaire de confrontation sociale ou pour des du personnel est exigee. Mr Joe L. Smith (D) (A22-333-444) raisoce medicales 12). A.\" exception des lampes de mut la Iumiere sera teinte Kroine S.P.C. ESTOCATION COMME SANCTION DISCIPLINAIRE 23.00. P.O. Box 160327 addimistres RUX individus qui aurose viole' IV COMPTE Snapper Creek Station les reglements du centre, tels que: bataillo cottro Le campte des detenus s'effective ong foir par four. Ass Miumi FLA. 33116 on entre detenus, destruction de propriete moment du compte les determs doivent etre leurs sections VIII. L'USAGE DU TELEPHONE: comportement irrespectusiz, manifestation signces dont les portes resteront formees Ancone interference des telephones publics repartis BLUCK building evader, etc. Gelai au moment du comput no sera pas tolicre.\" Chaque Hi darvent etis logalement utilites par les tratement medical on income additional debout tout pres de BOX lit et restead things lour Dearnt do dehors no sont pas FOCUS: Om selon la pinescription du medecin du service de Sante dortoir individuel juaqu'a2 oc que 1 officier receptionniste de' clare telephone le matin apres le nettoyage et l'inspection Publique vous pouvez etre en isolation medicale dans une l'ouverture do camp. A ce moment les portes du dortoir sent quotidienne du miliou. Les telephones seront farmies MM Cio section approprice de la facilite. Us medecin y est en service ouvertes. De temps a° antre on pent avoir des comptes speciaux le jour pendant les heures de repas, de comptes a la not on 24. houres, par jour. ou des comptes visuels par photo. Les houres de comptes eteignant toute Inmiere. L'abus ou l'emploi illegal du tels. III REGLES GENERALES: reguliers peuvent etre modifiees to cas d'evenements on pour des phone peut resulter on la perte de cc privilege, ca une action A. Lea regles suivantes seront appliquees durant votre necessites operationelles. civile et/ou oriminelle. rejour au camp. Elles sont 'etablies pour le maintien de V. REPAS: IX, PROGRAMME DE TRAVAIL VOLONTAIRE DES l'ordre et de Is securite de cette facilite\" necessaire pour le Trois repas varies of nutritivement balances sont prepares dans DETENUS: bien-stre des detenus et du corps des employes on entier: la cuisine de la facilite'. Ils doivent etro consommes dans la salle Chaque dortair comporte un nombre de detenus travailleurs 1) Total ouvertures an dortoir ne daivent pas etre du cafeteria. Les heures de repas soct visiblement postes dans assignes au nettoyage des lieux communs. Its recoivent une Livret 'Admission et D'Orientation"
}