{
	"anumber": "A72034343",
	"id": "A72034343_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 INSTRUCTIONS subsequent Proceedings of a change in the respondent/applicant's custody location or of release from Service over the or Record of Service shall immediately advise the Office of the Immigration Judge (OIJ) having control (EOIR), PURSUANT the 8 CFR 3.19(g), while any proceeding is pending before the Executive Office for Immigration Review his/her fixed of the change in custody location or status, and, upon the release of the the effective taking date into Service custody of a respondent/applicant. This notification shall be in writing and custody, shall state street address, including ZIP code. The purpose of this requirement is to ensure respondent/applicant, that the OIJ his appropriate location at which the respondent/applicant may be served with notices or other documents pertinent has the to proceedings. (1) The date at the top of this form shall be the effective date of the change in custody location or status. (2) providing the information. Write in the location of the OIJ office to whom this notice is provided, and the location of the INS office (3) This Order form to will by filed with the OIJ for detained cases initially with the filing of the original of the in Show Cause; a new form will be prepared and filed with the OIJ each time there is a change administrative file (A-file). custody location or status. A copy of each form prepared shall be retained in the INS (4) the If respondent is transferred in custody to another location outside the area of jurisdiction of Motion for Change of Venue, if appropriate. OIJ, this form is to be forwarded to OIJ via the Office of District Counsel who will file a The reminded Alien of is the to be provided with a Form EOIR-33, Change of Address upon his/her release from INS and (Section 242B requirement to notify the OIJ within five (5) days of any change of address or telephone custody number (a) (F) (ii)."
}
