{
	"anumber": "A72044147",
	"id": "A72044147_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044147_0009/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "feminin"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXTRAIT DU GISTRE DES ACTES DE HAISSANCE DE LA COMMUNE DU CAP-HAITIEN, Série B-1 N° 96904"
		},
		"years": {
			"ms_years_nlp_v1": [1992, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 EXTRAIT DU RE GISTRE DES ACTES DE NAISSANCE DE LA COMMUNE DU CAP- DEPUBLICUE HAITIEN>FOUR L'ANNEE MIL HUIT CENT QUATRE VINGT DIX HUIT (I898)DE POSE AU GREFFE DU TRIBUNAL CIVIL DU CAP*HAITIEN L'ACTE INSCRIT AU NO;76DONT TENEUR SUIT: 1.50 1.50 Série B-1 No 96904 Gda. Cde. PAPIER TIMBREC AUJOURD HUI vendredi vingt deux Juillet mil huit cent quatre vingt dix huit,An quatre vingt quinzieme de l'independance a neut heures Une Gourde Cinquante Centimes et demie du matin;Far devant nous ROSEVILLE BERNARDIN, Officier de l'Etat civil do la commune du Cap-\"aitien;\"st comparu le Citoyen JOSEPH BALMIR ,pharmacien,domicilie au Cap-haitien, lequel nous a ANNEE I898 declare que le seize JUIN dernier a une heures un quart du matin PAGE 39 il est ne en cette ville, de lui declarant en sa maison,et de la NUMERO 76 dame CARIDA STERLIN, son epouse un enfant du sexe feminin, qu'il 110% nous presente ,et auquel il donne les prenoms del'MARIE CECILE ACTE DE NAISSANCE DE: les diles declaration et presentation Lailes en presence du C1= MARIE CECTLE BALMTR toyen DOUARD KINKE commercant et du Citoyen JOSEPH MURVILLE NOISY ,commis-greffier du Tribunal civil de ce ressort, tous deux majeurs ,domicilies en cette commune ,et nous avons signe le pre sent acte de naissance avec le pere et les temoins apres que lec ture leur en a ete \"prealablement donnee SIGUE:ROSEVILLE BERNARDIN, Officier de l'Etat civil, THE UNAL LIVE Pour extrait conforme Collationne. Regulation PIERRE/ROGER DAY, GREFFIER. VUpar le Doyen du ribunal civil du Cap-haitien pour la legalisat tion de la signature du greffier, Palais de Justice du Cap-haitien le 6 Novembre 1992, An I89eme de l'Independence. GABRIEL GRATIA DOYEN"
}
