{
  "anumber": "A72034343",
  "id": "A72034343_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CREOLE, Screened by NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 minimus nan is kou-a ou run che' min yo, ginyin CREOLE tou minimans je'ne'ral. Pots yo pran mount yo baze' sou sa'oo kon'n fe*, kentite\" travay ki ginyin e' ki moun' ki mande' anvan. DEPATMAN LA JISTIS X.DISTPLIN': Administration Krome nan PEYI AMERIKIN apre'sie' le yo pran solisyion rapid pour you prob- Par Jem disiplin' ke'se' pou you akayion ou pour you violasyion. Rapo you insidan kapab o'kri pe'r you mumb Dan staf la OIL pa you ofiais' de sekirite' you Sevis Imigraysyon Ak Natiralizasyon kontra ki le\" to 'urvin you moun'te'fe you bagay ki pa bon. Yo klase' bagay moun's pa gin dwa fe' an KROME 4 kate' gori. Pi piti-a re'le' mine's apre' se' SANT DE SEVIS TREMAN LEGAL MODE'RE', apre' se® MAJE' e' pi gro-s se Miyami Florida KRIMINEL. She'f yo ka shoizi pon yo ba'ou koesey, distance or re'primande* de\" boush ou fe' you 40 eltri por violasyion mine' ou mode're'. Le'on koma't de\" on plisie ri violasyion you konside're' 22 yo egal n you gro. Le yo rapote\" you insiden mino' on modere' alaryion disipline\" ke's yo pran, sil pa gin KREOL INTRODIKSION izolasyion ou pet de privilej, ofisie\" sipevise Is gin Isit la se' Km Krome nta pour min-ria you anket poo yo asire' ke mezi yo te2 Miami Folrida. Se you kote pran - to\" bon. Pou you violasyion modere' yap Sevis Imigrasyon Eta zini voye\" repor-la be sipevise' en shef ofisis' yo pon Kimbe' mona's jisle' la jistis e anket, konsta ak evaliasyion. Nan ka you gro Fini tre'te\" ka'ou. violasyion, deteni in prais' direk nan izolasyion Pandan passj ou isit, ya'p bs'on administrativ. Pandan se'tea yapkon value you to garanti . Ke' ya''p tre'te'ou byin de' disiplin's asa le' 24 e' pon anite'te' et pcs o' yo ap respeite* ton't Dwa on cheche' assemb H pinisyion pour yo bay. Tout' ginyin. Sa ke' nou mande' ou koreapondans, rapo et dokiman ki girs repor at se° respekta* dwa otorite* yo ak akryion disipline prais' an dosie de'te'ni-m. moun's kap travay m'a dan XL VIZAT AVOKA OU PARALEGGAL Avoka no. Le' a la P facil pour on re'pro zantan otorize' vizito' ou isit-la de 9 es di travery' la byin fe't nan inte're tin a' 9 e di swe, ekeepto\" le magies ek le yo tout' moan'n. Jije' kibois, pou so'likite' Me'ri rezonah Nap prie' 'on Pou kapab se'kirite\" R m': Konte' I period normal on rispot respected Iwa ak regis'man bi le' sokizite\" kme-en memore'. Sm kxpsb fet selon grant ginyin nan kan Ian. shof yo vio-1 Le Pou reason subject mannak byinne't on, on dwe kinbe* plas-la Prop e'pi ou sipoze* fe+ kaban' ou tankou egrapp ki plake DAD pan, no yo, z. ADMISYON Krome Sant de Sevis Tretman Legal INTODIKSYON Miyami Florida"
}