{
  "anumber": "A72034343",
  "id": "A72034343_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIVRET D'ADMISSION ET D'ORIENTATION, KROME"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 compensation. Par aillourn les detenua peuvent aider an actogage general si l'side not sollicizee. Ceux qui desirent participar au programme de travail volontaire doivent FRENCH 'inscrire devant les officient affectes au service de build Le Service d'immigration ings. II y a unc variate de travail disponible, telle que: sides etde Naturalisation du zu service d' Almentation, maintenance de terrairs ou de Is chaussee', mainteaacics generale. La procedure d' embauchage est basec sur la disponibilite de 1 emploi, de a Departement De Lajustice Des la qualification du classement d'inscription. D. X. DISCIPLINE: Etats Unis Dr Amerique L° Administration de Krome encourage la resolution immedate, a'a importe quel moment, de problemes désciplinaires s'agissent d'acte ou de violation. Un rapport KROME d' incident poul-etzes redige' par # importe quel membre du Centre Do Service De Legalisation staff ou par on officer do securite' sous contrat ayant raison Miami, Florida do croire, aprea avoir vecu un fait or sous reception Edition Francuise give viration de boune source, qu'ten detenu ait commin us efenda. Lee notes defendus sont classes on quatre catagories allant par ordre d'importance, de: Minor-Moder ato Major Criminal Les membres du staff powent choicis INTRODUCTION de consciller, dooser dis evertissements ou reprintender virtialement oc introduire UB support 'ecrit pour violation Vous etes, ici a \"Krome Process- mineure ou modesce'. Delix DD plusieurs violations secont ing Center\" de Miami et Floride consideress egales a des violations majeures. Pour un Rapport C est time facilito de Detention du d'incident redige pour unc violation mineure on moyenine Service d' Immigration et si l'action disciplinare in implique pas de Segregation ou deNatiralisation destinee a VOUS parte de privileges new investigation see meace par Fofficien accomoder, temporairement, supervisor afin que les charges et action jasqu'a ce que la justice procede disciplinaire prises sout approprices. Dam le cas d'une n° Is conclusion de votre cas ou violation moyenne, be rapport d' incident seen caveye au authorise votre mise 6 liberte'. Superviseur m chef des officient de l'inmigration pour countation et evaluation Dans to CES violeth majoure some etc commise at Is deleisu Durant votre passage ick. le sera place en segregation Administrative * 'pin corps traitement civil et humain Vous est disciplusire sea Codivoque' done les 24 houres abod Tenquotep garanti et vos droits individuals et do'terminate li sumption disciplinaire appropries\" Tante semont En retour, nops produite, rapports et documents se ripportant insistons a ce que vous respectes 9 disciplinaire scrool inclus su dossiez administratif les droits et I authorite du person Hoterju XL VISITE D'AVOCAT ou DE PARALEGAL nill and do lear permettre de traviller Pour voize representation vous eles authorize votio bien etre, Nous vous priors un avocat on son representant legal de 9 h du mifin a° 9h a obear SUX règlements du centre, du sair a l'exception des houres de repas a coBes jugees necessaires pour le mainties de is securite\". Des mesures reisonnables de socurite comprensent les comptes pediodiques de detenur ou a \"importe quelle autre periode de tecops daps LIVRET laquelle la securite' du cump sexit menaces suivant déter- mine' par 10 plos beut grade' superviseur en service. Poise KROME D'ADMISSION ET des raisons sanitaines at de bon mesage, vous devez arranger Centre De Service De Legalisation votre It et maintenir in surperficie qui l'occupe comme l'exemple donne' Coci dolt etre fait chaque jour. Miami, Florida D'ORIENTATION"
}