{
  "anumber": "A72034343",
  "id": "A72034343_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0014/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Welcome to the United States, I-94 Arrival/Departure Record - Instructions"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2014
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U.S. Department of Justice OMB 1115-0077 Immigrat and Naturalization Service Admission Number Welcome to the United States 236737023 01 I-94 Arrival/Departure Record - Instructions This form must be completed by all persons except U.S. Citizens. returning resident aliens, aliens with immigrant visas, and Canadian Citizens visiting or in transit. Type or print legibly with pen in ALL CAPITAL LETTERS. Use English. Do not write on the back of this form. This form is in two parts. Please complete both the Arrival Record (Items I through 13) and the Departure Record (Items 14 through 17). When all items are completed, present this form to the U.S. Immigration and Naturalization Service Inspector. Item 7-If you are entering the United States by land, enter LAND in this space. If you are entering the United States by ship, enter SEA in this space. Form 1-94 (04-15-86)Y Admission Number PAROLED PURSUARY TO 212(d) (5) 06 THE I £ IC 236737023 01 INDEFINITELY PURPOSE: PENDING EXCLUSION PROCEEDINGS Immigration and PISPC 03/09/93 Naturalization Service (2014) (Date) (Officer) I-94 Arrival Record 1. Family Name MADOU 2. First (Given) Name 3. Birth Date (Day/Mo/Yr) OXINAL 0110107 4. Country of Citizenship 5. Sex (Male or Female) HAITI MALE 6. Passport Number 7. Airline and Flight Number 8. Country Where You Live 9. City Where You Boarded 10. City Where Visa Was Issued 11. Date Issued (Day/Mo/Y 12. Address While in the United States (Number and Street) 550 N.E. 63rd ST APT.3 13. City and State MIAMI FL 33138"
}