{
  "anumber": "A72044147",
  "id": "A72044147_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044147_0026/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXTRAIT DU REGISTRE DES ACTES DE NAISSANCE DE LA COMMUNE DU CAP-HAITIEN POUR L'ANNEE MIL NEUF CENT VINGT HUIT (1928), N° 35814"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991,
        1928
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/14/2023 REPUBLIQUE EXTRAIT DU REGISTRE DES ACTES DE NAISSANCE DE LA COMMU- NE DU CAP-HAITIEN POUR L'ANNEE MIL NEUF CENT VINGT HUIT- (1928) DEPOSE AUX ARCHIVES DU GREFFE DU TRIBUNAL CIVIL DU EGALITY CAP-HAITIEN, L'ACTE INSCRIT AU NO 327 DONT TENEUR SUIT: 1.50 1.50 A 4 No 35814 Gdo. Gdo. Aujourd'hui Vendredi Vingt et un Decembre mil neuf Cent Vingt Huit, an cent vingt cinquieme de l'Indepen- PAPIER TIMBREC dance a trois heures de l'apres-midi. Par devant Nous Jh Floricourt Perrier,Officier de l'E- Une gourde cingnante centimes tat Civil de la commune du Cap-Haitien, Section Nord,-- ANNEE 1928 soussigne; NUMERO 327 A Comparu le citoyen PIERRE JUVIGNY VAUGUES, avocat- ACTE DE NAISSANCE DE: ancien batonnier ,domicilie au Cap-Haitien, lequel nous THERESE MARIE LUCIE VAUGUES-a declare que le Jeudi Vingt Decembre courant a huit- Nee le 20 DECEMBRE 1928 a heures du soir,11 est ne en cette ville de lui decla- HUIT HEURES DU SOIR. rant en sa maison et de la dame Marie Cecile Balmir- son repouse une enfant du sexe feminin qu'il nous pre- sente et a laquelle il donne les prenoms de: THERESE -MARIE LUCIE Ces declaration et presentation ont ete faites en presence des citoyens Luc Grimard, Diredteur du Lycee - National de cette ville et Thracius Mompoint specula- teur en denrees, tous d.eux majeurs domicilies au Cap Haitien et avons signe le present acte avec le pere et les temoins apres que lecture leur en a ete donnee (s) Jh.Floricourt Perrier Of.de l'Etat Civil, avec para- phe. Pour Extrait Conforme et litteral. Collationne. BETTER TRIP of Raymond Prophete Commis Greffier. -HAITIER Vu par Nous,Me Francois Raymond, av Doyen du Tribunal Civil du Cap-Haitien pour la legalisation de la signa- ture de Mr.Raymond Prophete, Commis-Greffier au dit Tri bunal. Tribunal Civil du Cap-Halti engle 12 Mars 1991. Recepisse No. Me Francoi S Raymond, av Doyen."
}