{
  "anumber": "A72034343",
  "id": "A72034343_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE TO APPLICANT FOR ADMISSION DETAILS FOR HEARING BEFORE IMMIGRATION JUDGE, I-122"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 United States Department of ustice Immigration and Naturalization Service A NOTICE TO APPLICANT FOR ADMISSION DETAINED FOR HEARING 72054343 BEFORE IMMIGRATION JUDGE To: Date: 12/10/97 PLEASE TAKE NOTICE THAT: United You do not appear to me to be clearly and beyond a doubt entitled to enter the States as you may came within the exclusion provisions of Section 212 (a) (7) (a) (i) (I) of the Immigration and Nationality Act, as amended, in that valid unexpired immigrant visa, reentry permit, border crossing card, possession or other a You valid are an immigrant at the time of application for admission not in of entry document required by this act. Therefore you are detained under the provisions of Section 235(b) of the Immigration and Nationality Act, as amended, for a hearing before a Judge to determine whether or not you are entitled to enter the United Immigration States whether you shall be excluded and deported. During such hearing you will have or the right to be represented by counsel and to have a friend or relative present. AT THE HEARING BEFORE THE IMMIGRATION JUDGE YOU MUST ESTABLISH THAT YOU ARE ADMISSIBLE TO THE UNITED STATES UNDER ALL PROVISIONS OF THE UNITED STATES IMMIGRATION LAWS. FAILURE TO ATTEND THE HEARING AT THE SCHEDULED TIME AND PLACE MAY RESULT IN A DETERMINATION BEING MADE BY THE IMMIGRATION JUDGE IN YOUR ABSENCE. The hearing is scheduled for To , BE , (Time) (Date) (Place) will be scheduled and you will be notified as to the time and place. It is understood that you want notice of hearing to be sent to you at the following address: (Street and Number) (Apt. No.) (City) (Province) (State) (Country) (United States Immigration Officer) CERTIFICATE OF SERVICE Original of this notice was delivered to the above-named applicant by the undersigned on DEL 10/97 and the alien has been advised of communication privileges pursuant to 8 CFR 242.2(e) Eoir 12/16/92 (United States Immigration Officer) Form I-122"
}