{
	"anumber": "A72034343",
	"id": "A72034343_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF HEARING IN DEPORTATION PROCEEDINGS, A72-034-343"
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 NOTICE OF HEARING IN DEPORTATION PROCEEDINGS Office of the Immigration Judge RT 3 BOX 341 BUENA VISTA DR LOS FRESNOS TX 78566 RE: MADQU OXINAL* FILE: A72-034-343 DATE: 08/18/93 ) TO: MADOU OXINAL* 1000 HICKARY STREET FORT PEIRCE. FL 34950 Please take notice that the above captioned case has been scheduled for a hearing before an Immigration Judge on Sep 8 1993 at 10:30 A.M. at: RT 3 BOX 041 BUENA VISTA DR LOS FRESNOS TX 78566 You may be represented in these proceedings. at no expense to the Government by an attorney or other individual who is accredited to represent persons before an Immigration Judge Your hearing date has not been scheduled earlier than 14 days from the date of service of the Order to Show Cause, in order to permit you the opportunity to obtain an attorney or representative You can request ab-earlier hearing in writing If you wish to be represented your attorney or representative must appear with you st the hearing prepared to proceed Failure to appear at your hearing except for exceptional circumstances may result in one or more of the following actions: 1. You may be taken into custody by the Immigration and Naturalization Service and held for further action 2. Your hearing may be held in your absence under section 242(L) of the Immigration and National fity Act. An order of deportation will be entered against you if the Imprigration and Naturalization Service establishes by clear, unequivocal and digitacing evidence that a) you or your attorney has been provided this notice and b) you are deportable IF YOUR ADDRESS IS NOT LISTED ON THE ORDER TO SHOW CAUSE OR IF IT IS NOT CORRECT WITHIN FIVE DAYS OF THIS NOTICE YOU MUST PROVIDE TO THE OFFICE OF THE IMMIGRATION JUDGE LOS FRESNOS TX, WRITTEN NOTICE OF YOUR ADDRESS AND PHONE NUMBER AT WHICH YOU CAN BE CONTACTED REGARDING THESE PROCEEDINGS IF YOU CHANGE YOUR ADDRESS YOU MUST PROVIDE TO THE OFFICE OF THE IMMIGRATION JUDGE WRITTEN NOTICE WITHIN FIVE DAYS OF ANY CHANGE OF ADDRESS ON FORM EOIR 33, WRITTEN NOTICE TO THE MOST RECENT ADDRESS YOU HAVE PROVIDED WILL BE CONSIDERED SUFFICIENT NOTICE TO YOU, AND THESE PROCEEDINGS CAN GO FORWARD IN YOUR ABSENCE. A list of pro bono attorneys and representatives has been provided to you by the Immigration and Naturalization Service 30 M"
}
