{
  "anumber": "A72044315",
  "id": "A72044315_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, Form G-28"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE DATE In re: ALIEN REQUEST 7/11/92 FILE No. I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): Petitioner Applicant GEORGES NAME HERAUK c/o KENNETH LOWENHAUDT Beneficiary ADDRESS (APL No.) (Number is Street) (City) (State) (ZIP Code) 5600 S.W. 135 Ave # 200 MIAMI FLA 33183 Petitioner Applicant NAME Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) Check Applicable Item(s) below: I am on attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia FLORIDA SUPREME COURT OF FLORIDA and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2 I am on accredited representative of the following named religious, charitable, social service, or similar organization established in the United Srares and which is so recognized by the Board: 3. I am associated with the attorney of record who previously filed a notice of appearance in this case and my copearance is at his request. (if you check this item, also check item 1 or 2 whichever is appropriate. 4. Others (Explain fully.) COMPLETE ADDRESS SIGNATURE 5600 S.W. 135th Ave. , Suite 200 Miami, FL 33183 TELEPHONE NUMBER NAME (Type or Print) (305) 383-9570 KENNETH J. LOWENHAUPT PURSUANT TO THE PRIVACY ACT OF 1974, / HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: KENNETH J. LOWENHAUPT (Name or Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: SIGNATURE OF PERSON CONSENTING DATE NAME OF PERSON CONSENTING ELIZABETH DELVA llizabeth Telva 2/11/92 Execution of this box is required under the Privacy Act of 1974 where the person being represented (NOTE: is a citizen of the United States or an alien lawrully admitted for permanent residence.) UNITED STATES DEPARTMENT OF JUSTICE Form G-28 (OVER) Immigration and Naturalization Service (Rev.10-25-79)N"
}