{
	"anumber": "A72044315",
	"id": "A72044315_0038",
	"page_index": 38,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0038/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LIBERTE EGALE FRATERNITE, N° 4 44395"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1963]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 LIBERTE EGALITE FRATERNITE EE No 44395 REPUBLIQUE D'HAITI 20 2Gait des registres dos actes de mariage de la Commune de Port-au Canes. d660sés au Bureau dos Archives Nationales de la République. L'An mil neuf cent soixante-trois An 160 mm do l'Indé- pendance et le Dimancho douze Mai à dix houres tronto du ma- Vingt centimes de gourde tin. Par devant nous Jacques M. Oriol, Officier de l'Etat 3.1.35 Civil de la Section Est de Port-au-Prince, expressement qua- lifié pour procéder ce jourd'hui à la célébration des consort GEORGES HENRI DE DELVA ET ELISABETH ELIANE HERAUX, ap- pert autorisation de Me Claude D. Hippolyte, Substitut du Con missaire du gouvernement, près le Tribunal Civil de Port-au- Prince, en date du 6 Mai 1963, Soussigne; Ont comparu If Monsieur GEORGES HENRI DE DELVA, Interprète, traducteur, demeurant et domicilie à Port-au-Prince, dûment muni de son Certificat prénuptial, immatriculé pour l'exercice en cours au No. 3845, né à Port-au-Prince le vingt-cing Janvier mil neuf cent trente-six, âgé de' vingt-sept ans et trois mois, fils légitime de Monsieur Alfred de Delva, décédé, et de son épouse née Christiane Mérové Pierre, également décédée, Sti- pulant pour lui et en son nom personnel, d'une part Et-2) Mademoiselle ELISABETH ELIANE HERAUX, Secrétaire, demeurant et domiciliée à Port-au-Prince, dûment munie de son ANNEE 1963 Certificat prénuptial, immatriculée pour l'exercice en cours PAGE - 37 au No 3846, née à Port-au-Prince, le dix-neuf Novembre mil NUMERO 37 neuf cent quarante-trois, âgée de dix-neuf ans et cinq mois, fille légitime de Monsieur Georges Héraux, Agronomo, demeu- ACTE DE MARIAGE DE: rant et domicilié à Port-au-Prince, et de son épouse née Ger- GEORGES HENRI DE DELVA trude Kalmar, propriétaire, demeurant et domiciliée à Port-au- ET DE ELISABETH ELIANE Prince, Stipulant pour olle at les consentemente requis ayant HERAUX été donnés d'autro part Lesquels nous ont requis de prócéder à la célébration du MARIAGE projoté entre oux et dont les publications ont été régulièrement faites devant la principale porto d'entrée do notre Buroau los dimanches vingt-huit Avril ot oinq Mai mil neuf cent woixanto-trols. Auound opposition au dit MARIAGE no noue ayant été significo ot l'ai mant droit à leur réquici- E.F tion, après avoir donné aux partion contraotantos leoturo do"
}
