{
	"anumber": "A72034343",
	"id": "A72034343_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Notice to EOIR: Alien Address, Form I-830 ( (06-12-92)"
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 J.S. Department of Justice inmigration and Naturalization Service Notice to EOIR: Alien Address DATE: May 4, 1993 TO: OFFICE OF THE IMMIGRATION JUDGE Executive Office for Immigration Review Route 3 Box 341 Bldg 37 Los Fresnos, TX 78566 FROM: USINS RESPONDENT: MADOU, Oxinal A# 72 034 343 This is to notify you that this respondenti is: [ ] Currently incarcerated by other than INS. An Order to Show cause (Form I-221) has been served on the Respondent, and an Immigration Detainer-Notice of Action by Immigration and Naturalization Service (Form I- 247) has been served with the institution shown below. He/she is incarcerated at: His/her anticipated release date is: [ ] Detained by INS at: [ ] Detained by INS and was transferred this date to another location of detention at: INS Motion for Change of Venue attached. [ Yes [ ] No [x] Released from INS custody on the following conditions(s): [ Personal Recognizance [ Order of Recognizance (Form I-220A) I Bond in the Amount of $ [ ] Surety Cash Other Parole (x) Upon release from INS custody, the respondent reported his/her address and telephone number will be: 1000 Hickary street Fort Peirce , Florida 34950 (407) 464-5450 [ ] Upon release from INS /custody, the respondent was reminded of the requirements contained in Section 242B (a) (F) (ii) and was provided with a Form EOIR-33, Change of Address DEPORTATION OFFICER Signature-INS Officer Title-INS Officer Ruben Garcia PISPC/ Los Fresnos, Texas 78566 Printed Name of INS Officer Location ORIG: OIJ CC: A-FILE form I-830 (06-12-92)"
}
