{
	"anumber": "A72044315",
	"id": "A72044315_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 02-28-87) N"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 U.S. Department of Justice (INS) Petition for Alien Relative OMB No. 1115-0054 DONG WRITE IN THIS B OCK-FOR EXAMINING OFFICE ONLY Case ID# Action Stam Fee Stamp AN APPROVED DISTRICT DIRECTOR G-28 or Volag # Section of Law: JAV 19 1993 201 (b) spouse 203 (a)(1) Petition was filed on (priority date) 201 (b) child 203 (a)(2) 203 (a)(4) jymp Personal Interview Previously Forwarded 201 (b) parent Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously 204 (a)(2)(A) Resolved AM CON: 204 (h) Resolved REMARKS: A. Relationship 1. The allen relative is my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother Sister Child Yes No Yes X No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) DELVA ELIZABETH HERAUX GEORGES 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 348 Ballena Drive 4720 S.W. 135 Place (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) Diamond Bar CA 91765 Miami FL 33175 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Port-Au-Prince Haiti Port-Au-Prince Haiti 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Year) Male Married Single (Mo/Day/Year) X Male Married Single 11/19/43 Female Widowed Divorced 06/06/07 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) ELIZABETH HERAUX NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) n/a n/a 9. Social Security number 10. Allen Registration Number (if any) 9. Social Security number 10. Alien Registration Number (if any) FOIA (b)(6) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended HENRY DELVA 07-02-91 N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: Naturalization He or she last arrived as (visitor, student, stowaway, without inspection, etc.) Give number of certificate, date and place it was issued Visitor B2 9310690 Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Parents 4 1 8 1 2 06/06/92 Have you obtained a certificate of citizenship in your own name? Date authorized stay expired, or will expire as shown on Form I-94 or I-95 Yes No If \"Yes,\" give number of certificate, date and place it was issued 12/05/92 15. Name and address of present employer (if any) n/a Date this employment began (Month/Day/Year) 14a. If you are a lawful permanent resident allen, complete the following: n/a Date and place of admission for, or adjustment to, lawful permanent residence, and class of admission: n/a 16. Has your relative ever been under immigration proceedings? Yes X No Where When 14b. Did you gain permanent resident status through marriage to a United Exclusion Deportation Rescission States citizen or lawful permanent resident? Yes No Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 02-28-87) N"
}
