{
	"anumber": "A72044147",
	"id": "A72044147_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044147_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Birth Certificate of the Commune of Cap-Haitian for the Year 1928, M - No. 358144"
		},
		"years": {
			"ms_years_nlp_v1": [1994, 2023, 1991, 1928]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 CERTIFIED TRANSLATION Officially Stamped Paper: Republic of Haiti - 1 Gde 50 One rubber Stamp: Civil Court of Cap Haitian M - No. 35814 Excerpt of the Register of Birth Certificate of the Commune of Cap-Haitian for the Year 1928, deposited at the Archives of the Civil Court of Cap-Haitian, Registered under the No. 327, in the following terms: Today, Friday December 21 Nineteen Hundred and Twenty Eight (1928), the 125th Year of Independences at 3:00 in the afternoon; Before us, the undersigned, Joseph Floricourt Perrier, Civil Status Officer YEAR 1928 of the Commune of Cap-Haitian, Section North; No. 327 Appeared Mr. Pierre Juvigny Vaugues, Lawyer, former President of the Corpora- Birth Certi- tion of barristérs, living and residing at Cap-Haitian. He presented to us a child of the female sex, whom he declared to be his legitime daughter, born ficate of on December 20, Nineteen Hundred Twenty Eight (1928) at eight clock in the evening, of the Dame Marie Cécile Balmir, his wife; To which child he has Therse, Marie- given the first names of: THERESE MARIE LUCIE Lucie VAUGUES This act was donc in the presence of Mr. Luc Grimard, Dean of the National Born on Lyceum of this city and Mr. Thracius Mompoint, Food products Dealer, both of Dec. 20m 1928 legal age, living and residing in cap-Haitian. at 8:00 p.m. After reading of this act, we have signed it together with the father and the witnesses. (s) Joseph Floricourt Perrier Civil Court Officer (with initials) Certified collated excerpt (S) Raymond Prophète Town-Clerk Verified by us, Mr. Francois Raymond, Lawyer, Dean of the Civil Court of Cap-Haitian; we certify that the above signature is truly the signature of Mr. Raymond Prophète, Town Clerk of the said Court. The Civil Court of Cap-Haitian, March 12, 1991, Receipt No. --- (S) Mr. Francols Raymond, Lawyer This is to certify that this document is a correct translation of a Birth Certificate, and that I am competent and qualified to effect such a translation. Nalary public Hancy Iu-f This too 01-92 Nancy Menard Translator - Pimentel Inc. Notary Public State of Florida at Lerg 5.5 My Commission Expires: July 17, 1994"
}
