{
	"anumber": "A72034343",
	"id": "A72034343_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0016/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTIFICATION REQUIREMENT FOR CHANGE OF ADDRESS, A# 72 034 343"
		},
		"years": {
			"ms_years_nlp_v1": [1993, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 A# 72 034 343 NOTIFICATION REQUIREMENT FOR CHANGE OF ADDRESS REQUISITO DE NOTIFICACION DE CAMBIO DE DIRECCION Please be advised that any address change must be reported to: QUEDE ADVERTIDO QUE CUALQUIER CAMBIO DE DIRECCION DEBE SER REPORTADO A: EXECUTIVE OFFICE FOR IMMIGRATION AND NATURALIZATION IMMIGRATION REVIEW : and SERVICE 201 EAST JACKSON 2102 Teege Avenue Harlingen, Texas 78550 y Harlingeng, Texas 78550 The notice must include your alien registration number. LA NOTIFICACION TIENE QUE INCLUIR SU NUMBERO DE EXPEDIENTE COMO EXTRANJERO. Failure to report your address change to both agencies may result in any or all of the following actions: FALTA DE REPORTAR SU CAMBIO DE DIRECCION A AMBAS AGENCIAS PUEDE RESULTAR EN CUALQUIERA o TODAS DE LAS ACCIONES SIGUIENTES: 1. A deportation hearing may be held in your absence under Section 242 (b) of the Immigration and Nationality Act. UNA AUDENCIA DEDEPORTACION PUEDE SER CONDUCIDA EN SU AUSENCIA DE ACUERDO CON LA LEY BAJO LA SECCION 242 (b) DE ACTA DE IMMIGRACION Y NACIONALIDAD. 2. An order of deportation may be entered against you. SE PODRIA LEVANTAR UNA ORDEN DE DEPORTACION EN SU COTRA. 3. Forfeiture of your bond. PERDIDA DE SU FIANZA. 4. Issuance of a warrant for your arrest and deportation. QUE SE EXTIENDA UNA ORDEN PARA SU ARRESTO Y DEPORTACION. MI NOMBRE, NUMBERO DE EXPEDIENTE COMO EXTRANJERO MADOU, OXINAL Y DIRECCION POSTAL: 550 N.E. 63rd St. Apt. 3 My name, alien registration number and mailing address is: Miami, F1 33138 I hereby acknowledge that I have read or have had read to me and have had explained to me the above, and that I understand its contents. POR LA PRESENTE RECONOZCO QUE LO HE LEIDO o SE ME LO HA LEIDO Y ME LO HA EXPLICADO Y ENTIENDO EL CONTENIDO. t his mark Rg/R.O. March 9, 1993 (date/FECHA) signature/FIRMA Served by me at PISPC, on March 9, , 19 93, , at 11:30 a.m./p.m. Colonia do Signature and Title of employee or officer"
}
