{
	"anumber": "A72034343",
	"id": "A72034343_0049",
	"page_index": 49,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0049/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "KROME, I. BIRO PROSEING:, Gid Pou Deteni, VII. LET:, VIII. LISAJTE TE'LE'PON YON:, IX. PROGRAM TRAVALE VOLONTÈ:, E Naturalizasyon"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 KROME Gid Pou Deteni L BIRO PROSESING: A. De'pl ou rive' man sant byin sikile* DRD bildig nan. 2). Pot't yo, miray yo, Fe'ne't VI. VIZIT: Yo bay vizit le' sa yo: le' samdi, le isit is, ou sipose' kope're' avek she'f yo. Se' pour bay yo ak me'b yo dwe' re'te\" an bon 'eta; pa Mete' ansely, dimansh ak le4 jou fet. de 9 ve a' 11 2e4 edmi e' de tout' infomasyco pe'sonel ke yo mande' ou. Ya'p pran afish, potre' ou lot bagay ki kap bloke' limie* la on fe kote' foto' ou avek anprin't ou pon administrasion an fe' 13 28 30 a' 15 ze' 30, vizit ya se' pour mamb famiye. a le'd. Yo limite' kentite vizite* a' 2 pa de'teni pou shak fwr dosie' 'on. Me's le' tou y'ap ba' nime TO kaban' ou, 3). Yo de'fand moun\" e'kri du malminnin pot't, mi gin vizit, Direksyion Jan nan gin dwa anile' you vizit, B. Pou sekirite p&* ou yo mande' ou pour \"pose\" ak lot bagay ki nan kan. e'dui kentite' tan-nan on byin sispand-ni pou re'zon tou't vals' lajan ki plis ke' 40 dola. Nou Konse'ye' *ou 4). Pas tripote' mashin'n kap van'n yo, e'kipman se'kirite'. tou pou me't oin sekirite bijou de vale' ke' ou ginyin. insandi yo ak deviz ou sistem sipor la vi yo. VII. LET: Pa gin limit SOB kantite' le't on moun' Pou lajan ak bagay de vale' ke' ou de \"pose ya'p be you 5). Set manje' can mashin'n yo kapab antre' nan dor ka ekri on resevwa. Yo pa louvri lo't pesonel on moun' resi pour yo. Resi ap siyin par Z sh'e f. twa. Ou pa ka Soti ak manje' nan cafeteria La pou pote\" C. Gin you kote® espe'sial pour Reme't rad' ou ak a mavin ke' yo sispek le't ss-yo de kontre) 'band ou si gin nan dortwa la. koz valab ki kapab kre? ye\" problem pour se'kirite' kan- bagay pesonel on. Tan kou yo te' fe2 pour lajan at bagay 6). Moun'n ki fimin dwe' jete san ak bour't sigaret't non. Yo pemel deteni yo resevwa mony orde', shek ak de vale' yo, ya'p be resi. Kimbe' resi yo pou le wap nan sandrie' Ice' yo mete' la pour sa. Pa je'te' sigaret limin dokiman peronel pa le't rekomande' ou asire'. Le' le't pour jwin tout' afe* ou. ate ou soa meb. Yo de'fan'n moun'n fimin sou kaban. 7). sa yo rive' yap anrejistre' yo kota' yo 0 ske'ke' le't e' D. Apre' ke' yo fin'n pose'ou kesyion, y'ap remet Ant' 8h di matin et 5 h. di swa, shak Fwa on gin pour soti yap distribiye* yo per S.I.D.O./O.I.C. Avan yo rinmet ou you je* Atik ak rade kan 'an. Sonje byin bagay 22 nan selesyion ou dwe' byien abiye'. you le't se pou not idantifie'-1 byin o' sup siyin liv pou yo se byin leta Amerikin yo ye': Pa de'figire'yo, pa 8). Yo pa tolo're' moun'n ki fre'kan ak moun'n ki prouve'ke' li resevwa. You le't ki rekomande' e' d shanje' yo, pa de't wi yo. Le\"ou fin'n binyin wap tapaje® agire' dwe' pour louvri kote* yo de'livre', 1-la min'm shanje' rade pa'or pour me'te' rade kan nan. Ys'p 9). Shak moun'n responsab pou ne 'twaye' kaban'n yo devan S.I.D.O. /O.I.C. Mony orde', shek e' Iajan ld akonpaye' ou nan sant de sante dokte Konsilte' on, ak espas kote' kaban nan kampe' a. Tout' moun'n ensemble depasa' 40 dola sp de'paze' nan kont de'teni-am. Let avan ou fe pati lo moun'n yo. responab kimbe' propre'te' dortwa la. Yo pap peme't nou avoka, tribinal o' biro piblik pap louvri. Pon yo ka II. LOJMAN A. Yo mo'te\" bout2 gason nan soti nan dortwa la san ke'l pa netwaye' nun gou ofisie' facilite' travay de'livrans le't, yo manda' ou pou me'te\" bildig 8 se'ksyion A'a c. Tou't fan's ale* pan bildig responsab la. Propre'te' dortwa la se' responsablite' shak nan te't le't la: adra's-ou, nimero kaban' ou e' nimero 11. ou pa gin dwa shanje* ni Kaban' ni seksyion san moun'n. kaban' ou et nime's kat imigran. Egzanp: Mr. Joe L. ke' shef dortwa la pa ba7 ou permisyon. 10). Yo me'te' bidon fatra tout' kote nan bildig nan. Smith (D) (A22-333-44) Krome S.P.C. Box 160327 B.SE'PARASYON ADMINISTRATIF: Yo 'pare' Se nan yo pour non je'te' fatra. Snapper Creek Station Miemi, FLA. 33116 Konsa Laz moun'n ki bezwin re'te' a pa4 pour re'zon proteksyion 11). Yo Egzije* non obe'yi lo'd ak komandman ke yo fasil pour she'f Imigrasyion de'livre* Ie't yo ak rapidite p'esonel ou paske yo p'e and' dan 'an. Yo separe' pase' not. VIII. LISAJETE'LE'FON YO: pliste\" e'fon moun'n tou pour re'zon me dikal. 12). A 11 20 di SWA yo tinyin tout' limie' eksepte piblik nan tou le' de' bildig yo. De'teni yo dwe' utilize' c. IZOLASYON: Yo ka me'te' ou nan izolasyion lamp de' awi. yo ak egalite'. On pap ka resevoi kol ki soti de* yo\". ou vyiole' Iwa ak regle'm san't la; can kour Goumin IV. KONTE Yo konte' g fwa pe jou, le yap konta' Te'le'fon yo an sevis le matin &pre' netwayaj, ak thef ou at lot dete'ni, le4 ou do twi byin le'ta, move' tout' moun'n dwe' pm seksyion yo kots' tout' pott femin. inspeksyion. La jounin yo femin lo le'r manje, 18\" kcompotman; le' ou vie' fe' vyolaus, le'ou eseye sove', Yo pa tole're' moun'n ki kantrarye' konte' ya ou ki rive' koats' e' lan nwit' Io tout' limie' tinyin si DOU abuze' etc. en reta. Le' yap kcante' tout' moon dwe' kanps kote\" kaban tele fon yo ou sevi nan yo ilegalman sa kab fe' nou pedi D. Si Dokta* mande' pou fe° plis egzamin ak plis yo Jiskaske® oftsie' de'klare' kan-an oavri. Se'le' sa wap privilej ma, ou yo kab minnin you aksyion sivil ou tretman medikal yo kapab mete' nan izolasyion Kapab soti. You le' konsa yo kap fe koute' especial ou kriminel koot nou. medikal, se you kote ki fe't pour sa. Gin dokte'la 24 byien yo kap konte* ak foto. Le' konte' normal yo ka IX. PROGRAM TRAVAY VOLONTE': Chak tre* pa'jou. shanje' si gin you e'venmen ou le gin nesesite. dortwa gia travaye\" ki plase* pour travay kote' nou la ka HI. RE'G JENERAL: Ou dwe' aplike' re'g SR V, MANJE': Yo bay 3 repa varie' byin nourisan e' re'le' lyie' piblik. Yo toushe' you tibagay kom yo pou tax ke wap fe® nan Krome nan. Re'g SB yo fe't byin balanse. Manje' sa yo prepare\" nan kwizin kan-an. re'konpans. Si yo ta gin you no twayaj noral ki pou minteni lo'd ak sekirite' ki bon pour tet pt nou all pour Yo se'vi manje*- a can sal kafe'te'ry a-a. Le' manje' yo fe't yo gin dwe mande* konkou tout' moun'. Mona'ki tout* anplwaye' make' nan shak bilding. Kapab gin Komand manje' in rinmin patisips' nan program travay volonte® dwe' 1). Tout\" ouveti ki gin nan dortwa'la dwe' re'te' espe'sial. Le sa fet li toujou gin konsantman you dokte'. bay non yo bn ofisie' ki nan sevis bildignan. Gin tout' de'kouvri. c'pi pa bare' vantilate' yo, se' pour le' ka Manje pa gin dwa soti nan kafe'te'ria la. kalite' travay, tel ke': o'de' nan sevis manje' a, ede' fo Sevis Imigrasyon E Natirallzasyon"
}
