{
  "anumber": "A72044147",
  "id": "A72044147_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044147_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/14/2023, United States Department of Justice Immigration and Naturalization Service"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/14/2023 e o 9 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE DATE: 09/06/92 MARIR C. VAUGUES FILES A72044147 681 N.W. 102 CT MIAMI, FL 33172 to line 11/23/92 900PM PLEASE COME TO THIS OFFICE: 7980 Biscayne Blvd. Room 490, Miami, FL, 33138 ON: 11/20/92 AT: 100 PM regarding your application for adjustment of status. Failure to respond to this request may result in Appial of your application BE ON TIME. GAME entAval VACTUFS cause you is long or postponement of the Interview CSI 102 Con'T Aim ENERGENCY ALAME must appointment because of an emergency, please indicate below the nature of late emergency and attach evidence of the emergency Sign and date this form and return it to this office immediately. BRING WITH YOU: This letter: an interpreter if you do not speak English: all documents listed below (any document in a foreign language must be accompanied by a certified English translation). Documents submitted must be originals or certified copies that bear the seal of the issuing authority. Provide an addi- tional photocopy of any original document you wish returned YOUR PASSPORT, birth certificate & original entry document (I-94). PROOF OF SUPPORT. You and/or any employed family members mastpresent from each employer a letter on official stationery that indicates theposition, whether the position is temporary or permanent current salary, and date of initial employment. IF YOU HAVE AT ANY TIM BEEN ARRESTED in any country of the world you must submit the following for EACH arrests arresting officer Trearts indictment (if applicable) and document of the case. CURRENT MEDICAL REPORT: As soon as you receive this notice. you are required to make arrangements for your medical examination with one of the medical examiners on the attached list of INS-approved physicians who will perform the required laboratory and ray procedures, if required. as well 95 the medical examination NOTE: Applicants 2 years of age or older are required to have is tuberculin skin test (Mantoux) as part of their medical examination followed by a chest x-ray examination if reaction of 5mtn or greater. ROUTINELY, APPLICANTS UNDER 15 YEARS OF AGE ARE NOT REQUIRED TO HAVE SEROLOGY TESTS AS PART OF THEIR MEDICAL EXAMINATION. IF YOU ARE THE BENIFICIARY OF AR APPROVED VISA PETITION: Bring copies of all documents submitted with that petition."
}