{
  "anumber": "A72044315",
  "id": "A72044315_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ACTE DE MARIAGE ( (CIVIL), 64244"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1953,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 B. C. 364 REPUBLIQUE D HAITI SERVICE DES CONTRIBUTIONS No. 50 50 Cmes. Cmes. 6424 A TE DE ARIAGE (CIVIL) LIBERTE OLGALITE FRATERNITE PAPIER TIMBRECT D'HAITI Cinquante centimes de Gourde Wai a dix heurs trente du matin. L'an mil neuf cent soixante trois, An 150g de l'Indépendance et le Dimanche douze houres du ; Officier de l'Etat Civil de la Section Just de Port-au-Prince expression ant + soussigné Par devant Nous Macques lil. Oniol, Ont comparu: 1) Monsieur georges Hemri de Delva, Internate traduction demeurant et domicilié à Gost-are. Prince, climent minide son bestificat Primptial né à lost all limice H: 37- levingthe ang jamier mil neul cest trents. sit âgé de wingt sept ans et train mis fils ligitime de Monsieur Alfred de Delva, decede demourant et domicilié à tqualifie hom proce stipulant pour lui. et en son mmm personnel, et de posippurse, nee Christiane merove Pierre, demourant et domieiliée à igale ment decided, der a celebration clu d'une part: maringe a des consorts fer Et 2) Madempiselle Elisabeth bliane The'raux, Sponsorse Alisabeth Idaine the née à Gost. au Prince Ses Henri de Delve it demeurant et domiciliée à Part au Prince, disment minie de son Certificat Premuttial rant, appeal autonisa lionagée de dix yeuf ans et cang mais, le dix. new novembre mil meuf cent guarante trois, fille ligtime de me blaude D Hippoly de Monsieur georges Heraux, Igraneme te, du government his le faire Substitu du bo mossease demeurant et domicilié à Best. et de son spouse nee gestrude Kalmar profesio- demeurant et domiciliée à Post an Prince stipulant pour elle Obribunal Bivilde Post-an it for was personal les consentements requis ayant etc donne's, d'autre part; Prince in date du 6Mai lesquels nous ont requis de procéder à la célébration du mariage projeté entre eux et dont 1953,88 les publications ont été régulièrement faites devant la principale porte d'entrée de notre Bu- due reau les dimanches unight huir Avil et ang Wai mil new cent united trois. Aucune opposition au dit mariage ne nous ay ant été signifiée et faisant droit à leur réquisi- tion, après avoir donné aux parties contractantes lecture de toutes les pièces relatives à leur état et aux formalités du Mariage ainsi que du Chapître VI de la Loi No. 6 du Code Civil timmatriculi from d'Haîti, traitant des Droits et Devoirs respectifs des époux, avons demandé aux futurs époux lierence in arms an s'ils consentaient à se prendre pour mari et pour femme. Chacun d'eux ayant répondu sépa- ni 3845,H rément et affirmativement, en présence des témoins ci-après nommés, déclarons, au nom de la loi, que Monsieur georges Henride Delva full et Ittademoiselle Volisabeth reliane Heiraup sont unis par le Mariage. Dont acte fait it passe be domicile en présence de Wadame Gacqueline de Delva, Paxpeste. comptable it de Monsieus Trantz from barl Herant, Agent de varyages, l'exercice eu Carus are du côté de l'époux de Whomaniaus georges Herant, Ograneme it de Wadame Raoul bham, n: 3846, nee Suciennie Williams, du côté de l'épouse; tous lesquatie, majeurs, demeurant et domiciliés à témoins choisis et requis par les parties. Après lecture faite par nous du présent acte, l'avons signé all its etc be de mains Inge myta raye's drois renvis an marge Récépissé de l'Administration Générale des Contributions mail No. 50 Série J Signé: DD"
}