{
	"anumber": "A72044315",
	"id": "A72044315_0035",
	"page_index": 35,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0035/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF ENTRY OF JUDGMENT, 1290"
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 12 ATTORNEY OR PARTY WITHOUT ATTORNE and Address): TELEPI O.: FOR COURT USE ONLY TURNER, CLARK & CZECH (213) 802-2159 14241 E. Firestone Blvd. Ste. 305 La Mirada, California 90638 ATTORNEY FOR (Name): Petitioner SUPERIOR COURT OF CALIFORNIA, COUNTY OF LOS ANGELES STREET ADDRESS: Pomona Superior Court MAILING ADDRESS: 400 Civic Center Plaza CITY AND ZIP CODE: Pomona, CA 91766 BRANCH NAME: East LOS ANGELES SUPERIOR COURT MARRIAGE OF PETITIONER: HENRY DELVA RESPONDENT: ELIZABETH E. DELVA CASE NUMBER: NOTICE OF ENTRY OF JUDGMENT KD 002951 You are notified that the following judgment was entered on (date): JUL 02 1991 1. Dissolution of Marriage 2. Dissolution of Marriage - Status Only 3. Dissolution of Marriage - Reserving Jurisdiction over Termination of Marital Status 4. Legal Separation 5. Nullity 6. Other (specify): Date: JUL 02 1991 Clerk, by Depu - NOTICE TO ATTORNEY OF RECORD OR PARTY WITHOUT ATTORNEY - Pursuant to the provisions of Code of Civil Procedure section 1952, if no appeal is filed the court may order the exhibits destroyed otherwise disposed of after 60 days from the expiration of the appeal time. Effective date of termination of marital status (specify): JUL 02 1991 WARNING: NEITHER PARTY MAY REMARRY UNTIL THE EFFECTIVE DATE OF THE TERMINATION OF MARITAL STATUS AS SHOWN IN THIS BOX. CLERK'S CERTIFICATE OF MAILING I certify that I am not B party to this cause and that 8 true copy of the Notice of Entry of Judgment was mailed first class, postag fully prepaid, in a sealed envelope addressed as shown below, and that the notice was mailed at (place): Pomona California, on (date): JUL 02 1991 Whien Date: Clerk, by . Depun JUL 02 1991 Henry Delva Elizabeth E. Delva c/o: Turner, Clark & Czech 348 Ballena Drive 14241 E. Firestone Blvd. Diamond Bar, CA 91765 Ste. 305 La Mirada, CA 90638 L form Adopted by Rule 1290 NOTICE OF ENTRY OF JUDGMENT Publisher supple Judicial Council of California 1290 (Rev. July 1, 1985) (Family Law) Ov.C.prec. 43"
}
