{
  "anumber": "A72034343",
  "id": "A72034343_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE TO APPLICANT FOR ADMISSION RETAINED FOR HEARING BEFORE IMMIGRATION JUDGE, I-122"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 United States Department of Justice Immigration and Naturalization Service 7203434 NOTICE TO APPLICANT FOR ADMISSION DETAINED FOR HEARING BEFORE IMMIGRATION JUDGE To: MADOU, EXINAL Date: 12/10/92 PLEASE TAKE NOTICE THAT: United You do not States appear to me to be clearly and beyond a doubt entitled to enter the Section 212 (a) (7) (a) (i) as you may came within the exclusion provisions of of the Immigration and Nationality Act, as amended, in that valid a unexpired immigrant visa, reentry permit, border crossing card, possession or other You valid are an immigrant at the time of application for admission not in of entry document required by this act. whether determine whether or not you are entitled to enter the United Immigration Judge Immigration to and Nationality Act, as amended, for a hearing before a of the Therefore you are detained under the provisions of Section 235(b) right to you be shall be excluded and deported. During such hearing will States have or the represented by counsel and to have a friend or relative you present. ADMISSIBLE AT THE HEARING BEFORE THE IMMIGRATION JUDGE YOU MUST ESTABLISH THAT YOU ARE RESULT IMMIGRATION LAWS. FAILURE TO ATTEND THE HEARING AT THE SCHEDULED TIME STATES AND PLACE MA TO THE UNITED STATES UNDER ALL PROVISIONS OF THE UNITED IN A DETERMINATION BEING MADE BY THE IMMIGRATION JUDGE IN YOUR ABSENCE. The hearing is scheduled for To , BE (Time) SeT (Date) (Place) understood address: that you want notice of hearing to be sent to you at the following will be scheduled and you will be notified as to the time and place. It is (Street and Number) (Apt. No.) (City) (Province) (State) (Country) (United States Immigration Officer) CERTIFICATE OF SERVICE Original of this notice was delivered to the above-named applicant by the undersigned on DEL 10/92 and the alien has been advised privileges pursuant to 8 CFR 242.2 MILE (e) of comunication ANDAIN (United Stat es Immigration Officer) Form I-122"
}