{
	"anumber": "A72034343",
	"id": "A72034343_0004",
	"page_index": 4,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72034343_0004/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "INSTRUCTIONS, EOIR-33, Change of Address"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "INSTRUCTIONS PURSUANT.TO 8 CFR 3.19(g), while any proceeding is pending before the Executive Office for Immigration Review the (EOIR), the Service shall immediately advise the Office of the Immigration Judge (OIJ) having control over or Record of taking into Service custody of a respondent/applicant. This notification shall be in writing and shall state Proceedings of a change in the respondent/applicant's custody location or of release from Service custody, subsequent effective date of the change in custody location or status, and, upon the release of the respondent/applicant, OIJ has the the fixed street address, including ZIP code. The purpose of this requirement is to ensure that the his/her appropriate location at which the respondent/applicant may be served with notices or other documents pertinent to his proceedings. (1) The date at the top of this form shall be the effective date of the change in custody location or status. (2) Write in the location of the OIJ office to whom this notice is provided, and the location of the INS office providing the information. (3) This form will by filed with the OIJ for detained cases initially with the filing of the original of the Order to Show Cause; a new form will be prepared and filed with the OIJ each time there is a change in custody location or status. A copy of each form prepared shall be retained in the INS administrative file (A-file). (4) If respondent is transferred in custody to another location outside the area of jurisdiction file of the OIJ, this form is to be forwarded to OIJ via the Office of District Counsel who will a Motion for Change of Venue, if appropriate. Alien is to be provided with a Form EOIR-33, Change of Address upon his/her release from INS custody number and The reminded of the requirement to notify the OIJ within five (5) days of any change of address or telephone (Section 242B (a) (F) (ii)."
}
