{
	"anumber": "A72044147",
	"id": "A72044147_0028",
	"page_index": 28,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044147_0028/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, A72044147"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/14/2023 a D 0 a UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE DATE: 09/06/92 MARIE C. VAUGUES FILE: A72044147 681 H.W. 102 CT MIAMI, FL 33172 To line m11/23/92 at 10900AM. PLEASE COME TO THIS OFFICE: 7880 Biscayne Blvd. Room 490, Miami, FL, 33138 ON: 1/20/92 AT: 1100 PM regarding your application for adjustment of status. Failure to respond to this request may result in Aenial of your application BE ON TIME. cause you B long delaye or postponement of the interview. C 102 Con'T Aim MIAMI EMERGENCY: If you must appointment because of an emergency, please indicate below the nature of the emergency and attach evidence of the emergency. Sign and date this form and return it to this office immediately BRING WITH YOU: This letters an interpreter if you do not speak English all documents listed below (any document in a foreign language must be accompanied by a certified English translation). Documents submitted must be originals or certified copies that bear the seal of the issuing authority Provide an addi- tional photocopy of any original document you wish returned. YOUR PASSPORT, birth certificate & original entry document I-94) PROOF OF SUPPORT You and/or any employed family members mustpresent from each employer a letter on official stationery that indicates theposition, whether the position is temporary or permanent current salary, and date of initial employment. IF YOU HAVE AT ANY TIME BEEN ARRESTED in any country of the world you must submit the following for EACH arrest arresting of icer indictment (if applicable): Refe Preposition of the case. CURRENT MEDICAL REPORT: As soon as you receive this notice, you are required to make arrangements for your medical examination with one of the medical examiners on the attached list of INS-approved physicians who will perform the required laboratory and x-ray procedures, if required, as well as the medical examination HOTE: Applicants 2 years of age or older are required to have a tuberculin skin test (Mantoux) as part of their medical examination followed by a chest x-ray examination, if reaction of 5mm or greater. ROUTINELY APPLICANTS UNDER 15 YEARS OF AGE ARE HOT REQUIRED TO HAVE SEROLOGY TESTS AS PART OF THEIR MEDICAL EXAMINATION. IF YOU ARE THE BENIFICIARY OF AN APPROVED VISA PETITION: Bring copies of all documents submitted with that petition."
}
