{
  "anumber": "A72044315",
  "id": "A72044315_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0042/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Acte de naissance, N° 372448"
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1943
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 LIBERTE CART EGALITE FRATERNITE REPUBLIQUE D HALTI EE No 37248 REPUBLIQUE D'HAITI 20 registros des actes de naissance de la Commune de Port-a Cmes. PCiness depotion au Bureau des Archives Nationales dela République, L'An mid neuf cent quarante trois An 140ème de l'Indé- Vingt centimes de pourde pendance et le Mercredi vingt quatre Novembre à neuf heures G.1.35 JUSTICE TOUS cinq du matin. Par devant nous Edouard Baussan, Officier de POUR l'Etat Civil de Port-au-Prince Section Est Soussigné; A com- paru le citoyen Georges Héraux Idan No 5310- AB, Agronôme, de- meurant et domicilié en cette ville. Lequel nous a présenté une enfant du sexe féminin qu'il nous a déclaré être sa fille légitime née le Vendredi dix neuf Novembre de cette année, à midi quarante cinq à l'Asile Français de son épouse née Gertru- de Kalmar y domiciliée A laquelle enfant il a donné les pré- G.0.20 noms de ELISABETH ELIANE. Dont acte fait en notre Bureau, Rue du Dr Aubry, en présence des citoyens Haus Kalmar et Roger Denis, tous deux majeurs, commerçants, demeurant en cette ville témoins choisis et amenés par le comparant. Après lecture faite avons signé le présent acte avec le père et les témoins ANNEE - 1943 PAGE - 10 (SIGNE) G.Héraux, H.Kalmar, R. Denis et Ed. Baussan NUMERO - 923 RECEPISSE No. 88322 BB Bort-au-Prince, le 27 Novembre 1969. ACTE DE NAISSANCE DE: POUR COPIE CONFORME ELISABETH ELIANE HERAUX COLLATIONNEE. LE DIRECTEUR DES ARCHIVES Nales de la République d'Haiti Laurore St-Jiste M.A. Dteur des Archave's Mles E.F"
}