{
	"anumber": "A72849146",
	"id": "A72849146_0080",
	"page_index": 80,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0080/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ADVICE to International Passengers on Limitation of Liability, NARA, 8/11/2023"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 ADVICE TO INTERNATIONAL PASSENGERS ON LIMITATION OF LIABILITY Passengers on a journey involving an ultimate destination or a stop in a country other than the country of origin are advised that the provisions of a treaty known as the Warsaw Convention may be applicable to the entire journey, including any portion entirely within the country of origin or destination. For such passengers on a journey to, from, or with an agreed stopping place in the United States of America, the Convention and special contracts of carriage embodied in applicable tariffs provide that the liability of certain carriers, parties to such special contracts, for death of or personal injury to passengers is limited in most cases to proven damages not to exceed U.S. $75,000 per passenger, and that this liability up to such limit shall not depend on negligence on the part of the carrier. The limit of liability of U.S. $75,000 above is inclusive of legal fees and costs except that in case of a claim brought in a state where provision is made for separate award of legal fees and costs, the limit shall be the sum of U.S. $58,000 exclusive of legal fees and costs. For such passengers traveling by a carrier not a party to such special contracts or on a journey not to, from, or having an agreed stopping place in the United States of America, liability of the carrier for death or personal injury to passengers is limited in most cases to approximately U.S. 10,000 or U.S. $20,000. The names of carriers, parties to such special contracts, are available at all ticket offices of such carriers and may be examined on request. Additional protection can usually be obtained by purchasing insurance from a private company. Such insurance is not affected by any limitation of the carrier's liability under the Warsaw Convention or such special contracts of carriage. For further information please consult your airline or insurance company representative."
}
