{
  "anumber": "A72849146",
  "id": "A72849146_0069",
  "page_index": 69,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0069/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AVERTISSEMENT PRODUITS AGRICOLES, Screened by NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 AVERTISSEMENT PRODUITS AGRICOLES Afin d'éviter l'entrée de parasites agricoles, sont interdits: fruits, légumes, plantes, produits de+ plantes, terre, viandes, oiseaux. escargots et autres animaux vivants ou produits animaux. Tout défaut de déclaration de ces articles auprés d'un agent des douanes ou des services de l'agriculture peut entrainer des amendes ou d'autres penalités ESPECES ET INSTRUMENTS MONETAIRES Le transport d'espéces ou d'instruments monétaires, quel qu'en soit le montant, est légal. Toutefois, si vous emportez des Etats-Unis ou si vous y apportez (ou si vous tentez d'emporter des Etats-Unis ou d'y apporter) une somme superieure à 10 000 dollars (en monnale des Etats-Unis ou l'equivalent en autre monnale ou une combinalson des deux monnales) en pieces, espéces chéques de voyage ou effets au por- teur tels que les mandats, le chéques, les valeurs et les titres, vous étes requis par la loi d'en faire declara- tion sur le formulaire 4790. Si vous chargez quelqu'un de transporter les espéces ou les instruments mone- taires pour vous vous devez également les déclarer. TOUT DEFAUT DE DECLARATION ou TOUTE FAUSSE DECLARATION PEUT ENTRAINER LA SAISIE DE ESPECES OU DES INSTRUMENTS MONETAIRES, DES PENALITES CIVILES ET (OU) DES POURSUITES PENALES. MARCHANDISES Les résidents des Etats-Unis doivent déclarer, a la rubrique 11. la valeur totale de TOUS les articles acquis à l'étranger (qu'ils soient neufs ou usagés, qu'ils soient soumis ou non aux droits de douane ou qu'ils aient été acquis par achat, comme cadeaux ou autrement) qui sont en leur possession ou en celle de leur famille au moment de leur arrivée. Les visiteurs doivent déclarer, seulement à la rubrique 11. la valeur totale de tous les cadeaux qu'ils rapportent. Le montant des droits de douane à acquitter sera détermine par l'agent des douanes. Normalement les résidents des Etats-Unis ont droit à une franchise douanière de 400 dollars et les non-résidents à une exemption de 100 dollars Normalement les résidents et les non-résidents devront payer un taux fixe de 10 pour cent sur la première tranche de 1 000 dollars dépassant le montant de leurs exemptions. Si la valeur des articles déclarés à la rubrique 11 DEPASSE 1 400 dollars par personne donner ci- dessous la liste des articles et indiquer le prix d'achat ou. pour les cadeaux, la valeur marchande raisonnable. ARTICLES PRIX RESERVE A LA DOUANE TOTAL ADRESSEZ-VOUS A UN AGENT DES DOUANES POUR TOUT RENSEIGNEMENT SUR CE QUI DOIT ETRE DECLARE. Je certifie que jai lu l'avertissement ci-dessus et que ma déclaration est conforme à la vérité. 1/15/94 SIGNATURE DATE (Moria/Jour/Annee) Customs Form 60598 (102584) (Back) (French) U.S.GPO: 1987-0-743-992"
}