{
  "anumber": "A72849146",
  "id": "A72849146_0066",
  "page_index": 66,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0066/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "photograph"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 AVIS R Get More Miles For Your Money And More Car Too! Earn 500 A*Advantage miles on qualifying Avis rentals. Get low, competitive rates. Save time and money with special Avis discounts and services. FREE UPGRADE Just bring this ticket jacket to an Avis airport rental counter in the contiguous U.S. and you'll receive a complimentary one-car-group upgrade US from Avis. Call Avis at 1-800-331-1212 or your travel consultant PASSENGER TICKET for reservations and information. Terms and Conditions Earn mileage credit on qualified Avis rentals. Just provide your AAdvantage number and show your American Airlines or AlvAntage partner ticket or boarding pass for travel within 24 hours of your domestic U.S. flight.- Intermediate (Group C) through a Full Size 4-door (Group E) car. Maximum Complimentary upgrade valid for a one-time, one-car-group upgrade on an upgrade to Premium (Group G), excluding Station Wagon (Group F). Must surrender this ticket jacket panel to agent at time of rental. One upgrade per rental. Valid at Avis corporate and participating licensee locations in the contiguous U.S. Cars and upgrades are subject to availability at time of rental. Renter must meet Avis age, driver and credit requirements. Minimum age is 25 but may vary by location. Offer expires December 31, 1992. RENTAL SALES AGENT INSTRUCTIONS AT CHECKOUT: Assign customer a car one group higher than car group reserved or requested. Upgrade to no higher than Group G, excluding Group F. Charge for car group reserved or requested. In CPN, enter UUWA060. Complete this information: RA# Rental Location: Attach to COUPON tape. American Airlines and AlvAntage are registered trademarks of American Airlines, Inc. American Airlines reserves the right to change AAdvantage program rules, regulations, travel awards and special offers without notice, and to end the AAdvantage program with six months notice. © 1992 Wizard Co., Inc. Avis features GM cars. Pontiac Bonneville. AVIS AVIS"
}