{
	"anumber": "A72890010",
	"id": "A72890010_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72890010_0030/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACION, Nº 1647818"
		},
		"years": {
			"ms_years_nlp_v1": [1975, 2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 PRIMERA CLASE CINCUENTA CENTAVOS 1972-1975 No 1647818 1 ERTIFICACIO 2 El Infrascrito Secretario Municipal y Encargado del Registro Civil 3 de este termino Municipal CERTIFICA: que a pagina 228 del tomo 43 del Libro Orginal de Nacimientos se encuentra el Acta que literal- - 4 mente dice 11 MARIA ENEIDA PAZ \".-En la Ciudad de El Progreso, D. L. 5 6 a las 2p.m. del día sabado veintiuno de Agosto de mil novecientos GENERAL DE cincuenta y tres. -Ante mi Carlos Romero Secretario del Concejo de HOMELAND este Distrito Local y Encargado del Registro Civil y ante los tes- - HONDURAS 9 tigos Angel Bustillo y Luis Jiron, mayores de edad, y vecinos compa ADUANAS reció el señor FRANCISCO PAZ, mayor de edad, soltero, labrador y SHAMM Median de este vecindario, dando cuenta que en su casa de habitacion, si- 1 ta en la Aldea de Urraco el día jueves doce del presente mes a las 12 ocho de la mañnaa nacio una niña a quien puso por nombre \" MARIA CENTRAL DE 13 ENEIRA \" Es hija natural del declarante a quien la reconoce en esté Acto y de la señora SEFERINA VALLE, mayor de edad, soltera, de ofi- 15 cios domesticos, y de este vecindario Son Abuelos Paternos: Doña Ju 16 lia Paz hondureña, y vecina y Abuelos Maternos: la señora Gregoria 17 Valle ya difunta y vecina que fue de este Distrito.- - Lei lo escrito 18 al/compareciente y estando conforme firmo.-Francisco - Cruz.- - Luis Gi 19 ron . - Angel Bustillo. - Sello.- - C. Romero P. Srio. Mpal'. - NOTA le 20 gitimado por Matrimonio contraído entre FRANCISCO PAZZ Y CEFERINA 21 VALLE, autorizado por el Jefe del Concejo de este D.L. el 18 de Ju 22 Tane nio de 1.955.- - En Concecuencia \"MARIA ENEIDA es hija legitima. El , 28 Progreso, Yoro, 20 de Junio de 1.955.- - Sello. - J. Efraín Castañeda 24 25 Srio. Mpal' . -"
}
