{
	"anumber": "A72845268",
	"id": "A72845268_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72845268_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Liberté, Égalité, Fraternité, N°57"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 N°:57 24 SEP. 1990 24 CTD 1990 LIBERTE EGALITE FRATERNITE REPUBLIQUE ''HAITI Extrait des Registres de l'Offi cier de l'Etat Civil de Port-au-- 1,50 1.50 Prince, section NORD.- A3 81864 Gde. Gde.ACTE INSCRIPTION DE NAISSANCE DE: GELIN DIEUVILLE. L'An mil neuf cent quatre vingt dix (1990), An 187e de 1'In- Une gourde cinquante centimes dépendance et le Vendredi vingt et un (21) Septembre, à onze heures du matin. NOUS Me.Daniel D. DESROSIERS, Officier de l'Etat Civil de Port au-Prince, section Nord, soussigné. CERTIFIONS Avoir inscrit aux Registres y afferents, en conformité de la loi du vingt août mil neuf cent soixante quatorze (1974),3 dis- positif d'un jugement rendu par le tribunal civil de Port-au-- Prince séant au Palais de Justice de cette ville, en audience publique et civile, le treize Septembre mil neuf cent quatre vingt dix. Sur requete du sieur GELIN DIEUVILLE, sous la constitution de Me. Jean GARNIER, Avocat de ce Barreau, dûment patenté et imposé. Lequel Dispositif est ainsi concu PAR CES MOTIFS:-Le tribunal aprés examen sur les con-- clusions du Ministère Public dit et déclaré sous la réserve--- des droits de ceux qui ont interets et qualités que: GELIN DIEUVILLE, du sexe masculin est né à l'Arcahaie, le cinq decem-- bre mil neuf cent deux, des oeuvres naturelles de Romélus Dieu- ville et de la dame Gabélise Gabriel, tous deux décédés; Dit que le Dispositif du present jugement tiendra lieu d'acte de nais- sance de Gélin Dieuville; Ordonne la transcription du disposi-- tif du present jugement sur le régistre spécial tenu en double à cet effet par l'Officier de l'Etat civil de la section Nord de port-au-Prince, conformément aux dispositions de la loi sur le service d'Inspection et de controle de l'Etat Civil.- Ainsi jugê et prononcé par Nous, Arnold Charles, doyen du Tribunal Civil de Port-au-prince, en audience publique et civi- le du treize Septembre mil neuf cent quatre vingt dix, en pre-- sence de me. Larive Lominy, substitut du Commissaire du Gouver- nement de ce ressort avec l'assistance de Monsieur Ascencio-- Jumelle, greffier. Il est ordonné ect En foi de quoi...ect Ainsi Signé:A.Charles,A.Jumelle. Pour Expedition Conforme D'ETAT Collationnée DAVIE Le greffier Ascencio Jumelle. Dont acte fait et passé en notre Bureau de l'Etat civil de Port-au-prince,secti Nord sis a la rue du Centre # 99. Le Vendredi vingt et un Septembre 1990. Bureau de l'Etat Civil de rttau-Prince section Nord. SECTION HORY ME DANIEL D.DESROSIMS OFFICIEADELFTATCIVIL SECTION NORO paniel D.Desrosiers"
}
