{
  "anumber": "A72851592",
  "id": "A72851592_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72851592_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NARA - National Cholesterol Educational Program, Screeneded by NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 PRRECOMMENDATION BY THE NATIONAL CHOLESTEROL EDUCATIONAL PROGRAM Cholesterol % 75th 10th PERCENTILE MODERATE RISK LIPID DESIRABLE BO LINE HIGHER RISK GR 3 THAN 90th PERCENTILE: HIGH RISK CHOLESTEROL <200 MG/DL 200-239 MG/DL >240 MG/DL *LDL CHOLESTEROL <130 MG/DL 130-159 MG/DL >160 MG/DL HDL CHOLESTEROL <35 MG/DL (**)THE BLOOD LIPID SCORE IS A PERCENTILE RANKING OF THE LIPID STATUS DERIVED FROM MULTIVARIATE ANALYSIS LESS THAN 25 LOWEST 26.50 LOW 51-75 MODERATE 76-89 HIGH GREATER THAN 90 HIGHEST EXPLANATION OF THE BETHESDA SYSTEM AND THE OLD PAP CLASS EQUIVALENTS BETHESDA SYSTEM OLD PAP CLASS OF PAP SMEAR REPORTING EQUIVALENT NEGATIVE SMEARS ROUTINE FOLLOW-UP PAP SMEARS PREVIOUS CLASS 1 WITHIN NORMAL LIMITS BENIGN CELLULAR REACTIVE AND/OR REPARATIVE CHANGES CHANGES GENERALLY ASSOCIATED (WITHIN NORMAL LIMITS) WITH INFECTION AND/OR WILL INCLUDE PATHOLOGIST'S INFLAMMATION ROUTINE THERAPY COMMENT RE REACTIVE/ AND FOLLOW-UP INDICATED REPARATIVE CHANGES PREVIOUS CLASS I SQUAMOUS CELL ATYPIA OF ATYPICAL CHANGES POSSIBLY DUE TO UNDETERMINED SIGNIFICANCE INFLAMMATION HOWEVER CYTOLOGICAL CHANGES ARE PRESENT THAT MAY INDICATE EARLY DYSPLASTIC CHANGES GLANDULAR CELL ATYPIA OF LOCAL THERAPY AND FOLLOW-UP IS UNDETERMINED SIGNIFICANCE RECOMMENDED TO RULE OUT THE POSSIBILITY OF DYSPLASIA PREVIOUS CLASS 11 LOW GRADE MILD DYSPLASIA EARLY DYSPLASTIC INTRAEPITHELIAL CHANGES WITH OR WITHOUT ASSOCIATED LESION (MILD DYSPLASIA) CHANGES OF HPV (HUMAN PAPILLOMA VIRUS). SUGGEST FOLLOW-UP WITH WITH OR WITHOUT HPV EARLY REPEAT SMEAR AND COLPOSCOPY (HUMAN PAPILLOMA VIRUS) IF CLINICALLY INDICATED PREVIOUS CLASS III A (CIN 1) HIGH GRADE MODERATE TO SEVERE DYSPLASIA AND/ INTRAEPITHELIAL OR CARCINOMA IN SITU WARRANTS LESION (MODERATE TO COLPOSCOPY AND BIOPSY PREVIOUS SEVERE DYSPLASIA AND/OR CLASS III B AND CLASS III C CARCINOMA IN SITU (CIS) (CIN Il III). HIGH GRADE SUSPICIOUS FOR CARCINOMA INTRAEPITHELIAL BIOPSIES AND/OR D&C LESION WITH QUALIFYING INDICATED DEPENDING ON PATHOLOGIST'S COMMENT REMARKS PREVIOUS CLASS IV SQUAMOUS CELL CARCINOMA POSITIVE FOR MALIGNANCY PREVIOUS CLASS V ADENOCARINOMA REFERENCE LAB LIST WITH PROVIDERS NUMBERS: DFL: ORL: WPB MIA: TET: METPATH DEERFIELD BEACH METPATH ORLANDO METPATH WEST PALM BEACH METPATH MIAMI METPATH TETERBORO 1300 EAST NEWPORT CENTER DR. 518 S. MAGNOLIA AVE 2617 N. FLAGLER SUITE 110 8720 N. KENDELL DR. #114 1 MALCOLM AVE DEERFIELD BEACH. FL 33442 ORLANDO, FL.32801 WEST PALM BEACH F. 33407 MIAMI. FL 33174 TETERBORO, N.J. 07608 V. GEMELLARO M.D. D.A. MAURER M.D. V. GEMELLARO M.D. J.L. BOWEN M.D. J. O'BRIEN M.D. MEDICARE # 108308 MEDICARE # 108234 MEDICARE # 108055 MEDICARE # 108308 MEDICARE # 108886 MEDICAID # 0300551-00 MEDICAID # 0300861-00 MEDICAID # 0300543-00 MEDICAID // 0300551-00 MEDICAID # 030228-00"
}