{
	"anumber": "A72845268",
	"id": "A72845268_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72845268_0019/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FRATERNITÉ, 64 197"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 1974, 1993, 2023, 1902]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "LIBERTE Screened by NARA 7/27/2023 &CALITY FRATERNITE REPUBLIQUE D'HAITI REPUBLICAN Extrait des registres des actes de naissance de la commune de Port-aa Prince; déposés au Bureau des Archives Nationales de la République 64197 A9 N° 1.50 1.50 LI An mil neuf cent quatre vingt dix (1990) An 157mc de l'Indépendance et le vendredi vingt et un (21) Septembre à onze PAPIER TIMBREC. heure du matin. Nous Me Daniel D. Desrosiers, officier de l'Etat civil do Port-au-Prince, section Nord, soussigné. Certifions avoir Une gonrda cinquante centimes transcrit aux registres y afferents en conformité de la loi du REPUBLIQUE D'HAITI JUSTICE vingt (20) Août mil neuf cent soixante quatorze (1974) le dispo- sitif d'un jugement rendu par le tribunal civil de Port-su-Prince, séant au Palais do Justice de cette ville on audience publique et civile le treize (13) Septembre mil neuf cent quatre vingt dix (1990). Sur requete du siour GELIN DISUVILLE, sous la constitu- ANNES 1990 tion de Me Jean Garnier, avocat de ce Barreau, dument patenté et PAGE 9 imposé. Lequel dispositif est ainsi conçu PAR CES MOTIFS NUMERO 57 L3 tribunal, aprils examen sur les conclusions du Minists re public, dit et déclars sous la réserve des droits et ceux qui ACTE D'INSCRIPTION DE ont intérsts st qualités que CELIN DIEUVILLE du sexe masculin est NAISSANCE D5: né A l' Arcahaia le cinq (5) Décembre mil neuf cent deux (1902) GELIN DIEUVILLE des oouvres naturelles de Romélus Dieuville et de la dams Gabélise Gabriel, tous deux décédés dit que le dispositif du présent jugs- ANH A 655842 ment tiendra bieu d'acte de naissance de Gélin Dieuville, ordonne la transcription du dispositif du présent jugement sur le registre spécial tenu en double & cet offet par l'officier de l'Stat civil de la Section Nord do P-au-Prince, conformément aux dispositions de la loi sur le service d'inspection at de controle de 1'Stat ci- vil. Ainsi jusé at prononcé par nous Arnold Charles, Doyen du Tribu nal civil de Port-su-Prince en audience publique et civile du trei ze (13) Septembre mil neuf cont quatre vingt dix (1990) en présen 00 da the Lariva Lominy, substitut av. achwissaire du Gouvernement de CO res ort av3c l'assistance de Monsfeur Ascencio Jumells Gref- fior. I1 est ordonné otc. En fb danqioi to Ainsi signé A.Charles A.Jumollo, expédition conforman collations SIGN : DANIEL D.DASROSIERS POUR JE. WILFRID BERTRAND CSD the Avril 1993 CONFORME DIRECTEUR GENERAL"
}
