{
  "anumber": "A72849146",
  "id": "A72849146_0077",
  "page_index": 77,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0077/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ISSUED BY AMERICAN AIRLINES, INC., AA FORM NO. 920ICPN 5690718"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1955,
        2023,
        1929
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 ISSUED BY AMERICAN AIRLINES, INC. NOTICE SOLD SUBJECT TO TARIFF REGULATIONS If the passenger's journey involves an ultimate destination or stop in a country other than the country of departure the Warsaw Convention Air tr may be applicable and the Convention governs and in most cases limits the liability of carriers for death or personal injury and in respect terms of loss of or damage to baggage. See also notice headed \"Advice to International Passengers on Limitation of Liability.\" on w CONDITIONS OF CONTRACT with 1 1. As used in this contract \"ticket\" means this passenger ticket and baggage check, of which these conditions and 6. Any exclusion of limitation of liability of carrier shall apply to and be for the benefit of agents, servants and the notices form part, \"carriage\" is equivalent to \"transportation,\" \"carrier\" means all air carriers that carry or undertake representatives of carrier and any person whose aircraft is used by carrier for carriage and its agents, servants to carry the passenger or his baggage hereunder or perform any other service incidental to such air carriage, \"WARSAW and representatives. CONVENTION means the Convention for the Unification of Certain Rules Relating to International Carriage by Air signed 7. Checked baggage will be delivered to bearer of the baggage check in case of damage to baggage moving in at Warsaw. 12th October 1929, or that Convention as amended at The Hague, 28th September 1955. whichever may international transportation complaint must be made in writing to carrier forthwith after discovery of damage and, be applicable. at the latest, within 7 days from receipt; in case of delay. commplaint must be made within 21 days from date 2. Carriage hereunder is subject to the rules and limitations relating to liability established by the Warsaw the baggage was delivered See tariffs or conditions of carriage regarding non-international transportation Convention unless such carriage is not \"international carriage\" as defined by that Convention 8. This ticket is good for carriage for one year from date of issue except as otherwise provided in this ticket, 3. To the extent not in conflict with the foregoing carriage and other services performed by each carrier are subject in carrier's tariffs, conditions of carriage, or related regulations The fare for carriage hereunder is subject to change to: (1) provisions contained in this ticket, (II) applicable tariffs, (III) carrier's conditions of carriage and related regulations prior to commencement of carriage. Carrier may refuse transportation if the applicable fare has not been paid. which are made part hereof (and are available on application at the offices of carrier), except in transportation between 9. Carrier undertakes to use its best efforts to carry the passenger and baggage with reasonable dispatch Times a place in the United States or Canada and any place outside thereof to which tariffs in force in those countries apply. shown in timetable or elsewhere are not guaranteed and form no part of this contract Carrier may without notice 4. Carrier's name may be abbreviated in the ticket, the full name and its abbreviation being set forth in carrier's tariffs, substitute alternate carriers or aircraft, and may alter or omit stopping places shown on the ticket in case of necessity conditions of carriage, regulations or timetables; carrier's address shall be the airport of departure shown opposite Schedules are subject to change without notice. Carrier assumes no responsibility for making connections You ca the first abbreviation of carrier's name in the ticket; the agreed stopping places are those places set forth in this ticket 10. Passenger shall comply with Goverment travel requirements, present exit, entry and other required documents You ha or as shown in carrier's timetables as scheduled stopping places on the passenger's route; carriage to be performed and arrive at airport by time fixed by carrier or, if no time is fixed, early enough to complete departure procedures. hereunder by several successive carriers is regarded as a single operation 11. No agent, servant or representative of carrier has authority to alter, modify or waive any provision of this right, u 5. An air carrier issuing a ticket for carriage over the lines of another air carrier does $0 only as its agent. contract air car CARRIER RESERVES THE RIGHT TO REFUSE CARRIAGE TO ANY PERSON WHO HAS ACQUIRED A TICKET IN VIOLATION OF APPLICABLE LAW OR CARRIER'S TARIFFS, RULES OR REGULATIONS are sold"
}