{
  "anumber": "A72845268",
  "id": "A72845268_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72845268_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "GENETIC DESIGN, PA™ TRINITY EVALUATION REPORT"
    },
    "years": {
      "ms_years_nlp_v1": [
        1994,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/27/2023 PA RNITY EVALUATION REPO 7017 ALBERT PICK ROAD GREENSBORO, NC 27409-9525 GENETIC DESIGN Race Blood Drawn Mother ERMITE SEME (NOT TESTED) Haitian Child JOSEPH ST. JEAN DIEUVIL February 23, 1994 Alleged Father GELIN DIEUVIL Haitian February 23, 1994 Case Number: Reference No.: 0029841301/94096898 Location: MIAMI, FL Account: BC800D PATERNITY SYSTEM MOTHER CHILD ALLEGED FATHER INDEX DNA: D17S26 ? 1.53 2.94 EFD52/HAEIII ? 4.26 4.26 5.73 D4S139 ? 4.02 2.63 H30/HAEIII ? 4.49 4.49 3.19 D10S28 ? 1.81 5.39 TBQ7/HAEIII ? 1.26 1.26 6.33 D7S467 ? 1.78 4.83 AC415/HAEIII ? 3.66 3.66 2.00 PROBABILITY OF PATERNITY 99.57% COMBINED PATERNITY INDEX 231 to 1 CONCLUSIONS: The alleged father, GELIN DIEUVIL, cannot be excluded as the biological father of JOSEPH ST. JEAN DIEUVIL. Based on the above genetic testing results, the probability of paternity is 99.57% as compared to an untested random man of the North American Black population. (Prior Probability = .5) 99.99% of falsely accused men would be excluded as the father by the above tests. I, the undersigned Director, upon being duly sworn on oath, do depose and state that I read the foregoing report on the analysis of genetic specimens from the above-named individuals, signed by myself, and that the facts and results therein are true and correct. Sworn to and Subscribed before me this R. Scott Foster, Ph.D., Director 22nd day of mar , 1994 Berta Hamby Huggins, Ph.D., Director at Greensboro, North Carolina. Robert A. Bever, Ph.D., Director mary P. North Hopeer Carolina Lawrence A. Chavez, Ph.D., Director Kristine H. Durkee, Ph.D., Director Notary Public, State of Deborah L. Cutter, Ph.D., Associate Director My commission expires 12-6-98 Charles M. Kelly, Ph.D., Associate Director Ruth P. Koester, Ph.D., Associate Director Genetic Design, Inc. is accredited by the Parentage Testing Committee, American Association of Blood Banks Rev. 01/11/94"
}