{
	"anumber": "A72849146",
	"id": "A72849146_0081",
	"page_index": 81,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0081/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "JAPAN Tokyo Outside Tokyo 03-3248-2011 PUERTO RICO San Juan LIECHTENSTEIN 0120-000860 Outside San 749-1747 9800-146-20 LUXEMBOURG 046-051444 Juan aris MARTINQUE 08002008 ST. KITTS 137-800-462-8455 42-89-05-22 Fort de France LUCIA 465-2273 Outside Paris 021-6488 749-1840 GERMANY, F.R. 05-23-00-35 MEXICO 51.12.29 ST. MAARTEN/ST. MARTIN 452-1820/40 SPAIN 52046 Frankfurt Acapulco Montreal 663-5044 69-230591 4-12-44 Madrid Outside Frankfurt Cancun Niagara Falls 397-9635 0130-4114 Outside Madrid 597-2068 91-800-50222 468-4211 GRENADA, W.I. Guadalajara 16-40-90 SWEDEN 900-100-556 Ottawa Toronto GUADELOUPE 444-2222 230-5588 Juarez Matamoros 0-8-533-9909 Stockholm Pointe Pitre 08-24-61-45 QUILLA 283-2243 497-3131 Vancouver Outside Stockholm 020-78-03-55 ANTIGUA CAYMAN ISLANDS 800-433-7300 462-0950 GUATEMALA 83.62.62 0-8-541-9427 Mexico City 399-9222 SWITZERLAND ARGENTINA Grand Cayman Guatemala Monterrey Zurich 58-91-00 Buenos Aires CHILE 949-8799 City Nuevo Laredo 0-8-722-0112 Outside Zurich 221-3110 ARUBA 312-5031 HAITI 347-379 Puerto Vallarta TRINIDAD 155-14-44 22700 Santiago AUSTRIA COLOMBIA 6713-004 NETHERLANDS 91-800-50222 Port Au Prince Port of Spain 285-1111 HONDURAS 6-0100 NICARAGUA 060227844 UNITED KINGDOM 664-4661 Vienna 066-04-91 Bogota BARBADOS Barranquilla 45-95-11 San Pedro Sula Managua London, England Bridgetown Cali 504-58-0518 NORWAY 663-881 Outside London 081-572-5555 BELGIUM 428-4170 Tegucigalpa 0800-010151 COSTA RICA 81-31-11 ITALY 504-32-1414 PANAMA 050-101-20 Glasgow 0800-010151 Brussels Jose Ireland to London Outside Brussels 02-508-7700 DOMINICAN REPUBLIC 22-5655 Rome Panama City 06-482-4542 69-6022 VENEZUELA 1-800-535345 BELIZE 114608 Puerta Plata Outside Rome PARAGUAY Caracas 689-4151 1-6-786-5027 Asuncion Outside Caracas 285-3133 Belize City Santo Domingo JAMAICA 02-32522 809-542-5151 PERU 44-3330 All Other Areas Kingston VIRGIN ISLANDS 02-91-42-22 1-200-1122 924-8305 Lima Montego Bay 952-5950 POLAND 42-8555 St. Croix/St. Thomas 800-474-4884 Warsaw 482-625-3002 Tortola/Virgin Gorda Dial 7 & ask for AA BAGGAGE INFORMATION LOCK YOUR BAGGAGE. WE PUT CAN YOUR RETURN NAME IT TO AND YOU ADDRESS IF IT IS MISPLACED. ON THE OUTSIDE OF YOUR BAGGAGE so three FREE BAGGAGE pieces of ALLOWANCE: American will accept for each baggage allowance baggage may be any free of of the charge. following: Combined checked ticketed and passenger carry-on CASH AMERICAN OR OTHER IS NOT RESPONSIBLE FOR CAMERA EQUIPMENT, 3 pieces checked and no carry-on PRESCRIPTIONS, BAGGAGE. THESE ITEMS, AS WELL AS MEDICATIONS CHECKED OR CARRY-ON SIMILAR VALUABLE ITEMS CONTAINED IN JEWELRY, OR 2 pieces checked and 1 carry-on 1 piece checked and 2 carry-on SHOULD BE CARRIED PERSONALLY BY YOU. The height) three of bags 62\", 55\" may not exceed total outside dimensions BAGGAGE PER OUR PASSENGER LIABILITY DOMESTICALLY FOR LOSS, DAMAGE AND $640 OR DELAYS PER PIECE IS LIMITED TO $1,250 American and 45\" respectively. Maximum weight (length + width AN EXCESS FOR INTERNATIONAL TRAVEL. THESE LIMITS OF WILL CHECKED APPLY UNLESS items, such or weight limitations, or are in excess of the free to items which exceed size stowage capacity of the aircraft. Extra charges apply carry-on bags based on may place additional size and weight restrictions per on bag is 70 lbs. VALUATION IS DECLARED AT TIME OF CHECK-IN. allowance. as skis and golf clubs, will be accepted one item allowance. under the Certain free Some restrictions may apply outside the U.S. as OWN FRAGILE RISK. OR PERISHABLE ARTICLES WILL BE CHECKED ONLY AT YOUR to CARRY-ON space BAGGAGE: A maximum of two bags may be carried on board considered availability of and government baggage limitations. A subject AND TEAR TO BAGGAGE. IN AMERICAN DOES NOT ASSUME LIABILITY FOR NORMAL CARE WEAR HANDLING. SCRATCHES, NICKS OR DIRT MAY APPEAR ON BAGGAGE DESPITE an stowed before compartment the or under a seat. All baggage must Baggage be must fit in overhead one the allotted pieces, as are garment bags. briefcase is toys will not radios, be TVs, cellular telephones, video cameras and equipment such as portable aircraft may depart the gate. Use of completely flight. permitted during flight. Lap top computers may some be used electronic during RESTRICTED ARTICLES SMOKING Acid, hazardous lighter fluid, matches and other items classified by the U.S. Government or as agents, radioactive materials and irritating materials--cannot gasses, be poisons, etiologic oxidizing materials, corrosive materials, compressed solids and liquids, materials--including but not limited to explosives, flammable as and Smoking from is not permitted on American's domestic U.S. flights, including less in Puerto Rico, St. Thomas, St. Croix and Canada scheduled for those to firearms checked or carry-on baggage. U.S. Government regulations do carried in or On either direction. Smoking is not permitted on any American six hours unloaded in carry-on baggage and require that firearms in checked not allow and declared. Firearms must be presented in a hard baggage case be non-smoking sections and strive to honor your preference. If smoking or flights where smoking is permitted, we offer the choice of either Eagle flight. crushproof-type container manufactured specifically for shipment. Containers or with a all are full, the ticket agent or flight attendant will make every effort smoking to reseat sections If handguns must be locked. are rows or the entire aircraft may be declared non-smoking. Cigar- and additional non-smokers cannot be accommodated in the non-smoking section, you. through lighter containing regular lighting fluid, please do not use brought or refill a see- it in prohibited, as is smoking in the aisles or lavatories. If you pipe-smoking flight. We appreciate your cooperation. RESERVATIONS/RECONFIRMATION CHECK-IN REQUIREMENTS Coach reservations passengers originating travel in Latin America must reconfirm 72 hours prior to departure. Some international carriers their requirements. reconfirmation of your reservation. Contact the transporting carrier for applicable require Your held reservation, as well as your seat assignment on your boarding pass, will be board until 10 minutes before your scheduled departure. To avoid problems, be cancel Please cancel your reservation if there is a change in your travel plans. Failure aircraft at least 10 minutes before scheduled departure. gate, receive your boarding pass and be at the boarding point ready to board departure the the aircraft or check in with an American Airlines agent at the on itinerary. a confirmed booking will result in automatic cancellation of your entire to For international travel, we suggest that you arrive at the airport at least 2 hours prior to your departure time. This will allow sufficient time to complete all necessary international departure requirements."
}
