{
  "anumber": "A72849146",
  "id": "A72849146_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Bienvenue aux États-Unis, FORM APPROVED OMB NO. 1516-0441"
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 BIENVENUE AUX ETATS-UNIS TREASURY MINISTERE DES FINANCES SERVICE DES DOUANES DES ETATS-UNIS SECURITY DECLARATION EN DOUANE FORM APPROVED OMB NO. 1515-0041 seule Tout voyagaur déclaration ou écrite chef de par famille famille arrivant est requise): aux Etats-Unis doit donner les renseignements suivants (UNE Roseme Girolia 1. Nom: CiBalia Nom de famille Prenom 2. Nombre des membres de votre famille voyageant avec vous Initiale du 2ème prénom 3. Date de naissance: 30111 122 4. Ligne afrienne et PA Male Jour Annee numéro de vol: #424 5. Adresse aux Etats-Unis: 1060 NW 129st 27 Ave miami the 33137 6. Je suis citoyen américain Si la résponse est négative OUI NON donner la nom du pays: 7. Je suis résident permanent des Etats-Unis SI la riponse est négative, OUI NON donner la durée prévue du séjour: 8. La but de mon voyage est ou etait: AFFAIRES LOISIRS 9. Je suis (nous sommes) on possession de fruits, plantes, produits alimentaires, terre. alseaux escargots, autres animaux viandes, OUI produits agricoles. ou j'ai (nous avons) visite une exploitation agricole vivants, ou NON un ranch en dehors des Etats-Unis. 10. Je suis (ROUS sommes) porteur(s) d'une somme ou d'instruments montaires supérieurs à 10 000 dollars des Etats-Unis (ou l'equivalent en OUI NON une autre monnaie). 11. La valeur totale de tous les articles que j'ai (nous avons) achetés l'étranger et que apporte (nous apportons) BUX Etats-Unis est de ou acquis declarer instructions que au la Verse valeur à des la rubrique cadeaux): Marchandises; les visiteurs ne (Voir doivent les $2/00 00 valeur exprince on dollars des Etats-Unis SIGNER AU VERSO APRES AVOIR w L'AVERTISSEMENT (No pas écrire sous cette Signe) INSPECTOR'S NAME STAMP AREA BADGE NO. exigo Avis concernant la Loi portant réduction des formalités: La Lol de 1980 si vous que étes nous teru vous de nous disions les pourquel donner. nous recuellions ces informations comment partent réduction nous les des utiliserons formalités Unis sur la douane, l'agriculture et les Nous monnales. demandons Nous ces avons informations besoin de on application des lois des Etats et exacts surer aue des les droits voyageurs de douane observent et des ces taxes. leis et Votre pour réponse nous permettre est obligatoire. de calcular ces informations of de prelever pour les nous montants as- Customs Form 60598 (102584) (French)"
}