{
  "anumber": "A72890010",
  "id": "A72890010_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72890010_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, Form 1-1344 ( (Rev. 12/8/95)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 OMB No. 1115-0062 Expires 12/86 U.S. Department of Justice Immigration and Naturalization Service Affidavit of Support (ANSWER ALL ITEMS: FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) I, ENEIDA GUIDO residing at 361 W. CHEVY CHASE DR, (Name) (Street and Number) GLENDALE CA 91204 U.S.A. (City) (State) (ZIP Code if in U.S.) (Country) BEING DULY SWORN DEPOSE AND SAY: 1. I was born on 08/12/43 at EL PROGRESO YOR HONDURAS C.A. (Date) (City) (Country) If you are not a native born United States citizen, answer the following as appropriate: a. If a United States citizen through naturalization, give certificate of naturalization number 11302212 b. If a United States citizen through parent(s) or marriage, give citizenship certificate number C. If United States citizenship was derived by some other method, attach a statement of explanation. d. If a lawfully admitted permanent resident of the United States, give \"A\" number 2. That I am 50 years of age and have resided in the United States since (date) 1975 3. That this affidavit is executed in behalf of the following person: Name Sex Age PAZ BONILLA FRANCISCO M 81 Citizen of-(Country) Marital Status Relationship to Deponent HONDURAS WIDOW FATHER Presently resides at--(Street and Number) (City) (State) (Country) 361 W. CHEVY CHASE DR GLENDALE, CA. 91204 U.SA. Name of spouse and children accompanying or following to join person: Spouse Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age Child Sex Age 4. That this affidavit is made by me for the purpose of assuring the United States Government that the person(s) named in item 3 will not become a public charge in the United States. 5. That I am willing and able to receive, maintain and support the person(s) named in item 3. That I am ready and willing to deposit a bond, if necessary, to guarantee that such person(s) will not become a public charge during his or her stay in the United States, or to guarantee that the above named will maintain his or her nonimmigrant status if admitted temporarily and will depart prior to the expiration of his or her authorized stay in the United States. 6. That I understand this affidavit will be binding upon me for a period of three (3) years after entry of the person(s) named in item 3 and that the information and documentation provided by me may be made available to the Secretary of Health and Human Services and the Secretary of Agriculture, who may make it available to a public assistance agency. 7. That I am employed as, or engaged in the business of SELF EMPLOYED with SAMPLE MAKER (Type of Business) (Name of concern) at 3613 W. CHEVY CHASE DR GLENDALE, CA U.S.A. (Street and Number) (City) (State) (Zip Code) I derive an annual income of (if self-employed. / have attached a copy of my last income tax return or report of commercial rating concern which I certify to be true and correct to the best of my knowledge and belief. See instruction for nature of evidence of net worth to be submitted.) $ 16,258.00 I have on deposit in savings banks in the United States $ 661.67 I have other personal property, the reasonable value of which is $ 25,800.00 Form"
}