{
	"anumber": "A72851592",
	"id": "A72851592_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72851592_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXPLANATION OF PATERNITY EVALUATION RESULTS, NARA, 8/11/2023"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 7017 Albert Pick Road Greensboro, NC 27409-9654 (800) 247-9540 GENETIC DESIGN EXPLANATION OF PATERNITY EVALUATION RESULTS Paternity testing involves the identification of genetic markers in blood obtained from the parties in disputed parentage cases. The genetic markers are represented by groups of chemical substances which prove the presence of specific genes in defined genetic systems. Blood is a mixture of cell types in a supporting liquid called plasma. The test systems most frequently used in paternity testing can be categorized by the blood component utilized. 1. Red Blood Cells: Genetic markers on red blood cells are called antigens and they are identified by their reaction with reagents called antibodies. ABO and Rh are examples of blood groups in this category. 2. Red Blood Cell Enzymes and Plasma Proteins: Genetic markers in this category are identified by placing the liquid substances of the blood on a supporting surface and allowing them to migrate as charged particles in an electric field (electrophoresis). Under these conditions, the individual groups separate into bands of spots which allow their identification. 3. HLA (human leukocyte antigens): White blood cells provide a convenient cell for the identification of a large and diverse group of substances called histocompatibility antigens. The typing of these antigens (HLA) is used to match organ transplant donors and recipients and constitutes one of the most useful systems tested in disputed paternity cases. 4. DNA Typing: DNA testing is a powerful system that can exclude the falsely accused man or provide convincing evidence that the man is the biological father of the child. Using DNA testing, the sizes of the two DNA fragments of the child are compared with the mother and alleged father. The DNA fragment sizes are measured in kilobase pairs. One of the fragments must be inherited from the mother. The remaining fragment of the child must be contributed from the biological father. If the alleged father does not have that specific size DNA fragment, then that alleged father is excluded. If the alleged father and the child have a DNA fragment in common, then that alleged father cannot be excluded and a paternity index is reported for that specific DNA locus based on how common or rare that DNA fragment is in the relevant racial population. The test results are analyzed for exclusions by assessing genetic inconsistencies between the mother, child and the alleged father (that is, blood groups or DNA fragments in the child that cannot be explained as having been inherited from either the mother or alleged father). By using combinations of the above genetic systems, an average of 98-99 out of 100 men falsely accused of paternity can be excluded. If an exclusion is not found, the inclusionary genetic evidence is quantitated in the form of a paternity index which combines the rarity of the genetic markers potentially shared between the alleged father and the child with genetic aspects of their inheritance. The paternity index is reported as an odds ratio which tells how many times more likely the alleged father is to be the biological father than a man in the unrelated, random population of a similar ethnic background. The results are also reported as a probability of paternity. This calculation is made by using Bayes' theorem to combine the paternity index (scientific evidence) with a neutral, unbiased assessment of the subjective evidence (0.5 prior probability)."
}
