{
	"anumber": "A72845268",
	"id": "A72845268_0014",
	"page_index": 14,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72845268_0014/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "EXCERPT FROM THE REGISTERS OF PORT AU PRINCE, NORTHERN COUNTY"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1902, 1974]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/27/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI EXCERPT FROM THE REGISTERS OF PORT AU PRINCE, NOTHERN COUNTY A3 NO. 81864 REGISTRATION OF BIRTH OF : GELIN DIEUVILLE THE YEAR NINETEEN NINETY, 187TH OF THE INDEPENDENCE AND ON FRIDAY, SEPTEMBER 21 AT ELEVEN O' CLOCK IN THE MORNING WE, DANIEL D. DESROSIERS, THE UNDERSIGNED, CIVIL REGISTRAR OF PORT AU PRINCE, NOTH COUNTY CERTIFY TO HAVE ENTERED IN THE PROPER REGISTERS, AD PER LAW OF AUGUST 21, 1974, THE PRESENT JUDGMENT RENDERED BY THE CIVIL COURT OF PORT AU PRINCE IN OPEN COURT ON SEPTEMBER 13, 1990 UPON REQUEST OF MR. GELIN DIEUVILLE, ADVISED BY ATTORNEY JEAN GANIER OF THE BAR OF PORT AU PRINCE. THE JUDGMENT READS AS FOLLOW; BY THESE MOTIVES THE COURT, UPON EXAM ON THE DRAWINGS OF THE PUBLIC PROSECUTOR STATES THAT MR. GELIN DIEUVILLE OF MALE SEX WAS BORN IN ARCAHAIE ON DECEMBER5, 1902 AS THE NATURAL CHILD OF MR. ROMELUS DIEUVILLE AND GABELISE GABRIEL, BOTH DECEASED AND DECLARES THAT THIS WILL, FOR NOW ON, BE USED AS THE BIRTH CERTIFICATE OF THE APPLICANT. IT IS ORDERED TO ENTER THE PRESENT JUDGMENT IN THE SPECIAL REGISTERS KEPT IN THE CIVIL COURT , NORTH COUNT, OF PORT AU PRINCE IN CONFORMITY WITH THE LAW. THUS JUDGED AND PRONOUNCE BY US, ARNOL CHARLES, DEAN OFTHE CIVIL COURT OF PORT AU PRINCE, IN OPEN COURT THIS 13TH DAY OF SEPTEMBER, 1990 IN PRESENCE OF MR. LARIVE LOMINY GOVERMENTAL COMMISSIONNER SUBSTITUTE ASSISTED BY MR. ASCENCIO JUMELLE, CLERCK OF THE COURT. THUS SIGNED: a. CHARLES, A. JUMELLE THIS DRAFT, DON EIN OUR OFFICE AT THE CIVIL COURT OF PORT AU PRINCE ON FRIDAY SEPTEMBER 21, 1990 SIGNED: DANIEL D. DESROSIERS. SEAL FROM THE CIVIL COURT OF PORT AU PRINCE, NORTH COUNTY. (BACK OF PAGE) SEEN SOLELY TO VERIFY AND LEGALIZE THE SIGNATURE OF MR. DANIEL D. DESROSIERS, CIVIL REGISTRAR OF THE NORTHERN COUNTY OF PORT AU PRINCE, RECEIPT NO. 69085- JJ. FROM THE PROSECUTOR'S OFFICE THIS SEPTEMBER 26,1990 SIGNED: MR. BAYARD VINCENT, ATTORNEY GOVERNMENTAL COMMISSIONER"
}
