{
	"anumber": "A72849146",
	"id": "A72849146_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service Miami International Airport, Form G-2 ( (Rev. 1-2-80)"
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service Miami International Airport Subject Petit Frere Anne MARIE A726009474 Date Petit. Frere, Tertulie JAN 1594 AMA Rosenie , Giropia A 72 849 146 To Files. From Liun Renne - DAVIS II Above Subject Anne marie Petit. Frere arrived this date from FOIA (b)(6) Pnt an Prince Naih VIA AA 424. Subject presented Nathan Pos pods N° 57 451 322 , Afien Resident lord No FOIA (b)(6) and for her Mother AHA Rosenia GiroPic APien Resident wid requesting admission es Returning LPR's subjects were referred to Secondary (Pls see Airport Secondary Referral). where it was determined that AKA Roseme, GiroPia was an Imposte. ( Prints were taken and Print on Cord did not match subject's Print. In Secon dary Anne- MARIE Petit Frere FOIA (b)(6) admitted to Inspector Lopagne that she attempted to smuggle her mother in, because there was no one in Hah to core for her. Subject claims he mother's true name is Tertu Pie Peht here and the her mother was born in Hah on Jul 1, 1906 Subject Anne marie Petit. Frene FOIA (b)(6) was charged with (4) ( ) ( ) ( (1) , , Subject Rosenie Giropia (A) (72 849 146) was charged 112(c)(7)(A)H)(1) she was not charged with 212(c)(1)7)(1)(4) because Subject does not comprehend, hearing is very bed and her VISION is very bed, Subject appears to be exclubb mder Sections 212(4)(7) (17)9)(I) of the INA. ( Unable to take SWORN Statement.) Line Rinne-Devis r Form G-2 subject daughter was Service I 122 (Rev. 1-2-80) FOIA (b)(6)"
}
