{
	"anumber": "A72849146",
	"id": "A72849146_0067",
	"page_index": 67,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0067/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "International Style And Comfort From Coast To Coast, 800-223-5446"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Canada"]
		},
		"years": {
			"ms_years_nlp_v1": [1992]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DIAL-A'A-FLIGHT AUTOMATED FLIGHT INFORMATION (800) 223-5436 For Flight Arrival/Departure/Gate/Fare and Schedule Information Call DIAL-A'A-FLIGHT Para reservaciones en español llame al (800)633-3711 For U.S., Hawaii, Alaska, Puerto Rico and Canada call (800)223-5436 Sólo disponible en los Estados Unidos Continentales. When in the Dallas/Fort Worth Area Call Metro (817)267-2222 TDD Reservations for the hearing and speech impaired 24 hour service American Airlines® Passenger Reservations Telephone Numbers for Continental U.S. except Ohio: (800)543-1586 U.S. destinations (800)433-7300 Ohio (800)582-1573 For international destinations call (800)624-6262 For Cargo and Priority Parcel within the U.S. except Alaska call (800) )CARGOAA AMERICAN AIRLINES® PASSENGER RESERVATION TELEPHONE NUMBERS IN THE FOLLOWING INTERNATIONAL CITIES. SEE BELOW NOTICE OF OVERBOOKING OF FLIGHTS WORLD XAd Airline flights may be overbooked, and there is a slight chance that a seat will not be available on a 3000 flight for which a person has a confirmed reservation. If the flight is overbooked, no one will be denied a seat until airline personnel first ask for volunteers willing to give up their reservation in AA CHOM assize exchange for a payment of the airline's choosing. If there are not enough volunteers, the airline will deny boarding to other persons in accordance with its particular boarding priority. With few exceptions, persons denied boarding involuntarily are entitled to compensation. However, to receive compensation, a passenger must present himself at the loading gate for boarding at least 10 minutes before scheduled departure. The complete rules for the payment of compensation and LIWIT each airline's boarding priorities are available at all airport ticket counters and boarding locations. WHZV AV CAR BAGGAGE INFORMATION International StyleAnd Comfort From Coast To Coast Los Angeles New York (JFK) The style and comfort of international Legrests that adjust at the touch of a button. And control panels for more convenience. service comes to a transcontinental flight internationally acclaimed cuisine served on fine china. And an inflight staff that has never been 14 times every business day with our new A Whole New Class of better prepared to serve your needs. American American Flagship Service between Flagship Service First Class. Fourteen Flights Every Los Angeles and New York (JFK). Here you'll discover a world of Our upgraded First Class offers Business Day. distinctive amenities. Meticulous attention to detail. everything from champagne and caviar Best of all, our nonstop service is And the same three remarkable classes of comfort to your own carefully constructed ice sure to fit your nonstop schedule. With 14 flights you'd find on an international flight. cream sundae. Sleeper seats that allow you to between New York (JFK) and Los Angeles every business stretch out for miles. And an individual video unit day, we'll offer more service than any other airline. Business In A Class built into every First Class seat, complete with a variety Call your Travel Agent or American Airlines at By Itself. of program choices from our on-board library. 1-800-433-7300 and ask about our new American Our spacious new 52-seat Main Cabin Comfort. Flagship Service. Only in America, only on American. Business Class is an ideal place to Our Main Cabin, too, reveals a new look and feel. work or relax. With soft, roomy seats With roomier seats for greater comfort. User-friendly AmericanAirlines crafted of fine leather and sheepskin. Something special in the air. ® ©1992 American Airlines, Inc. All rights reserved. American Flagship Service is a registered service mark of American Airlines, Inc. Schedules subject to change."
}
