{
  "anumber": "A72849146",
  "id": "A72849146_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72849146_0008/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES IMMIGRATION & NATURALIZATION SERVICE, I-122/I-110"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED ATES IMMIGRATION & NATURALIZATION SERV ATTACHMENT TO -122/I-110 NAME PETIT-FRERE Ter torne FILE 177 549 146 DATE JAN 1544 ( ) 212(a)(2)(A)(i)(I). Any alien convicted of. or who admits having committed, or who admits committing acts which constitute the essential elements of a crime involving moral turpitude (other than a purely political offense) is excludable. ( ) 212(a)(2)(A)(i)(II). Any alien convicted of. or who admits having committed, or who admits committing acts which constitute the essential elements of a violation of (or conspiracy to violate) any law or regulation of a State, the United States. or a foreign country relating to a controlled substance (as defined in Section 102 of the Controlled Substances Act {21 USC 802}), is excludable. ( ) 212(a)(2)(B) Any alien convicted of 2 or more offenses (other than purely political offenses). regardless of whether the conviction was in a single trial or whether the offenses arose from a single scheme of misconduct and regardless of whether the offenses involved moral turpitude, for which the aggregate sentences to confinement actually imposed were five years or more, is excludable. ( ) 212(a)(2)(c) Any alien who the consular or immigration officer knows or has reason to believe is or has been an illicit trafficker in any such controlled substance or IS or has been a knowing assister. abettor, conspirator, or colluder with others in the illicit trafficking in any such controlled substance, is excludable. ( ) 212(a)(5)(A)(i) Any alien who seeks to enter the United States for the purpose of performing skilled or unskilled labor is excludable, unless the Secretary of Labor has determined and certified to the Secretary of State and the Attorney General that (I) there are not sufficient workers who are able. willing. qualified (or equally qualified in the case of an alien described in clause (ii)) and available at the time of application for a visa and admission to the United States and at the place where the alien is to perform such skilled or unskilled labor, and (II) the employment of such alien will not adversely affect the wages and working conditions of workers in the United States similarly employed. ( ) 212(a)(6)(A) Any alien who has been excluded from admission and deported and who again seeks admission within one year of the date of such deportation is excludable. unless prior to the alien's reembarkation at a place outside the united States or attempt to be admitted from foreign contiguous territory the Attorney General has consented to the alien's reapplying for admission. ( ) 212(a)(6)(B)(i) Any alien who has been arrested and deported and who seeks admission within 5 years of the date of such deportation or removal. or who seeks admission within 20 years in the case of an alien convicted of an aggravated felony, IS excludable. unless prior to the alien's reembarkation at a place outside the united States or attempt to be admitted from foreign contiguous territory the Attorney General has consented to the alien's reapplying for admission. ( ) 212(a)(6)(C)(i). Any alien who, by fraud or willfully misrepresenting a material fact. seeks to procure (or has sought to procure or has procured) a visa, other documentation or entry into the United States or other benefit provided under the Act is excludable. 212(a)(7)(A)(i)(I) Except as otherwise specifically provided in this Act. any immigrant at the time of application for admission who is not in possession of a valid unexpired immigrant visa, reentry permit. 01/15/94 border crossing identification card. or other valid entry document required by this Act. and a valid unexpired passport, or other suitable travel document or document of identity and nationality if such document is required under the regulations issued by the Attorney General under Section 211(a) is excludable. ( ) 212(a)(7)(A)(i)(II) Except as otherwise specifically provided in this Act, any immigrant at the time of application for admission whose visa has been issued without compliance with the provisions of Section 203, is excludable. ( ) 212(a)(7)(B)(i)(i). Any nonimmigrant who is not in possession of a passport valid for a minimum of six months from the date of the expiration of the initial period of the alien's admission or contemplated initial period of stay authorizing the alien to return to the country from which the alien came or to proceed to and enter some other country during such period is excludable. ( ) 212(a)(7)(B)(()(I))...Ary nonimmigrant who is not in possession of a valid nonimmigrant visa or border crossing identification card at the time of application for admission, is excludable."
}