{
  "anumber": "A72964793",
  "id": "A72964793_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72964793_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Simmons, Ungar, Helbush & Steinberg, Screeneded by NARA, 7/7/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1992,
        2023,
        1911
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 Simmons, Ungar, Helbush & Steinberg Attorneys at Law Milton T. Simmons (1911-1989) 909 Montgomery Street, Suite 303 Donald L. Ungar, of Counsel Teresa A. Bright San Francisco, CA 94133 Terry J. Helbush Michael K. Ungar Tel: (415) 421-0860 Kip Evan Steinberg Bill Ong Hing, of Counsel FAX: (415) 421-0772 April 24, 1992 Immigration & Naturalization Service 630 Sansome Street San Francisco, CA 94111 Attn. Camille Chappell Re: Josefa Feliciano Ramirez-Garcia aka Josefa Feliciana Ramirez-Guadamuz A28 961 620 Dear Camille, I understand from Tony Jue that he has given this file to you to straighten out the problem which has led to Ms. Ramirez-Garcia not receiving her alien registration card. Apparently, an alien registration card was issued to another immigrant using Ms. Ramirez-Garcia's A number so that now the Texas Card Facility refuses to issue Ms. Ramirez-Garcia her alien registration card. Because of this mix-up, Ms. Ramirez-Garcia who is 84 years of age has been found ineligible for Medicare benefits (through recourse to the SAVE program). She is ill and not able to go to the doctor. Under the circumstances, I am urging you to resolve this problem as soon as possible. Further, I would ask you to issue a letter to Ms. Ramirez-Garcia confirming her lawful permanent resident status. She could take this letter to her Social Worker so that she could be reinstated to Medicare. Thank you for your attention to this matter. I will follow up with a phone call next week. Very truly yours, Terry J. Helbush TJH:uv"
}