{
  "anumber": "A72937061",
  "id": "A72937061_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72937061_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice, Immigration & Naturalization Service, I-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Mexico",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OF Screened by NARA, 8/7/2023 U.S. Department of Justice Immigration & Naturalization Service Los Angeles District 3/8/95 300 N. Los Angeles Street Los Angeles CA 90012 Sing , Jagat - A72 937 06/ NAME Kaur , Gurcharan - A72 All 9370 YOUR APPOINTMENTS FOR AN EMPLOYMENT AUTHORIZATION CARD AND YOUR ADJUSTMENT OF STATUS INTERVIEW HAVE BEEN SCHEDULED AS FOLLOWS. Please office, 1001, #11, J come into this Room Window on at to be processed for your Employment Authorization Card. Attention!! You must bring this ORIGINAL notice, and your fee receipt from the Immigration & Naturalization Service. Please come to the office shown below at the time and place indicated for your adjustment of status interview. OFFICE Room No. Floor No. LOCATION 300 North Los Angeles St Los Angeles CA 90012 8024 8th DATE AND HOUR Mar. 7,1996 at 1:10P.M. #13,14 BUNDLE/NO. B REASON FOR APPOINTMENT Adjustment of Status Section 245 Section 245(i) BRING WITH YOU Medical (completed), birth certificate, marriage certificate, divorce certificate, passport, I-94, proof of support, other: IT IS IMPORTANT THAT YOU KEEP THIS APPOINTMENT AND BRING THIS LETTER WITH YOU: * IF YOUR ADJUSTMENT IS BASED ON A SPOUSE PETITION, YOUR SPOUSE MUST ACCOMPANY YOU TO THIS INTERVIEW IF YOU CONSIDER DEPARTING FROM THE UNITED STATES TO ANY COUNTRY INCLUDING MEXICO (TIJUANA INCLUDED), OR CANADA PRIOR TO YOUR INTERVIEW, YOU MUST OBTAIN PERMISSION FROM THIS SERVICE. FAILURE TO OBTAIN AN ADVANCE PAROLE WILL RESULT IN CANCELLATION OF YOUR INTERVIEW AND YOUR APPLICATION(S) WILL BE CONSIDERED TO BE ABANDONED. Very truly yours,"
}