{
  "anumber": "A72964793",
  "id": "A72964793_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72964793_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. IMMIGRATION & NATURALIZATION SERVICE, W/A 7-19-82"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 U.S. IMMIGRATION & NATURALIZATION SERVICE 630 SANSOME STREET San Francisco, California 94111 w/A 7-19-89 Dear Applicant: Josefa Ramirez Guadamuz Your interview for permanent residence will be held on OCT 25 1989 A at: ROOM 242A - Second Floor 10:15 AM 630 Sansome Street San Francisco, California 94111 PM You must bring with you this letter, your passport, personal identification, and any immigration papers you may have in your possession and the following documents: If your application for residence is based upon your marriage: BRING WITH YOU - a) BRING SPOUSE, IF HE/SHE IS IN THE UNITED STATES, WITH PERSONAL IDENTIFICATION, BENEFICIARY'S PASSPORT, COPIES OF ANY LEASE, RENTAL OR PURCHASE AGREEMENTS; JOINT BANK ACCOUNTS; FEDERAL INCOME TAX RETURNS FOR THE YEARS YOU ARE MARRIED; LIFE, HEALTH OR CAR INSURANCE POLICIES; A LETTER FROM THE CURRENT EMPLOYER OF EACH OF YOU INDICATING DATE EMPLOYMENT BEGAN; BIRTH CERTIFICATES FOR EACH OF THE BENEFICIARY'S CHILDREN, IF ANY; SWORN AFFIDAVITS FROM YOUR PARENTS/FAMILY MEMBERS REGARDING THEIR KNOWLEDGE OF YOUR MARRIAGE; PHOTOS OF YOU AND YOUR SPOUSE TOGETHER TAKEN OVER A PERIOD OF TIME. b) IN ADDITION, BRING ANY OTHER EVIDENCE THAT YOU FEEL WOULD ESTABLISH THAT YOUR MARRIAGE IS BONA FIDE. On the day of your interview, please turn in your passport and appointment notice to ROOM 242A as soon as you arrive. Your attorney must accompany you to this interview if you wish. to be represented. If you fail to keep this appointment, your application for adjustment of status may be denied and any employment authorization granted to you in connection with this application will be revoked. PLEASE NOTE: While your application is pending, you must not leave the United States unless you receive written approval from the Immigration and Naturalization Service before your departure from the United States. Failure to comply with this requirement will result in your application being denied. Sincerely, David N. Ilchert District Director San Francisco, California"
}