{
  "anumber": "A72937061",
  "id": "A72937061_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72937061_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, Form I-130 ( (Rev. 10/01/91) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 U.S. Department of Justice OMB 1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE USE ONLY Case ID# Action Stamp Fee Stamp A# APPROVED 0025 UU1 K 2 04/13/95 7:42 1130 80.00 INS DISTRICT DIRECTOR G-28 or Volag# APR 1 1996 Section of Law: 201 (b) spouse Recommended bys RMP. Petition was filed on (priority date) 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) Pet. Pet. Ben. \"A\" File Reviewed Stateside Criteria 201 (b) parent 203 (a)(4) LOS 4566 Field Investigations I-485 Simultaneously 203 (a)(5) AM CON: 204 (a)(2)(4) Resolved 204 (h) Resolved Remarks: A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain residence through adoption? Husband/Wife X Parent Brother/Sister Child Yes X No Yes X No B. Information about you C. Information about your relative 1. Name (Family Name in CAPS) (First) (Middle) 1. Name (Family Name in CAPS) (First) (Middle) Singh Kanwar H. SINGH Jagat 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 1737 Holbrook Street 1737 Holbrook Street (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) California Anaheim California 92807 Anaheim USA 92807 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Baluchistan, Pakistan Gujranwala Pakistan 4. Date of Birth 5. Sex 4. Marital Status 4. Date of Birth 5. Sex 4. Marital Status (Mo/Day/Y1) X Male X Married Single (Mo/Day/Yr) X Male Married Single 09-22-36 Female Widowed Divorced 10-15-06 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) Captain Singh Major Jagat Singh 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) Lucknow, India Pakistan 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b) (6) 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriage(s) Ended None N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or X she last arrived as a Naturalization (Give number of certificate, date and place it was issued) (visitor, student, slowaway, without inspection, etc.) 21036986 10-20-94 B-2 Parents Arrival/Departure Record (I-94) Number Date Arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? 5 8 2 2 6 7 8 6 9 09-89 Yes No Date authorized stay expired, or will expire as shown on Form I-94 or I-95 s If \"Yes\", give number of certificate, date and place it was issued 03/22/90 15. Name and Address of Present Employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: Captain Singh's (Month/Day/Year) Guest Homes Wate and place of admission for, or adjustment to, lawful permanent residence, Date this employment began and class of admission: 5-87 16. Has your relative ever been under immigration proceedings? 14b. Did you gain permanent residence status through marriage to a United Yes X No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 10/01/89) Y"
}