{
  "anumber": "A72937061",
  "id": "A72937061_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72937061_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application to Register Permanent Residence or Adjust Status, Form I-458 ( (09-09-92)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "Cuba"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1972,
        1996,
        2023,
        1964,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 U.S. Department of Justice OMB No. 1115-0053 Immigration and Naturalization Service Application to Register Permanent Residence or Adjust Status START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name SINGH Name Jagat Name Address C/O Resubmitted Street Number Apt. and Name 1737 Holbrook Street # City Anaheim State Zip Code Reloc Sent California 92807 UU25 UU1 H 2 04/13/95 7:42 Date of Birth Country 1485 130.00 (month/day/year) 10-15-06 of Birth Pakistan Social A # (if any) Security # Reloc Rec'd Date of Last Arrival I-94 # (month/day/year) 09-89 582-26786901 Current INS Expires on Status EXP. B2 (month/day/year) 03/22/90 Part 2. Application Type. (Check one) Applicant Interviewed I am applying for adjustment to permanent resident status because a. an immigrant petition giving me an immediately available immigrant visa number has Section of Law been approved (attach a copy of the approval notice), or a relative, special Sec. 209(b), INA Sec. 13, Act of 9/11/57 immigrant juvenile, or special immigrant military visa petition filed with this application Sec. 245, INA will give me an immediately available visa number if approved. Sec. 249, INA Sec. 1 Act of 11/2/66 b. My spouse or parent applied for adjustment of status or was granted lawful Sec. 2 Act of 11/2/66 Other permanent residence in an immigrant visa category which allows derivative status for spouses and children. Country Chargeable c. I entered as a K-1 fiance(e) of a U.S. citizen whom I married within 90 days of entry, or I am the K-2 child of such a fiance(e) (attach a copy of the fiance(e) petition approval notice and the marriage certificate). Eligibility Under Sec. 245 d. I was granted asylum or derivative asylum status as the spouse or child of a person Approved Visa Petition Dependent of Principal Alien granted asylum and am eligible for adjustment. Special Immigrant e. I am a native or citizen of Cuba admitted or paroled into the U.S. after January 1, Other 1959, and thereafter have been physically present in the U.S. for at least 1 year. Preference f. I am the husband, wife, or minor unmarried child of a Cuban described in (e) and Action Block PPROVED am residing with that person, and was admitted or paroled into the U.S. after INS DISTRICT DIRECTOR January 1, 1959, and thereafter have been physically present in the U.S. for at least 1 year. APR 1 6 1996 g. I have continuously resided in the U.S. since before January 1, 1972. h. Other-explain Recommended by: LOS 4566 I am already a permanent resident and am applying to have the date I was granted permanent residence adjusted to the date I originally arrived in the u.s. as a To Be Completed by nonimmigrant or parolee, or as of May 2, 1964, whichever is later, and: (Check one) Attorney or Representative, if any i. am a native or citizen of Cuba and meet the description in (e), above. Fill in box if G-28 is attached to represent I the applicant j. I am the husband, wife or minor unmarried child of a Cuban, and meet the VOLAG# description in (f), above. ATTY State License # Form I-485 (09-09-92)N Continued on back."
}