{
	"anumber": "A73780035",
	"id": "A73780035_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73780035_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Acte de Mariage, 78064"
		},
		"years": {
			"ms_years_nlp_v1": [1941, 2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 LIBERTE BGALITE FRATERNITE RDN' 50618 NN. REPUBLIQUE D'HAITI Extrait des registres des acte S de Mariage de la com' de St Ls du Nord déposés au bureau des Archives Nles de la République 20 No. 78064 AUJOURD'HUI le quinze novembre mil neuf cent guarante et un 138e de l'Indépendance à dix heures du matin Nous Alexandre Chanoi Officier de l'Etat civil de la commune de Sannt Louis du Nord sous: VII REPUBLIQUE D'HAITI G.1.35 gné en conformité de l'article six de la 101 do six décumbre mil n TOUS POUR cent vingt neuf son sixiéme Alinéa Avons transcrit l'acte de Maria ci-dessous que nous avons reçu du Révérend Pére Charles Fradet cur de cette paroisse Collationné l'Officier de Etat civil A CHANOIN DIOCESE DE PORT DE PAIX PAROISSE DE SAINT LOUIS DU NORD Le treize novembre mil neuf cent quarante et un ,je soussiane curé la paroisse de Saint Louis du Nord, certifie qu'aprés les publicati dument faites aucune Opposition ne m'ayant été signifiée G.0.50 G.0.50 CHARLES GABRIEL ,profession t illeur agé de trente cing ans né et domicilié au bourg de Saint Louis du Nord , fils de feur Saint J lien Gabriel et de feue Iris Pamphile Et ELIZABETH MERCEDES JEAN PIERRE ,profession douturiére agée de vingt deux ans née à la cinqu me section et demiciliée au borg de Saint Louis du Nord fille de - ANNEE 1941 Inelphart Petit Phart profession cultivateur et de Florence Eusmar PAGE -47 fession cultivatrice domiciliés à la cinquiéme section de Saint Lou NUMERO R 25748- 45 du Nord Se sont présentés pour @tre unis par le saurement de Mariag A la question s'ils consentaient à se prendre pour époux, ils Ont r ACTA DE MARIAGE DE pondu chacun séparément et affirmetivement en présence des témoins CHARLES GABRIEL ET DE: lifiés et nommée ci-aprés Ont été témoins Monsieur Magloire Aime pr ELIZABETH MERCEDES JEAN_ PIERRE 9- fession arpenteur agé de trente six ans domicilié Eat bourg de Louis du Nord et Madame Emilord Bastien profession oouturiere agée ID N_462-CD ID N 862 cinquante quatre ans $ domiciliée a Saint Louis du Nord (signe) Ch. Fradet ,Curé de Saint Louis du Nord REC 50618NN. ANH A-04236 Port-au-Prince le 25 aout 1983 POUR COPIE CONFORME COLLATIONNEE DEPARTMENT D NATIONAL Me. WILFRID BERTRAND DIRECTEUR M/A/J"
}
