{
	"anumber": "A73779517",
	"id": "A73779517_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73779517_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ALCICLIA MUNICIPAL DE NAGAROTE, Nº 0658038"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 CORDOBA ORD SERIE No. 0658038 ALCALDIA MUNICIPAL DE NAGAROTE REGISTRO DEL ESTADO CIVIL DE LAS PERSONAS EL SUSCRITO REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE NAGAROTE, CERTIFICA: QUE EM LA PAGINA 9, TOMO 1, DEL LIBRO DE REPOSICION DE PARTIDAS, QUE ESTA OFI- CINA, LLEVO EN EL AÑO DE 1979. SE ENCUENTRA EL ACTA,, QUE LITERALMENTE DICE: PDA. No. 18.- - MARIANO DE JESTIS GALLO PADILLA.- 6 IIN IA CIUDAD DE NAGAROTE DEPARTAMENTO DE LEON A LAS TRES DE LA TARDE DEL DIA VEINTE Y SEIS 7 DEL MES MARZO DEL ANO DE MIL NOVECIENTOS SETENTA Y NUEVE ANTE EL INFRASCRITO REGISTRADOR 8 DEL ESTADO CIVIL Y SECRETARIO QUE AUTORIZA COMPARECE: MARIANO DE JESUS GALLO PADILLA. Y 9 PRESENTA PARA SU INSCRIPCION LA SENTENCIA DE REPOSICION DE PARTIDA DICTADA POR EL SENOR 10 JUEZ DE DISERITO DE LO CIVIL DE LEON A LAS noce Y DIEZ MINUTOS DEL DIA DIEZ Y NUEVE DEL 11 MES DE MARZO DE MIL NOVECIENTOS SETENTA Y NUEVE EN LA QUE ORDENA REPONER LA PARTIDA DE 12 MARIANO DE JESUS GALLO PADILLA QUIEN NACIO EN ESTA CIUDAD EL DIEZ Y SIETE DEL MES DE ABRI 13 DE MIL NOVECIENTOS TRES, SIENDO HIJO DE LOS SENORES MANUEL GALLO Y DE REYMUNDA PADILIA. 14 15 YO, EL REGISTRADOR DOY FE, DE HABER TENIDO A LA VISTA LA SENTENCIA DE REPOSICION. LEIDA LA PRESENTE SE ENCUENTRA CONFORME, SE APRUEBA Y FIRMA.- JULIA ELENA H. DE CHAVARRIA.- 16 MAGDA BLANCO DE SILVA.- is CONFORME CON SU ORIGINAL, DEBIDAMENTE COTEJADA. A SOLICITHD 17 DE PARTE INTERESADA, SE EXTIENDE LA PRESENTE, EN LA CIUDAD DE NAGAROTE, A LOS DOCE DIAS 18 DEL MES DE MARZO DESID NOVECIENTOS NOVENTA Y DOS. 19 Chil Parents delas plusion 20 DENIS MORALES MORENO MARIA LNISA FONSECA C.- REG. EST. CIVIL DE LAS PERSONAS. SRIA. DEL REG.- 21 1 22 23 24 25 26 27 28 29 30"
}
