{
  "anumber": "A73780035",
  "id": "A73780035_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73780035_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATE OF BAPTISM, SERIE B2 NO 36589"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1992,
        1906,
        2023,
        1890,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI SERIE B2 NO 36589 We the undersigned Director of the Republic National Archives, Certify that after research done have been able to find the inscrp- tion of birth of; ; CHARLES GABRIEL, In the Registrar of birth of the Commune of St, Louis du Nord, Year 1906. Consequently it is impossible to deliver an Extract of the said act We are therefore reproducing any purposes it may serve a Certificate of baptism delivered by the Priest of St, Louis du Nord. CERTIFICATE OF BAPTISM The 9-2-1907 was baptized CHARLES GABRIEL Son £ SAINT JULIEN GABRI EL and the IRIS PAMPHILE, born on November 4, 1906 at St, Louis du Nord, Godfather GENERAL JADOTTE, Godmather BEJ INA BEL, this inscri ption is controled and confirmed by the Priest of the said Church, and legalized by the Archbishop of Port-au-Prince on 18-8-83. It remains understood that the Certificate of the Director can not Achieve the constitutional proof of inexistence or the registrar Party act, 48, of HAITI'S Civil code, decision in March 4, 1890 of The Cassation Tribunal. Therefore the Present Certificate is delivered this date; 23-9-1992 For any purposes it may serve. Port-au-Prince September, 1992. Mr, Wilfrid Bertrand, Directo A/ N/ H/ A 612324 M/ C/ L/ M. C. DEBIR MY COMMISSION # CC 255238 EXPIRES: February 27, 1997 4/27/93 Bonded Thru Notary Public Underwriters"
}