{
	"anumber": "A73780035",
	"id": "A73780035_0026",
	"page_index": 26,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73780035_0026/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Extract from marriage register of the commune of St. Louis du Nord, stored at the National Archives of the Republic., 78064"
		},
		"years": {
			"ms_years_nlp_v1": [1929, 1941, 2023, 1997, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "RD # 50618 NN Screened by NARA, 8/7/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI Extract from marriage register of the commune of St. Louis du Nord, stored at the National Archives of the Republic. JJJ NO: 78064 TODAY November Fifteen Nineteen Hundred Forty-One the 187th year of Independence, at 10:00 a.m. US, Alexandre Chanoine, Civil State officer of St. Louis du Nord, Undersigned. Considering the documents received by the Reverend Father Pere Charles Fradet Priest of the Parish, Collated by the Civil State Officer A.Chanoine in accordance with the article 6 of the law of December 16th, 1929 and Transcribe the Marriage Certificate below. DIOCESE OF PORT-DE-PAIX PARISH OF ST. LOUIS DU NORD On November Thirteen Nineteen Hundred Forty-One, I, Undersigned Priest of the Parish of St. Louis du Nord, certify that after after publications done no opposition of the said marriage was received. CHARLES GABRIEL, Taylor, 35 year old born at Bourg of St. Louis du Nord, Son of St. Julien Gabriel: Deceased and Iris Pamphile:Deceased. AND ELIZABETH MERCEDES JEAN-PIERRE: Seamstress, 22 years old born at Bourg of St. Louis du Nord, Daughter of Inelphart Petit-Phart: Laborer and Florence Eusmar: Laborer. They presented themselves to be reunited by the bonds of marriage at the questions asked they both responded affirmativelly in the presence of the above-said Religious Minister and the following witnesses 1) Mr. Magloire Aime: Surveyor and Mrs. Emilord Bastie: Seamstress, resoectivelly 36 and 54 years old residing and domiciled at St. Louis du Nord. They were then reunited by the bonds of marriage. Act drawn up by the above-said Religious Minister, and signed by him. Signed:Ch. Fradet Port-au-Prince: August 25th, 1983 COPY CONFORM - COLLATED WILFRID BERTRAND, GENERAL DIRECTOR- SEALED. YEAR 1941 - PAGE 47 - NUMBER 45. Marriage Certificate of: Charles Gabriel and Elizabeth Mercedes Jean Pierre. ID # N 462-CD, N 862 ANH A 04236 M/A/J I certify this to be a correct translation of the document in French and that I am competent to effect such translation. Notary Public Translator Valparaiso United Services, Inc. 40 N.E. 54th St STATE OF FLORIDA Miami, F1 33137 ON EXPIRES: BONDED THRU NOTARY PUBLIC UNDERWRITER M. C. DESIR MY COMMISSION # CC 255238 EXPIRES: February 27, 1997 Bonded Thru Notary Public Underwriters"
}
