{
  "anumber": "A73779517",
  "id": "A73779517_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73779517_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 Part 3. Processing Information. A. City/Town/Village of birth Current occupation Managua, Nicaragua Retired Your mother's first name Your father's first name RAIMUNDA MANUEL Give your name exactly how it appears on your Arrival /Departure Record (Form I-94) Arrival/Departure Record lost Place of last entry into the U.S. (City/State) In what status did you last enter? (Visitor, Student, exchange MIAMI, FLORIDA alien, crewman, temporary worker, without inspection, etc.) Were you inspected by a U.S. Immigration Officer? Yes No VISITOR Nonimmigrant Visa Number Consulate where Visa was issued 004343 Managua, Nicaragua Date Visa was Issued August 1990 Sex: Male Female Marital Status: Married Single Divorced Widowed (month/day/year) Have you ever before applied for permanent resident status in the U.S? No Yes (give date and place of filing and final disposition): B. List your present husband/wife, all of your sons and daughters (if you have none, write \"none\". If additional space is needed, use separate paper). Family Given Middle Date of Birth Name Name Initial JARQUIN MARIA (month/day/year) 00/01/28 A Country of birth Relationship Applying with you? NICARAGUA WIFE # Yes No Family Country Name Family Name of birth FOIA (b)(6) Country of birth Family Name Country of birth Family Name Country of birth C. List your present and past membership in or affiliation with every political organization, association, fund, foundation, party, club, society, or similar group in the United States or in any other place since your 16th birthday. Include any foreign military service in this part. If none, write \"none\". Include the name of organization, location, dates of membership from and to, and the nature of the organization. If additional space is needed, use separate paper. NONE Form I-485 (Rev. 09-09-92) N Continued On Next Page"
}