{
  "anumber": "A73964564",
  "id": "A73964564_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0042/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service California Service Center, Form N-400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 U.S. Department of Justice Immigration and Naturalization Service California Service Center DEPARTMENT P.O. Box 10400 Laguna Niguel, CA 92607-1040 (Name & Address of Applicant Petitioner) DATE: 01/10/02 JOSEth MATI/de ROMANO File No.: Form No: N-400 363 AveNIdA MANZANOS SANJOSE CA. 95123 This is an initial screening only. Your application(s) or petition(s) may be returned to you for additional information or documentation at a later date. Your application(s)/petition(s) is/are returned to you for the following reasons: The fee for your application(s)/petition(s) is incorrect. Please submit a check or money order with the correct fee. The total fee for the application(s)/petition(s) is $225.00. As of March 29, 1998, applicants in the US who are required to submit fingerprints with any INS application or petition must be fingerprinted at an INS Application Support Center or INS approved Designated Law Enforcement Agency. Such applicants must pay an additional fee of $25.00 to the INS after which they will be scheduled for fingerprinting. It appears you are an applicant who is subject to this requirement. Therefore, please send the required fee of $25.00 IN ADDITION TO the amount listed above for the application/petition fee along with a copy of this notice. Checks or money orders must be made payable to INS. Please submit a check or money order made payable to INS. Post-dated checks or money orders are not acceptable. Please submit a check or money order with a current date. Personal checks and business checks are not valid beyond one (1) year. Please submit a check with a current date. Checks or money orders must be made payable through a United States bank. Please submit a check payable through a U.S. bank. Please submit a check or money order with corrected written guarantee amount. We have been informed that money orders drawn from \"General Money Orders or *PAN American\" are no longer negotiable. Please submit a negotiable check or money order. Please complete the omitted items. Legalization fees must be paid by cashier's check. money order. or bank check only. Personal checks and cash are not acceptable. Cashier's checks. money orders or bank checks must be made payable to INS. Other: INCOMPLETE APPLICATION. PLEASE COMPLETE PAGE 3 AND t. OR OBTAIN A NEW N-400 APPLICATION FROM YOUR LOCAL INS OFFICE. **IMPORTANT NOTICE** Please place this notice on top of any application(s)/petition(s) you return with correction(s) and mail to the above address ID# 3100101 INS Conc. 03/05/99 Form N-400 Notice 1"
}