{
  "anumber": "A73964564",
  "id": "A73964564_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Decision Letter, N-335"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2003,
        2002
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 U.S. Department of Homeland Security San Jose, Ca. DEPARTMENT U.S. U.S. Citizenship OF HOMELAND SECURITY and Immigration Services 1887 Monterey Highway San Jose, California 95112 Josefa Matilde Romano 363 Avenida Manzanos JAN 1 3 2005 San Jose, CA 95123 Alien File Number: A073964564 N-400 Application ID No.: WSC*000773841 DECISION On January 28, 2002, you filed an application for naturalization in accordance with Section 316(a) of the Immigration and Nationality Act. On May 13, 2003, you appeared for an examination of your application for naturalization. Pursuant to the investigation and examination of your application it is determined that you are ineligible for naturalization for the following reason(s): See Attachment(s) If you desire to request a review hearing on this decision pursuant to Section 336(a) of the Act, you must file a request for a hearing within 30 Days of the date of this notice (33 days if received by mail). If no request for hearing is filed within the time allowed, this decision is final. A request for hearing may be made to the District Director, with the Citizenship and Immigration Services office that made the decision, on Form N- 336, Request for Hearing on a Decision in Naturalization Proceedings under Section 336 of the Act, together with a fee of $250.00. A brief or other written statement in support of your request may be submitted with the Request for Hearing. Sincerely Ind n that David N. Still District Director Enclosure: Form N-336 DIADN.DJ.12292004.073964564 Form N-335"
}