{
  "anumber": "A73964564",
  "id": "A73964564_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0031/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notificación de Acción, NA 990 TRANSFER BETWEEN LTC AND NON LTC STATUS"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2000
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA. 7/24/2023 DEL 4/00 CONDADO DE ESTADO DE CALIFORNIA AGENCIA DE SALUD Y BIENESTAR SANTA CLARA DEPARTAMENTO DE SERVICIOS SOCIALES Notificación de Accion Fecha de la Notificación 08-25-00 D639 Nombre R del Caso ROMAN MATILDE Número MT-0A52248-80-0 Nombre del Trabajádor(a) ROSA DURAN Número 0639 Teléfono 556-1774 Dirección 1880 PRUNERIDGE AVE SANTA CLARA CA 95050-6596 ¿Tiene Preguntas? Comuníquese con su Trabajador(a). (DESTINATARIO) MATILDE ROMANI Audiencia con el estado: Si usted cree que esta C/O EMPRESS CONVALESCENT acción está equivocada, puede solicitar una 1299 S BASCOM AVE audiencia. En el reverso de esta hoja se le explica SAN JOSE CA 95128-3514 cómo hacerlo. Es posible que sus beneficios continúen si usted solicita una audiencia antes que esta acción entre en vigor. EFFECTIVE SEP 01, 2000 THE FOLLOWING CHANGE HAS BEEN MADE IN YOUR MEDI-CAL BENEFITS: MEDI-CAL BUDGET SUMMARY FOR 09/00 TOTAL NONEXEMPT INCOME ROUNDED$ .00 MFBU MAINTENANCE NEED 35.00 TOTAL MAINTENANCE NEED 35.00 TOTAL SHARE OF COST .00 ( ) YOU HAVE ENTERED A LONG-TERM CARE FACILITY. THIS HAS CAUSED A CHANGE IN THE AMOUNT OF \"MAINTENANCE NEED\" YOU ARE ALLOWED. SEE BELOW. YOUR SHARE-JF-COST MUST BE PAID OR OBLIGATED TO THE LONG-TERM CARE FACILITY EACH MONTH. DO NOT THROW AWAY YOUR PLASTIC ID CARD. ( ) YOU HAVE LEFT A LONG-TERM CARE FACILITY. THIS HAS CAUSED A CHANGE IN THE AMOUNT OF YOUR \"MAINTENANCE NEED\". SEE ABOVE FOR YOUR NEW SHARE OF COST. TAKE YOUR PLASTIC BENEFITS IDENTIFICATION CARD (BIC) TO YOUR DOCTOR OR OTHER HEALTH CARE PROVIDER EACH TIME YOU REQUEST MEDICAL SERVICES. THE AMOUNT THAT YOU PAY OR OBLIGATE FOR MEDICAL CARE WILL BE AUTOMATICALLY COMPUTED. ONCE YOUR TOTAL SHARE OF COST HAS BEEN PAID OR OBLIGATED YOU WILL NOT HAVE TO PAY FOR ADDITIONAL MEDI-CAL COVERED SERVICES THAT MONTH, OTHER THAN THE CO-PAY CHARGES. ( ) YOU HAVE LEFT A LONG-TERM CARE FACILITY. THIS HAS CAUSED A CHANGE IN THE AMOUNT OF YOUR MAINTENANCE NEED. YOU WILL CONTINUE TO RECEIVE MEDI-CAL BENEFITS, BUT YOU WILL NO LONGER HAVE A SHARE OF- COST. ( ) YOU HAVE ENTERED OR LEFT A LONG-TERM CARE FACILITY, BUT THIS HAS RESULTED IN NO CHANGE IN YOUR MEDI-CAL BENEFITS. YOU MUST TELL YOUR WORKER WITHIN 10 DAYS IF THERE IS ANY CHANGE IN YOUR INCOME PROPERTY OR OTHER CIRCUMSTANCES WHICH AFFECT YOUR MEDI-CAL ELIGIBILITY. STATUS REPORT: SOME MEDI-CAL RECIPIENTS MUST COMPLETE A QUARTERLY REPORT FORM MC-176. A FORM WILL BE MAILED TO YOU IF THIS IS REQUIRED. MEDICAL INSURANCE: IF YOU HAVE OTHER MEDICAL COVERAGE. YOU MUST USE IT BEFORE YOU USE MEDI-CAL. FAILURE TO TELL THE COUNTY WELFARE DEPARTMENT ABOUT OTHER HEALTH COVERAGE OR FAILURE TO USE OTHER COVERAGE AVAILABLE TO YOU IS A MISDEMEANOR. THIS ACTION IS REQUIRED BY THE FOLLOWING LAWS AND/OR REGULATIONS MEDI-CAL ELIGIBILITY MANUAL 50185, 50653 NA 990 TRANSFER BETWEEN LTC AND NON LTC STATUS 893-A 990N (SP) (11/98) ofcom OD. 5/30/18"
}