{
	"anumber": "A73964564",
	"id": "A73964564_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0025/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Fee Waiver Request"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2001, 2002]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 FEE WAIVER REQUEST January 16, 2002 To: US Departmental of Justice Immigration and Naturalization Service USINS California Service Center Attention N-400 Unit P.O. Box 10400 Laguna Miguel, CA 92607-0400 From: Josefa Matilde Romano (A073964564) On November 15, 2001, I sent your office a Fee Waiver Request. On December 10, 2001 your office responded that due to insufficient information and supporting documentation contained in the fee waiver request, INS was not able to determine my \"inability to pay\" the required filing fee. On December 17, 2001, I sent you another letter (see attached) with all the supporting documentation. Since I sent this letter certified, the post office stapled the response card on top of the \"fee waiver request\" typed in the enveloped. On January 16, 2002, I received all my paperwork with a cover sheet from INS asking for a fee of $225.00 and an additional $25.00 dollars for fingerprints. I really do not understand how I can pay these amounts. I do not have that money to pay. I don't receive any kind of monetary assistance from nobody. I live in a convalescent home; I do not owe property and Social Services provides me with medical assistance. My daughter provides me with some food and clothes. All the pertaining information is attached. I really appreciate your consideration in this matter. I will be 90 years old this coming April, I my dreams are to become an American Citizen. Please fulfill my dreams. Thank you very much. Please read all the attached information. Matilde Ro main current letter oF"
}
