{
	"anumber": "A73964564",
	"id": "A73964564_0053",
	"page_index": 53,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0053/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application to Register Permanent Residence or Adjust Status"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Cuba", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1964, 2023, 1972, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/24/2023 A73-964-564 U.S. Department of Justice OMB No. 1115-0053 Immigration and Naturalization Service Application to Register Permanent Residence or Adjust Status START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. Returned Receipt 2533 006 001 01/04/96 11:16 Family Given Middle Name ROMANO Name JOSEFA Initial M. $830. 130.00 Address C/O JOSEFA MATILDE ROMANO Resubmitted Street Number Apt. and Name 363 AVENIDA MANZANOS # - City SAN Jose State Zip Code Reloc Sent CALIFORNIA 95123- Date of Birth Country (month/day/year) 4-5-12 of Birth NiCARAGUA Social A (if any) Security # 622-52-2201 NONE Reloc Rec'd Date of Last Arrival -94 # (month/day/year) 7-2-1991 391765175 02 Current INS NONEOVERSTAY B-2 Expires on Status (month/day/year) N/A 1/1/92 Part 2. Application Type. (check one) A73-964-569 Applicant Interviewed I am applying for adjustment to permanent resident status because: a. an immigrant petition giving me an immediately available immigrant visa number has Section of Law been approved (attach a copy of the approval notice), or a relative, special Sec. 209(b), INA Sec. 13, Act of 9/11/57 immigrant juvenile, or special immigrant military visa petition filed with this application Sec. 245, INA will give me an immediately available visa number if approved. Sec. 249, INA Sec. 1 Act of 11/2/66 b. My spouse or parent applied for adjustment of status or was granted lawful Sec. 2 Act of 11/2/66 permanent residence in an immigrant visa category which allows derivative status Other for spouses and children. Country Chargeable C. I entered as a K-1 fiance(e) of a U.S. citizen whom I married within 90 days of entry, or I am the K-2 child of such a fiance(e) (attach a copy of the fiance(e) petition approval notice and the marriage certificate). Eligibility Under Sec. 245 d. I was granted asylum or derivative asylum status as the spouse or child of a person Approved Visa Petition granted asylum and am eligible for adjustment. Dependent of Principal Alien Special Immigrant e. I am a native or citizen of Cuba admitted or paroled into the U.S. after January 1, Other 1959, and thereafter have been physically present in the U.S. for at least 1 year. Preference f. I am the husband, wife, or minor unmarried child of a Cuban described in (e) and APPROVED am residing with that person, and was admitted or paroled into the U.S. after Action Block DISTRICT DIRECTOR January 1, 1959, and thereafter have been physically present in the U.S. for at least 1 year. g. I have continuously resided in the U.S. since before January 1, 1972. DEC3 0 1996 h. Other-explain R.F.L SFR 4448 I am already a permanent resident and am applying to have the date I was granted permanent residence adjusted to the date I originally arrived in the U.S. as a nonimmigrant or parolee, or as of May 2, 1964, whichever is later, and: (Check one) To Be Completed by i. I am a native or citizen of Cuba and meet the description in (e), above. Attorney or Representative, if any Fill in box if G-28 is attached to represent j. I am the husband, wife or minor unmarried child of a Cuban, and meet the the applicant description in (f), above. VOLAG# Continued on back. ATTY State License # Form I-485 (09-09-92)N"
}
