{
  "anumber": "A73964564",
  "id": "A73964564_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Your Medicare Number: 622-52-2201M, 434017948 Page 2 of 3 June 19, 2001"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 Your Medicare Number: 622-52-2201M 434017948 Page 2 of 3 PART B MEDICAL INSURANCE N ASSIGNED CLAIMS (continued) June 19, 2001 Dates of Medicare You See Amount Service Medicare Services Provided Paid May Be Notes Charged Approved Provider Billed Section Claim number 07-01141-182-330 Michael A. Heisman, DPM, P o Box 24800, San Jose, CA 95154-4800 b,c 05/14/01 I Nursing fac care, subseq (99311) $60.00 $37.51 $30.01 $7.50 Notes Section: a Payment is included in another service received on the same day. b The name or Medicare number was incorrect or missing. Ask your provider to use the name or number shown on this notice for future claims. C This information is being sent to Medicaid. They will review it to see if additional benefits can be paid. General Information: You have the right to make a request in writing for an itemized statement which details each Medicare item or service which you have received from your physician, hospital, or any other health supplier or health professional. Please contact them directly, in writing, if you would like an itemized statement. Report Medicare fraud by calling the Medicare Fraud Hotline at 1-800-447-8477. You can now find information about Medicare and NHIC on the World Wide Web. Our new Internet address is http://www.medicarenhic.com. We welcome your comments through the internet. HICAP, the state's Health Insurance Counseling and Advocacy Program, provides information to help people with Medicare make good decisions about their health care coverage. For more information, call HICAP at 1-800-434-0222. To provide you with the best possible service, the Medicare Summary Notice is now available in Spanish. If you or someone you know would like to receive the Medicare Summary Notice in Spanish, please contact us at: 1-800-952-8627."
}