{
	"anumber": "A73919171",
	"id": "A73919171_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73919171_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 4/11/91) Y"
		},
		"countries": {
			"ms_countries_nlp_v1": ["El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 1994, 2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 U.S. Department of Justice A6 Immigration and Naturalization Service (NNS) IRO OMB #1115-0054 Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# 73919171 APPROVED I.N.S RAC DIRECTOR 12/09/94 WAC-95-047-50074 WACBKT01 G-28 or Volag # FEB 11 1995 Section of Law: Petition was filed on OCT 09 1994 (priority date) 201 (b) spouse 203 (a)(1) Personal Interview Previously Forwarded 201 (b) child 203 (a)(2) WSC 201 (b) parent 203 (a)(4) 8432 Pet. Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(5) Field Investigations I-485 Simultaneously AM CON: 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: PHO 8245 201(b)(2)(A)(%) A. Relationship 1. The alien relative is my 2. Are you related by adoption? .3 Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your allen relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) MEJIA-Romero Luis Alberto ROMERO De Mejia Sabina de Mercedes 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 14317N.Second Avenue 14317 N. Second Avenue (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) E1 Mirage Arizona/USA 85335 E1 Mirage Arizona/USA 85335 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (Canton (State/Country) El Canton Los Pozos, San Vicente, El Salvador San Vicente Llanos de Archilco) Salvador 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) X Male X Married Single (Mo/Day/Yr) Male Married Single 10-11-39 Female Widowed Divorced 12-30-1906 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) None - N/A Sabina de Mercedes Romero 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 7-9-83 Los Angles, California 4-9-31 San vicente E1 Salvador 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) None - N/A None - N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended None - N/A N/A Jacinto Mejia (Deceased Husband) 9-6-93 (See attached copy of Death Certificate and translation) 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) No. 203498878 2-5-93 Phoenix, Arizona Visitor with Authorized I-94 & Valid Passport Parents Arrival/Departure Record (I-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? 5 7 8 9 1 2 1 2 (B-2) 9-9-93 Yes No N/A Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued March 8, 1995 Note: I am a Naturalized Citizen 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: None - N/A Date and place of admission for, or adjustment to, lawfut permanent residence, Date this employment began (Month/Day/Year) and class of admission: N/A N/A I am a Naturalized Citizen of the USA 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? No Exclusion Deportation Recission Judicial Proceedings INEFIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4/11/91) Y KS 214.9"
}
