{
  "anumber": "A73964564",
  "id": "A73964564_0113",
  "page_index": 113,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0113/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Incomplete N-648, N-648B ( (3-30-99)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 U.S. Department of Justice Notice of Incomplete N-648 Immigration and Naturalization Service Medical Certification For Disability Exceptions Applicant'sName JOSEFA MATILDE ROMANO A Number A073964564 For Official Use Only Name of INS Officer AYRAN NOTICE TO APPLICANT: The Form N-648, Medical Certification for Disability Exceptions that you have submitted is incomplete. Identified below in the boxes marked with an \"X\" is the information that your doctor needs to provide. Please return this letter to your doctor, along with the Form N-648, as soon as possible. Your doctor should complete the Form N-648 with the requested information, and you should return the completed N-648 as instructed by the Service. ! NOTE: If your doctor does not provide all requested information, your N-648 will be rejected. NOTICE TO CERTIFYING DOCTOR: The Form N-648, Medical Certification for Disability Exceptions that you filled out on behalf of the above-named applicant is incomplete. The deficient information is identified below. Please read this Notice carefully, complete the Form N-648 with the requested information, and return the completed Form N-648 to the applicant. You may use additional sheets of paper to detail your responses if necessary. ! NOTE: If you do not provide all of the information requested below, in a clear and legible fashion, the applicant's request for a medical exception will be rejected. Physical And Mental Health Information: To qualify for a disability exception, the applicant must show that he or she suffers from a medically determinable disability or impairment or combination thereof that results in functioning so impaired that it prevents him or her from learning or demonstrating knowledge of English and/or civics. The impairment must not be temporary (i.e., less than 12 months). An applicant will not qualify for the exception if the sole basis for the request is that he or she cannot learn or demonstrate knowledge of English and/or civics because of old age. Please provide a full and complete medical diagnosis of the applicant's disability or impairment, including, if applicable, the most recent DSM Code (Question #3 on the Form N-648). Note: INS will not consider vague terms such as \"organic brain syndrome\" or \"chronic brain syndrome\" unless you identify the etiology. Specific problem noted: Please explain how the disability or impairment prevents the applicant from learning or demonstrating knowledge of English and/or U.S. history and government (Question #3 of the Form N-648). Specific problem noted: Please provide your conclusion about whether the applicant is able to learn or demonstrate knowledge of English and/or U.S. history and government because of his or her condition (Question #3 on the Form N-648). Please state whether or not the applicant's condition resulted from the illegal use of drugs (Question #4 on the Form N-648). Please state whether or not the applicant's developmental disability first manifested itself before age 22 (Question #4 on the Form N-648). Please state whether the applicant's condition is temporary (less than 12 months) or permanent (Question #5 on the Form N-648). Other N-648B (3-30-99)"
}