{
  "anumber": "A73919171",
  "id": "A73919171_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73919171_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "SUMMARY TRANSLATION OF A MARRIAGE CERTIFICATE IN SPANISH – TO ENGLISH, 56"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1931,
        2023,
        1993
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 SUMMARY TRANSLATION OF A MARRIAGE CERTIFICATE IN SPANISH - TO ENGLISH THE UNDERSIGNED HEAD OF THE OFFICE OF THE CIVIL REGISTRY IN SAN VICENTE, EL SALVADOR CERTIFIES: OFFICE OF THE CIVIL REGISTRY San Vicente, El Salvador HEAD OF THE OFFICE OF CIVIL REGISTRY Blanca Gloria Lemus MARRIAGE REGISTRY BOOK PAGE NUMBER 56 Year of 1931 DATE OF MARRIAGE April 9, 1931 PLACE OF MARRIAGE San Vicente, E1 Salvador NAME OF GROOM Jacinto Mejia MARITAL STATUS Single AGE 23 ORIGIN San Vicente, El Salvador OCCUPATION Laborer NAME OF BRIDE Sabina De Mercedes Romero MARITAL STATUS Single AGE 24 ORIGIN San Vicente, E1 Salvador OCCUPATION Homemaker FATHER OF THE GROOM Not Mentioned (Jacinto Mejia is her MOTHER OF THE GROOM Juana Mejia illigitimate son) FATHER OF THE BRIDE Not mentioned (Sabina De Mercedes is her MOTHER OF THE BRIDE Antonia Romero (illigitimate daughter) THE MOTHERS OF BOTH GRROM AND BRIDE ARE NATIVES OF EL SALVADOR ALSO WITNESSES: Pablo Romero Ignacio Pineda Arturo Acevedo R.A. Moreno THIS CERTIFIED COPY OF THE MARRIAGE CERTIFICATE WAS TAKEN FROM THE ORIGINAL COPY OF THE MARRIAGE CERTIFICATE ON FILE IN THE MUNICIPAL OFFICE IN THE OFFICE OF THE VICIL REGISTRY IN San Vicenter, E1 Salvador on February 11, 1993. BLANCA GLORIA LEMUS (Signed) Head of the Office of Civil Registry I, Jose Robles, Jr. hereby certify that the foregoing is an accurate summary translation taken from the original certified copy of the marriage certificate in Spanish and I further certify I am competent to translate from Spanish to English. VLM,I Date: 11-5-94 Jose Robles, Jr. - Director Friendly House, Inc. Department of Immigration Services Immigration Dept. 802 S. 1st Ave. P.O. Box 3695 Phx., AZ 85030 (602) 257-1870 FAX 254-3135"
}