{
  "anumber": "A73964564",
  "id": "A73964564_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73964564_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, Form N-4 40"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/24/2023 Attachment(s) to Form N-335 Applicant: Josefa Matilde Romano Application for Naturalization, Form N-400 Alien Number: A073964564 Pursuant to the investigation and examination of your application it is determined that you are ineligible for naturalization for the following reason(s): During your examination, you failed to demonstrate an ability to speak and understand the English language sufficiently to answer the questions in your interview and on your application. You were unable to understand questions asked of you by the Service officer regarding your eligibility for naturalization, despite the officer's efforts to help you comprehend by repeating and rephrasing questions. As a result, the Service officer was unable to complete the examination and test you in English literacy and U.S. history and government. Section 312 of the Act provides in pertinent part that: (a) No person except as otherwise provided shall hereafter be naturalized who cannot demonstrate an understanding of the English language, including an ability to read, write, and speak words in ordinary usage in the English language [and] a knowledge and understanding of the fundamentals of the history, and of the principles and form of government, of the United States. (b) The requirements of subsection (a) shall not apply to any person who is unable because of physical or developmental disability or mental impairment to comply therewith Although you were unable to speak and understand English sufficiently to complete your examination, you submitted Form N-648, Medical Certification for Disability Exceptions, in support of your claim of being exempt the requirements of Section 312 of the Act. Section 312.1(b)(3) of Title 8, Code of Federal Regulations clarifies the qualifications for a disability exception, where it is demonstrated that an applicant suffers form a medically determinable disability or impairment or combination of impairments that result(s) in functioning so impaired that it prevents him or her from learning or demonstrating knowledge of English and/or U.S. history and government. An authorized medical professional must provide: 1) a full and complete description of the applicant's diagnosis; 2) a thorough explanation of how the condition diagnosed has impaired the functioning of the applicant so severely that the applicant is unable to learn or demonstrate knowledge of English and/or U.S. history and government; and 3) the medical professional's conclusion about whether or not the applicant is able to learn or demonstrate knowledge of English and/or U.S. history and government. The Form N-648 that you submitted failed to demonstrate how your disability affected your ability to meet the English and civics requirements for naturalization. Your physician failed to sufficiently establish the existence of a nexus between your impairment and your inability to learn English. Consequently, you are not exempt the requirements of Section 312 of the Act, including that you must sufficiently speak and understand English. Subsequent to your preliminary examination, you were given Form N-14, and requested to bring an amended or more detailed Form N-648, correcting the noted deficiencies, to your reexamination, scheduled on Nov. 7, 2003. You failed to appear or to notify the Service of your inability to appear. 8 C.F.R. Section 312.5(b) states: \"If an applicant who receives notice of the second scheduled examination date fails to appear without good cause for that second examination \" without prior notification to the Service, the applicant will be deemed to have failed this second examination. You failed to meet the requirements of Section 312 of the Act. Therefore, your application must be and hereby is denied. This decision is made without prejudice toward the filing of a new application. However, eligibility must again be established."
}