{
  "anumber": "A75287434",
  "id": "A75287434_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75287434_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Signalement du titulaire, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "The Secretary of State of the United States of America AS 30 NoHIdX3,O bereby requests all whom it may concern to permit the citizen/ national of the United States named herein to pass A without delay or bindrance and in case of need to give all lawful aid and protection. Le Secrétaire d'Etat des Etats-Unis d'Amérique AS 30 O10Hd 3 prie par les présentes toutes autorités compétentes de laisser passer saiod le citoyen ou ressortissant des Etats-Unis titulaire du présent passeport, sans délai ni difficulté et, en cas de besoin, de lui accorder STNDIS loute aide et protection légitimes. 30 0317 30 SIGNATURE OF BEARER/SICNATURE DU TITULAIRE 37713 ENDER 30 WON WONDER 13 WON NOT VALID UNTIL SIGNED AS 30 UNITED STATES OF AMERICA Type/Cate- Code of issuing / code du pays PASSPORT NO./NO. DU PASSEPORT PASSPORT gorie State emetteur PASSEPORT P USA (9)(q) AIR Surname / Nom na 2661 80 90 ELIACIN OLDONN 11/28/17 Given names / Prenoms Dodge'd JAMES WILSON Nationality Nationalite SETON L861.80.20 UNITED STATES OF AMERICA of with Date'd naissance P2 MAYOMAI 35 of birth / Lieu de naissance HALTI 591 211 Date de adifyrance Date of expiration / Date d'expiration saiod BBAFEV 91 20 FEB/FEV 01 Amendments/ 25 ml FUEDON Authodit Modifications SENDIS PASSPORT AGENCY SEE PAGE inofaxied SUCPORT NEW YORK 24 30 0317 28 RDUEM 5061 20.51 30 (9)(q) Alon DIFDUAH NISHITE WONDER 13 WON HAID na"
}