{
	"anumber": "A75287434",
	"id": "A75287434_0002",
	"page_index": 2,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75287434_0002/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application to Register Permanent Residence or Adjust Status"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "Cuba"]
		},
		"years": {
			"ms_years_nlp_v1": [1905, 1972, 1996, 2023, 1997, 1964, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 U.S. Department of Justice OMB No. 1115-0053 Immigration and Naturalization Service Application to Register Permanent Residence or Adjust Status START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name ELIACIN Name ANNETTE Initial Address C/O Resubmitted DEPARTMENT Street Number Apt. and Name 13120 NW 19TH AVE # City MIAMI State Zip Code Reloc Sent 524226 FLORIDA 33167 we Date of Birth Country FEE (month/day/year) 02.15.1905 of Birth HAITI THE Social A # (if any) Security # 76287434 NONE COMPUTER Reloc Rec'd Date of Last Arrival I-94 # NR. (month/day/year) 01.02.89 (LOST) Current INS Expires on AUG 20 1996 Status NONE (month/day/year) N/A Part 2. Application Type. (check one) Applicant Interviewed 3103 I am applying for adjustment to permanent resident status because: a. an immigrant petition giving me an immediately available immigrant visa number has Section of Law been approved (attach a copy of the approval notice), or a relative, special Sec. 209(b), INA Sec. 13, Act of 9/11/57 immigrant juvenile, or special immigrant military visa petition filed with this application Sec. 245, INA will give me an immediately available visa number if approved. Sec. 249, INA Sec. 1 Act of 11/2/66 b. My spouse or parent applied for adjustment of status or was granted lawful Sec. 2 Act of 11/2/66 Other permanent residence in an immigrant visa category which allows derivative status for spouses and children. Country Chargeable C. I entered as a K-1 fiance(e) of a U.S. citizen whom I married within 90 days of Hute entry, or I am the K-2 child of such a fiance(e) (attach a copy of the fiance(e) petition approval notice and the marriage certificate). Eligibility Under Sec. 245 d. I was granted asylum or derivative asylum status as the spouse or child of a person Approved Visa Petition granted asylum and am eligible for adjustment. Dependent of Principal Alien Special Immigrant e. I am a native or citizen of Cuba admitted or paroled into the U.S. after January 1, Other 1959, and thereafter have been physically present in the U.S. for at least 1 year. Preference IXW f. I am the husband, wife, or minor unmarried child of a Cuban described in (e) and Action Block am residing with that person, and was admitted or paroled into the U.S. after January 1, 1959, and thereafter have been physically present in the U.S. for at least APPROVED I.N.S. DISTRICT DIRECTOR 1 year. g. I have continuously resided in the U.S. since before January 1, 1972. h. Other-explain MAR 0 1997 I am already a permanent resident and am applying to have the date I was granted from permanent residence adjusted to the date I originally arrived in the U.S. as a 8117 nonimmigrant or parolee, or as of May 2, 1964, whichever is later, and: (Check one) To Be Completed by i. Attorney or Representative, if any I am a native or citizen of Cuba and meet the description in (e), above. Fill in box if G-28 is attached to represent j. I am the husband, wife or minor unmarried child of a Cuban, and meet the the applicant description in (f), above. VOLAG# ATTY State License # Form I-485 (09-09-92)N Continued on back."
}
