{
	"anumber": "A75424782",
	"id": "A75424782_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0032/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "feminin"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI, 1228"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 2023, 1933, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 LIBERT EQUALITY FRATERNITY REPUBLIC OF HAITI XXX No 1228 The year nineteen thirty three; and the friday September fifteen year 130th of the Independance at two 'clock in the afternoon. Before thus Sainville Lahens officer of the civil state of Port- au-Prince Northern Section; Had appeared Mrs Nerva Brice, borned Anna Jadot, adult, dressmaker borned in Saint louis du Nord, residing presently in Port-au-Prince. To whom thus had presented YEAR 1933 a child of feminin sex whom thus declared to be his legitimate daughter borned from his natural works with the citizen Nerva PAGE 23 Brice her husband adult worked at public works domiciled in Saint Louis du Nord residing presently in Port-au-Prince. Whom NUMBER 632 child borned in Port-au-Prince, rue des remparts the sunday August thirteen of the same year at eight o'clock in the morning. To whom thus child she was given the first names of: Anne Marie BIRTH CERTIFICATE Louisa Brice. This act made in presence of citizens Joseph Theodore, Mechanic and Eugene Baptist, Lawyer witnesses chosen OF: ANNE MARIE and brought by the appearant, both of them adults domiciled in the same town. Whom thus, after lecture was done, have signed LOUISA BRICE with us not the appearant for not knowing how to do SO. BORN ON AUGUST 13, SIGN: S. LAHENS RECEIPT: 949224-Q 1933. Port-au-Prince, the March 16, 1988 ANH; 287320 CONFORM COPY CLASSIFIED KJB ILLEGIBLE SIGNATURE JEAN WILFRID BERTRAND GENERAL DIRECTOR BEFORE ME A NOTARY PUBLIC IN AND FOR THE STATE OF FLORIDA AT LARGE PERSONALLY APPEARS YVON JOSAPHAT WHO AFTER DULY SWORN DEPOSES AND SAYS, HE'S FULLY VERSED IN THE ENGLISH AND FRENCH LANGUAGES AND THIS IS A TRUE AND CORRECT TRANSLATION OF THE ATTACHED DOCUMENT. SWORN TO AND SUBSCRIBED BEFORE ME THIS 6th DAY OF DECEMBER996 Heraus Do HERAUX LOUIS Notary Public OFFICIAL NOTARY SEAL HERAUX LOUIS NOTARY PUBLIC STATE OF FLORIDA COMMISSION NO. CC347943 MY COMMISSION EXP. FEB. 13,1998"
}
