{
  "anumber": "A75424782",
  "id": "A75424782_0039",
  "page_index": 39,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0039/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Translation of Birth Certificate, X X X No. 1228"
    },
    "years": {
      "ms_years_nlp_v1": [
        1995,
        1988,
        2023,
        1933,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 X No. 1228 TRANSLATION OF BIRTH CERTIFICATE Republic of Haiti Liberty Equality Fraternity Extract from the registrars of birth certificate of the District of Port-au-Prince filed at the National Archives of the Republic. In the nineteen hundred and thirty three and on Friday September 15 and 130th of the Independence at 2:00 A.M. Appearing before us: Sainville Lahens civil state officer of Port-au-Prince north section Had appeared Mrs. NERVA BRICE born MARIE ANNA JADOT adult dressmaker born in Saint Louis du Nord residing actually in Port-au-Prince whom have presented to us a female child that she declared being her legitimate daughter born from her legitimates works with the citizen NERVA BRICE her spouse adult employed at the publics works, domiciling in Saint Louis du nord, residing actually in Port-au-Prince Whom child was born in port-au-Prince, des Ramparts Street on Sunday August 13, of the current year at 8:00 A. M. To whom child she gave the first name of: ANNE MARIE LOUISA BRICE. Whose act made in presence of the citizens Joseph Theodore Mechanic Eugene Baptiste Lawyer, chosen witnesses were brought by the appearer, both of them adults residing and domiciling in this city They have signed it after reading not the appearer for being unable to do so Port-au-Prince March 16, 1988 SIGNED LAHENS SEAL FOR COPY CONFORM COLLTED SIGNED JEAN WILFRID BERTRAND director general YEAR: 1933 PAGE 23 NUMBER 632 BIRTH CERTIFICATE OF : ANNE MARIE LOUISA BRICE ANH/A 287320 I. E.S.D. , HEREBY CERTIFY THAT THE FOREGOING TRANSLATION IS MADE BY ME AND IT IS TRUE AND CORRECT TO THE BEST OF MY KNOWLEDGE TRANSLATOR S SIGNATURE SWORN TO AND 28th DAY OF SUBSCRIBED TO BEFORE ME ON THIS FEBRUARY 1995 AT MIAMI FlA Deversity NOTARY PUBLIC'S SIGNATURE SYLVIO CHERASARD MY COMMISSION # CC 307476 EXPIRES: September 18, 1997 Bonded Thru Notary Public Underwriters"
}