{
  "anumber": "A75424782",
  "id": "A75424782_0036",
  "page_index": 36,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0036/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY, NARA, 8/7/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1984,
        1996,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 LIBERT` EQUALITY FRATERNITY REPUBLIC OF 1. TI Extracted from the registry of the clerk of the tribunal of peace of Port-au-Prince, Eastern Section. Today Wednesday the 30th day of the month of May nineteen eighty four; Year 181st of the Independance at eleven 'clock in the morning. Before thus, Julien Eustache, Judge of peace of Port-au-Prince, Eastern section, assisted of our clerk Louis Edner Duverneau. Had appeared the citizen Marie Anna Jadotte, owner residing and domiciled in Port-au-Prince, identified to the number 8023-BW. To whom thus had presented that all the researches made to the Nationales Archives of the Republic to retreive her act of birth remain futile and fruitless. That this act of birth make her the great need at this present moment, to autorise her to identify before whom of right. The reason, the appearant had brought in our office three witnesses which certify below the faith of sermon the truthfulness of her statement. HAVE TO THE INSTANT APPEARED 1. Mr. Sainte Pierre, identified to No: 2937-P 2. Mr. Wallon Aime identified to No: 1750-BW 3. Mr. Georges Louis identified to No: 5056-AY To whom the appearants adults and Haitians enjoying of their civils and politicals rights, owners, residing and domiciled in Port-au-Prince. After lceture has done by the Clerk of the statement whom presided and the dispositions of law ruling the matter. We have under the faith of sermont declared, certified, attested, knowing extremely well the citizen, Marie Anna Jadotte and knowing also that she was borned in Saint Louis du Nord the July twenty fith nineteen zero five of naturals works of Mr. Timeleon Jadotte and of the lady Sophie Richelieu, both of them deceased. To whom thus cited that the appearants thus have declared sincere and thruthful. To what act, and have prepared and concluded the present declaration that we have signed after reading with the appearants and our Clerk. SIGN: MARIE ANNA JADOTTE, SAINTE PIERRE, WALLON AIME, GEORGES LOUIS, JULIEN EUSTACHE, LOUIS EDNER DUVERNEAU. In view of the fact, the Judge of Peace of the Capital Eastern Section for the legalization of the Clerk's sign- ature. CONFORM EXPEDITION, CLASSIFIED. In view of the fact: Solely for the legalization of Mr Julien Eustache, Deputy Judge of Peace of Port-au-Prince, Eastern Section. Receipt No. 94209-SS; Port-au-Prince, June 1, 1984. G. Myrbel Jean Baptist, Att. Government's Commissary Department of Justice of Republic of Haiti Raymond Delva, Att. General Director This is a true and correct translation of the attached document from French to the English language. SWORN TO AND SUBSCRIBED BEFORE ME THIS 6th DAY OF DECEMBER 1996 Heeaux In HERAUX LOUIS/NOTARY PUBLIC OFFICIAL NOTARY SEAL TRANS Guard Traflat LATOR HERAUX LOUIS NOTARY PUBLIC STATE OF FLORIDA COMMISSION NO. CC347943 MY COMMISSION EXP. FEB. 13,1998"
}