{
  "anumber": "A75424782",
  "id": "A75424782_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEED FOR FLORIDA, FHA #092-3164482-203"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CONSUMERS TITLE AGENCY, INC Screened by NARA, 8/7/2023 14750 North West 7th Avenu FHA, #092-316428-203 Miami, Florida 33168 This instrument was prepared by Robert de la Vega ESQ. ? U.S. Department of Housing and Urban Development, 1320 South Dixie Highway, Coral Gables , Florida 33146 DEED FOR FLORIDA THIS INDENTURE, Made September 22, 1987 by and between Samuel R. Pierce, Jr. Secretary of Housing and Urban Development, of Washington, D.C., (hereinafter referred to as \"Grantor\"), and JEAN LOUIS & LOUISA B. LOUIS, his Wife (hereinafter referred to as \"Grantee(s)\"). 160 N.E 86 STREET, MIAMI, FL. 33138 WITNESSETH: That the said Grantor, for and in consideration of the sum of TEN DOLLARS ($10.00) to him/her in hand paid and other valuable considerations, the receipt whereof is hereby acknowledged, has granted. bargained, sold. aliened, remised, released. conveyed and confirmed, and by these presents doth grant. bargain. sell. alien. remise, release. convey and confirm unto the said Grantee(s) and the heirs and assigns of said Grantee(s), forever, all that certain parcel of land lying and being in the County of DADE , and State of Florida, more particularly described as follows, to wit: Lot 12, in Block 5, of EL JARDIN, according to the Plat thereof, as recorded in Plat Book 9, at Page 169, of the Public Records of Dade County, Florida. U.S. DEPT OF H.U.D. DEED TAX EXEMPT BEING the same property acquired by the grantor pursuant to the provisions of the National Housing Act. as amended (12 USC 1701 et seq.) and the Department of Housing and Urban Development Act (79 Stat. 667). TOGETHER with all and singular the tenements, hereditaments and appurtenances thereunto belonging, or in anywise appertaining, and the reversion and reversions, remainder and remainders, rents, issues and profits thereof. And also all the estate, right, title, interest. property, possession, claim and demand whatsoever, as well in law as in equity. of the Grantor, of, in and to the same, and every part and parcel thereof, with the appur- tenances. TO HAVE AND TO HOLD the above granted and described premises with the appurtenances, unto the Grantee(s), and the heirs and assigns of said Grantee(s), to their only proper use, benefit and behoof forever. SUBJECT TO ALL covenants, restrictions, reservations, easements, conditions and rights appearing of record; and SUBJECT to any state of facts an accurate survey would show. AND the said Grantor does hereby specially warrant the title to said land against the lawful claims of all persons claiming by, through or under him/her. HUD-91810 (3-83) Previous edition is obsolete Page 1 of 2 pages Reprinted 3-87"
}