{
	"anumber": "A75424782",
	"id": "A75424782_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "DEED FOR FLORIDA, HUD-91810 ( (3-83)"
		},
		"years": {
			"ms_years_nlp_v1": [1990, 2023, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 DEED FOR FLORIDA IN WITNESS WHEREOF the undersigned has set his/her hand and seal as Field Office Chief Property Officer, Property Disposition Section HUD Field Office, Coral Gables Florida, for and on behalf of the said Secretary of Housing and Urban Development, under authority and by virtue of 35 F.R. 16106 (10/14/70). as amended. Signed, sealed and delivered in the SAMUEL R. PIERCE, JR. presence of: Secretary of Housing and Urban Development. Cfk M. Hhman By angele 2 Daybut (SEAL) Field Office HUD Field Office, Coral Gables , Florida STATE OF FLORIDA : SS COUNTY OF DADE Before me personally appeared Angela L. Dougherty who is personally well known to me and known to me to be the duly appointed Field Office Chief Property Officer, Property Dispositon Section , HUD Field Office. Coral Gables , Florida, and the person who executed the foregoing instrument bearing date September 22, 1987 , by virtue of the above cited authority, and acknowledged before me that he/she executed the same as Field Office Chief Property Officer Property Disposition Section for and on behalf of Samuel R. Pierce, Jr. Secretary of Housing and Urban Development, for the purposes therein expressed. Witness my hand and official seal this 22nd day of September , 19 87 Notary Public in and for the County and State aforesaid My Commission Expires: NOTARY PUBLIC STATE OF FLORIDA KY COMMISSION EXP. JAN 21,1990 BONDED THRU GENERAL INS. UND. Page 2 of 2 pages HUD-91810 (3-83) GPO 902-594"
}
