{
	"anumber": "A75424782",
	"id": "A75424782_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0003/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application to Register Permanent Residence or Adjust Status"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Haiti", "Cuba"]
		},
		"years": {
			"ms_years_nlp_v1": [1972, 1996, 2023, 1964, 1959]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 U.S. Department of Justice OMB No. 1115-0053 Immigration and Naturalization Service Application to Register Permanent Residence or Adjust Status START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. Receipt Family Given Middle Name BRICE Name MARIE Initial ANNA Address C/O 160 NE 86ST MIA Resubmitted Street Number Apt. and Name 160 NE 86ST # RECEIVED DISTRICT NOV ELIVED INF 1996 MIAMI, FIA. City MIAMI State Zip Code FLORIDA 33138 Reloc Sent Date of Birth Country (month/day/year) 07/25/05 of Birth HAITI 9016 Social A # (if any) PER COMPUTER Security # NA N/A Reloc Rec'd NR FCO Date of Last Arrival I-94 (month/day/year) 06/3/87 428968183 00 DEC 09 1996 Current INS Expires on Status EMIGRANT (month/day/year) DEC 87 Part 2. Application Type. (check one) Applicant Interviewed I am applying for adjustment to permanent resident status because: a. an immigrant petition giving me an immediately available immigrant visa number has Section been approved (attach a copy of the approval notice), or a relative, special Sec. Sec. immigrant juvenile, or special immigrant military visa petition filed with this application will give me an immediately available visa number if approved. Sec. Sec. 245, 249 209(b), 2 13, 1 Act of Act Act Law INA INA of of MNA of 11/2/66 11/2/66 9/11/57 DEC SCHIVED, 1996 Sec. b. My spouse or parent applied for adjustment of status or was granted lawful Sec. permanent residence in an immigrant visa category which allows derivative status Other for spouses and children. Country Chargeable C. I entered as a K-1 fiance(e) of a U.S. citizen whom I married within 90 days of entry, or I am the K-2 child of such a fiance(e) (attach a copy of the fiance(e) petition approval notice and the marriage certificate). Eligibility Under Sec. 245 d. I was granted asylum or derivative asylum status as the spouse or child of a person Approved Visa Petition granted asylum and am eligible for adjustment. Dependent of Principal Alien Special Immigrant e. I am a native or citizen of Cuba admitted or paroled into the U.S. after January 1, Other 1959, and thereafter have been physically present in the U.S. for at least 1 year. Preference f. I am the husband, wife, or minor unmarried child of a Cuban described in (e) and am residing with that person, and was admitted or paroled into the U.S. after Action Block DISTRICT C January 1, 1959, and thereafter have been physically present in the U.S. for at least 1 year. g. I have continuously resided in the U.S. since before January 1, 1972. JUL 31 h. Other-explain processed I am already a permanent resident and am applying to have the date I was granted permanent residence adjusted to the date I originally arrived in the U.S. as a nonimmigrant or parolee, or as of May 2, 1964, whichever is later, and: (Check one) To Be Completed by i. I am a native or citizen of Cuba and meet the description in (e), above. Attorney or Representative, if any Fill in box if G-28 is attached to represent j. I am the husband, wife or minor unmarried child of a Cuban, and meet the the applicant description in (f), above. VOLAG# ATTY State License Form I-485 (09-09-92)N Continued on back."
}
