{
  "anumber": "A75424782",
  "id": "A75424782_0041",
  "page_index": 41,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0041/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Marriage Certificate of the Citizen Nerva Brice and of the Citizen Marie Anna Jadotte, MARRIAGE CERTIFICATE OF THE CITIZEN NERVA BRICE AND OF THE CITIZEN MARIE A. JADOTTE."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1999,
        2023,
        1930,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 LIBERTY EGALITY FRATERNITY REPUBLIC OF HAITI Extract from theregisters of marriage certificate of the civil state of the district of Saint Louis du Nord. Today April 24, 1930 and 127th years of the Independence of Haiti at 4:00 P.M. Befor eus Arthur Austin civil state officer of the district of Saint Louis du Nord undersigned. Have appeared: 1) The citizen NERVA BRICE assistant medical 31 years old and 1 month born born at Port-au-Prince (South Section) and domiciled in this district; legitimate son of the HENRI G. BRICE and the citizen CARINE STABLE both of them deceased stipulating for him and under his personal name one part. 2) The citizen MARIE ANNA JADOTTE 24 years old and 9 months without profession born and domiciled in that district. Natural daughter of the citizen THIMOLEON JADOTTE, owner, domiciled at Borgne and of the citizen SOPHIE RICHELIEU deceased. Stipulating for her and under her personal name the other part. Whom asked us to celebrate their marriage and whose publications were done in front of the of the main door of our office on Sundays 30th of last month and 6th of this month at 10:00 A.M. There was no opposition about this marriage. After reading to the paties 1) of all documents required by the law, according to their states and the formalities of marriage 29 of chapter 6 of the law. We have asked to the future spouses if they accept to be husband and wife, they have responded separately and affirmatively in presence of the following witnesses. We declared in the name of the law that the citizen Nerva Brice and the citizen Marie Anna Jadotte has been united by this marriage. Whose act done and prepared at the new spouses' house in presence of the citizen Alix Tiphaine dean of the court of 1st instance of Port-dePaix; Alfred J. william from the groom's side; Walter Poux Pharmacist and Felix D. Sam from the bride's side. All four adults owner domiciled at Port-de-Paix and at Saint Louis du Nord chosen witnesses and were called by the spouses. After reading done by us, the groom and the witnesses have been signed with us the bride did not signe because she was unable to do it. SIGNATURE OF N. BRICE ALFRED WILLIAM WALTER POUX MARRIAGE CERTIFICATE OF THE CITIZEN NERVA BRICE AND OF THE CITIZEN MARIE ANNA JADOTTE. reshleuport TRANSLATOR'S SIGNATURE SWORN TO AND SUBSCRIBED TO BEFORE ME ON THIS 16th DAY OF NOVEMBER 1996 AT 7806 NE 2ND AVE MIAMI, FLORIDA 33138. give JACQUES A. DESPINOSSE NOTARY PUBLICAS SIGNATURE MY COMMISSION # CC448642 EXPIRES SMITH March 27, 1999 BONDED THRU TROY FAIN INSURANCE, INC."
}