{
  "anumber": "A75424782",
  "id": "A75424782_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Vingt Centimes de Courant, N° 89443"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 REPUBLIQUE WHATE 20 20 NNN N2 89493 Cuses Cmes LIBERTE 5G LITE IR JORNITE REPUBLICUT D'HLITI Vingt Centimes de Courde Extrait des Registres du Greffe Tribunal do Paid de Port-ou Prince Section Ect. Aujourd'hui Mercredi trentièmo jour du Mois de Mai mil neuf cent- quatre Pan 181ème de onze heures du matin. Per devant Nous, Julion Eustache, Suppléant Jugo de Paix de Port-- Vinge quatif Prince, Section Est, assisté de notre Creffier Louis Edner Devernes A Comparu la Citeyenne Marie Anna Jadotte, prepriétaire,demeurant- et domiciliée a rt-au-Prince, identifiée au No:8023-2:,-Laquellg nous a exposé que toutes les Recherches effectuée aux .rchives No tionales de la Republique pour retrouver son acte de Naismance do mourent vaines et infructueuses; Que scn Acte de Nuissance lui fait actuellement grand bescin aux-- fine de lui permettre d. s'identifier par devant qui de dreit. Pourquei la comparante a amerié en notre pretoire trois temoins qu certifierent sous 12 foi du serment la veracité de scn exposé: CNT L'INCTANT 1.-Consieur Sainté Pierre, identifié au No: 2937-P 2.-Nonzieur Mallon Aimé identifié au No:1750-37 3.6-Nonsicur Georges Louis, identific au No:5056-4Y Lesquels companants majeurs et Huitiens, jouissant do leurs droits civils et Politiques, propriétaires, demeurant et domiciliés 3. Port surPrince. près lecture a eux faite par le greffier de l'exposé- qui precede et dos dispositions de loi registant la matière,-Nous ont sous la foi du sermont declaréx, certifié attesté connaitre pa faitement bien la citoyenne MRIS ANNA JADCTTE et savoir surtcut- qu'elle est née : Saint Louis du Nord, 1e. vingt cing Juillet mil- neuf cent cing des oeuvres naturelles du sieur Timoleen Jadotte-- et de la dame Sophie Richelicuptous deut décédés. Desquels faits sus cités que les companents nous ent declaré stn- ceres et Authentiques; Dont acte. Et avons dressé et cles le oré sent proces verbal que nous avons signé apres lecture avec les comparents et notre greffier. AINEI SIGNS: -Mario Anna Jadette, Sainté Fierre, Wallon Aimé, Ceorge Leuis, Julien Edner Vu le Juse de Paix de POUR EXPEDITION COMPANY Section Est pour la 14 Listion COLI TRI 03 signature du Greenier."
}