{
	"anumber": "A76229988",
	"id": "A76229988_0009",
	"page_index": 9,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A76229988_0009/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petition for Alien Relative, I-130 (Rev. 4 11 '91)"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1957, 1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "NICOSCREENED by NARA 8/7/2023 LEAVENWORTH KANSAS U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp Fee Stamp A# 76229988 APPROVED I.N.S. DISTINCTIDE ETOP 7319 G-28 or Volag # 201 (b) parent XC MA133 1997 Section of Law: Petition was filed on: 201 (b) spouse 203 (a)(1) Record lend Personal Interview DATE (priority consided 201 (b) child 203 (a)(2) 0112 Pet Ben. \"A\" File Reviewed Stateside Criteria 203 (a)(4) 203 (a)(5) Field Investigations Simultarteously B AM CON: 204 (a)(2)(A) Resolved 20.204(h) Resolved Remarks: 25482 S A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child FOIA (b)(6 B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) FOIA (b)(6) SANDER MARIE LUCIENNE 2. Address (Number and Street) (Apartment Number) 1155 N.W. 121th ST (Town or City) (State/Country) (ZIP/Postal Code) MIAMI FL 33168 3. Place of Birth (Town or City) (State/Country) BARADERE HAITI 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single 04-21-06 Female Widowed Divorced 7. Other Names Used (including maiden name) MARIE LUCIENNE MATIN 8. Date and Place of Present Marriage (if married) N / A 9. Social Security Number 10. Alien Registration Number (if any) 595-82-0291 N / A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended MAX SANDER 1957 (decement) 13. Has your relative ever been in the U.S.? Yes No 14. If your relative is currently in the U.S., complete the following: He or she last arrived as a (visitor, student, stowaway, without inspection, etc.) VISITOR Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) 2 82 4 4 8 0 02-23-89 Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 N/A 15. Name and address of present employer (if any) N/A Date this employment began (Month/Day/Year) N/A 16. Has you relative ever been under immigration proceedings? Yes X No Where When Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form I-130 (Rev. 41191) Y"
}
