{
  "anumber": "A76229988",
  "id": "A76229988_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A76229988_0014/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "LIBERTY EQUALITY FRATERNITY, C-4 0063205"
    },
    "years": {
      "ms_years_nlp_v1": [
        1995,
        1996,
        1906,
        2023,
        2000
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/7/2023 LIBERTY EQUALITY FRATERNITY REPUBLIC OF HAITI Excerpt form the registers of birth of the commune of Baraderes, kept in the office of the National Archives of the Republic. Serial C-4 NO 0063205 In the year of nineteen hundred six, the 103th year of the Independence and on December thirteen at nine o'clock in the morning. Before us: ANTOINE LUC MILORD, officer of the civil state of the commune of Barade- re, the undersigned. Appeared Mr. . EMILE MATIN, farmer, residing and domiciled in Baraderes. Who presented to us a female child whom he declared to be his natural daughter, born in Baraderes on April twenty first nineteen hundred six, of the lady LOUISE TERMINE, dressmaker, residing and domiciled in Bara- deres. To said child he gave the first name of: MARIE LUCIENNE Which act was carried out in our office in the presence of RENE LOUIS and JEAN RICHARD, both adults, residing and domiciled in Baraderes, wit- nesses choosen and brought by the appearing. After having read this present act I have signed it without the parties. Signed: A. L. MILORD Port-au-Prince July 22, 1996 FOR COPY CONFORM/COLLATIONED JEAN WILFRID BERTRAND, General Director In the left margin Year 1906 Page 10? NO 204 Birth certificate of: MARIE LUCIENNE MATIN Born on April 21, 1906 ANHA - 895678 The translation above is correct and true to the best of my knowledge. mulle Salvant Junelle Salvant Translator Sworn to and subscribed before me on this 29th day of August 1995. Jersmot Hortensia Jeannot OFFICIAL NOTARYSEAL Notary Public HORTENSIA L JEANNOT NOTARY PUBLIC STATE OF FLORIDA COMMISSION NO. CC549642 MY COMMISSION EXP. APR 1,2000"
}