{
	"anumber": "A76229988",
	"id": "A76229988_0042",
	"page_index": 42,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A76229988_0042/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 8/7/2023, I-145"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "C Screened by NARA, 8/7/2023 have - AND FILLE 76 229 988 SAndee L MARIe 10 THIS OFFICE RESLAYME HLVD NOUP IVU. MLAMiLUNIDA 33138 05/01/20 Art HEOU AM regarding an immigration matter respond to 5016 request may requit in denial OF your application. TIME Lare arrival can cause 71 long delay or postportement OT interview. MERCERCY 11 you HUST cancer this appointment because OF an emergency, please indreate below the nature OT the emergency and attaomevidonge or tne emergency sign and date this form and return ito this office immediately WORLD YOUR this/ferror: an interpreter 110 you do not spear English): 811 toguments listocr below cany document in a foreign language must DO accompanied by a certified English translation). Documertssubmttod must be originals of DEPUTING copias that bear the soal OT the issuing authority Provide an acci tronal photocopy OT any original document you wish returned interview may be vidoestaped the service. KNING YOUR PASSPORT Birth cortiticate 8 original entry documentll9 HUK BLOUSES Your spouse must appear with you and bring a valid photo entification, DPOOT or ms/ner resigency or citizenship, present evidence that you and your spouse reside together in it husband/witch relationship: birth cortiticates OT children born OT your present marriage income tax returns mortgage documents insurance policies. rent receipts and/or agreements. wedding photographs, bank account and/or cradit cara records. INFECTIONING PUR MARENTE UI UNITED STATES CITIZENS: MUSE present original certificate OT birth OT the petitioner and 11 there has been a name change by virtue or marriage present original marriage license OF petitioner. it name change by court deorec. present suon document CORRENT MEDICAL REPURIS AS soon as you roccivo Enis notice. you are required to make arrangements for your medical examination with one or the medical examiners on the attached List or INS approved physicians who will perform the medical examination required laboratory procedures. and any necessary chest x-ray NOTES Applicants two years or ago or older are required to nave a tuberculin skin test (Mantoux) as part of the medical examination followed by a caest x-ray 11 reaction or 5mm or greater APPLICANTS UNDER J.S YEARS OF ALL ARE NOT ROUFINELY REQUIRED 10 HAVE THE TESTS AS PANI OF THEIR MEDICAL EXAMINATION PROOF 1.11 SUPPORT: YOU and/or any employed family members must present from each employer a letter on official stationary that indicates the position, whether the position 1.5 temporary or permanent, current salary, and cate or initial employment 11 you Havi ALTANY HIME MEEN ARRESTED in any country you must submit the following TOP LACH dress arresting officer G report: indictment (17 applicable.to document showing the disposition of the case. 11 YOU ARE THE BENEFICIARY OF AN APPROVED VISA PETLION: sting CODICE of all documents submitted with that polition HT"
}
