{
	"anumber": "A77912550",
	"id": "A77912550_0033",
	"page_index": 33,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A77912550_0033/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Part 7. The Use of the Affidavit to Overcome Public Charge Grounds ( (Continued)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1996]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/28/2023 Part 7. Use of the Affidavit of Support to Overcome Public Charge Grounds (Continued) Notice of Change of Address. Sponsors are required to provide written notice of any change of address within 30 days of the change in address until the sponsored immigrant(s) have become U.S. citizens, can be credited with 40 quarters of work, depart the United States permanently, or die. To comply with this requirement, the sponsor must complete INS Form I-865. Failure to give this notice may subject the sponsor to the civil penalty established under section 213A(d)(2) which ranges from $250 to $2,000, unless the failure to report occurred with the knowledge that the sponsored immigrant(s) had received means-tested public benefits, in which case the penalty ranges from $2,000 to $5,000. If my address changes for any reason before my obligations under this affidavit of support terminate, I will complete and file INS Form I-865, Sponsor's Notice of Change of Address, within 30 days of the change of address. I understand that failure to give this notice may subject me to civil penalties. Means-tested Public Benefit Prohibitions and Exceptions. Under section 403(a) of Public Law 104-193 (Welfare Reform Act), aliens lawfully admitted for permanent residence in the United States, with certain exceptions, are ineligible for most Federally-funded means-tested public benefits during their first 5 years in the United States. This provision does not apply to public benefits specified in section 403(c) of the Welfare Reform Act or to State public benefits, including emergency Medicaid; short-term, non-cash emergency relief; services provided under the National School Lunch and Child Nutrition Acts; immunizations and testing and treatment for communicable diseases; student assistance under the Higher Education Act and the Public Health Service Act; certain forms of foster-care or adoption assistance under the Social Security Act; Head Start programs; means-tested programs under the Elementary and Secondary Education Act; and Job Training Partnership Act programs. Consideration of Sponsor's Income in Determining Eligibility for Benefits. If a permanent resident alien is no longer statutorily barred from a Federally-funded means-tested public benefit program and applies for such a benefit, the income and resources of the sponsor and the sponsor's spouse will be considered (or deemed) to be the income and resources of the sponsored immigrant in determining the immigrant's eligibility for Federal means-tested public benefits. Any State or local government may also choose to consider (or deem) the income and resources of the sponsor and the sponsor's spouse to be the income and resources of the immigrant for the purposes of determining eligibility for their means-tested public benefits. The attribution of the income and resources of the sponsor and the sponsor's spouse to the immigrant will continue until the immigrant becomes a U.S. citizen or has worked or can be credited with 40 qualifying quarters of work, provided that the immigrant or the worker crediting the quarters to the immigrant has not received any Federal means-tested public benefit during any creditable quarter for/any period after December 31, 1996. I understand that, under section 213A of the Immigration and Nationality Act (the Act), as amended, this affidavit of support constitutes a contract between me and the U.S. Government. This contract is designed to protect the United States Government, and State and local government agencies or private entities that provide means-tested public benefits, from having to pay benefits to or on behalf of the sponsored immigrant(s), for as long as I am obligated to support them under this affidavit of support. I understand that the sponsored immigrants, or any Federal, State, local, or private entity that pays any means-tested benefit to or on behalf of the sponsored immigrant(s), are entitled to sue me if I fail to meet my obligations under this affidavit of support, as defined by section 213A and INS regulations. Civil Action to Enforce. If the immigrant on whose behalf this affidavit of support is executed receives any Federal, State, or local means-tested public benefit before this obligation terminates, the Federal, State, or local agency or private entity may request reimbursement from the sponsor who signed this affidavit. If the sponsor fails to honor the request for reimbursement, the agency may sue the sponsor in any U.S. District Court or any State court with jurisdiction of civil actions for breach of contract. INS will provide names, addresses, and Social Security account numbers of sponsors to benefit- providing agencies for this purpose. Sponsors may also be liable for paying the costs of collection, including legal fees. Form I-864 (10/6/97) Page 5"
}
