{
  "anumber": "A77912550",
  "id": "A77912550_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A77912550_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service, Form I-181 ( Rev.(3-1-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        1999,
        2023,
        2000
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/28/2023 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record of Immigration and Naturalization Service Lawful Permanent Residence Place MIAMI, FLORIDA File No. 07/13/2000 SRC-00-034-53657 SRCBXF01 A77-912-550 or the united States is accorded: I-94 #: 211918933 05 Name Sex Date of Birth (Month/Day/Year) MARIE,C DIEGUE FEMALE In Care Of JANUARY 16, 1905 Street City of Birth Country of Birth Address 1355 NW 113 TERR PORT-AU-PRINCE HAITI Apt. No. MIAMI, FL 33167 Country of Nationality Country of Last Residence City, State, Zip HAITI HAITI Marital Status Occupation N/I Class at time of Adj. Year Adm. to U.S. or Change to WIDOWED NOT B2 Present NI Class 1999 Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) N/A N/A N/A Section 212 (a)(14) Mother's First Name Father's First Name Labor Certification N/A trancuinise JOSEPH Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification of Last Niv Port of Prince 3/8/96 08967678 B2 Under the following provision of law Section 245, I. & N. Act As of May (Month) (Day) 10 (Year) 00 MIA at PORT OF ENTRY FOR PERMANENT RESIDENCE Class of Admission (Insert Symbol) IRO Remarks: Recommended by: (Immigration Officer) (Date) APPROVED I.N.S. DISTRICT DIRECTOR D. SCOTT 5/10/01 Delra D. Swtt MAY 1 0 2000 Recommendad by: Dely D. Scutt FOR USE BY VISA CONTROL OFFICE MIA 9539 Date Foreign State Preference Category Number Month of Issuance Signed 2000 (Visa Office, Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent o Form I-181 (Rev.3-1-83) N"
}