{
  "anumber": "A77912550",
  "id": "A77912550_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A77912550_0029/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support Under Section 213A of the Act, I-864 (10/6/97)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "o Screened by NARANG 9/28/2023 697-435-821 U.S. Department of Justice OMB # 1115-0214 Immigration and Naturalization Service Affidavit of Support Under Section 213A of the Act START HERE - Please Type or Print Part 1. Information on Sponsor (You) Last Name AURELIE N First Name ANDRE Middle Name Mailing Address 1355 (Street Number and Name) NW 113 TERR Apt/Suite Number City State or Province MIAMI HC Country ZIP/Pestal Code USA Telephone Number 33167 ( ) Place of Residence if different from above (Street Number and Name) Apt/Suite Number SAME AS ABOVE FOR AGENCY USE ONLY This Affidavit City Receipt State or Province Meets Country ZIP/Postal Code Telephone Number Does not ( ) meet Date of Birth (Month Day, Year) Place of irth(City, State, Country) Are you a U.S. Citizen? 5-22-41 HAITI Requirements of Yes No Section 213A Social Security Number FOIA (b)(6) Part 2. Basis for Filing Affidavit of Support Officer's I am filing this affidavit of support because (check one): Signature a. I filed/am filing the alien relative petition. b. I filed/am filing an alien worker petition on behalf of the intending Location immigrant, who is related to me as my (relationship) c. I have ownership interest of at least 5% of . (name of entity which filed visa petition) Date which filed an alien worker petition on behalf of the intending immigrant, who is related to me as my . (relationship) d. I am a joint sponsor willing to accept the legal obligations with any other sponsor(s). Part 3. Information on the Immigrant(s) You Are Sponsoring Last Name First Name DIEGUE PET Middle Name MARIE CHoiSiLiA Date of Birth (Month Day, Year) Sex: 01-16-05 Social Security Number (If any) Male Female Country of Citizenship A-Number (If any) HAITI Current 1355 NW 113TERR Address (Street Number and Name) Apt/Suite Number City Miami State/Province Country ZIP/Postal Code FL Telephone Number USA 33167 ( ) List any spouse and/or children immigrating with the immigrant named above in this Part: (Use additional sheet of paper if necessary.) Relationship to Sponsored Immigrant Date of Birth A-Number Social Security Number Name (If any) (If any) NONE Spouse Son Daughter Mo. Day Yr. Form I-864 (10/6/97)"
}