{
	"anumber": "A86927428",
	"id": "A86927428_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 Part 7. Use of assets to supplement income. (Optional) For Government Use Only If your income, or the total income for you and your household, from line 24c exceeds the Federal Poverty Guidelines for your household size, YOU ARE NOT REQUIRED to complete this Part. Skip to Part 8. Household Size = 26. Your assets (Optional) $ FOIA (b)(6) a. Enter the balance of all savings and checking accounts. * Poverty line for year b. Enter the net cash value of real-estate holdings. (Net means is: current assessed value minus mortgage debt.) $ FOIA (b)(6) * $ c. Enter the net cash value of all stocks, bonds, certificates of deposit, and any other assets not already included in lines 26 $ (a) or (b). d. Add together lines 26 a, b and c and enter the number here. TOTAL: $ FOIA (b)(6) 27. Your household member's assets from Form I-864A. (Optional) Assets from Form I-864A, line 12d for $ Jacobo Zelaya (joint assets) (Name of Relative) 28. Assets of the principal sponsored immigrant. (Optional) The principal sponsored immigrant is the person listed in line 2. a. Enter the balance of the sponsored immigrant's savings and checking accounts. $ b. Enter the net cash value of all the sponsored immigrant's real estate holdings. (Net means investment value minus $ mortgage debt.) c. Enter the current cash value of the sponsored immigrant's stocks, bonds, certificates of deposit, and other assets not included on line a or b. $ The total value of all d. Add together lines 28a, b, and c, and enter the number here. $ FOIA (b)(6) assests, line 29, must equal 5 times (3 times for spouses and children of USCs, or 1 time for 29. Total value of assets. orphans to be formally adopted in the U.S.) the Add together lines 26d, 27 and 28d and enter the difference between the FOIA (b)(6) * number here. TOTAL: $ poverty guidelines and the sponsor's household income, line 24c. *** joint assets with husband Jacobo Zelaya Form I-864 (Rev. 11/01/06)N Page 5"
}
