{
  "anumber": "A86927428",
  "id": "A86927428_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0045/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 No. 15096987 CARE Petition No 00280972 ORIGINAL FOIA (b)(6) Personal description of holder Date of birth APRIL 29, 1932 sex MALE complexion MEDIUM coloraboyes BROWN colorafhair BROWN height 5 feet 11 inches; weight 185 pounds, visible distendive marks NONE Marital status MARRIED Country of formernationality HONDURAS I certify that the description above given is true, and that the photograph chafficed heretois, a likeness of me. Greet Relat Padelle / Complex and suce signature of holder) UNITED STATES OF AMERICA SOUTHERN DISTRICT OF FL DISTRICT Count of SOUTHERN DISTRICT OF FL held.pursuantholowai. MIAMI, FL on AUGUST 6TH, 1991 the JACOBO ZELAYA-PADILLA themresiding at 9350 FONTAINBLEAU #C-305, MIAMI, FL intends loreside permanently in the United States when sorequired bythe naturalization Laws of the United nates), had in allother respects complied with theapplicable provisions of such naturalization laws, and was entitled lobe Leal admitted Elecitiscenships such person be and/shewas admittediasa citizen al the United States of Umerica. Indestimony whereofs thesealof the courtis hereuntouffixed this 6TH day of AUGUST nineteen hundred and NINETY-ONE T. G. CHELEOTIS Clerkof the DISTRICT Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. By yoursdandiah Deputy Clerk. FORM N-550 (REV. 11-1-87)Y E LOI T 6186825 9506 87:20 10 '02 Inf [DI 288508"
}