{
  "anumber": "A86927428",
  "id": "A86927428_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, I-864"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 OMB No. 1615-0075; Expires 10/31/07 Department of Homeland Security I-864, Affidavit of Support U.S. Citizenship and Immigration Services Under Section 213A of the Act Part 1. Basis for filing Affidavit of Support. 1. I, Vilma Gloria ZELAYA For Government , Use Only am the sponsor submitting this affidavit of support because (Check only one box): This I-864 is from: a. I am the petitioner. I filed or am filing for the immigration of my relative. b. I filed an alien worker petition on behalf of the intending immigrant, who is related to me as the Petitioner my a Joint Sponsor # c. I have an ownership interest of at least 5 percent in , which filed an alien worker petition on behalf of the intending immigrant, who is related to the Substitute me as my Sponsor d. I am the only joint sponsor. 5% Owner e. I am the first second of two joint sponsors. (Check appropriate box.) This I-864: f. The original petitioner is deceased. I am the substitute sponsor. I am the intending does not meet the immigrant's requirements of section 213A. Part 2. Information on the principal immigrant. meets the 2. Last Name ROVELO requirements of section 213A. First Name Middle Name Ela Reviewer 3. Mailing Address Street Number and Name (Include Apartment Number) PKP FOIA (b)(6) Location CSC City State/Province Zip/Postal Code Country Date (mm/dd/yyyy) FOIA (b)(6) 4. Country of Citizenship 5. Date of Birth (mm/dd/yyyy) Number of Affidavits of Honduras 02/14/1913 Support in file: 6. Alien Registration Number (if any) 7. U.S. Social Security Number (if any) 1 2 A- none none Part 3. Information on the immigrant(s) you are sponsoring. 8. I am sponsoring the principal immigrant named in Part 2 above. Yes No (Applicable only in cases with two joint sponsors) 9. I am sponsoring the following family members immigrating at the same time or within six months of the principal immigrant named in Part 2 above. Do not include any relative listed on a separate visa petition. Relationship to Date of Birth U.S.Social Security Name Sponsored Immigrant (mm/dd/yyyy) A-Number (if any) Number (if any) a. b. c. d. e. 10. Enter the total number of immigrants you are sponsoring on this form from Part 3, Items 8 and 9. 0 1 Form I-864 (Rev. 11/01/06)N"
}