{
  "anumber": "A86927428",
  "id": "A86927428_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0034/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        1946,
        2007,
        1937,
        2023,
        1913,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 7/17/2023 Department of Homeland Security OMB#1615-0012; Expires 11/30/07 U.S. Citizenship and Immigration Services I-130, Petition for Alien Relative Ab DO NOT WRITE IN THIS BLOCK - FOR AGS A# Action Stamp IRO F I-130 Section of Law/Visa Category 201(b) Spouse IR-1/CR-1 U.S. Department of Homeland Security 201(b) Child IR-2/CR-2 201(b) Parent IR-5 APPROVED MSC-07-293-14735 07/15/2007 203(a)(1) Unm. S or D F1-1 203(a)(2)(A)Spouse F2-1 SEP 14 2007 Petition was filed on: 7/15/07 (priority date) 203(a)(2)(A) Child F2-2 Personal Interview Previously Forwarded 203(a)(2)(B) Unm. S or D F2-4 Pet. Ben. A\" File Reviewed I-485 Filed Simultaneously 203(a)(3) Married S or D F3-1 Field Investigation 204(g) Resolved 203(a)(4) Brother/Sister F4-1 203(a)(2)(A) Resolved 203(g) Resolved Remarks: A. Relationship You are the petitioner. Your relative is the beneficiary. 1. I am filing this petition for my: 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wife Parent Brother/Sister Child Yes X No Yes No B. Information about you C. Information about your relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) ZELAYA Vilma Gloria ROVELO Ela 2. Address (Number and Street) (Apt. No.) 2.Address (Number and Street) (Apt. No.) FOIA (b)(6 FOIA (b)(6) (Town or City) (State/Country) (Zip/Postal Code) (Town or City) (State/Country) (Zip/Postal Code) FOIA (b) (6) FOIA (b) (6) 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) Tegucigalpa Honduras Tegucigalpa Honduras 4. Date of Birth 5. Gender 6. Marital Status 4. Date of Birth 5. Gender 6. Marital Status Male Married Male Married 09/09/1937 Single Single 02/14/1913 Female Widowed Divorced Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) VELASQUEZ-Rovelo, Vilma Gloria ROVELO-Sauceda, Ela Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 01/12/1961 Tegucigalpa, Honduras n/a 9. U.S. Social Security (if any) 10. Alien Registration Number 9. U.S. Social Security (if any) 10. Alien Registration Number FOIA (b)(6) FOIA b)(6) P21 none none 11. Name(s) of Prior Husband(s)/Wive(s) 12. Date(s) Marriage(s) Ended 11. Name(s) of Prior Husband(s)/Wive(s) 12. Date(s) Marriage(s) Ended none Santos ROMERO 03/12/1946 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? Yes No My citizenship was acquired through (check one): 14. If your relative is currently in the U.S., complete the following: Birth in the U.S. He or she arrived as a: Naturalization Give certificate number and date and place of issuance. (visitor, student, stowaway, without inspection, etc.) visitor (B-2) No. 14776493; 12/03/1990, Miami, Florida Arrival/Departure Record (I-94) Date arrived 9 8 9 0 9 7 3 7 8 1 1 03/26/2007 Parents. Have you obtained a certificate of citizenship in your own name? Yes. Give certificate number, date and place of issuance. No Date authorized stay expired, or will expire, as 09/25/2007 shown on Form I-94 or I-95 14. If you are a lawful permanent resident alien, complete the following: 15. Name and address of present employer (if any) n/a Date and place of admission for or adjustment to lawful permanent residence and class of admission. Date this employment began n/a 16. Has your relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a No Yes Where When U.S. citizen or lawful permanent resident? Yes No Removal Exclusion/Deportation Rescission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED: Rec'd Sent COMPLETED: Appv'd Denied Ret'd Form 1-130 (Rev. 01/05/07)Y"
}