{
  "anumber": "A86927428",
  "id": "A86927428_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Translation of a Document Written in Spanish and Presented to the Undersigned for Its Translation into English, 2928442"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2007,
        1937,
        1982,
        1980,
        2023,
        1983,
        1932,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 THIS IS THE TRANSLATION OF A DOCUMENT WRITTEN IN SPANISH AND PRESENTED TO THE UNDERSIGNED FOR ITS TRANSLATION INTO ENGLISH. First Class - Fifty Cents 1980-1983 No. 2928492 CERTIFICATION: The undersigned official in charge of the Civil Registry of the Metropolitan Council of the Central District, Certifies: That in the Original book of Marriages that this Secretarial Office maintained for 1961 in folio # 356 Volume # 50, there is a record which literally reads: No. 22 JACOBO ZELAYA PADILLA TO VILMA GLORIA VELASQUEZ ROVELO. They were married in a civil ceremony in this Central District, on January 12, 1961. JACOBO ZELAYA PADILLA, Clerk, born in Puerto de Tela Atlántida Department, on April 21, 1932, the son of Jacobo Zelaya and Victoria Padilla; and VILMA GLORIA VELASQUEZ ROVELO, urban elementary school teacher, born in this capital, on July 09, 1937, the daughter of Francisco G. Velásquez and Ela Eovelo, both parties single, of legal age, Honduran and of this domicile. Given in Tegucigalpa D.C. on June 24, 1982. (Signature) Illegible Luis R. Diaz R. Capital District Metropolitan Civil Council Head Four seals: a) General Comptroller of the Republic, Tegucigalpa D.C. Honduras; b) Customs General Head Office, Republic of Honduras; c) Central Bank of Honduras; d) Metropolitan Council of the Central District, Civil Registry, Tegucigalpa D.C. I, Maria Mejia Patterson, state that I am competent in the English and Spanish languages and that I have translated the foregoing to the best of my knowledge and ability. Maria Patterson reewlatt Maria Mejia Certified Translator Certified Translator #26213 State of Florida County of Miami-Dade Signed before me on this July 5, 2007 by Maria Mejia Patterson, personally known to me. for Campaid Luz Stella Campuzano AMPUZANO 17,2007 wome EXPIRES Notary"
}