{
	"anumber": "A86927428",
	"id": "A86927428_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF YOUR FINANCIAL PRIVACY RIGHTS, A6 80457 Jul 15, 2023"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "NOTICE OF YOUR FINANCIAL PRIVACY RIGHTS We, our, and us, when used in this notice, mean Great Florida Bank. This is our privacy notice for our customers. When we use IMPORTANT the words \"you\" and \"your\" we mean the following types of customers: Our consumer customers who have acontinuing FORMATION relationship by purchasing or holding financial products or services such as a(n): Deposit account BOUT YOUR Loan account Credit card account Retail installment contract we hold landservice PRIVACY Self-directed Individual Retirement Account We will tell you the sources of the information we collect about you. We will tell you what measures we take to secure that information. We first define some terms. Nonpublic personal information means information about you that we collect in connection with providing a financial product or service to you. Nonpublic personal information does not include information that is available from public sources, such as telephone directories or government records. Hereafter, we will use the term \"information\" to mean nonpublic personal information as defined in this section. An affiliate is a company we own or control, a company that owns or controls us, or a company that is owned or controlled by the same company that owns or controls us. Ownership does not mean complete ownership, but means owning enough to have control. A nonaffiliated third party is a person we do not employ or a company that is not an affiliate of ours. This is also known as nonaffiliated third party, or simply, an \"other party.\" THE INFORMATION WE COLLECT We collect information about you from the following sources: Information you give us on applications or other forms Information about your transactions with us Information about your transactions with other parties"
}
