{
  "anumber": "A86927428",
  "id": "A86927428_0067",
  "page_index": 67,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0067/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 Complete entire checklist before completing request for evidence on second page. RFE for all missing documents at one time. Update C3 after RFE has been completed and is ready to mail. 24. Letter from employer for petitioner with current income? Goto M01 Goto G25 25. Proof of income for petitioner that shows weekly, monthly, or yearly earnings (pay Goto M01 Goto M01 stubs, social Security benefits statements, pension/retirement disbursement RFE(F25) statements)? 26. Page 2, Part 4, line 20 marked \"Yes\"? Goto G27 Goto G32 27. Proof of active duty military status of petitioner? Use Military Goto G28 Column on I- RFE(F06) 864P & Go to G28 28. Find petitioner's income from federal tax return for most recent tax year Goto M01 Goto G29 ($ ) and household size (Page 3, Part 5, Line 21, item h of I-864) ( ). Using the I-864P in effect the date Form I-485 was filed, does the income for household size meet or exceed 100% of Poverty line? 29. Find petitioner's current income (Page 3, Part 6, Line 23 of I-864) Goto G30 Goto G32 ($ ) and Household size (Page 3, Part 5, Line 21, Item h of I-864) ( ). Using the I-864P in effect the date Form I-485 was filed, does the income for household size meet 100% of poverty line? 30. Letter from employer for petitioner with current income? Goto M01 Goto G31 31. Proof of income for petitioner that shows weekly, monthly, or yearly earnings (pay Goto M01 Goto M01 stubs, social Security benefits statements, pension/retirement disbursement RFE(F25) statements)? 32. Is Page 4, Part 6, line 24, item b completed (Household members)? Goto H01 Goto G33 33. Another I-864 in file with page 1, Part 1, line 1, block \"d\" or \"e\" marked? Goto I01 Goto G34 34. Is Page 5, Part 7, line 26, 27, or 28 completed (assets)? ORB2 STOP Goto M01 RFE(F11) ORB2 - Please send to Officer Review. NBC November 13, 2006 MSCBKK01 8/11/2007 11:35:04 AM Revision 9"
}