{
	"anumber": "A86927428",
	"id": "A86927428_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Supplemental Form to I-1"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 SUPPLEMENTAL FORM TO Adjustment of Status Applicants's Documentation of Immunization To be completed by civil surgeon only 1 Applicant Identifying Information Rovelo E/A Date of Birth 02-14-13 (Family) (Personal) (Middle) (Month/day/year) Male Female Passport# Country HONDURAS 2. Immunization Record Vaccine History Transferred from A Written Record Vaccine Completed Waiver(s) to be Requested from INS Given series of fully BEATRIZ GARCIA, M.D. immune Blanket CIVIL SURGEON & GENERAL PRACTIC 867 S.W. 1ST STREET (check if MIAMI, FL 33130 U.S.A. YES or (305) 324-7665 Write date Not Medically Appropriate of lab test if immune) Vaccine Date Rec'd Date Rec'd Date Rec'd Date Rec'd Date given by Not appropriate Contra- Insufficient Not fall Mo/Day/Yr Mo/Day/Yr Mo/Day/Yr Mo/Day/Yr civil Surgeon age indication I time (flu) Mo/Day/Yr interva! season DT/DTP IIIIIIIIIIII TD 6/27/07 IIIIIIIIIII Polio IIIIIIIIIIIIIII (OPV/TPV) Measles (or IIIIIIIIIIIIII MR or MMR) Mumps (or MMR) Rubella (or IIIIIIIIIIIIIII MR OR MMR) HIB IIIIIIIIIIIIIIIIIIIIIII Hepatitis B Varicella bad deserve ViH Pneumococ 6/27/07 I cal ys Influenza 3 Results Applicant may be eligible for blanket waiver(s) as indicated above. Applicant will request an individual waiver based on religious or moral convictions Vaccine history complete for each vaccine, all requirements met. Applicant does not meet immunization requirements. 4 Civil Surgeon's Civil Surgeon's Identifying name Information Bestin 2 GAMA MD Date: 4/27/07 (Print or type) Civil Surgeon's Signature: Beats racea un"
}
