{
	"anumber": "A86927428",
	"id": "A86927428_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Department of Homeland Security, I-864A, Contract Between Sponsor and Household Member"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2006, 2023, 1932]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 OMB No. 1615-0075; Expires 09/30/2006 Department of Homeland Security I-864A, Contract Between U.S. Citizenship and Immigration Services Sponsor and Household Member For Government Part 1. Information on the Household Member. (You.) Use Only 1. Name Last Name ZELAYA This I-864A relates to a household member First Name Middle Name who: Jacobo 2. Mailing Address Street Number and Name (include apartment number) is the intending FOIA (b)(6) immigrant. City State or Province FOIA (b)(6) is not the intending Country Zip/Postal Code immigrant. FOIA (b) )(6) 3. Place of Residence Street Number and Name (include apartment number) (if different from mailing address) PKP City State or Province Reviewer Country Zip/Postal Code CSC Location 4. Telephone Number (Include area code or country and city codes) FOIA (b)(6) 9/13/07 Date (mm/dd/yyyy) 5. Date of Birth (mm/dd/yyyy) 04/29/1932 6. Place of Birth City State/Province Country Puerto de Tela Atlantida Honduras 7. U.S. Social Security Number (if any) FOIA (b)(6) 8. Relationship to Sponsor (Check either a, b or c) a. I am the intending immigrant and also the sponsor's spouse. b. I am the intending immigrant and also a member of the sponsor's household. c. I am not the intending immigrant. I am the sponsor's household member. I am related to the sponsor as his/her. Spouse Son or daughter (at least 18 years old) Parent Brother or sister Other dependent (specify) Form I-864A (Rev. 01/15/06)N"
}
