{
	"anumber": "A86927428",
	"id": "A86927428_0055",
	"page_index": 55,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0055/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "The Confidentiality, Security, and Integrity of Your Information, Form PRIV-DISC 2/4054"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2001]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 Information from a consumer reporting agency Information we receive as a result of verifying customer Information THE CONFIDENTIALITY, SECURITY, AND INTEGRITY OF YOUR INFORMATION We restrict access to information about you to those Limitations on Disclosure employees who need to know that information to provide products or services to you. We maintain physical, Here are the limitations we impose on the use of information electronic, and procedural safeguards to protect this disclosed to other financialinstitutions with whom we information. have joint marketing agreements: YOUR INFORMATION AND OTHER PARTIES We will not We only allow direct mail solicitations. disclose information about you to anyone except as disclosed in this policy or as permitted by law. Examples of this might include disclosures necessary to service your account or preventunauthorized transactions. INFORMATION ABOUT FORMER CUSTOMERS We do not disclose information about formercustomers, except as permitted by law. AUTHORIZED SHARING - JOINT MARKETING We may disclose the following information to other financial institutions with whom we have joint marketing agreements: Information you give us on an application or other forms, such as: Name Address We disclose the information listed above with other financial institutions with whom we have joint marketing agreements. You do not have a right to opt out of the disclosure of this information. State Limitations We will not share this information about customers who reside in the following state(s): California Types of Businesses We may disclose information pursuant to joint marketing agreements to the following types of businesses: Financial service providers, such as: Private label credit card issuers Reasons For Disclosing We may disclose information about you to other financial institutions with whom we have joint Great Florida Bank marketing agreements to provide you with information about additional products and P.O. BOX 028580 services. MIAMI, FL 33102-8580 1-866-514-6900 270650-020 Expere 2000 Bankers Systems, Inc., St. Cloud, MN Form PRIV-DISC 9/4/2001 2.1/4854"
}
