{
  "anumber": "A86927428",
  "id": "A86927428_0064",
  "page_index": 64,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0064/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "National Benefits Center-Contractor Processing Review Checklist for AOS I-485s, AOS I-485s"
    },
    "years": {
      "ms_years_nlp_v1": [
        2006,
        2007,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 National Benefits Center-Contractor Processing Review Checklist for AOS I-485s Complete entire checklist before completing request for evidence on second page. RFE for all missing documents at one time. Update C3 after RFE has been completed and is ready to mail. A. Evidence of eligibility? Yes No 1. Concurrently filed I-130? Goto B01 Goto A02 2. Concurrently filed I-360 with Part 2, block \"c\" marked, concurrently filed I-360 STOP Goto A03 with Part 2, block \"k\" annotated \"SIJ\" or \"Special Immigrant Juvenile\", or I-797 Transfer to Notice of Action for I-360 with \"Special Immigrant Juvenile\" next to \"Section\" or District Office \"Class\"? 3. Concurrently filed I-360 (Petition for Amerasian, Widow(er), or Special Immigrant)? Goto A14 Goto A04 4. Page 1, Part 1, of Form I-485 \"Current USCIS status?\" K-4; Page 2, part 3 of Form Goto A05 Goto A06 I-485 \"In What Stats did you last enter?\" K-4; Form I-94 Arrival/Departure record \"K-4\"; K-4 non-immigrant visa page from passport; or US immigration admission stamp with \"K-4\" classification (K-4 in/on at least one)? 5. I-797 Notice of Action receipt or approval notice for Form I-130 with I-485 Goto E01 Goto E01 applicant's name listed as \"Beneficiary\" on I-797 notice? RFE(A02) 6. I-797 Notice of Action for I-130, I-129f, I-360 or I-171 Notice from Consular Goto E01 Goto A07 Office for I-130, I-129f, I-360? 7. Child riding with parent who has I-797 or I-171 for I-129f, I-130, I-360? Goto E01 Goto A08 8. Petitions Form I-129f (Petition for Alien Fiancée), Form I-130 (Petition for Alien Goto E01 Goto A09 Relative), or Form I-360 (Petition for Amerasian, Widow(er), or Special Immigrant) in file (check other A or T files)? 9. Form I-485, Part 2, block \"e\" marked? Goto D05 Goto A10 10. Form I-485, Part 2, block \"f\" marked? Goto D06 Goto All 11. Form I-485, Part 2, block \"d\" marked? STOP! Goto A12 Transfer to LIN 12. Form I-485, Part 2, block \"g\" marked? ORBI STOP Goto A14 14. Concurrently filed I-360 with other than block \"c\" in Part 2 marked? ORB1 STOP Goto A17 17. Diversity visa lottery winner? STOP HERE! Goto A18 Route to Records 18. Block \"h\" marked on Form I-485 and NOT a diversity visa lottery winner? ORB1 STOP Goto E01 RFE(A01) B. Proof of Petitioner's U.S. Citizenship included? (only for those with I-130s Yes No 1. Examples (need only one type): Goto C01 Goto C01 U.S. birth certificate, Certificate of Naturalization, Certificate of Citizenship, RFE(B01) Copy of biographic information page of U.S. passport, Department of State Consular Report of Birth Abroad, if naturalized citizen-check CIS for proof of USC C. Relationship (only for those with I-130s) Yes No 1. On Form I-130, under Part A number 1, \"Husband/Wife\" block marked? Goto D01 Goto C02 2. On Form I-130, under Part A number 1, \"Child\" block marked? Goto E01 Goto C03 3. On Form I-130, under Part A number 1, \"Parent\" block marked? Goto D02 Goto C04 4. On Form I-130, under Part A number 1, \"Brother/Sister\" block marked? ORB2 STOP ORB2 STOP D. Evidence of Relationship Yes No 1. Marriage certificate English or foreign language with English translation Goto E01 Goto E01 RFE(D01) ORB2 - Please send to Officer Review. NBC November 13, 2006 MSCBKK01 8/11/2007 11:35:04 AM Revision 9"
}