{
	"anumber": "A86927428",
	"id": "A86927428_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "IMMUNIZATION RECORD, 867 S.W. 1ST ST"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 RECOMMENDED SCHEDULE FOR INITIAL IMMUNIZATION PROGRAMA RECOMENDADO PARA LA VACUNACION BEATRIZ GARCIA, M.D. CIVIL SURGEON & GENERAL PRACTICE AGE RECOMMENDED TYPE OF IMMUNIZATIONS RECOMMENDED 867 S.W. 1ST STREET EDAD RECOMENDADA TIPO DE VACUNAS RECOMENDADAS MIAMI, FL 33130 U.S.A. 2 MONTHS MESES DTP TOPV (305) 324-7665 & MONTHS / 4 MESES DTP TOPV 6 MONTHS / 6 MESES DTP 15 MONTHS / 15 MESES MMR 18 MONTHS / 18 MESES DTP. TOPV IMMUNIZATION RECORD 4 THRU 6 YEARS / 6 AÑOS DTP. TOPV Do Not Destroy THEREAFTER TO. EVERY 10 YEARS OR FOLLOWING A DIRTY WOUND IF ABOOSTERHAS NOT BEENGIVEN IN THE PRECEDING FIVE YEARS A PARTIR DE LOS 6 ID. CADA 10AROS ODESPUES DE UNA HERIDA RECORD De VACUNAS SUCIA SI NO HA RECIBIDO UN TOXOIDE ENLOS U TIMOS CINCO AÑOS No Destruya CURRENT RECOMMENDATIONS OF THE AMERICAN ACADEMY OF PEDIATRICS AND U.S. PUBLIC HEAL TH SERVICE Rovelo SAVCUDA ELA RECOMENDACIONES PRESENTES DE LA ACADEMIA AMERICANA DE LAST NAME FIRST NAME MIDDLE INITIAL PEDIATRIA Y EL SERVICIO DE SALUD PUBLICA DE LOS ESTADOS APELLIDO NOMBRE INICIAL UNIDOS. ABBREVIATIONS: TOPV TRIVALENT ORAL POLIO VACCINE ADDRESS DIP DIPHTHERIA AND TETANUS TOXOIDS AND PERTUSSIS VACCINE DIRECCION MMR MEASLES, MUMPS, RUBELLA VACCINE TD TETANUS AND DIPHTHERIA TOXOIDS (ADULT TYPE) 5/14/13 ABREVIATURAS: DATE OF BIRTH PHYSICIAN'S NAME TOPV VACUNA ORAL TRIVALENTE LA POLIO FECHA DE NACIMIENTO NOMRE DEL MEDICO DTP TOXOIDES DE LA DIFTERIA, EL TETANO Y LA VACUNA DE LA TOS / FERINA MMR SARAMPION COMUN, PAPERAS, SARAMPION ALEMAN VACUNA REMARKS (DRUG SENSITIVITY. EGG ALLERGY ETC.) OBSERVACIONES TO TOXOIDES DEL TETANO Y LA DIFTERIA (PARA ADULTOS) (SENSITIVIDAD A ALGUNA DROGA ALERGIA AL HUEVO ETC.) NOTICE TO PARENTS PLEASE TAKE THIS RECORD CARD WITH YOU EACH TIME YOU VISIT YOUR DOCTOR OR HEAL TH CLINIC BE SURE THEY ENTER THE REQUIRED INFORMATION IN THIS RECORD CONCERNING EACH IMMUNIZATION YOUR CHILD RECEIVES FLORIDA LAW FS 232.032 REQUIRES YOUR CHILD TO BE ADEQUATELY IMMUNIZED PRIOR TO ENTRANCE INTO ANY SCHOOL IN FLORIDA AVISO A LOS PADRES POR FAVOR LLEVE ESTA TARJETA CADA VEZ QUE VISITE A SU MEDICO 0 LA CLINICA ASEGURESE QUE ANOTEN EN ESTA TARJETA CADA VACUNA QUE SU HIJO RECIBA LA LEY DE LA FLORIDA FS 232.032 REQUIERE QUE SU HUO ESTE DEBIDAMENTE VACUNADO ANTES DE PODER MATRICULARSE EN LAS ESCUELAS DEL ESTADO. DTP DT Td POLIOMYELITS / POLIOMIELITIS DATE OF EACH DOSE TYPE ADMINISTERED PHYSICIAN OR HEALTH DATE of EACH DOSE TYPE ADMINISTERED PHYSICIAN OR HEAL TH CLINIC CLINIC FECHA DE CADA DOSIS TIPO ADMINISTRADO MEDICO 0 CLINICA FECHA DE CADA DOSIS TIPO ADMINISTRADO MEDICO 0 CLINICA 6/27/07 BlArriA and DDG Swire MEASLES MUMPS - RUBELLA SARAMPION COMUN - PAPERAS - SARAMPION ALEMAN OTHER IMMUNIZATIONS OR TESTS OTRAS VACUNAS o PRUEBAS DATE OF EACH DOSE TYPE ADMINISTERED PHYSICIAN OR HEALTH DATE OF EACH DOSE TYPE ADMINISTERED PHYSICIAN OR HEALTH CLINIC CLINIC , FECHA DE CADA DOSIS TIPO ADMINISTRADO MEDICO 0 CLINICN EECHA DE CADA DOSIS TIPO ADMINISTRADO MEDICO,O CLINICA 6/27/07 thoumocrocaed DIAGIA"
}
