{
  "anumber": "A86927428",
  "id": "A86927428_0058",
  "page_index": 58,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0058/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXPRESS MAIL POSTAGE REQUIRED, Label 11-B"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 15, CALL 1-800 222-1811 FOR PICKUP OR 7 1 UNITED STATES POSTAL SERVICE 0000 $18.40 00012369-23 EXPRESS EXPRESS MAIL MAIL POSTAGE REQUIRED DOMESTIC USE ONLY UN ES POSTAL SERVICE sps.com EXPRESS MAIL POST OFFICE TO ADDRESSEE UNITED STATES POSTAL SERVICE TM ORIGIN (POSTAL USE ONLY) DELIVERY (POSTAL USE ONLY) Day of Delivery Flat Rate Envelope Delivery Attempt Time Employee Signature PO ZIP Code 16.35 Next Second Mo. Day AM PM Date In Postage Delivery Attempt Time Employee Signature 12 Noon 3 PM Mo. Day Year $ Mo. Day AM PM Time In Military Return Receipt Fee Delivery Date Time Employee Signature documento 2nd Day 3rd Day Mo. Day AM PM AM PM Weight Int'l Alpha Country Code COD Fee Insurance Fee Signature of Addressee or Agent X lbs. ozs. No Delivery Acceptance Clerk Initials Total Postage & Fees Name - Please Print Weekend Holiday $ CUSTOMER USE ONLY TO FILE A CLAIM FOR DAMAGE OR LOSS WAIVER OF SIGNATURE (Domestic Only ) Additional merchandise Insurance is void if waiver of signature is requested. I wish delivery to be made without obtaining signature of addressee or addressee's agent (if delivery employee judges OF CONTENTS, YOU MUST PRESENT THE that article can be left in secure location) and I authorize that delivery employee's signature constitutes valid proof of ARTICLE, CONTAINER, AND PACKAGING delivery. NO DELIVERY Weekend Holiday TO THE USPS FOR INSPECTION. Customer Signature FROM: (PLEASE PRINT) PHONE 265-0006 TO: (PLEASE PRINT) PHONE Manfred Rosenow, P.A. S.M. 57 805887 Masti, FL 33144 Chicago, IL 60680-4120 FOR PICKUP OR TRACKING CALL 1-800-222-1811 www.usps.gov EMS Label 11-B July 1997 JSPS 1995"
}