{
	"anumber": "A86927428",
	"id": "A86927428_0065",
	"page_index": 65,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0065/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Petitioner’s I-864, I-864"
		},
		"years": {
			"ms_years_nlp_v1": [2006, 2007, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 Complete entire checklist before completing request for evidence on second page. RFE for all missing documents at one time. Update C3 after RFE has been completed and is ready to mail. 2. Birth certificate for petitioner (person listed on left side of I-130) English or foreign Goto E01 Goto D03 language with English translation 3. Document(s) other than birth certificate submitted for I-130 petitioner (person listed Goto D04 Goto E01 on left side of I-130) in place of birth certificate? RFE(D02) 4. Check the DOS FAM for the I-130 petitioner's country of birth. Are the documents Goto E01 Goto E01 submitted acceptable? RFE(D02) 5. Cuban birth certificate with translation or Cuban passport for applicant Goto M01 Goto M01 RFE(D03) 6. Evidence of Principal Cuban applicant or LPR (copy of LPR card with \"CU6\" for Goto M01 Goto M01 \"Category\", I-797 Receipt notice for I-485 filed under \"Section: Cuban Adjustment RFE(D04) Act\", Cuban birth certificate, Cuban passport, Principal Cuban file part of family pack)? E. Form I-864, Form I-864EZ, or I-864W included? Yes No 1. Form I-360 in file or I-797 Notice of Action for Form I-360 in file? Goto E02 Goto E05 2. I-360 or I-797 for I-360 filed as battered spouse or child or widow/widower? Goto E09 Goto E03 3. I-360 or I-797 for I-360 filed under any other \"Section\"? ORB1 STOP Goto E05 5. Form I-485, Part 2, block \"e\" or \"f\" marked? Goto M01 Goto E06 6. Form I-864 submitted Goto E07 Goto E08 7. Is revision date of I-864 (Rev.) before January 15, 2006 (1/15/2006)? Goto M01 Goto F01 RFE(F45) 8. Form I-864EZ submitted? Goto K01 Goto E09 9. Form I-864W submitted? Goto L01 Goto M01 RFE(F04) F. New Form I-864 Yes No 1. Page 1 of I-864 submitted? Goto F02 Goto M01 RFE(F30) 2. Page 2 of I-864 submitted? Goto F03 Goto M01 RFE(F30) 3. Only one block marked on Page 1, Part 1, question 1 of I-864? Goto F04 Goto F09 4. Page 1, Part 1, question 1, block \"a\" marked on one I-864? Goto G01 Goto F05 5. Page 1, Part 1, question 1, block \"b\" or \"c\" marked on only I-864? Goto F15 Goto F06 6. Page 1, Part 1, question 1, block \"f\" marked on one I-864? Goto J01 Goto F07 7. Page 1, Part 1, question 1, block \"d\" or \"e\" marked on I-864? Goto F08 Goto F09 8. Only one I-864 submitted? Goto I01 Goto F09 RFE(F04) 9. A name provided on Page 1, Part 1, line 1 of I-864? Goto F10 Goto F11 10. Name listed on Page 1, Part 1, line 1 same name as petitioner listed on I-797 notice Goto G01 Goto F11 or concurrently filed I-130? 11. A name listed on Page 2, Part 4, line 11? Goto F14 ORB1 STOP 14. Name listed on Page 2, Part 4, line 11 same name as petitioner listed on I-797 notice Goto G01 Goto I01 or concurrently filed I-130? RFE(F04) 15. Concurrently filed I-130 and/or I-797 for I-130, I-129f, I-360? Goto I01 Goto F16 16. I-797 for I-140 only proof of petition (NO I-797 for I-130, I-129f, I-360)? ORB2 STOP Goto G01 G. Petitioner's I-864 Yes No 1. I-797 Notice of Action for I-130 or I-129f or I-171 Notice from Consular Office for Goto G03 Goto G02 I-130 or I-129f? ORB2 - Please send to Officer Review. NBC November 13, 2006 MSCBKK01 8/11/2007 11:35:04 AM Revision 9"
}
