{
  "anumber": "A86927428",
  "id": "A86927428_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A86927428_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Translation of a Document Written in Spanish and Presented to the Undersigned for Its Translation into English., 3036885"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2007,
        1982,
        1980,
        2023,
        1913,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/17/2023 THIS IS THE TRANSLATION OF A DOCUMENT WRITTEN IN SPANISH AND PRESENTED TO THE UNDERSIGNED FOR ITS TRANSLATION INTO ENGLISH. Complete name: Ela Rovelo Sauceda Birth registration: 14-Feb-13 Parents: Manuel Rovelo - Juana Maria Sauceda First Class - Fifty Cents 1980-1983 No. 3036885 CERTIFICATION: The undersigned official in charge of the Civil Registry of the Metropolitan Council of the Central District, Certifies: That in the Original book of Births for the year 1913 in folio # 60 Volume # 30, there is a record which reads: No. ELA ROVELO. In Tegucigalpa, D.C. on March 06, 1913, before me, Pastor Gomez, Municipal Secretary and before witnesses, Julio C. Rico and Santiago Chavarria, single, of legal age, students and of this domicile, appeared MANUEL ROVELO, married, 31 years of age, law student, Honduran, and of this domiciled, to inform that on last February 14th at 9:00 p.m. in Barrio Guttemberg of this city, a female was born who was named ELA. The legitimate daughter of the Affiant and of his wife, JUANA MARIA SAUCEDA, housewife of this domicile. Paternal grandparents: Manuel F. Rovelo and Juan E. Landa and Maternal: Presentación garcia and Felicita Sauceda, Honduran citizens. Given in Tegucigalpa D.C. on June 25, 1982. (Signature) Illegible Luis R. Diaz R. Capital District Metropolitan Civil Council Head Four seals: a) General Comptroller of the Republic, Tegucigalpa D.C. Honduras; b) Customs General Head Office, Republic of Honduras; c) Central Bank of Honduras; d) Metropolitan Council of the Central District, Civil Registry, Tegucigalpa D.C. I, Maria Mejia Patterson, state that I am competent in the English and Spanish languages and Have were lall that I have translated the foregoing to the best of my knowledge and ability. Maria Mejia Patterson Certified Translator Certified Translator State of Florida #26213 County of Miami-Dade Signed before me on this July 5, 2007 by Mania Mejia Patterson, personally known to me. Luz Stella Campuzano MEDICAL BLA CAMPUZHO 17, EXPIRES * * #DD 275743"
}