{
  "anumber": "A90405034",
  "id": "A90405034_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DECISION ON APPLICATION FOR NATURALIZATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE with Immigration and Naturalization Service 7880 Biscayne Boulevard Miami, Florida 33138 JUL 06 1998 Refer to file no. A 90405034 Maria LACAYO 11560 SW 92nd street Miami FL 33176 DECISION ON APPLICATION FOR NATURALIZATION On you appeared for examination your application for naturalization which filed 04/14/98 on was in accordance with: Section 316/9). of the Immigration and Nationality Act. Pursuant to the investigation and examination of your application it is determined that you are ineligible for naturalization for the following reason(s): SEE ATTACHMENT If you desire to request a review hearing on this decision pursuant to Section 336(a) of the Act, you must file a request for a hearing within 30 days of the date of this notice. If no request for hearing is filed within the time allowed. this decision is final. A request for hearing may be made to the District Director with the Immigration and Naturalization Service office which made the decision, on Form N-336, Request for Hearing on a Decision in Naturalization Proceeding under section 336 of the Act, together with a fee of $110.00. A brief or other written statement in support of your request may be submitted with the Request for Hearing. The Form N-336 Request for Hearing on a Decision in Naturalization Proceeding with the required fee should be sent by mail to the above address. Any questions which you have may be answered by the Service office nearest your residence, or at the above address. CITIZENSHIP Sincerely RETURN RECEIPT REQUESTED Corne Joseer 2392254462 District Director Enclosure: Form N-336 Form N-335 Approved by: Recommended CAO SDAC"
}