{
  "anumber": "A90414760",
  "id": "A90414760_0139",
  "page_index": 139,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0139/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPUBLIC of NICARAGUA BIRTH CERTIFICATE REINALDO SANCHEZ SANCHEZ LAWYER AND REGISTER OF THE CIVIL STATUS OF THE PEOPLE OF MANAGUA,, 1386"
    },
    "years": {
      "ms_years_nlp_v1": [
        1906,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 REPUBLIC OF NICARAGUA BIRTH CERTIFICATE REINALDO SANCHEZ SANCHEZ LAWYER AND REGISTER OF THE CIVIL STATUS OF THE PEOPLE OF MANAGUA. CERTIFIES: That under No 1386, Tome II, Folio 73, of the Book of Birth, that this office carried out during the year 1906, is found the Act that literally says: No. 1386 ELIDA CONSTANSA FUENTES In Managua, at two o'clock in the af ternoon on September twenty eight of nineteen hundred six Before the un dersigned Register of the Civil Status, declared, Mercedes Torres, that at six o'clock in the afternoon on the nineteen of the current month, was born in this city the baby-girl. ELIDA CONSTANSA Illegitimate daughter of Teresa Fuentes, of legal age, housewife. This act was read and aproved, A, Zuniga.-Salv. Montenegro, Srio. It complies with its original. Managua, D.N. on August eight of nineteen hundred seventy-nine. (Illegible signature) (Illegible signature) Register of the Civil Status Before me. of People of Managua, Note: There is an illegible seal. I, Guillermina Villavicencio, being duly qualified to translate from Spanish to English language, certify this is a correct translation to the the best of my knowledge. Johnson NOTARY PUBLIC. STATE OF FLORIDA MY COMMISSION EXPIRES APRIL 28. 1991. BONDED THRU NOTARY PUBLIC UNDERWRITERS. trap M.Sincered"
}