{
	"anumber": "A90417818",
	"id": "A90417818_0072",
	"page_index": 72,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90417818_0072/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, Form 1-488"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991, 1987]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Form approved. Budget Bureau No. 13-R313 No. AFFIDAVIT OF WITNESS IN THE MATTER OF THE APPLICATION OF ( (CASE - - AMNESTY) NAME : ISABEL MARTINEZ CRUZ File No. AFFIDAVIT FOIA (b)(6) , occupation FOIA (b)(6) FOIA (b)(6) residing at (Number and street) (City or town) (State) (ZIP Code) is being duly sworn, deposes and says that (si the a citizen of the United States of America: that is not Isabel Martinez (s) )he has personally known and has been acquainted in the United States with Cruz , the applicant above mentioned; his that to her personal knowledge the applicant has resided in the United States as follows: 1335 S. Bronson #100 L.A. CA. 90019 from 12 80 to 12 86 (City. town. and State) (Month) (Year) Month, (Year) from to (City. town. and State) (Month) (Year) (Month) Year, from to (City. town. and State) (Month) (Year) (Month) (Year) from to (City. town. and State) (Month) (Year) (Month) (Year) his that (s)he is able to determine the date of the beginning of her acquaintance with the applicant in the United States from the following fact(s): He visited her continually throught the years she lived at that address. that (s)he has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is (Y cars) last 5 months. (Months) OFFICIAL SEAL NORMAN MARTINEZ FOIA (b)(6) Notary Public-California LOS ANGELES COUNTY My Comm. Exp. May 17. 1991 Subscribed and sworn to before me by the above-named witness at Los Angles, California this 12th day of June 1987 Montency Form 1-488 (Signature of attestor) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Rev. 10-1-78) N (Title of attestor)"
}
