{
	"anumber": "A90409169",
	"id": "A90409169_0059",
	"page_index": 59,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0059/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, Form I-687 ( (04/01/87) Page 1"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [1899, 2023, 1982, 1973]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 U.S. Department of Justice Application of Status as a Temporary Resident OMB #V 15-0133 Immigration and Naturalization Service (Under Section 245A of the Immigration and Nationality Act) 23 Please begin with item #1, after carefully reading the instructions. The block below is for Government Use Only. Name and Location (City or Town) of Qualified Designated Entity Fee Stamp 185 Fee Receipt No. (This application) XUP-87-026-3022 LISTED RECEIVED JUN1987 XOP Principal Applicant's File No. A 90409169 Qualified Designated Entity I.D. No. File No. (This applicant) MIAMI- 2252525 A 90404109 Applicant: Do not write above this line. See instructions before filling in application. If you need more space to answer fully any question on this form, use a separate sheet and identify each answer with the number of the corresponding question. Fill in with typewriter or print in block letters in ink. 1. I hereby apply for status as indicated by the block checked below (check block A or B). A Temporary Residence as an alien who illegally entered the U.S. prior to January 1, 1982. B Temporary Residence as an alien who entered the U.S. as a nonimmigrant prior to January 1, 1982 and whose authorized stay expired before such date or whose unlawful status was known to the Government as of January 1, 1982. 2. Family Name (Last Name in CAPITAL Letters) (First Name) (Middle Name) 3. Date of Birth (Month/Day/Year) ROMERO LANZA, TARCILA ISIDRA MAY 15, 1899 4. Other Names Used or Known by (Including maiden name, if married) 5. Telephone Numbers (Include Area Codes) NONE Home: (305) 823-8731 Work: 6. Home Address in the U.S. (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 1701 West 42nd Place, Unit 8 , Hialeah, F1. 33012 7. Mailing Address in the U.S. (if different from #6.) (Apt. No.) (City) (State) (ZIP Code) SAME AS ABOVE 8. Last Address outside the U.S. (City or Town) (County, Province or State) (Country) PEDREGAL DE SAN JOSE , B-39-C No. 10 COMAYAHUELA, HONDURAS 9. Sex Male 10. Race Asian or Pacific Islander Black, not of Hispanic origin Other (specify below) Female Hispanic White, not of Hispanic origin 11. Marital Status Never Married Divorced 12. Country of Citizenship HONDURAS Now Married Separated Widowed 13. Place of Birth (City or Town) (County, Province or State) (Country) LA CEIBA HONDURAS 14. Have you previously applied for temporary residence as a legalization applicant? 15. Do you have any other record with I&NS? No Yes (if \"Yes\" give date, place of filing, and final disposition, if known) No Yes [If \"Yes\" give number(s) A Other 16. When did you last come to the U.S.? (Month/Day/Year) 17. Manner of Entry (Visitor, Student, Crewman, etc.) JUNE 15, 1973 MTA With visa (visitor, student, etc.) specify Visitor Without visa 18. Place of Last Entry 19. List all Social Security Numbers used. Mia. F1 U.S. Port of entry (City and State) (1) (3) Border - Not through port (State) (2) (4) 20. Mother's Name (Maiden) (Last) (First) Living 21. Father's Name (Last) (First) Living Francisca Lanza I don' t Rem. Manuel J. Romero Don t Remember Deceased (year) Deceased (year) Form I-687 (04/01/87) Page 1"
}
