{
  "anumber": "A90414760",
  "id": "A90414760_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0072/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER ON ASYLUM APPLICATION, NARA-0123456789"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1984,
        2023,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 The applicant has not established a clear probability of persecution if she returned to Nicaragua. Her statements fail to established that she would be persecuted upon return to Nicaragua on account of race, religion, nationality, membership in a particular social group, or political opinion. Review of the applicant's claims both separately and cumulatively, has found that the applicant has not borne the burden of proving a well founded fear of persecution. She has failed to substantiate that she would be persecuted if she were to return to Nicaragua. The burden is solely upon the applicant in an asylum case. See Kashani V. INS supra. See also McMullen V. INS, 658 F 2d 1312 (9 Cir. 1981). Further, since the definition of refugee cites only specific types of persecution, other reasons for an applicant's unwillingness to return to Nicaragua are irrelevant unless used to augment a claim to persecution based on one of the grounds cited. Thus asylum status will not be granted in cases where the primary motivation is economic, nor may it be found that a well-founded fear of Nicaragua persecution exists merely due to a form of government in power, or because a person is from a specific country. The term implies more than just discrimination. Further the term does not imply simply an abridgement of the rights guaranteed by the Constitution of the United States. ORDER: It is ordered that the instant application seeking asylum in the United States be, and the same is hereby denied. It is FURTHER ORDERED that employment authorization granted by this Service is hereby terminated. AUG 30 1984 Date District Director NOTICE: The applicant may renew this request for asylum or apply for the benefits of section 243 (h) of the Act, in subsequent exclusion or deportation proceedings."
}