{
  "anumber": "A90409169",
  "id": "A90409169_0026",
  "page_index": 26,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0026/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1979,
        1987,
        2023,
        1983,
        1976,
        1821
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 TRANSLATION \"SEAL\" Republic of Honduras, Free, Sovereign and Independent. 15 of September 1821 FIRST CLASS FIFTY CENTS 1976-1979 CERTIFICATION No 2976592 The undersigned, Municipal Secretary in charge of the Civil Register of this city CERTIFIES: That folio No. 8 of the original book of births No. 31 corresponding to the year nineteen hundred twenty- four and which is active in the files of this municipality you will find the entry which literally says: .-- FRANCISCA ROMERO.- \"SEAL\" In La Ceiba at eight a.m. on Thrusday the eighth of May of nineteen General Register hundred twenty-four.- Before me, Domingo Escobar, Municipal Secre- of the Republic tary and before the witnesses Antonio Aguilar N. and Emeterio Contralor Lopez B., both from Honduras, clerks, of legal age, of this neigbor- Honduras hood.-- Appeared Don Alfredo Romero, of legal age, single, military man, hondurian, neighbor of this city stating that on Wednesday the thirtieth of April after four p.m. in the district of Solares \"SEAL\" Nuevos of this city a female child was born and given the name General Office of of: FRANCISCA ROMERO.-- Daughter of Tarcila Romero of legal age, Customs and Interior single, of domestic occupation, hondurian and neighbor of this Rents city.-- Grandparents of the new born: Manuel Romero and Francisca Republic of Honduras Lanza de Romero.-- Deceased, hondurian and neighbor of this city the first named person.-- Read the writing to the stating party and being in agreement with its manifestation, and comprehending \"SEAL\" it, signed.- Jose A. Romero.-- Antonio Aguilar.- E. Lopez B.- Central Bank of Sello.- Domingo Escobar. Secretary.- IN ACCORDANCE WITH ITS Honduras ORIGINAL.- -- Drawn up in the city of La Ceiba on the third day of the month of September of nineteen hundred seventy-nine. \"STAMP\" \"Illegible\" \"STAMP\" \"Illegible\" Municipality of Signature Municipal Mayor Signature La Ceiba Kamel Jose La Ceiba, Atl. Vo. Bo. Daniel Secretary Municipal Secretary Hond. Pinel E. Honduras CA Municipal Mayor \"Illegible\" Signature Stamp \"STAMP\" 25 Jun 1979 STATE OF FLORIDA ) SS COUNTY OF DADE BEFORE ME, the undersigned authority, personally appeared, ELIZABETH M. GIRALDEL who being by me first duly sworn says that SHE is fully versed in the SPANISH language and the English Languages and that the foregoing is a true and correct translation of an instrument consist- ing of / page (s) and this is the / page of the attached. Elizabeth Grabby WITNESS MY HAND AND OFFICIAL SEAL at MIAMi , FLorida, County of DAdE , this 24 day of October 1983. My Commission Expires: NOTARY PUBLIC STATE OF FLORIDA NOTARY PUBLIC, state of Florida Bug MY COMMISSION EXPIRES JAN 18 1987 MR. ROLANDO PEREZ BONDED THRU GENERAL INSURANCE UND"
}