{
	"anumber": "A90413717",
	"id": "A90413717_0051",
	"page_index": 51,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90413717_0051/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "ATTACHMENT TO FORM N-335"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 ATTACHMENT TO FORM N-335 090413717 A#: Reference is made to your Application for Naturalization, Form N-400, which you filed on 06-25-1999 pursuant to Section 316(a) of the Immigration and Nationality Act (INA). Under section 335 of the Immigration and Nationality Act (INA), and Title 8 of the Code of Federal Regulations (CFR), Part 335.2(a), an applicant for naturalization must appear before a Service officer for examination on his or her application. During such examination, the applicant is questioned. under oath or affirmation, about his or her responses on the N-400. If necessary. the examining officer shall repeat such questions on the application in a simplified. different or more elaborate manner until the officer is satisfied that the applicant fully understands the questions being asked or is unable to understand English. 8 C.F.R. ยง 335.2(b). The Service officer must make a determination on an application for naturalization. INA 335(d). Such naturalization application shall only be granted when the adjudication officer is satisfied that the applicant has complied with all requirements for naturalization. 8 C.F.R. ยง 335.3(a). Further, before an applicant may be naturalized. he or she must take an oath of allegiance (INA 337(a)) and establish that it is his or her intention. in good faith. to assume and discharge the obligations of the oath of allegiance, and that his or her attitude toward the Constitution renders him or her capable of fulfilling the obligations of such oath. 8 C.F.R. 337.1(c). The you appeared before an officer of the Service on records reflect that 11-17-99 regarding your Application for Naturalization. At that time, the adjudication officer attempted to review your application with you and determined that you were unable to answer questions regarding the information contained on your N-400 or to provide responses which would demonstrate to the satisfaction of the adjudicating officer that you have complied with the statutory requirements for naturalization. However, you were unable to respond in a manner which would indicate to the officer that you understood the nature of the questions being posed. Accordingly, for the reasons set forth above. the application may not be approved and hereby is denied. No appeal lies from this decision. However, in accordance with 8 C.F.R. ยง 336.2(a), you may request a hearing before an immigration officer within thirty (30) days of the date of this notice. To do so, you must file the attached Form N-336 along with the correct fee with this Service."
}
