{
	"anumber": "A90413717",
	"id": "A90413717_0019",
	"page_index": 19,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90413717_0019/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1906, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 U.S. Department of Jus OMB #1115-0009 Immigration and Naturalization Service Application for Na START HERE - Please Type or Print 11/188 FOR INS USF OF Returned Part 1. Information about you. Family Given Middle Name Amaya CHAVEZ Name Melida Initial U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 13327 S. W. 113rd. Court # City Miami County Dade State Florida ZIP Reloc Sent e33176-0805 Date of Birth 31 02 - Country (month/day/year) 03/07/1906 of Birth Leon-Nicaragua Social A Security # 261-99-6022 090413717 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) over 75 05/21/87 3/1/89 where granted adjustment of status. Miami Int. Airport Citizenship Name on alien registration card (if different than in Part Other names used since you became a permanent resident (including maidey name) USE D2 9-16-99 APR Sex Male Height Marital States: Single Divorce USE nw 11/17/99 Female Married Widowed CLERK AA Can you speak, read and write English ? No Yes. Action Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes If you answered \"Yes\" , complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip Yes No Yes No To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}
