{
	"anumber": "A90405034",
	"id": "A90405034_0047",
	"page_index": 47,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0047/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Naturalization and Citizenship Application Form, I-687 ( (04/01/87) Page 2"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1908, 1928, 1982, 1981, 1933, 1909, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "If you were admitted as a nonimmigrant, complete items 22 through 30; if not, leave blank and continue on item 31. 22. Passport Number 23. Country that Issued Passport 24. Location Visa Issued (City and Country of U.S. Consul) No. 175392 NICARAGUA MANAGUA, NICARAGUA 25. Type of Visa Issued (B-2, F-1, etc.) 26. Date Visa Issued (Month/Day/Year) 27. Authorized Stay in U.S. Expired (Month/Day/Year) B-2 APRIL 1, 1981 AUGUST 10, 1981 28. Visa Class (Student. visitor, etc.) 29. Did you violate your legal status? 30. Were you notified of your violation? No Yes If \"Yes\". explain violation and date. No Yes If \"Yes\", explain how notified B-2 Remained in USA after expira- tion of authorization 8/19/81 31. I have been married ONE times. I have (fill in total number now living, whether in the U.S. or not.) THREE sons and daughters, and TWO brothers and sisters. 32. Complete all columns below for your spouse, each former spouse, and each son, daughter, brother and sister. Under Name, give first name and middle initial (give last name only if it differs from your own). Under Relationship, fill in spouse, former spouse, son, daughter, brother or sister. Under Date of Birth, give month, day, and year of birth. Under Place of Birth, give city, state and country of birth. Under Location Where Now Living, give city, state and country of current residence (if living with you, write \"with me\" in the column). In the last column write \"Yes\", \"No\", or \"Unknown\" to indicate if each is applying for residence in the U.S. If more space is needed, attach an additional sheet. Indicate on the sheet that the information refers to question #32. Full Name U.S. Location Where (Include maiden name if applicable) Relationship Citizen? Date of Birth Place of Birth Now Living Applying? Yes FERNANDO SON No 10/03/1928 GRANADA, NICARAGUA. MIAMI YES Yes CARMEN ZAMPIER DAUGHTER 09/09/1933 GRANADA, NICARAGUA. MIAMI NO No Yes ALFREDO SON No 02/03/1936 GRANADA, NICARAGUA MIAMI NO Yes GRACIELA SISTER 06/15/1908 GRANADA, NICARAGUA PHILADELPHIA NO No Yes AMALIA SISTER 08/28/1909 GRANADA, NICARAGUA TEGUCIGALPA, HONDURAS No Yes No Yes No Yes No Yes No Yes No Yes No Yes No Yes No 33. List all of your residences in the United States since your first entry, beginning with your present address (attach an additional sheet, if necessary). From To Street Name and Number (Apt. No.) City State and ZIP Code (Month/Year) (Month/Year) 11560 S.W. 92nd STREET MIAMI, FLORIDA, 33176 JULY 1982 Present 13925 S.W. 84th STREET MIAMI, FLORIDA, 33183 AUGUST 1981 JULY 1982 11245 N. KENDALL DR. (PINEGROVE F-109) MIAMI, FLORIDA, MAY 03, 1981 AUGUST'81 Form I-687 (04/01/87) Page 2"
}
