{
	"anumber": "A90405034",
	"id": "A90405034_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0046/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Status as a a Temporary Resident, Form I-687 ( (04/01/87) Page 1"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1907, 1982, 1981]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Application for Status as a Temporary Resident OMB #1115-0133 Immigration and Naturalization Service (Under Section 245A of the Immigration and Nationality Act) Please begin with item #1, after carefully reading the instructions. The block below is for Government Use Only. Name and Location (City or Town) of Qualified Designated Entity Fee Stamp 03 $185 accoint No. (This application) Qualified Designated Entity I.D. No. A90405034 Applicant: Do not write above this line. See instructions before filling in application. If you need more space to answer lully any question on this form, use a separate sheet and identify each answer with the number of the corresponding question. Fill in with typewriter or print in block letters in ink. 1. I hereby apply for status as indicated by the block checked below (check block A or B). A Temporary Residence as an alien who illegally entered the U.S. prior to January 1, 1982. B Temporary Residence as an alien who entered the U.S. as a nonimmigrant prior to January 1, 1982 and whose authorized stay expired before such date or whose unlawful status was known to the Government as of January 1, 1982. 2. Family Name (Last Name in CAPITAL Letters) (First Name) (Middle Name) 3. Date of Birth (Month/Day/Year) de LACAYO, Maria Bertha MARCH 28, 1907 4. Other Names Used or Known by (Including maiden name, if married) 5. Telephone Numbers (Include Area Codes) BERTHA Arguello de LACAYO Home: (305)595-3493 Work: 6. Home Address in the U.S. (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 11560 S.W. 92nd STREET MIAMI, FLORIDA, 33176 7. Mailing Address in the U.S. (if different from #6.) (Apt. No.) (City) (State) (ZIP Code) SAME AS ABOVE 8. Last Address outside the U.S. (City or Town) (County, Province or State) (Country) KILOMETRO 12, CARRETERA A MASAYA, MANAGUA, NICARAGUA 9. Sex Male 10. Race Asian or Pacific Islander Black, not of Hispanic origin Other (specify below) Female Hispanic White, not of Hispanic origin 11. Marital Status Never Married Divorced 12. Country of Citizenship Now Married Separated Widowed NicAraGua 13. Place of Birth (City or Town) (County, Province or State) (Country) GRANADA, GRANADA, NICARAGUA 14. Have you previously applied for temporary residence as a legalization applicant? 15. Do you have any other record with I&NS? No Yes (if \"Yes\" give date, place of filing, and final disposition, if known) No Yes [If \"Yes\" give number(s)] A - Other 1-589 16. When did you last come to the U.S.? (Month/Day/Year) 17. Manner of Entry (Visitor, Student, Crewman, etc.) With visa (visitor, student, etc.) specify B-2 MAY 3, 1981 Without visa 18. Place of Last Entry U.S. Port of entry (City and State) MIAMI, FLORIDA MiA 19. List all Social Security Numbers used. (1) 556-40-4319 (3) Border - Not through port (State) (2) (4) 20. Mother's Name (Maiden) (Last) (First) Living 21. Father's Name (Last) (First) Living URBINA SALVADORA ARGUELLO JUAN 0 Deceased (year) Deceased (year) Form I-687 (04/01/87) Page 1"
}
