{
	"anumber": "A90409169",
	"id": "A90409169_0027",
	"page_index": 27,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0027/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICA CION, 2976592"
		},
		"years": {
			"ms_years_nlp_v1": [1979, 1987, 2023, 1983, 1976]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 PRIMERA CLASE CINCUENTA CENTAVOS CERTIF ICA CION 1976-1979 No 2976592 1 El Infrascrito, Secretario Municipal y Encargado del Registro Civil de esta ciu 2 dad CERTIFICA: Que a folio No. 8 del libro original de nacimientos No. 31 que - 3 corresponde a7 año de mL novecientos veinficuatro y que obra en el archive de - 4 esta municipalidad se encuentra el asiento que literalmente dice:.. FRANCISCA 5 ROMERO.- En la Ceiba, a las ocho a.m. del dia jueves ocho de mayo de mil nove - cientos veinticuatro.- Ante mi, Domingo Escobar, Secretario Municipal y ante los 6 testigos Antonio Aguilar N. y Emeterio Lopez B. hondureños, escribientes, mayores 7 GENERAL de edad, de este vecindario.- Compareció Don Alfredo Romero, mayor de edad, sol tero, militar, hondureño, vecino de esta ciudad, dando cuenta que el dia mierco les treinta de abril recien pasado a las cuatro p.m. en el barrio de Solares Nue 10 ADUAKAS vos de esta ciudad, nacio una niña a quien llamaron: FRANCISCA ROMERO.- as hi ja SECURITY natural de Tarcila Romero, mayor de edad, soltera de pficios domesticos, hondu- 13 reña y vecina de esta ciudad.- Son abuelos de la recien nacida: Manuel Romero y CENTRAL Francisca Lanza de Romero.- ya difunto esta, hondureño y vecino de esta ciudad- el primero.- Lei lo escrito al denunciante y estando conforme con su manifesta- opion, entendido firmo.- Jose A. Romero.- Antonio Aguilar. E. Lopez P.- - Sello. - - omingo Escobar.- Secretario.- ES CONFORME CON SU ORIGINAL.- Extendida en la - 18 ciudad de La Ceiba, a los tres dias del mes de septiembre de mil novecientos - setenta y nueve. KAMEE JOSE Bo.o DANIEL PINEL E. SECRETARIO MUNICIPAL ALPILDE MUNICIPAL Secretaria 22 Hond, At!. 23 STATE OF FLORIDA COUNTY OF DADE T, the undersigned authority, hereby WITNESS my hand and certify that the foregoing is a true official seal this 4 and correct copy of an instrument day of D 1983. presented to me by MARIA EUGENIA QUINTERO as the original of such instrument. Notary Kooeber A, State of Florida NOTARY PUBLIC STATE OF FLORIDA 18 1987 COMMISSION EXPIRES JAN MY BONDED THRU GENERAL INSURANCE UND"
}
