{
	"anumber": "A90409169",
	"id": "A90409169_0054",
	"page_index": 54,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0054/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Replacement of Form I-688A, Employment Authorization, or Form I-688, Temporary Residence Card ( (Under PL. 99-603)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Honduras"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1987, 1900]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 OMB #1115-0129 U.S. Department of Justice Application for Replacement of Form I-688A, Employment Authorization, Immigration and Naturalization Service or Form I-688, Temporary Residence Card (Under P.L. 99-603) Please begin with item #1, after carefully reading the instructions. The block below is for Government Use Only. Name and Location (City or Town) of Qualified Designated Entity Fee Stamp DEPARTMENT Fee Receipt No. (This application) Qualified Designated Entity I.D. No. File No. (This applicant) A 0409167 Please read instructions on reverse. FEE WILL NOT BE REFUNDED. 1. I hereby apply for a replacement of A replacement is needed because: Form I-688A, Employment Authorization Card Original was lost, stolen, or destroyed. (Give date and details in Block 12.) Form I-688, Temporary Residence Card (If reason is one of the following, attach original document.) Original was incorrect when issued (no fee required) Original was mutilated 2. Family Name (Last Name in CAPITAL Letters) (First Name) (Middle Name) 3. Date of Birth (Month/Day/Year) ROMERO LANZA, Tarcila Isidra May 15, 1900 4. Home Address in the U.S. (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 1701 W. 42nd Place Unit 8, Hialeah, F1. 33012 5. Telephone Numbers (Include Area Code) 6. Name used when admitted as temporary resident Home: (305) 823-8731 (If different from #2): Work: Same as above 7. The date you were admitted or adjusted to temporary residence status: 8. Social Security Number: June 10, 1987 9. Sex: Male 10. Place of Birth: (Town/City) (State/Country) 11. Country of Citizenship: Female La Ceiba, Honduras Honduras 12. Explanation: My Employment authorization expired on December 10, 1987 13. Signature of Applicant: / CERTIFY that the information above is true and correct to the best of my knowledge and belief. If original document is not attached, I agree to mail it to the Legalization office in the event it is recovered. I 12/14/87 Signature Date Signed 14. Signature of Person Preparing Form if other than applicant: / DECLARE that this application was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Signature Address This section for use by IMMIGRATION OFFICER only. Recommend Application be Denied By: (Immigration) Officer) astic Date Signed Granted (Date) 12/11/87 Director, Regional Processing Facility: Replacement Issued by: On (Date): Replacement Receipt No.: Form I-695 (02/24/87)"
}
