{
  "anumber": "A90405034",
  "id": "A90405034_0123",
  "page_index": 123,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0123/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Re-examination Notice, N-100"
    },
    "years": {
      "ms_years_nlp_v1": [
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "abus Miami, FL 33138 MARIA B. LAUAYO File No. A 90 405 034 DATE: 9-5-95 APPLICATION: N-400 You are scheduled for a Ie examination on: EXAMINER \" NOVEMBER 17th 1995 AT 10:30 A.M. POON 390 Failure to comply will result in denial of your application Re-exam: Government & History; English English Writing A complete preliminary examination to be conducted entirely in English. Proof of your continuous residence and your physical presence in the U.S. from to including (1) your passport(s), (2) proof of income, (3) rent/mortgage statements & utility bills, (4) bank account, credit card, & loan statements, (5) car registration/insurance, (6) health insurance/medical bills, and (7) school records. A list of trips made outside the O.S. from to including the date which you departed the I.S., the date which you returned to the U.S., the carrier used and the O.S. port of entry for each trip. Transcript of your Driver's Record for the last 7 years. Applications are obtainable from the Department of Motor Vehicles. CERTIFIED copies of the ARREST REPORT, the INFORMATION or INDICTMENT, the JUDGEMENT, and the SENTENCE for every arrest, including PROBATION orders and evidence of completion of probation. IF YOU CLAIM THERE IS NO RECORD LOCATED, YOU MUST OBTAIN A STATEMENT CERTIFIED BY THE CLERK OF THE COURT FROM BOTH THE FELONY AND MISDEMEANOR DIVISIONS IN THE COUNTY OF THE ARREST. SEALED RECORDS MUST BE RE-OPENED, IF UNAVAILABLE. - Complete the attached fingerprint card. Complete the attached G-325B (Bio. Data) I-426 (Mil.Cert. ) DD-214 (Report of transfer or dischärge from I.S. Armed Forces). A letter from your church stating that you are a member in good standing. A statement from your church regarding its principle regarding the bearing of arms or a statement concerning your own personal beliefs about the same. Complete the attached affidavit. Evidence of registration with the Selective Service before the age of 26. IF YOU DID NOT REGISTER FOR THE SELECTIVE SERVICE BEFORE THE AGE OF 26, submit both, a letter of explanation as to the reason you failed to register & an advisory opinion from the Selective Service. IF YOU ARE UNDER 26 AND NEED TO REGISTER, APPLY AT THE POST OFFICE* FOR PROOF OF REGISTRATION or TO OBTAIN AN ADVISORY OPINION, CALL 708-688-2576"
}