{
	"anumber": "A90414760",
	"id": "A90414760_0029",
	"page_index": 29,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0029/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REQUEST FOR WAIVER OF NATURALIZATION TESTING & DESIGNATED CIVIL SURGEONS & MEDICAL FACILITIES LIST, N-400"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 REQUEST FOR WAIVER OF NATURALIZATION TESTING & DESIGNATED CIVIL SURGEONS & MEDICAL FACILITIES LIST INSTRUCTIONS: TO ASK FOR CONSIDERATION FOR EXEMPTION FROM UNITED STATES HISTORY AND GOVERNMENT AND ENGLISH LITERACY TESTING REQUIREMENTS, THIS FORM (BOTH PAGES) MUST BE SUBMITTED WITH THE N-400 APPLICATION. THE REQUIRED MEDICAL ATTESTATION WILL ONLY BE ACCEPTED FROM A CIVIL SURGEON WHO HAS BEEN DESIGNATED BY THE IMMIGRATION AND NATURALIZATION SERVICE. THE PHYSICIANS ON THE FOLLOWING LIST HAVE BEEN SELECTED TO SERVE AS DESIGNATED CIVIL SURGEONS IN YOUR INS DISTRICT. PAGE 1: TO BE COMPLETED FOR THE APPLICANT BY HIS OR HER REPRESENTATIVE (NOT BY PHYSICIAN) AND PRESENTED TO PHYSICIAN AT TIME OF MEDICAL EXAMINATION. PAGE 2: TO BE COMPLETED BY DESIGNATED CIVIL SURGEON. PLEASE NOTE: APPLICANTS FOR NATURALIZATION WHO ESTABLISH ELIGIBILITY FOR SUCH WAIVER ARE NOT EXEMPT FROM OTHER REQUIREMENTS INCLUDING THE CONDUCTING OF THE N-400 INTERVIEW. APPLICANTS MUST DEMONSTRATE AN UNDERSTANDING OF THE NATURE OF THE PROCEEDINGS. ELIDA BOLAHOS 09/19/04 A090414760 Name Date of Birth Alien Registration Number Request for testing requirement waiver on the basis of: a permanent developmental disability a permanent physical disability mental impairment Please identify the nature of claimed disability or condition, including age at the time of onset, present medical diagnosis and date of diagnosis, and any medical and/or other treatment received: She has been Loaing her memory for the Last Ten years Jose H. Jarquin ,Son in have Allergh 12/09/94 Name of person completing Page 1/Relationship to Applicant/Signature & Date PAGE 1"
}
