{
  "anumber": "A90417818",
  "id": "A90417818_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90417818_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 7/13/292023, NARA Form Number: A36708"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "France"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1960
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 4. Did the applicant's disability or impairment result from the illegal use of drugs? If the applicant is developmental disabled. did this condition first manifest itself before age 227 Please explain. NO HISTORY OF ANY ILLICIT DRUG USE. NO EVIDENCE OF ANY DEVELOPMENTAL DISABILITY. S. What is the duration of the applicant's disability or impairment? Is it temporary (less than 12 months) or permanen Explain. Mrs. Cruz's condition is Permanent as there is no change for any improvement expected from a psychological, emotion and intellectual perspective. There might be some deterioration. 6. Please provide your medical speciality. If you are not specialized. provide your medical experience and oth qualifications that permit you to make this assessment. - GENERAL PRACTICE & ADULT AND ADOLESCENT PSYCHOLOGY - Graduated from \"Faculty de France\" Paris Sorbornne, France in 1960 - Professor of faculty - 37 years experience in medecine - Graduated from UCLA in 1985 - Intitulated book and different medical SOLY MELAMED,M.D. articles. (CV already sent to I.N.S.) 1030 S. Glendale Ave. #4C5 - Selected physician for \"Interstate Glendale, CA 91205 Teleconference regarding medical problems (813) 241-4162 I certify under penalty of perjury under the laws of the United States of America that the information on the form 3 any evidence submitted with it is all true and COFFECL I agree to release this applicant's relevant medical records up request from the U.S. Immigration and Naturalization Service. I am aware that the knowing placement of fa information on the Form N-648 and related documents may also subject me 10 civil penalties under 8 U.S.C. Secti 1324c. Signature bloom SOLY MELAMED, M.D. 12.7.98 (818) 241-4162 Date Please Type or Print Lar Name MELAMED First Name Middle Name SOLY Business Address City, State ZIP Code 436N. BADFORD. SUIT 303 Telephone BEVELYHILLS, CA. 90210 (310) 859-0853 License Number A36708 Licensing State CALIFORNIA"
}