{
	"anumber": "A90414760",
	"id": "A90414760_0030",
	"page_index": 30,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0030/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023, PAGE 2: TO BE COMPLETED BY DESIGNATED CIVIL SURGEON"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 PAGE 2: TO BE COMPLETED BY DESIGNATED CIVIL SURGEON Please type or print legibly / certify that on 12/09/96 (insert date) / examined: ELIDA BOLANOS A090414760 Name Alien Registration Number 09/19/06 4631 SW 135 AVE MIAMI FL 33175 Date of birth Address examined specifically for the condition listed below. My examination revealed: No apparent developmental disability, physical disability or mental impairment condition, or The conditions listed below were found: Developmental disability Physical disability Mental impairment condition Mental Retardation Blindness Aphasia Autism Deafness Altztheimer's Disease Cerebral Palsy Paralysis Other: senile Other: Multiple Sclerosis Dementia. Polio Other: REMARKS: PATIENT HAS SIGNIFICANT COGNITIVE AND MEMORY Impainment THAT RENNERS HEN UNABLE TO CONCENTRATE MEMORIZE AND LEANN NEW INFORMATION, mas. sucid AS cityzensHip questionAire on DESPITE Process HER MENTAL CONDITION; BOLANOS UNDERSTANDS THe cityzensitip QUESTIONAIRE AND is competent Lip. TO TAKE THE OATH OF AlleciANce. APPLICANT CERTIFICATION SIGNATURE & DATE I certify that the information in this form refers to me. x lids Bolonos 12-09-96 CIVIL SURGEON CERTIFICATION NAME TITLE. SIGNATURE & DATE I certify that I have been designated by the Immigration & Naturalization Lyen influenciers 12/5/56 Service to conduct medical examinations of aliens. Lazaro N. Plasencia, ADDRESS: M.D. 3850 S.W. 87 Avenue Suite 104 PAGE 2 Miami, Florida 33165 Tel: (305)223-1551 Fax: (305) 229-1864"
}
