{
	"anumber": "A90417818",
	"id": "A90417818_0016",
	"page_index": 16,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90417818_0016/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023, Soly Melamed, M.D. General Practice"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Soly Melamed, M.D. General Practice 436 N. Bedford Drive, Suite 303 1030 S. Glendale Ave. Suite 405 Beverly Hills, CA 90210 Glendale, CA 91205 (310) 859-0853 (24 HRS.) Fax: (818) 243-3368 (818) 241-4162 (9 TO 5) QUESTION # 3 RE: CRUZ, EISABEL ALIEN NO. A090417818 The patient is experiencing severe Depression and the symptoms of her condition are severe Loss of Memory (an impaired ability to learn new information or recall previously learned information), and Cognitive disturbances including an impairment of executive functioning. The patient is not able to abstract information and then present them in a test. These symptoms cause the patient inability to learn a new language or to recall what she may have learned in the past. EXTEND: She is experiencing Memory Deficit for recent and remote events. Neuro-psychological Testing reveals that there is disorientation as to day and date. NATURE: On Mental status examination, there is impairment and Deficit in intellectual and Cognitive functioning. Abstract thinking ability is impaired. The above disabilities would preclude her being able to assimilate or integrating any new skills, language or information. M.M.S.E. 12 Additionally, the patient is experiencing a host of medical problems that include Alzheimer's Disease (as explained above) She had Stroke lately and she is under treatment in UCLA and Midway Hospital. She is experiencing episodes of Dizziness and falls. She is suffering from Central Tremor (shaky hands). She also suffers from severe Degenerative Bone Disease and Osteoporosis that causes more limitation of her activities. She is walking around with cane or walker, for 7 years. She has low vision and using glasses. As a result of the combination of medical and psychological symptoms, Mrs. Cruz will not be able to study a new language or the U.S. History and Civics lessons. Hence, it will be impossible for her to pass the written or oral English tests or the U.S. History or Civics tests. However, Mrs. Cruz is aware of the nature and importance of pledging an oath and understands the consequences of proclaiming her allegiance to the United States of America. CULYMELAMED, M.D. 1030S. Glendale Ave. #405 Soly Melamed, M. D. glendale, CA91205 401 914 4400"
}
