{
  "anumber": "A90409169",
  "id": "A90409169_0071",
  "page_index": 71,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0071/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Disposiciones del Ley de Pasaportes Decreto por el Congreso Nacional el 3 de Febrero de 1971., 19541"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1973
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Disposiciones de la Ley de Pasaportes decretada por el 1 Congreso Nacional el 3 de Febrero de 1971. Artículo Para salir del territorio de la República, REPUBLICA DE HONDURAS los hondureños tienen el derecho de proveerse de un pasa- porte que será extendido por la Secretaría de Relaciones MINISTERIO DE RELACIONES EXTERIORES Exteriores de conformidad a los requisitos exigidos en la presente Ley. En los Departamentos las Oficinas de Mi- gración podrán recibir solicitudes de pasaportes con los documentos requeridos, debiendo remitirlos a la Secretaria Pasaporte No. 19541 de Relaciones Exteriores para su resolución. Es obligato- rio para todos les hondureños obtener de la Secretaria de Relaciones Exteriores O de las Oficinas Departamentales OTORGADO A de Migración, visa para salir del territorio nacional. Los hondureños no necesitan visar sus pasaportes para regresar al país. Artículo 7. En el exterior solo los Representantes Di- Tarcela Nombre Indra plomáticos O Consulares de Honduras, exceptuándose los de carácter ad-honorein podrán expedir pasaporte previa autorización de la Secretaria de Relaciones Exteriores. Ramiro Lonza Artículo 8.-Los pasaportes se extenderán en libretas Apellido especiales y a ellas se adherirán timbres fiscales de con- tratación por valor de CINCO LEMPIRAS (Lps. 5.00) en el acto de su expedicion. De nacionalidad hondureña por Artículo 9. Los pasaportes expedidos tendrán validez por dos años y podran ser revalidados por los funcionarios competentes previo el pago de DOS LEMPIRAS Y CIN- Extendido por CUENTA CENTAVOS (Lps. 2.50 en timbres que serán adheridos y cancelados en los referidos documentos. En ningún caso podrán ser revalidados los pasaportes que tuvieren seis años de haber sido expedidos. Seccion de Pasaperia el Jefa Aela Dirección del titular en Honduras En Augar Direccionen el extranjero DE al representante diplomático o consular hondureño más próximo y a: Nombre de la persona que debe ser notificada SELLO The Restrict Fecha Firma 1973 EN CASO DE MUERTE O ACCIDENTE AVISESE Dirección exacta En caso de pérdida O robo deberá notificarse a la policia y al repre- sentante diplomático O consular más próximo."
}