{
  "anumber": "A90417818",
  "id": "A90417818_0062",
  "page_index": 62,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90417818_0062/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPUBLICa De HOnDuras Regular Passport - Passeport Ordinaire, 033845"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1971,
        1980,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 1 2 Disposiciones de la Ley de Pasaportes decretada por el Congreso Nacional el 3 de Febrero de 1971. REPUBLICA DE HONDURAS Art. 10. Para salir del territorio de la República, los Secretaría de Estado en el Despacho hondureños tienen el derecho de proveerse de de Relaciones Exteriores un Pasaporte que será extendido por la Secretaría de Rela- ciones Exteriores, de conformidad a los requisitos exigidos en la presente Ley. En los Departamentos, las Oficinas de PASAPORTE CORRIENTE Migración podrán recibir solicitudes de pasaportes con los documentos requeridos, debiendo remitirlos a la Secretaría Regular Passport - Passeport Ordinaire de Relaciones Exteriores para su resolución. Es obligatorio para todos los hondurenos obtener de la Secretaría de Relaciones Exteriores o de las Oficinas Departamentales de Migracion, No 033845 visa para salir del territorio nacional. Los hondureños no necesitan visar sus pasaportes para regresar al país. Otorgado a - Issued to Délivre A: Art. 70 En el exterior sólo los representantes diplomá- ticos o consulares de Honduras, exceptuando los Dabel de carácter Ad-Honorem, podrán expedir pasaportes previa Nombre - First name-Prenom autorización de la Secretaría de Relaciones Exteriores, siempre que el solicitante presentare ante laquellos funcionarios, los documentos auténticos con que acredite la nacionalidad hondu- Apellidos - Surname - Nom Marting rena o que estén inscritos en los registros que se llevan en De nacionalidad hondureña esas oficinas, remitiendo a la misma Secretaría de Estado, De un duplicado de la solicitud que recibieren, y acompañando nationalité hondurienne por par. marminton Houduran citizen by también el razonamiento del documento o documentos nece- sarios para su resolución. Extendido por el issued by de Etabli par le defeleng En-In-A Lugay Place Lieu En-On-Le 28 le Ughetic Date de 1980 Fecha Selle DE STONES animaldy Firma Signature aquidal - de SIGUE EN LA ULTIMA PAGINA This is a true, correct and compared copy the original WHICH was returned to the pplicant.) G.B.Bille LEGALIZANO DI A U.S. Immig ati n & atur izition Service rost Lauderaul lorida 14 Junes"
}