{
  "anumber": "A90414760",
  "id": "A90414760_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4ion of your residences and employment."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1938,
        1942
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 Part 4. Information about your residences and employment. A. List your addresses during the last five (5) years or since you became a permanent resident, whichever IS less Begin with your current address. If you need more space, continue on separate paper: Street Number and Name, City, State, Country, and Zip Code Dates (month/day/year) From To 2701 S.W. 118 CT. MIAMI FLORIDA 33170 06/95 PRESENT 4631 S.W. 135 AVE MIAMI FLORIDA 33175 06/87 06/95 B. List your employers during the last five (5) years. List your present or most recent employer first. If none, write \"None\" If you need more space, continue on separate paper. Employer's Name Employer's Address Dates Employed (month/day/year) Street Name and Number - City, State and ZIP Code From 12190 Occupation/position To Clarmy NOT EMPLOYED DISABLED SSI SupportBuking 90 12/94 PREST 8 MEDICAID 12/94 PRESENT 9 Part 5. Information about your marital history. SETSOPPLE # / clAIMS No OTHERS 10 A. Total number of times you have been married 2 If you are now married, complete the following regarding your husband or wife. Family name Given name Middle initial NONE Address Date of birth Country of birth Citizenship (month/day/year) Social A# (if applicable) Immigration status Security# (If not a U.S. citizen) Naturalization (If applicable) (month/day/year) Place (City, State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. Claims MOTHERS 11 B. Total Number of Children Complete the following information for each of your children If the child lives with you, state \"with me\" in the address column; otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" III the address column. If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address LEONOR VEGA 12/05/3 BNICARAGUA NICARAGUA 2701 S.W. 118 ct MARIA BOLANOS 1938 NICARAGUA U.S.A 4631 S.W 135 AVE MIA, FL CARLOTA BOLANOS 1942 NICARAGUA U.S.A. 2701 S.W. 118 ct MIA, FL From I 4( (Rev 07/17/91)N Continued on next page"
}