{
  "anumber": "A90409169",
  "id": "A90409169_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Honduras"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1987,
        1980,
        2023,
        1983,
        1821
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 TRANSLATION \"SEAL\" Republic of Honduras, Free, Sovereign and Independent 15 of September 1821 FIRST CLASS FIFTY CENTS CERTIFICATION 1980-1983 No 0075863 The undersigned, Municipal Secretary in charge of the Civil Register of this city CERTIFIES: That folio No. 230 of the original book of births No. 4 corresponding to the year eighteen hundred ninety- nine and which is active in the files of this municipality you FEB 2 - 1980 will find the entry which literally says: -TARCILA ISIDRA.- In La Ceiba, the twenty second of May of eighteen hundred ninety- nine. Personally appeared before this Secretary Don Manuel J. \"SEAL\" Romero, stating that in this port and in his own habitual home, General Register the fifteenth of the current, at eleven a.m. a female child was of the Republic born and given the name of: TARCILA ISIDRA.-- Daughter of above Tegucigalpa named petitioner and Francisca Lanza.-- Paternal grandparents: D.C. Pedro Romero and Maria Josefa Palma, and maternal: Jesus Lanza Honduras and Gertrudis Galindo de Lanza.-- Were the witnesses of the declara- tion, who signed with me and the petitioner.-- Manuel J. Romero.- Quintin Gaitan.-- Gregorio Castro.-- Sello.-- J. Amaya.-- IN ACCOR- \"SEAL\" DANCE WITH ITS ORIGINAL.- Drawn up in the city of La Ceiba, on the General Office ninth day of the month of February of nineteen hundred eighty. of Customs Rep. of Honduras \"STAMP\" \"Illegible\" \"STAMP\" \"Illegible\" Municipality of Signature Municipal Mayor Signature \"SEAL\" La Ceiba Kamel Jose La Ceiba, Atl Hond. Daniel Pinel E Central Bank of Secretary Municipal Secretary Municipal Honduras Honduras CA Mayor \"Illegible\" Signature Stamp \"Illegible\" STAMP STATE OF FLORIDA ) SS COUNTY OF DADE BEFORE ME, the undersigned authority, personally appeared, ELIZABETH M. GIRALDEZ , who being by me first duly sowrn says that SHE is fully versed in the SPANISH language and the English Language and that the foregoing is a true and correct translation of an instrument consisting of / pages (s) and this is the / page of the attached. Elizabeth In Giraldy WITNESS MY HAND AND OFFICIAL SEAL at Miami Florida County of DAdE , this 24 day of October , 1983 My Commission Expires: the NOTARY PUBLIC STATE OF FLORIDA NOTARY PUBLIC/ State of Florida MY COMMISSION EXPIRES JAN 18 1987 MR. ROLANDO PEREZ BONDED THRU GENERAL INSURANCE UND"
}