{
  "anumber": "A90405034",
  "id": "A90405034_0113",
  "page_index": 113,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0113/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, A90 45 034"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1991,
        1993,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S Department of Justice Immigration and Naturalization Service 77 S.E. 5th St. Miami, Fl. 33131 Request That Applicant For Naturalization Appear for Interview Maria Lacayo Alien Registration no: A90 405 034 11560 SW 92nd Street Miami, FL 33176 Date: April 3, 1998 Your application for naturalization and request for medical exception has been reviewed and the medical exception has not been accepted. You will be required to satisfy the English and Civics requirement of the INA. You are required to return for an examination on your application for naturalization, on the below date and time. Please bring this letter with you. Please come to: IMMIGRATION & NATURALIZATION SERVICE ON: Acril 14, 1993 77 S.E. 5TH STREET 2ND FLOOR AT: 8:50am MIAMI, FLORIDA 33131 EXAMINER m-1 If for any reason you cannot keep this appointment, return this letter prior to your appointment with your explanation and a request for a new appointment; otherwise, your application will be denied pursuant to 8 CFR 335.7. You will be tested on your knowledge of the government of the United States and its history You may also be tested on reading writing, and your ability to speak English. YOU MUST BRING WITH YOU: This letter Alien registration Receipt Card All Passports Complete list of trips outside of the U.S. from 1991 to the present. Proof of continuous residence and physical presence in the U.S. from 1991 to the present. If you were ever arrested also include Certified copies of the Arrest Report. the information or indictment. the judgment. and the sentence for every arrest. including probation orders and evidence of completion of sentences. (Claims of no record. must be certified by the Clerk of Court in both the felony and misdemeanors division in the county of arrest. Sealed records must be reopened.) Please keep this appointment. even if you do not have all the items indicated above."
}