{
	"anumber": "A90413717",
	"id": "A90413717_0058",
	"page_index": 58,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90413717_0058/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Title: U.S. Department of Justice Immigration and Naturalization Service N-4 Adjudication Processing Worksheet, Form Number: Form N-650B ( (Rev. 1/1/98)"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 U.S. Department of Justice Immigration and Naturalization Service N-400 Adjudication Processing Worksheet A# 90 413 717 INTERVIEW Initials Date Remarks Appeared for interview cw 4/16/95 No show on (Date) (Initials and Current Date) A-file present at time of initial interview cw 9/16/99 OFFICER Initials Date Remarks (Only circle standard annotations when and if applicable) Met ยง 312 requirements at initial interview (55/15) (50/20) (65/20) Appeared for Re-Exam Ds 11-17-99 No show on: (Date) (Initials and Current Date) Met ยง 312 requirements at Re-Exam N648 not acected seelettes Ds 1177-99 If applicable, met ยง 312(b) disability exceptions NIY W648 cw 9/16/99 Established physical presence/residence Established good moral character (See Sworn Statement) (Criminal Record in File) Established attachment to Constitution (If modified oath, circle notation in remarks) (Religious Objection) Met other eligibility requirements (put reason(s) in remarks) (See Sworn Statement) Recommendation, if supervisory review required 1ST S 11-17-99 CIRCLE RECOMMENDATION: (CRIMINAL) and/or (GRANT) (DENY) (WITHDRAW) (T-FILE) and/or (DISABILITY) CIRCLE RECOMMENDATION: If necessary, enter 2ND (GRANT) (DENY) (WITHDRAW) SUPERVISORY CONCURRENCE WITH OFFICER'S RECOMMENDATION Slee Initials Date Remarks (Indicate non-concurrence issue(s) within remarks) 11/17/99. OFFICER Initials Date Remarks (Circle decision) Indicate decision under remarks Ds 11-17-99 (GRANTED) (DENIED) (WITHDRAWN) Reverified / Reverifier's Signature Date Form N-650B (Rev. 11/1/98)"
}
