{
	"anumber": "A90414760",
	"id": "A90414760_0052",
	"page_index": 52,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0052/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screened by NARA, 7/13/2023, 9044414760"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1995]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA,,7/13/2023 UNITED STATES 07 JUSTICE INXIGRATION E SXXPICX SECTION OF LAN 316a Incoming Sheet MY H 90414760 SEX: F MARITAL STATUS: IXIGI: ft. in. ITEMS: Nicaragna New Address Exam Date APR 17 1995 ACTION a DICROST STILL REQUIRED English: NO Speaks Reads Writer Cubiete tran I ) friting ( I Government Government: I INS Test ) STANDARDIXED Test I I See attached H I I 1 File I I Other: Residence Verified: I ) In. Fisa ( I I-181 I I CIS : ALL ACTION DOE 2-20-90 CO8 W26 POE XWS 6/23/95 (Signature E Date) DOCUMENTS PRESENTED: Unable to Speak, read, write English College hack knowledge DETERMINATION (Signature E Date APR 17 1995 Comments APPROVAL (stazoi OATH OF RENOXCTATION AM ALLOGIANCE I Oath with INS I I Cath rith COURT I } Modified Oath NAME ON CERTIFICATE I potentate, HEREBI DECLARK, state, or on sovereignty oath. that I of absoluteiy vices or which and entirely I have herethfore resource and been abjure Ally allegiance citizen: and fidelity to any foreign prince, that that I will support and defend the Constitution and the laws of the twited a States subject against or all eneries, foreign and domestic; I will bear true faith and allegiance to the same; that that I will bear arms on behalf of the United States when required by the law: that that I will perform work of national importance under civilian direction shen the lax, and I will perform noncombatant service in the Armed Forces of the inited States riez required by the lax; In acknowledgement whereof I have herenato affired #7 signature. I take this obligation freeit without any Restal reservation as propose of required Crazion: by SO NKLY MK GOD. Signature"
}
