{
	"anumber": "A90413717",
	"id": "A90413717_0095",
	"page_index": 95,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90413717_0095/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Status as a a Temporary Resident, Form I-687 ( (04/ 1987) Page 1"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1937, 1982, 1906, 2023, 1936]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/17/2023 U.S. Department of Justice Application for Status as a Temporary Resident OMB #1115-0133 Immigration and Naturalization Service (Under Section 245A of the Immigration and Nationality Act) Please begin with item #1, after carefully reading the instructions. The block below is for Government Use Only. Name and Location (City or Town) of Qualified Designated Entity Fee Stamp 5-21-87 185. Fee Receipt No. (This application) X5W-87-005-1014 Principal Applicant's File No A-90,413.717 Qualified Designated Entity I.D. No. File No. A - Applicant: Do not write above this line. See instructions before filling in application. If you on this form, use a separate sheet and identify each answer with the number of the correspondi lock letters in ink. A90413717 1. I hereby apply for status as indicated by the block checked below (check block A o, A Temporary Residence as an alien who illegally entered the U.S. prior to January 1. 1982. B Temporary Residence as an alien who entered the U.S. as a nonimmigrant prior to January 1, 1982 and whose authorized stay expired before such date or whose unlawful status was known to the Government as of January 1, 1982. 2. Family Name (Last Name in CAPITAL Letters) (First Name) (Middle Name) 3. Date of Birth (Month/Day/Year) AMAYA, CHAVEZ MELIDA NMN 3/31/1906 4. Other Names Used or Known by (Including maiden name, if married) 5. Telephone Numbers (Include Area Codes) Home: (305)232-0397 NONE Work: 6. Home Address in the U.S. (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 13324 S.W. 113 court Miami FLorida 33176 7. Mailing Address in the U.S. (if different from #6.) (Apt. No.) (City) (State) (ZIP Code) SAME AS ABOVE 8. Last Address outside the U.S. (City or Town) (County, Province or State) (Country) Col. Centro America J-590 Managua, Managua, NIcaragua 9. Sex Male 10. Race Asian or Pacific Islander Black, not of Hispanic origin Other (specify below) Female Hispanic White, not of Hispanic origin 11. Marital Status Never Married Divorced 12. Country of Citizenship Now Married Separated Widowed NICARAGUA 13. Place of Birth (City or Town) (County, Province or State) (Country) Leon, Leon, Nicaragua 14. Have you previously applied for temporary residence as a legalization applicant? 15. Do you have any other record with I&NS? No Yes (if \"Yes\" give date, place of filing, and final disposition, if known) No Yes [If \"Yes\" give number(s)] A Other 16. When did you last come to the U.S.? (Month/Day/Year) 17. Manner of Entry (Visitor, Student, Crewman, etc.) With visa (visitor, student, etc.) specify VISITOR 5/11/80 Without visa 18. Place of Last Entry MIA 19. List all Social Security Numbers used. U.S. Port of entry (City and State) Miami, Fl. (1) 261-99-6022 (3) Border - Not through port (State) (2) (4) 20. Mother's Name (Maiden) (Last) (First) Living 21. Father's Name (Last) (First) Living Chavez, Isabel Deceased (year) 1936 Amaya, Nicolas Deceased (year) 1937 Form I-687 (04/01/87) Page 1"
}
