{
  "anumber": "A90413717",
  "id": "A90413717_0109",
  "page_index": 109,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90413717_0109/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Special Warranty Deed, 12871 PG 21."
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1986 APR 28 PHE 333 NARA, 7/17/2023 86R134581 SPECIAL WARRANT DEED OFF REC 287 I PG 21. SPECIAL WARRANTY DEED, made this 25 thday of April , 1986 ! between, a EDGEWATER PARK, INC., a Florida corporation (\"Grantor\"), and JUAN TORRES, a single man whose mailing address is: 13324 S.W. 113th Court Miami, Florida 33176 (\"Grantee\"). WITNESSETI H: That the Grantor, for and in consideration of the sum of Ten Dollars ($10.00) and other good and valuable considerations to it in hand paid by the Grantee, the receipt of which is hereby acknowledged, has granted, bargained, and sold, and by these presents does grant, bargain and sell, to the Grantee, its heirs, successors and assigns forever, the following described Parcel, lying and being in Dade County, Florida, to wit: Lot 5 , Block 19, EDGEWATER PARK, according to the Plat thereof, recorded in Plat Book 126 at Page 17 , of the Public Records of Dade County, Florida. This conveyance is subject to the following: 1. Real estate taxes and assessments for this and subsequent years. 2. Conditions, restrictions, limitations, reservations, easements and other agreements of record, and easements visable upon the property of which the above Unit is a part. 3. The Plat of EDGEWATER PARK. 4. Declaration of Covenants, Restrictions and Easements for Edgewater Park Homeowners'. 5. Applicable zoning and subdivision ordinances. The Grantor does hereby warrant, and will defend, the title to the Unit hereby conveyed, subject as aforesaid, against the lawful claims of all persons claiming by, through or under the Grantor, but none other. Grantee, by acceptance of this Deed, automatically agrees for itself, and its heirs, personal representatives, successors and assigns, to observe and to be bound by all of the terms and conditions set forth in the said Declaration, all Exhibits attached thereto, and all future Amendments thereof. IN WITNESS WHEREOF, Grantor has caused these presents to be executed and its seal to be affixed the day and year first above written. Signed, sealed and delivered EDGEWATER PARK, INC. in the presence of: Dolly D. Dawis BY: Justing baral a. Bakisa VICE PRESIDENT (Corporate seals STATE OF FLORIDA ) COUNTY OF DADE ) SS: The foregoing instrument was acknowledged before me this 25thay of April , 19 86 by ANGEL GUTIERREZ as President of EDGEWATER PARK, INC., a Florida corporation, on behalf of said corporation. NOTARY PUBLIC, STATE OF FLORIDA My Commission Expires: #41 STATE OF Fister B. BRYANT OF RECORDED IN OFFICIAL RECORDS BOOK MOTARY FUNDLE RECORD VERIFIED DADE COUNTY. FLORIDA. RICHARD P. BRINKER MY COMMISSION EXP. APR. 23,1989 MERK CIRCUIT COURT MEY WEISS. ROSE. ARKIN. SHAMPANIER ZIEGLER & BARASH. P.A. FINA FEDERAL BUILDING, MIAMI BEACH. FLORIDA 33139 - 3097 G"
}