{
  "anumber": "A90417818",
  "id": "A90417818_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90417818_0015/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Certification for Disability Exceptions"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice OMB 1115-0205 Immigration and Naturalization Service Medical Certification for Disability Exceptions Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please prins or type information) Last Name First Name Middle Name Social Security Number CRUZ ISABEL Address Alien Number 1411 S. BRONSON AVE A090417818 City State L.A. Zip Code CA 90019 Telephone Number Date of Birth Sex (213) 731-0304 1/31/10 FEMALE I, CRUZ, ISABEL authorize SOLY MELAMED, M.D. (Applicant's Name) (Licensed medical doctor or licensed clinical prchologist to release all relevant physical and mental health information related 10 my medical status to the INS for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty of perjury pursuant to Title 28 U.S.C. Section 1746. that the information on tbc form and any entence submitted with it is all LIVE and correct. I am aware that the knowing placement of false information on the Form M-648 and related documents may also subject me 10 civil penalties under 8 U.S.C. Section 1324c. Signature Date 12/7/98 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language 2nd U. S. history and civics Lests required of applicants for naturalization. The Immigration and Naturalization Service's regulations require that applicants for an exception based on disability submit this certification form, completed by as licensed medical doctor or Licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complete words and phrases. 1. Date of your most recent examination of the applicant 12/7/1998 2. Is this your first examination of the individual? Yes No X If yes, who is the regular attending physician? 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, in your professional medical opinion. would prevent this applicant from demonstrating knowledge of basic English language and/or U.S. history and civics. Describe in detail. If applicant has a mental disability or impairment, please provide DSM diagnosis. DIAGNOSIS: ALZHEIMER'S DISEASE. STROKE. DIZZINESS, FALLS. DSM IV 294.0 Amnestic disorder DUE TO GENERAL MEDICAL CONDITION. DSM IV 780.9 AGE RELATED COGNITIVE DECLINE. DSM IV 300.02 GENERALIZED ANXIETY DISORDER. CENTRAL TREMOR. DEGENERATIVE BONE DISEASE. OSTEOPOROSIS. LOW VISION. BRAIN ATROPHY. ORIGIN: The patient is under my care for serious medical and emotional/ psychological conditions. The patient is suffering from severe Alzheimer's disease since 10 years ago. Her condition is deteriorating gradually. She had Stroke lately and she s - under treatment in UCLA and Midway Hospital She is not recognizing family members. She gets lost if she leaves the house by herself. A11 day she has to stay with a family member. MRI has been done in UCLA and it shows brain atrophy (copy attached) Cont"
}