{
  "anumber": "A90414760",
  "id": "A90414760_0067",
  "page_index": 67,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0067/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service, G-325A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1937,
        2023,
        1984
      ]
    },
    "g325a": {
      "occupation": {
        "occupation_llm_v1": "['n.a']"
      },
      "nationality": {
        "nationality_llm_v1": "Nicaragua"
      }
    }
  },
  "is_g325a": true,
  "is_cert_naturalization": false,
  "full_text": "FORM G-325A (REV. 10-1-74) Y Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE MIA Form Approved OMB No. 43-R436 T.C. I589 BIOGRAPHIC INFORMATION letter to the Bureau MAR 12 1984 Immigration and Naturalization Service (Family name) (First name) (Middle name) MALE BIRTHDATE(Mo.-Day-Yr.) NATIONALITY AUTH REGISTRATION NO. BOLANOS- FUENTES Elida DRAMALE 9/19/06 Nicaragua (If 403-604-639 ALL OTHER NAMES USED (Including names by previous marriages) CITY AND COUNTRY OF BIRTH SOCIAL SECURITY NO. Managua Nicar. (If any) FAMILY NAME FIRST NAME DATE, CITY AND COUNTRY OF BIRTH(If known) CITY AND COUNTRY OF RESIDENCE Villalta FATHER Jose A. Nicar. deceased MOTHER (Maiden name) Fuentes Teresa HUSBAND (If none, so state) FAMILY NAME FIRST NAME BIRTHDATE CITY & COUNTRY OF BIRTH DATE OF MARRIAGE PLACE OF MARRIAGE OR (For wife, give maiden name) WIFE FORMER HUSBANDS OR WIVES(if none, so state) FAMILY NAME (For wife, give maiden name) FIRST NAME BIRTHDATE DATE & PLACE OF MARRIAGE DATE AND PLACE OF TERMINATION OF MARRIAGE Bolabos Carlos Aug 8 / 06 1937 Nicar. deceased In Nicar APPLICANT'S RESIDENCE LAST FIVE YEARS. LIST PRESENT ADDRESS FIRST. FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR 12831 S.W. 43 Dr Apt 138 A Miami Fla USA 9 79 PRESENT TIME APPLICANT'S LAST ADDRESS OUTSIDE THE UNITED STATES OF MORE THAN ONE YEAR FROM TO STREET AND NUMBER CITY PROVINCE OR STATE COUNTRY MONTH YEAR MONTH YEAR Call3 14- 14 Ave S.E. # 1402 Managua Nicar. 62 9 79 APPLICANT'S EMPLOYMENT LAST FIVE YEARS. (IF NONE, so STATE.) LIST PRESENT EMPLOYMENT FIRST. FROM TO FULL NAME AND ADDRESS OF EMPLOYER OCCUPATION (SPECIFY) MONTH YEAR MONTH YEAR none PRESENT TIME Show below last occupation abroad if not shown above. (Include all information requested above.) THIS FORM IS SUBMITTED IN CONNECTION WITH APPLICATION FOR: SIGNATURE OF APPLICANT OR PETITIONER DATE NATURALIZATION ADJUSTMENT OF STATUS 10/11/79 Asylum OTHER (SPECIFY): falida IF YOUR NATIVE ALPHABET Fuentes IS IN OTHER THAN ROMAN-LETTERS. Vde WRITE Bolanos YOUR NAME IN YOUR NATIVE ALPHABET IN THIS SPACE: Are all copies legible? Yes PENALTIES: SEVERE PENALTIES ARE PROVIDED BY LAW FOR KNOWINGLY AND WILLFULLY FALSIFYING OR CONCEALING A MATERIAL FACT. APPLICANT: BE SURE TO PUT YOUR NAME AND ALIEN REGISTRATION NUMBER IN THE BOX OUTLINED BY HEAVY BORDER BELOW. COMPLETE THIS BOX (Family name) (Given name) (Middle name) (Alien registration number) BOLANOS, FUENTES, Elida - avia A23-606-639 (OTHER AGENCY USE) INS USE (Office of Origin) OFFICE CODE: TYPE OF CASE: DATE: MIA T.C. I589 MAR 12 1984 (1) Ident. FORM G-325A"
}