{
	"anumber": "A90409169",
	"id": "A90409169_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "CERTIFICACIÓN, 1565820"
		},
		"years": {
			"ms_years_nlp_v1": [1971, 1968, 1987, 2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened.by-NARA, 7/7/2023 PRIMERA CLASE CINCUENTA CENTAVOS 1968-1971 I No 1565820 1 CRTIFICACION 2 41 Infrascrito Encargado d°1 Registro Civil de este termino CERTIFICA:que en el 3 libro original de Nacimientos No.102 y a folio 249, se encuentra la partida que literal ERAL 4 DE mente dice :\"MARIA EUGENIA ROM ERO. in San PedroSula, a la dos de la tarde del día martes veinticuatro de septiembre de mil novecientos cuarenta yseis. Ante mi. CONTRACT Samuel Bogran h.Secrotario del Concejo del Distrito Departamental y Encargado del DURAS ? Registro Civil y ante los testigos Guillermo C. Espinoza y F. Alfredo Coto, mayores ADUANAS de edad, hondurenos y de este domicilio, comparecio el señor Rraimundo Perdomo, ma yor de edad, hondureno y de ests vecindario, dandocu@nta:que el día dieciocho del presen 10 te mes a las ocho pm. en elbarrio Las Andes de esta ciudad, nacio una niña quien 11e vara por nombre MARIA EUGENIA 48 hija natural de la senora Alicia Romero, mayor de edad, soltera y de este vecindario. Son abuelos maternos, Tarcila Romero. Lei lo es 13 crito al compareciente, lo ratifico y no firmo por ignorar. -G.C.ESPINOZA. -F. ALFRE DO. -COTO. - SELLO -SAM UEL BOGRAN h. -SECRETARIO. 14 4S CONFORM r CON SU ORIGIN AL 15 I 16 Ext°ndida en la ciudad de San Podro Sula a los ocho dias del mes de septiembre de mil novecientos setenta y uno. 17 REGISTRO 18 James ARTURO M AR PNZZ DIAZ 19 ENC. R EGISTRO CIVIL. 20 21 STATE OF FLORIDA COUNTY OF DADE 22 I, the undersigned authority, hereby 23 certify that the foregoing is a true and correct copy of an instrument 24 presented to me by MARIA EUGENIA QUINTERO as the original of such 3 DEPARTMENT PEREZ instrument. 25 WITNESS my hand and official seal, this 4 day of November NOTARY A.D. 1983 NOTARY PUBLIC STATE OF KLORIDA Notary Public STATE PUBLIC OF Hand MY COMMISSION EXPIRES JAN 18 1987 BONDED THRU GENERAL INSURANCE UND State of Flori da"
}
