{
  "anumber": "A90409169",
  "id": "A90409169_0031",
  "page_index": 31,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90409169_0031/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application to Adjust Status from Temporary to Permanent Resident, Form I-698 ( (08/10/88) Page 1"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1899,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 OMB No. 1115-0155 U.S. Department of Justice Application to Adjust Status from Temporary to Permanent Resident Immigration and Naturalization Service (Under Section 245 A of Public Law 99-603) Please read instructions: fee will not be refunded. Fee Stamp INS Use: Bar Code Address Label (Place adhesive address label here from booklet or fill Applicant's File No. X958906/0156010 1-15-89 XOP in name and address, and A 90 million file number in appropriate blocks.) 9 1. Family Name (Last Name in CAPITAL Letters) (See instructions) (First Name) (Middle Name) 2. Sex Male ROMERO LANZA, TARCILA ISIDRA (Female 3. Name as it appears on Temporary Resident Card (I-688) if different from above. 4. Phone No.'s (Include Area Codes) Home: (305)823-8731 Same as above No. 1 Work: NONE 5. Reason for difference in name (See instructions) None 6. Home Address (No. and Street) (Apt. No.) (City) (State) (Zip Code) 1701 West 42nd Place Unit 8 Hialeah Fla. 33012 7. Mailing Address (if different) (Apt. No.) (City) (State) (Zip Code) Same as above 8. Place of Birth (City or Town) (County, Province or State) (Country) 9. Date of Birth (Month/Day/Year) LA CEIBA ATLANTIDA HONDURAS May 15, 1899 10. Your Mother's First Name 11. Your Father's First Name 12. Enter your Social Security Number FRANCISCA LANZA MANUEL ROMERO 590.505222 13. Absences from the United States since becoming a Temporary Resident Alien. (List most recent first.) (If you have a single absence in excess of 30 days or the total of all your absences exceeds 90 days, explain and attach any relevant information). From To Total Days Country Purpose of Trip (Month/Day/Year) (Month/Day/Year) Absent NONE 14. When applying for temporary resident alien status, I did did not submit a medical examination form (I-693) with my application that included a serologic (blood) test for human immunodeficiency virus (HIV) infection. (If you did not, submit a medical examination form (1-693) with this application that includes a serologic test for HIV.) (Attach Medical Examination HIV) 15. Since becoming a temporary resident alien, I have have not been arrested, convicted or confined in a prison. (If you have, provide the date(s), place(s), specific charge(s) and attach any relevant information.) 16. Since becoming a temporary resident alien, I have have not been the beneficiary of a pardon, amnesty (other than legalization), rehabilitation decree, other act of clemency or similar action. (If you have, explain and attach any relevant documentation.) 17. Since becoming a temporary resident alien, I have have not received public assistance from any source, including but not limited to, the United States Government, any state, county, city or municipality. (If you have, explain, including the name(s) and Social Security Number(s) used and attach any relevant information.) Form I-698 (08/10/88) Page 1 8/17/89 CL"
}