{
  "anumber": "A90405034",
  "id": "A90405034_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4 (Rev 07/17/91)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1496
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. Returned Receipt Family Given Name LACAYO Name MARia Middle Initial B U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 11560 SW 92 ST # City MiAmi County Dade State Florida ZIP 33176 Reloc Sent Code Date of Birth (month/day/year) 3/28/07 of Country Birth NicaRaqual Social Security # 556-40-4319 A # 090405034 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B e. Other. (Please specify section of law) At interview request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 6/12/89 MIA. 95 NO ARC No FPE Citizenship NicARagua AUG 1496 ARC str 2-12-98 Name on alien registration card (if different than in Part 1) SAME. CLERK D use, Omr, SDAO 4/24/88 Other names used since you became a permanent resident (including maiden name) N/A Sex Male Height Marital Status: Single Divorced Female 5'5\" Married Widowed Can you speak, read and write English ? No Yes. Action Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip 2/10/95 2/20/95 Yes No NicaRagua Vacation 4/28/94 4/1/94 Yes No HondoRas Dacation To Be Completed by Attorney or Representative, if any 5/16/93 6/15/93 Yes No Niconagua vacation Fill in box if G-28 is attached to represent the applicant 9/16/93 10/14/93 Yes No NicaRagle vacation VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}