{
  "anumber": "A90414760",
  "id": "A90414760_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0007/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name BOLANOS Name ELIDA Initial I U.S. Mailing Address - Care of 9631 FOUNT FOINTAINBLEAV BLVD 2 Resubmitted Street Number Apt. and Name 2701 S.W. 118 CT # 20/ 3 City County MIAMI DADE State ZIP 33172 Reloc Sent Code FLORIDA 33170 Date of Birth Country (month/day/year) 09/19/06 of Birth NICARAGUA Social A Security # 595-10-1497 # 090-414-760 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent 1-7-89 Port admitted with an immmigrant visa or INS Office 5 resident (month/day/year) where granted adjustment of status. 06/09/87 us MIAMI, FLORIDA Citizenship NICARAGUAN Name on alien registration card (if different than in Part 1) BOLANOS ELIDA Other names used since you became a permanent resident (including maiden name) K SAME AS ABOVE Sex Male Height Marital Status: Single Divorced Female 5,0 Married Widowed 14 JAN '97 ARC s/R is 3/3/99 Can you speak, read and write English ? No Yes. Action Absences from the U.S.: CLERK 00 APPROVED I.N.S DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes If you answered \"Yes\" , complete the following Begin with your most recent absence If you need more room to explain the reason for an absence or to list more trips, continue on separate Claims NONE 6 MAR 25 199y paper. Did absence last by: Date left U.S. Date returned 6 months or more? Destination Reason for trip MIA 7845 Yes No To Be Completed by Yes No Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev 07/17/91)N Continued on back."
}