{
	"anumber": "A90405034",
	"id": "A90405034_0097",
	"page_index": 97,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90405034_0097/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "misc"
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "DE LACAYO MARiA Bertha ARGDETTO ADVERTENCIA IMPORTANTE País del que es ciudadano Passporte 0 Numero de Permiso No. Nic Registro de Extranjero 175372 Conserve este permiso consigo. Domicizio En los Estacos Unidos (Número, Calle, Ciudad y Estado) La fecha de validez de su visado no quiere de Pinegrove F 109-11245 Frendall DR que puede permanecer en los Estados Unidos he esa fecha. Línea Aérea y No. de Vuelo 0 Navío **EI pasajero se embarco en: en que llegó TACA 110 NICARAGUA Usted esta autorizado a permanecer en los Esta Unidos hasta la fecha inscrita por el inspector Número, Calle, Ciudad, Provincia (Estado) y País en que reside con carácter permanente NEW este formulario. EI permanecer en los Esta km. 12 CARR. MASAYENDER DOCKET CONTROL Unidos despues de esa fecha sin permiso de autoridades de migración es una violación ade Ja Mes, Día y Ano de Nacimiento ABRIL 10-1907 Cludad, Provir (Estado) y País de Nacimiento R. CUANDO USTED PARTA DE LOS EST ADOS UNIDOS OHLOW Por via marítima O por Via aerea, haga: entregaude este permiso granada Nic orders compañia de transportes. INDEFINITE Visa emitida en (Si no tiene visa, anote el numero Si abandona el país cruzando la frontera con el Canada, sirvase entre del pasaje) NiL EMPLOYMENT este permiso it Eving cionario deimmigra cign Canadiense. Mes, Día yo Año en que fue STAPLE emitida la visa Ang101981 no Si cruzando entre AUTH R. 7 este at unit phario de Impligración to los Estadoschidos: abandena Mpas 18 trontera 500 Mexico, sirvese HERE ABRIL 1- 1982 FORM I-94 REGISTRO DE AMPLIACIÓN DE PLAZOS Hasta EXT. DENIED state Oficina HUG.118,198 VD-TO SEPT. 10, 1981 Oficina RACY J.R. Oficina REGISTRO DE PARTIDA Fecha: UNDER DOCKET CONTROL AT Pu NEW Compañia de Transporte: w/s Con destino a: (Pais de desembarco) MAY 28 1982 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form Approved OMB No. 43 RO496 RIVAL - DEPARTURE RECORD Form I 94 (Rev.6 1 79)Y(Spanish)"
}
