{
	"anumber": "A90662047",
	"id": "A90662047_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90662047_0025/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "QDE Transmittal Sheet, 03-0044"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/7/2023 03-004 QDE TRANSMITTAL SHEET ID # 214004 DATE / / IN MATTER OF: NAME: LOPEZ TOMAS BoniLLA. LAST FIRST MI ADDRESS: 218 ELDERT LANE. WOODHAVEN. N.V. N.11421 STREET CITY STATE ZIP APPLICATION: I-687 For Legalization I-700 Special Agricultural Worker WAIVER NEEDED: YES NO (The HOME BANK SAVING) THE ITEMS CHECKED BELOW ARE ATTAHCED: Fee$ 18500 BANK Postal Money Order# 009822 I-687, Legalization Application I-486, Medical Examination FD-258 Fingerprint Card Form I-94, Arrival/Departure Record Photographs (3) Proof of Residence: 062 From8-7-80 To DATE From To From To From To Proof of Employment: From To From To From To Proof of Identity: A. Check blocks for each type of supporting documents attached to application: (SAW Employment Documentation 1. Leases/Rent Receipts 8. Utility/Phone Receipts 15. Government Employment Record 2. Employer/Union/Business 9. School Records 16. Agricultural Producer Record Records 10. Bank/Check Records 17. Farm Labor Contractor Record 3. Tax Records (11. Passports/Foreign I.D.'s 13. Union Records 4. U.S. licenses and I.D.' 12. Birth Certificate (s) 19. Pay Stubs/Work Receipts 5. Marriage Certificates 13. Church/Baptismal Records 20. Tax Records 6. Affidavits of Friends/ 14. Other: 21. Affidavits of Agricultural Relatives Producers or Farm D 7. Postmarked Mail Labor Contractors 22. Other: Proof of Financial Ability I-134 Affidavit of Support Evidence of Income Affidavit Other I-89 Adit Form I-690 Application for Waiver Record of Convictions Other REFER TO TRAINING MANUAL FOR REQUIREMENTS FOR ORIGINAL AND CERTIFIED COPIES OF DOCUMENTS CATHOLIC MIGRATION SERVICES, INC. I HEREBY AUTHORIZE , AN APPROVED QUALIFIED DESIGNATED ENTITY, TO FORWARD MY APPLICATION AND SUPPORTING DOCUMENTS TO THE APPROPRIATE LEGALIZATION OFFICE OF THE U.S. IMMIGRATION AND NATURALIZATION SERVICE. DATE $15.87 SIGNED LOCATION SAIN SILVESTER. church QDE COMMENTS:"
}
