{
  "anumber": "A90662047",
  "id": "A90662047_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90662047_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Clearance Requirements for Aliens Seeking Adjustment of Status, NARA-1035.428.967"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 MEDICAL CLEARANCE REQUIREMENTS FOR ALIENS SEEKING ADJUSTMENT OF STATUS MEDICAL ESTIMATED TIME CONDITION FOR CLEARANCE ACTION REQUIRED Suspected Mental* 5-30 Days Applicant must provide to civil surgeon a psychological or psychiatric evaluation Conditions from a specialist or medical facility for final classification and clearance. Tuberculin Skin Test Immediate Applicant should be encouraged to seek further medical evaluation for possible Reaction and preventive treatment. Normal Chest X-Ray Tuberculin Skin Test 10-30 Days Applicant should be referred to physician or local health department for further evaluation. Reaction and Medical clearance should not be granted until applicant returns to civil surgeon with Abnormal Chest X-Ray documentation of medical evaluation for tuberculosis. (\"Inactive/Class B\") Tuberculin Skin Test 10-300 Days Applicant should obtain appointment with physician or local health department. If Reaction and treatment for active disease is started, it must be completed (usually 9 months) before Abnormal Chest X-Ray medical clearance granted. At completion of treatment, applicant must present (\" Active or Suspected to civil surgeon documentation of completion. If treatment not started, applicant Active/Class A\") must present to civil surgeon documentation of medical evaluation for tuberculosis. Hansen's Disease 30-210 Days Obtain evaluation from specialist or Hansen's disease clinic. If disease is Indeterminate or Tuberculoid, applicant must present to civil surgeon documentation of medical evaluation. If disease is Lepromotous or Borderline (dimorphous) and treatment is started, applicant must complete at least 6 months and present documentation to civil surgeon showing adequate supervision, treatment, and clinical response before medical clearance granted. Venereal Diseases** 1-30 Days Obtain appointment with physician or local public health department. Applicants with a reactive serologic test for syphilis must provide to civil surgeon documentation of evaluation for treatment. If any of the venereal diseases are infectious, applicants must present to civil surgeon documentation of completion of treatment. Immunizations Immediate Applicant should be encouraged to go to physician or local health department for Incomplete appropriate immunizations *Mental retardation; insanity: previous attack of insanity; psychopathic personality, sexual deviation, or mental defect; narcotic drug addiction; and chronic alcoholism. **Chancroid; gonorrhea; granuloma inguinale; lymphogranuloma venereum; and syphilis."
}