{
  "anumber": "A90662047",
  "id": "A90662047_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90662047_0016/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Aliens Seeking Adjustment of Status ("
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/7/2023 AIS OMB #1115-0134 U.S. Department of Justice Medical Examination of Aliens Seeking Immigration and Naturalization Service Adjustment of Status (P. L. 99 603) (Please Type or Print Clearly) DATE OF MO DA YR / certify that on the date shown / examined: EXAMIN- ATION 10,287 No. FILE A90 662 047 NAME: LAST FIRST MI DATE OF MO DA YR COUNTRY OF BIRTH: Lopez BoNillA TOMAS BIRTH: 122904 Salvador, CA ADDRESS: STREET CITY STATE ZIP 218 EldERts LANE WoodHAVEN, n.y 11421 GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (check boxes that apply) CLASS A Conditions CLASS B Conditions Chancroid Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Gonorrhea Lymphogranuloma Venereum Other : Hansen's Disease, Not Infectious Granuloma Inguinale Syphilis, Infectious Other Physical Defect, Disease 10/12/87 siding you or Disability: Mental Retardation Previous Occurrence of One Mental Defect X Ray see Insanity or More Attacks of Insanity Narcotic Drug Addiction attached Rept Sexual Deviation Psychopathic Personality Chronic Alcoholism EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST CHEST X-RAY REPORT FROM Doctor FROM Doctor Rulifare (Please Print) (Please Print) MO DA YR MO DA YR REACTION mm NORMAL NO REACTION NOT DONE ABNORMAL NOT DONE 1024 DATE READ DATE READ SEROLOGIC TEST FOR SYPHILIS TEST TYPE RPR TEST TYPE FROM Doctor RNO wh FROM Doctor (Please Print) (Please Print) MO DA YR MO REACTIVE TITER REACTIVE TITER DA YR 101287 NONREACTIVE NONREACTIVE DATE READ DATE READ IMMUNIZATION DETERMINATION ( DTP, OPV, MMR, Td - Refer to PHS Guidelines for recommendations.) Applicant is current for recommended age-specific immunizations Applicant is not current for recommended age-specific immunizations and I have encouraged that appropriate immunizations be obtained REMARKS: X Ray no Evidence of T.B. CIVIL SURGEON REFERRAL FOR FOLLOW UP OF MEDICAL CONDITION The alien named above has applied for adjustment of status. A medical examination conducted by me identified the conditions above which require resolution before medical clearance is granted or for which the alien may seek medical advice. Please provide follow-up services or refer the alien to an appropriate health care provider. The actions necessary for medical clearance are detailed on the reverse of this form. FOLLOW-UP INFORMATION SIGNATURE TITLE MO DA YR The alien named above has complied with recommended health follow-up. APPLICANT CERTIFICATION SIGNATURE MO DA YR I certify that the information contained in this form refers to me. X CIVIL SURGEON CERTIFICATION SIGNATURE TITLE MO DA YR My examination showed the applicant to have met the medical examination and health follow-up requirements for adjustment of status. The Immigration and Naturalization Service is authorized to collect this information under the provisions of the Immigration Reform and Control Act of 1986. Public Law 99-603 The individually identified data requested is required in order for a proper evaluation to be made of your health status. and may be shared with health depart- so ments and other public health or cooperating medical authorities The medical examination must be completed in order for us to process your application Form I-693 (02/14/87) APPLICANT"
}