{
	"anumber": "A91178128",
	"id": "A91178128_0032",
	"page_index": 32,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91178128_0032/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Affidavit of Seasonal Agricultural Employment, I-705 ( (02/21/87)"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1985, 2023, 1984, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/7/2023 C. AGRICULTURAL EMPLOYMENT (Continued) 14. Identify the source of this information by checking the appropriate blocks below and state 15. Please sign and submit copies of the documents how you know the information to be true. identified in item #14 or state the reason(s) for Records kept by: not supplying such documents. Grower, Union, Signed, supporting documentation is attached Farm Labor Contractor or Personal Knowledge Supporting documentation is not attached (explain) Statement: Statement: 16. If the name of the applicant in block #1 is not the name under which the applicant worked as shown in Section C, please: (a) attach a recognizable photograph of the applicant and sign your name in ink across the back of the photograph, or (b) explain how you know that the applicant is, in fact, the person who performed the work. D. I am willing to personally confirm this information, if requested. I declare and affirm under penalty of perjury that the information on this affidavit is true and correct to the best of my knowledge and belief. Signature of Affiant Signature of Applicant Form Shows 1-705 (02/21/87) Engone Ng Instructions for Form I-705 Affidavit of Seasonal Agricultural Employment 1. Preparation of Affidavit: This affidavit is to be completed under oath by agricultural in this affidavit is confidential and may only be used by the producers, their foremen, union officials, farm labor con- Immigration and Naturalization Service in making a deter- tractors, or other persons with specific knowledge of the mination on the application for temporary resident status filed employment history of a person seeking temporary residence by a special agricultural worker. The information furnished shall status as a Special Agricultural Worker (SAW). A separate not be made available to any other government agency. affidavit must be completed for each applicant and must be typewritten or printed legibly in ink. The affidavit must be 4. Work Performed Under an Assumed Name: completed in full. If extra space is needed to answer any item, (a). Instructions for Applicant: attach a continuation sheet and indicate the item number. In cases where you worked under an assumed name, you must Affiants may provide other information not requested on this prove that you are, in fact, the person who used that name. form which may help to establish the performance of qualifying To do this, you should provide a recognizable photograph of employment by the applicant. yourself for identification by the affiant. (b). Instructions for Affiant: 2. Eligibility Criteria for Special Agricultural Workers: If you recognize the applicant from the photograph as the Section 210 of the Immigration and Nationality Act provides person who performed the work, sign the back of the for the granting of temporary residence status to aliens who photograph in ink and attach it to the affidavit. have performed field labor in perishable agricultural com- modities in the United States for at least 90 man-days during 5. Penalties for False Statements: the twelve month period ending May 1, 1986. Aliens who can Whoever provides information in support of an application also document performance of field work in perishable com- under section 210 of the Act and who knowingly and willfully modities for at least 90 man-days in the years ending May 1, conceals or covers up a material fact or makes any false, 1984 and May 1, 1985 will be adjusted to permanent resident fictitious, or fraudulent statements or representations, or makes status one year earlier than those who cannot. A man-day is or uses any false writing or document knowing the same to any day in which not less than one hour of the requisite labor contain any false, fictitious, or fraudulent statement or entry is performed for one or more employers. or creates or supplies a false writing or document for use in making such application will be subject to criminal prosecu- 3. Confidentiality: tion. Such false information is not protected by the confiden- As required by section 210 of the Act, the information provided tiality provisions of section 210 of the Act."
}
