{
	"anumber": "A91318117",
	"id": "A91318117_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0021/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Medical Examination / Aliens Seeking Adjustment of Status"
		},
		"years": {
			"ms_years_nlp_v1": [1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "@U.S. Screened by NARA, 7113/2023987-188-908 U.S. Department of Justice Immigration and Naturalization Service Medical Examinaticion Aliens Seeking Adjustment of Status Instructions To Alien Applying for Adjustment of Status A medical examination is necessary as part of your application The examining physician may refer you to your personal for adjustment of status. Please communicate immediately with physician or a local public health department and you must one of the physicians on the attached list to arrange for your comply with some health follow-up or treatment recommendations medical examination, which must be completed before your for certain health conditions before your status will be adjusted. status can be adjusted. The purpose of the medical examination is to determine if you have certain health conditions which may This form should be presented to the examining physician. You need further follow-up. The information requested is required in must sign the form in the presence of the examining physician. order for a proper evaluation to be made of your health status. The law provides severe penalties for knowingly and willfully The results of your examination will be provided to an Immigration falsifying or concealing a material fact or using any false officer and may be shared with health departments and other documents in connection with this medical examination. The public health or cooperating medical authorities. All expenses in medical examination must be completed in order for us to connection with this examination must be paid by you. process your application. Medical Examination and Health Information A medical examination is necessary as part of your application One of the conditions you will be tested for is tuberculosis. If you for adjustment of status. You should go for your medical exam- are 1.5 years of age or older, you will be required to have a chest ination as soon as possible. You will have to choose a doctor from X-ray examination. Exception: If you are pregnant or applying for a list you will be given. The list will have the names of doctors or adjustment of status under the Immigration Reform and Control clinics in your area that have been approved by the Immigration Act of 1986, you may choose to have either a chest X-ray or a and Naturalization Service for this examination. You must pay for tuberculin skin test. If you choose the skin test you will have to the examination. If you become a temporary legal resident and return in 2 3 days to have it checked. If you do not have any later apply to become a permanent resident, you may need to reaction to the skin test you will not need any more tests for have another medical examination at that time. tuberculosis. If you do have any reaction to the skin test, you will The purpose of the medical examination is to find out if you have also need to have a chest X-ray examination. If the doctor thinks certain health conditions which may need further follow-up. The you are infected with tuberculosis, you may have to go to the local doctor will examine you for certain physical and mental health health department and more tests may have to be done. The conditions. You will have to take off your clothes. If you need more doctor will explain these to you. tests because of a condition found during your medical exam- If you are 14 years of age or younger, you will not need to have a ination, the doctor may send you to your own doctor or to the local test for tuberculosis unless a member of your immediate family public health department. For some conditions, before you can has chest X-ray findings that may be tuberculosis. If you are in become a temporary or permanent resident, you will have to this age group and you do have to be tested for tuberculosis, you show that you have followed the doctor's advice to get more tests may choose either the chest X-ray or the skin test. or take treatment. You must also have a blood test for syphilis if you are 15 years of If you have any records of immunizations (vaccinations), you age or older. should bring them to show to the doctor. This is especially important for pre-school and school-age children. The doctor will You will also be tested to see if you have the human immuno- tell you if any more immunizations are needed, and where you deficiency virus (HIV) infection. This virus is the cause of AIDS. If can get them (usually at your local public health department). It is you have this virus, it may damage your body's ability to fight off important for your health that you follow the doctor's advice and other disease. The blood test you will take will tell if you have been go to get any immunizations. exposed to this virus. Instructions To Physician Performing the Examination Please medically examine for adjustment of status the individual If the applicant has a health condition which requires follow-up as presenting this form. The medical examination should be per- specified in the \"Guidelines for Medical Examination of Aliens in formed according to the U.S. Public Health Service \"Guidelines the United States\" and Supplements, complete the referral for Medical Examination of Aliens in the United States\" and information on the pink copy of the medical examination form, Supplements, which have been provided to you separately. and advise the applicant that appropriate follow-up must be obtained before medical clearance can be granted. Retain the blue copy of the form for your files and return all other copies to If the applicant is free of medical defects listed in Section 212(a) the applicant in a sealed envelope. The applicant should return to you when the necessary follow-up has been completed for your of the Immigration and Nationality Act, endorse the form in the final verification and signature. Do not sign the form until the space provided. While in your presence, the applicant must also applicant has met health follow-up requirements. All medical sign the form in the space provided. You should retain one copy documents, including chest X-ray films if a chest X-ray examina- for your files and return all other copies in a sealed envelope to tion was performed, should be returned to the applicant upon final the applicant for presentation at the immigration interview. medical clearance. Instructions To Physician Providing Health Follow-up The individual presenting this form has been found to have a The requirements for clearance are outlined on the reverse of medical condition(s) requiring resolution before medical clear- this page. When the individual has completed clearance re- ance for adjustment of status can be granted. Please evaluate quirements, please sign the form in the space provided and the applicant for the condition(s) identified. return the medical examination form to the applicant. Form I-693 (Rev. 09/01/87) N"
}
