{
	"anumber": "A91318117",
	"id": "A91318117_0062",
	"page_index": 62,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0062/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023, A91 318 117 -692"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1982, 1981, 1986, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Attachment to Form I-692 A91 318 117 On June 2, 1988 you filed an application to classify yourself as a temporary resident under section 245A of the Immigration Reform and Control Act of 1986. 8 CFR 245a. (2) states in part: Eligibility. The following categories of aliens, who are otherwise eligible to apply for legalization, may file for adjustment to temporary residence status: (2) An alien who establishes that he or she entered the United States as a nonimmigrant prior to January 1, 1982, and whose period of authorized admission expired through the passage of time prior to January 1, 1982, and who has thereafter resided continuously in the United States in an unlawful status, and who has been physically present in the United States from November 6, 1986, until the date of filing the application. 8 CFR 245a. (d) states in part: \"(5) Burden of Proof. An alien applying for adjustment of status under this part has the burden of proving by a preponderance of the evidence that he or she has resided in the United States for the requisite periods, is admissible to the United States under the provisions of section 245a of the Act, and is otherwise eligible for adjustment of status under this section. The inference to be drawn from the documentation provided shall depend on the extent of the documentation, its credibility and amenability to verification n '(6) Evidence. The sufficiency of all evidence produced by the applicant will be judged according to its probative value and credibility. To meet his or her burden of proof, an applicant must provide evidence of eligibility apart from his or her own testimony. In judging the probative value and credibility of the evidence submitted, greater weight will be given to the submission of original documentation 11 According to your legalization application and I-94 you entered the United States on January 19, 1981 as a B-2, nonimmigrant visitor until February 18, 1981 with no absences since that date. In order to meet the requirement for legalization, the applicant must submit a completed medical form (I-694) by a designated civil surgeon at their expense. As of this date, you have not submitted one."
}
