{
	"anumber": "A91318117",
	"id": "A91318117_0031",
	"page_index": 31,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0031/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service"
		},
		"years": {
			"ms_years_nlp_v1": [1989, 1988, 2023, 1986]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice Immigration and Naturalization Service PLACE BAR P.O. Box 590 CODE HERE Williston, VT 05495 Date: JUN 3 0 1989 Name and Address of Applicant: File No. : A91 318 117 Medarda VALERIO LAMBERT 2217 8th Ave., , #3J New York, NY 10026 Dear Ms. Valerio Lambert: PLEASE RESUBMIT THIS LETTER with the required documentation to the address above within 30 days (from date of this letter) . This is your notification of this Service's intent to deny the application for Temporary Resident Status which you filed on April 15, 1988 under Section 245A of the Immigration Reform and Control Act of 1986. As a result of the Service's attempt to verify your residence, it was found that: On March 20, 1989 you were sent a request for additional information. In this request you were advised that; evidence submitted in support of your application establishes your eligibility for benefits under the Immigration Reform and Control Act. However, you must submit a satisfactory medical report before a final decision can be made on your application. As of June 12, 1989 the Service has not received your response to the above request. This Service will not make a final decision on your application for thirty (30) days. During that time you may submit any evidence that you feel will overcome the above stated reasons for denial. If your response is not received by this office within thirty (30) days, your application will be denied pursuant to 8 CFR 103.2 (b) (2). THIS LETTER CONTAINS YOUR INDIVIDUAL BAR CODE AND MUST BE RETURNED WITH THE INFORMATION REQUESTED. Sincerely, David W. Wolfe Director, Regional Processing Facility"
}
