{
  "anumber": "A91318117",
  "id": "A91318117_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, Form I-694"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 INSTRUCTIONS Form l-694 1. FILING AN APPEAL: 3. COUNSEL: This form must be mailed to the address given on the In presenting and prosecuting this appeal the appel- \"Notice of Denial\", and must be received within 30 days of the date on that notice. No extensions will be lant may, if he or she desires, be represented at no granted. expense to the Government by counsel or other duly authorized representatives. 2. BRIEFS: A brief in support of an appeal is not required, but may be desired. If a brief is to be submitted, it must be submitted with this appeal form. No extensions will be 4. FEE: granted. A fee of fifty dollars ($50.) must be paid for filing this ORAL ARGUMENT: appeal. It cannot be refunded regardless of the action Oral argument before the Commissioner or an officer taken on the appeal. A separate cashier's check or designated by him may be requested by letter money order must be submitted for each application. attached to this notice. The letter must set forth the All fees must be submitted in the exact amount. The reasons oral argument is desired in support of or in place of a brief. Oral argument will be denied in any fee must be in the form of a cashier's check or money case where the appeal is found to be frivolous, where order. No cash or personal checks will be accepted. oral argument will serve no useful purpose or where The cashier's check or money order must be payable written material or representations will appropriately to \"Immigration and Naturalization Service\" unless serve the interests of the appelant. If oral argument is the appellant resides in the Virgin Islands or Guam. granted, it must be held in person. The officer to (Appellants residing in the Virgin Islands make whom the appeal is taken will designate in writing the time, date, and place of the oral argument. Oral cashier's check or money order payable to \"Com- argument in any one case will be limited to fifteen (15) missioner of Finance of the Virgin Islands\". Appellants minutes, unless justification and arrangements for residing in Guam make cashier's checks or money additional time are made in advance. orders payable to \"Treasurer, Guam\".) U.S. GOVERNMENT PRINTING OFFICE : 1987 o - 178-787"
}