{
	"anumber": "A91318117",
	"id": "A91318117_0037",
	"page_index": 37,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0037/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023, A91 '318 117"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice Immigration and Naturalization Service PLACE BAR P.O. Box 590 CODE HERE Williston, VT 05495 Date: March 20, 1989 Name and Address of Applicant: File No.: A91 318 117 Medarda VALERIO LAMBERT 2217 8th Avenue, #3J New York, NY 10026 Your application for temporary resident status cannot be processed until you have complied with the instructions on this form. THE INFORMATION YOU SUBMIT WITH THIS LETTER IS CONFIDENTIAL. Please resubmit THIS LETTER with the required documentation to the address above within 45 days from this date. SECTION 1. [You must prove continuous residence in the U.S. since before 1/1/82 to the date you filed your application in order for your case to be approved. The documents you submitted do not prove residence for the entire period of time required. Please submit further proof of residence for these specific periods of time; from to Evidence to establish residence in the United States may include, but is not limited to: employment records, W-2 Forms, utility bills (gas, electric, phone, etc.), receipts, or letters from companies showing the dates during which the applicant received service, school records (letters, report cards, etc.) from the schools that the applicant or his or her children have attended in the United States showing the name of school, name and, if available, address of student, and periods of attendance and hospital or medical records showing similar information; attestations by churches, unions, or their organizations to the applicant's residence by letter which identify applicant by name, are signed by an official (whose title is shown) show inclusive dates of membership, state the address where applicant resided during the membership period, include the seal of the organization impressed on the letter, establish how the author knows the applicant, and the origin of the information; and additional documents that could show that the applicant was in the United States at a specific time; such as: money order receipts for money sent out of the country, passport entries, birth certificates of children born in the United States, bankbooks with dated transactions, letters of correspondence between the applicant and another person or organization, Social Security card, Selective Service card, automobile license receipts or title, vehicle registration, deeds, mortgages, contracts to letters, and any other document that will show that applicant was in the United States at a specific time. ]"
}
