{
  "anumber": "A91318117",
  "id": "A91318117_0076",
  "page_index": 76,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91318117_0076/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Temporary Residence Application, I-687 ( (04/01/87)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 43. Applicants for status as Temporary Residents must establish that they G. Aliens who have been convicted ofla violation of any law or regulation are admissible to the United States. Except as otherwise provided by relating to narcotic drugs or marihuana, or who have been illicit law, aliens within any of the following classes are not admissible to the traffickers in narcotic drugs or marihuana. United States and are therefore ineligible for status as Temporary Residents. H. Aliens who have been involved in assisting any other aliens to enter A. Aliens who have committed or who have been convicted of a crime the United States in violation of the law. involving moral turpitude (does not include minor traffic violations). B. Aliens who have been engaged in or who intend to engage in any I. Aliens who have applied for exemption or discharge from training or commercialized sexual activity. service in the Armed Forces of the United States on the ground of C. Aliens who are or at any time have been anarchists, or members of or alienage and who have been relieved or discharged from such training affiliated with any Communist or other totalitarian party, including any or service. subdivision or affiliate thereof. D. Aliens who have advocated or taught, either by personal utterance, or J. Aliens who are mentally retarded, insane, or who have suffered one or by means of any written or printed matter, or through affiliation with an more attacks of insanity. organization: 1) Opposition to organized government; K. Aliens afflicted with psychopathic personality, sexual deviation, mental 2) The overthrow of government by force or violence; defect. narcotic drug addiction, chronic alcoholism or any dangerous 3) The assaulting or killing of government officials because of their contagious disease. official character; 4) The unlawful destruction of property; L. Aliens who have a physical defect, disease or disability affecting their 5) Sabotage, or: ability to earn a living 6) The doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States. M. Aliens who are paupers, professional beggars or vagrants. E. Aliens who intend to engage in activities prejudicial to the national N. Aliens who are polygamists or advocate polygamy. interests or unlawful activities of a subversive nature. F. Aliens who, during the period beginning on March 23, 1933, and O. Aliens likely to become a public charge. ending on May 8, 1945, under the direction of, or in association with: 1) The Nazi government in Germany; P. Aliens who have been excluded from the United States within the past 2) Any government in any area occupied by the military forces of the year, or who at any time within 5 years have been deported from the Nazi government in Germany; United States. 3) Any government established with the assistance or cooperation of the Nazi government of Germany; Q. Aliens who have procured or have attempted to procure a visa by fraud 4) Any government which was an ally of the Nazi government of or srepresentation Germany; ordered incited, assisted or otherwise participated in the persecution of R Aliens who are former exchange visitors who are subject to but have any person because of race, religion, national origin, or political opinion. not complied with the two-year foreign residence requirement Do any of the above classes apply to you? No Yes (If \"Yes\", explain on a separate sheet of paper.) 44. If your native alphabet is in other than Roman letters, write your name in your native alphabet. 45. Language of native alphabet DRANISH 46. Signature of Applicant - / CERTIFY, under penalty of perjury under the laws of the United States of America that 47. Date (Month/Day/Year) the foregoing is true and correct. I hereby consent and authorize the Service to verify the information provided, and to conduct police welfare and other/recard checks pertinent to this application. +6/2/88 de Orlanacion Emigrante, Inc. (AYUDANOS 1-22-88 48. Signature of person preparing form, if other than applicant. / DECLARE that this document was prepared by me 49. Date (Month/Day/Year) at the request of the applicant and is based on all information of which Nhave any knowledge. NEW YORK N Y. 10034 Barbara Melhinado 1-22-88 50. Name and Address of person preparing form, if other than applicant (type or print). 51. Occupation of person QDE No. 0035600 preparing form COMMUNITY QUALIFIED DESIGNATED ENTITY USE ONLY 52. Reviewed by (Print or Type Name) 53 Signature 54. Date JUANA not ONLY mola IMMIGRATION AND NATURALIZATION SERVICE USE Juana 04/04/188 55. Recommendation: Temporary Residence 56. Waiver of Excludability under Approved Denied Section 212 (a) is Approved Denied 57. Class of Admission 58. Place of Adjustment 59. Date of Adjustment TW2 OXMA-R 62. 4/15/88 60. Recommended by (Print or type Name and Title) 61. Signature LINDA Final Action: Temporary Hotaker Residence Ads \"Lunda Delabe ID No. 63. #1) Date 6/2/88 64. 65 Regional Director Tabor 6. ID No. 67. Date ocessing Facility KEDB OCT 17 1988 Approved Denied Form I-687 (04/01/87) Page 4 * U.S. Government Printing Office: 1987-175-862"
}