{
  "anumber": "A91807746",
  "id": "A91807746_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0049/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, Form 1-48"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 Form approved. Budget Bursau No. 43-R343. No. AFFIDAVIT OF WITNESS IN THE MATTER OF THE APPLICATION OF MARIA BRAVO File No. AFFIDAVIT FOIA (b) (6) FOIA (b)(6) , occupation FOIA (b)(6) residing at (Number and street) (City or town) (State) (ZIP Code) is being duly sworn, deposes and says that (s)he Xsnot XXX a citizen of the United States of America; that (s)he has personally known and has been acquainted in the United States with MARIA BRAVO , the applicant above mentioned; that to this personal knowledge the applicant has resided in the United States as follows: her MONTEBELLO CALIFORNIA from 10 82 to PRESENT (City, town. and State) (Month) (Year) (Month) (Year) from to (City, town. and State) (Month) (Year) (Month) (Year) from to (City. town. and State) (Month) (Year) (Meath) (Year) from to (City. town, and State) (Month) (Year) (Meast) (Year) that (s)he is able to determine the date of the beginning of acquaintance with the applicant in the United States from the following fact(s): I met Maria when we were shopping for groce- ries. We became friends and we have kept our good relationship all over the ; years visiting one each other from time to time. - that (s)he has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is o (Y ears) 0 (Months) OFFICIAL SEAL IVANIA RIVAS Notary Public-California LOS ANGELES COUNTY FOIA (b)(6) My Comm. Exp. June 7, 1991 Subscribed and sworn to before me by the above-named witness at this 20 day of February 19 88 Form 1-688 (Signature of attentor) UNITED STATES DEPARTMENT or JUSTICE Immugration and Naturalization Service Nolary Public (Rev. 10-1.78)N (Title of attessor)"
}