{
	"anumber": "A91807746",
	"id": "A91807746_0078",
	"page_index": 78,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0078/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Oath or Affirmation of Dependent, NARA Form 1024"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1912, 2023, 1991]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 I have stocks and bonds with th wing market value, as indicated on the ed list which I certify to be true and conce . the best of my knowledge and belief. $ 5,000 I have life insurance in the sum of $ 50,000 With a cash surrender value of I own real estate valued at $ 150,000 With mortgages or other encumbrances thereon amounting to $ 50,000 Which is located at 1642 S. New Hampshire Avenue, Los Angeles, CA 90006 (Street and Number (City) (State) (Zip Code) 8. That the following persons are dependent upon me for support: (Place an \"X\" in the appropriate column to indicate whether the person named is wholly or partially dependent upon you for support.) Name of Person Wholly Dependent Partially Dependent Age Relationship to Me none 9. That I have previously submitted affidavit(s) of support for the following person(s). If none, state \"None\" Name Date submitted none 10. That I have submitted visa petition(s) to the Immigration and Naturalization Service on behalf of the following person(s). If none, state none. Name Relationship Date submitted none (Complete this block only if the person named in item 3 will be in the United States temporarily.) That I do intend do not intend, to make specific contributions to the support of the person named in item 3. (If you check \"do intend\", indicate the exact nature and duration of the contributions. For example, if you intend to furnish room and board, state for how long and, if money, state the amount in United States dollars and state whether it is to be given in a lump sum, weekly, or monthly, or for how long.) SEAL OFFICIAL SEAL GEORGE A AUBERT NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY OATH OR AFFIRMATION OF DEPONENT My comm. expires MAR 29, 1991 Tacknowledge at that I have read Part III of the Instructions, Sponsor and Alien Liability, and am aware of my responsibilities as an immigrant sponsor under the Social Security Act, as amended, and the Food Stamp Act, as amended. I swear (affirm) that I know the contents of this affidavit signed by me and the statements are true and correct. Signature of deponent Ivania Rivas Subscribed and sworn to (affirmed) before me this 19th day of march 88 at Los angeles, California .My commission expires on March 29,1991 Signature of Officer Administering Oath George a centul Title Alctary Public If affidavit prepared by other than deponent, please complete the following: I declare that this document was prepared by me at the request of the deponent and is based on all information of which I have knowledge. 1912 So. Vermont 3/19/88 (Signature) (Address) (Date)"
}
