{
  "anumber": "A91807746",
  "id": "A91807746_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice Immigration and Naturalization Service 4.0 OMB #1115-0009 Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Part 1. Information about you. / Receipt 2 Family Name Bravo Reyes Given Middle Name Maria Initial U.S. Mailing Address - Care of Resubmitted Street Number 23331 Via Burriana, Apt. and Name City Mission Viejo. County Orange 07/17/97 12:30 N400 State Ca. ZIP Code 92691 Reloc Sent 95.00 Date of Birth (month/day/year) 2-13-12 Country Nikaragua of Birth Social Security # 616-26-3392 X091807746 Reloc Rec'd Part 2 Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. 9-28-95 and have attached completed Forms N-426 and G-325B Other. (Please specify section of law) At interview e. request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. FP waived 15+ 11-24-89 W16 LOS Citizenship Nicaraguan 316c91 Name on alien registration card different than in Part 1) - S/R ARC Same - N648 ACCEPTED ON FILE Other names used since you became a permanent resident (including maiden name) None SPANISH TRANSLATOR Sex Male Height Marital Status: Single Divorced Female 4-11 Married Widowed Can you speak, read and write English ? No Yes. 31E WAIVER Action Absences from the U.S.: APPROVED I.N.S. DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" , complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate SEP 2 8 1998 paper. DAMO2 Did absence last Recommenned by. Date left U.S. Date returned 6 months or more? Destination Reason for trip LOS 8435 Yes No 2 Yes No To Be Completed by Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}