{
  "anumber": "A91807746",
  "id": "A91807746_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0013/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medica' Certification for Disability Exceptions, N-648 (01/23/97"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice OMB 1115-02 Screened by NARA, 7/13/2023 Immigration and Naturalization Service Medics' Certification for Disability Exceptions Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please prins or type information) Last Name First Name Middle Name Social Security Number BRAVO MARIA 616-26-3392 Address Alien Number 23331 ViA BURRIANA 091807746 City State Zip Code MISSION VieJo CA 92691 Telephone Number Date of Birth Sex (949) 588-0923 2-13-1912 FemALe I, MARIA BRAVO authorize DAVID M. LECHUGA, Ph.D. (Applicant's Name) (Licensed medical doctor or licensed clinical psychologist) to release all relevant physical and mental health information related to my medical status to the INS for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information on the form and any evidence submitted with it is all true and correct. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. Signature Maria Bravo Date 9-25-98 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U.S. history and civics tests required of applicants for naturalization. The Immigration and Naturalization Service's regulations require that applicants for an exception based on disability submit this certification form, completed by a licensed medical doctor or licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complete words and phrases. 1. Date of your most recent examination of the applicant. 9/25 19 98 2. Is this your first examination of the individual? Yes No x If yes, who is the regular attending physician? Hector RAmirez 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, in your professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English language and/or U.S. history and civics. Describe in detail. If applicant has a mental disability or impairment, please provide DSM diagnosis. Applicant has history of developmental disability. This 06 has precluded normal interpersonal relationships. academic The work & employment. She is impletely dependent upon 9/28/69 her family for everything but basic activities of daily living Current neuroprychological findings suggest that applicant is demented with a history of mental retaidation She cannot process language on verbal information - written OR aurally presented She is unable to demonstrate basic knowledge of English as A language Form N.648 (01/23/07)"
}