{
	"anumber": "A91807746",
	"id": "A91807746_0046",
	"page_index": 46,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0046/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "AFFIDAVIT OF WITNESS, I-488"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1988, 1970, 1973, 2023, 1983]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 Form approved. Budget Burcau No. 43-R343 No. AFFIDAVIT OF WITNESS IN THE MATTER OF THE APPLICATION OF Maria Bravo } File No. AFFIDAVIT FOIA (b)(6) FOIA (b)(6) occupation residing at FOIA (b)(6) (City or town) being duly sworn, deposes and says that (s)he is (State) (ZIP Code) IS not a citizen of the United States of America; that (s)he has personally known and has been aquainted in the United States. with Maria Bravo. his 3 the applicant above mentioned; that to her personal knowledge the applicant has resided in the United States as follows: 225-11-2 gind St.mon66ello- Cold from 9.640 (City, town, and State) 1983 to Present 1642 S. New Aue L.A. CA from Hampshire (Month) 'Year) (Month) (Year) (City, town, and State) 1973 to 1983 1702 S. new Ave LA. CA Hampshire (Month) (Year) (Month) (Year) from 1970 (City, town, and State) to 1973 (Month) (Year) (Month) (Year) (City, town, and State) from to (Month) (Year) that (s)he is able to determine the date of the beginning of his (Month) (Year) her acquaintance with the applicant in the United States from the following fact(s): daily contact : that (s) he has personal knowledge that the applicant is a person of good moral character, and that the longest period during the residence described in which (s)he has not seen the applicant is 2 months. (Years) (Months) FOIA (b)(6) Subscribed and sworn to before me by :he above-named witness at this # day of February Anno Domini 1988. Form I-488 (Signature of attestor) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service (Rev. 1-1-66) (Title of attestor)"
}
