{
	"anumber": "A91807746",
	"id": "A91807746_0024",
	"page_index": 24,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0024/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "NOTICE OF ENTRY, Form G-28"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 NOTICE OF ENTRY APPEARANCE AS ATTORNEY OR r RESEN, ATIVE DATE In re: 05/03/88 Sec. 245a Legalization FILE No. Maria Brovo Reyes I hereby enter my appearance as attorney for (or representative of), and at the request of, the following named person(s): NAME Petitioner Applicant Maria Bravo Reyes Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) 225 N. 2nd St. Montebello, CA 90640 NAME Petitioner Applicant Beneficiary ADDRESS (Apt. No.) (Number & Street) (City) (State) (ZIP Code) Check Applicable Item(s) below: 1 I am on attorney and a member in good standing of the bar of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia and am not under a (Name of Court) court or administrative agency order suspending, enjoining, restraining, disbarring, or otherwise restricting me in practicing law. 2. I am on accredited representative of the following named religious, charitable, social service, or similar organization established in the United States and which is so ecognized by the Board: CATHOLIC CHARITIES IMMIGRATION & CITIZENSHIP DIVISION 3. I am associated with , the attorney of record who previously filed a notice of appearance in this case and my appearance is at his request. (If you check this item, also check item 1 or 2 whichever is appropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS CATHOLIC CHARITIES IMMIGRATION & CITIZENSHIP DIVISION Girls a Lame 1400 W. 9th St. P.O.Box 15095 Los Angeles CA 90015-0095 NAME (Type or Print) TELEPHONE NUMBER (213) 251-3435, 251-3443, Zoila Torres 251-3449, 251-3471, 251-3482. 251-3485 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTAINING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: Zoila Torres (Name of Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE Maria Bravo Maria Bravo 05/03/88 ( (NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented is a citizen of the United States or an alien lawfully admitted for permanent residence.) Form G-28 UNITED STATES DEPARTMENT OF JUSTICE (OVER) (Rev.10-25-79)N Immigration and Naturalization Service For sale by the Superintendent of Documents, U.S. Government Printing Office. Washington, D.C. 20402 Stock Number 027-002-00218-1"
}
