{
	"anumber": "A91807746",
	"id": "A91807746_0017",
	"page_index": 17,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0017/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Screeneded by NARA, 7/13/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1998]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 N97050577 A # 91-807-746 (714)588-0923 09/14/98 MARIA BRAVO REYES 23331 VIA BURRIANA MISSION VIEJO, CA92691 Catholic DEAR MARIA BRAVO REYES Charities of You have been selected to take part in a citizenship Orange County program conducted by the INS. INS Off-site Interviews at: Catholic Charities of Orange 1506 Brookhollow Dr. Suite 112 Santa Ana, CA 92705 1506 Brookhollow Drive Suite 112 The date of the interview will be: September 28, 1998 Santa Ana California 92705 YOUR APPOINTMENT TIME IS AT: 01:00PM If you do not keep the appointment, your application will Tel: (714) 662-7500 be processed in the regular method and you will be Fax: (714) 662-1861 interviewed at the INS office in Los Angeles. We hope TDD: (714) 979-2961 this program will be more convenient for you. E-Mail CCOC @ You are required to bring the following with you for the IX.NETCOM.COM interview: * This letter Alien registration card * Any evidence of Selective Service Registration Casa Santa Maria * Any documents you have which you ust in cor ction Columbian House with any entries into the United States Community Social Action * Any ID or Drivers license Deaf Advocacy Center Elder Services If married/divorced and spouse is US citizen, bring Employment Services marriage/divorce certificate. Family Support Center Immigration & Please keep this appointment, even if you do not have all Citizenship Services the items noted above. Outreach to the Poor and Homeless Professional Counseling PLEASE DO NOT BRING CHILDREN TO THE INS INTERVIEW Resettlement Services Summer Camp We are offering a 3 hour Interview preparation class. If you are interested, please call us for more information. If you change your address before your interview appointment date, please let us know your new address and telephone number as soon as possible. A United Way Agency Sincerely ACCREDITED Thu Tran Program Director COUNCIL ON ACCREDITION OF SERVICES FOR FAMILIES AND CHILDREN INC."
}
