{
	"anumber": "A92037324",
	"id": "A92037324_0018",
	"page_index": 18,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92037324_0018/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Memory Loss and Chronic Illness Continuation of #3, Part II, NARA 427012C"
		},
		"years": {
			"ms_years_nlp_v1": [1994, 1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "TIEP KiM NGUYEN M.D., INC. BELLAIRE MEDICAL CLINIC ATTACHMENT TO THE N-648 OF 12650 SHERMAN WAY, SUITE 3 NORTH HOLLYWOOD CA 91605 Ms. Candelaria Espinoza Alien # A 092 037 324 (818) 764-5775, (818) 503-1010 CONTINUATION OF #3, PART II Origin: (continued) The memory loss is part of her progressive dementia secondary to chronic hypertension and aging process. This is due to loss of elasticity, hardening and lipids, blood prod- ucts and tissue debris stick to the arterial walls which results in poor blood flow to the heart and brain. Thus she feels dizzy, confused, chest pain and occasionally faints. Her mental impairment apparently has its origin from severe stress from her multiple chronic deadly and incurable disease. Gradually she suffered a heart attack, broken spine and recently lymphoma which has been under radiotherapy since August, because patient could not tolerate chemotherapy, its specific treatment. (lymphoma: a cancer of lymphatic Nature; tissue, usually malignant The patient memory impairment has caused her to confuse names of relatives, to forget some minor events. She also had many episodes of missing appointment, misplacement of personal belongings, letting the gas and light on. This memory disturbance has resulted in decreased ability of Ms. Espinosa to perform her own basic activities of daily living for the past five years. Symptoms were mild initially but persistent and progressively worsening though the years and more SO following a heart attack, a fracture of the spine from a fall due to fainting spell and a lymphoma diagnosed in July of this year. On mental status examination, she is oriented to time and person. She has difficulty recalling minor events since 1994. She is poor in general fund of knowledge, concentration, intel- lectual, cognitive function, insight and judgment. She has a depressed mood characterized by a constant sadness, an inability to concentrate, extreme fatigue, and a sense of hope- lessness. She also expressed suicidal ideation. I have lived too long, I better die \", said Ms. Espinosa. She becomes more depressed when an examiner told her that she does not need citizenship status on previous interview. Extent: The patient is a 83 year old who has chronic hypertension with symptoms of dizziness, pal- itation, headaches, fainting spells. She had a heart attack five years ago hospitalized first in Pacific then transfered to Northridge hospital. She had frequent fainting spells. She was last hospitalized in July 1999 for one month for fracture of the spine following a fall. She was also diagnosed with lymphoma in July 1999 and currently on radiotherapy since she could not tolerate chemotherapy. As a result she experienced extreme fatigue, headaches, swelling and pain of right leg with difficulty ambulation. Her headaches, dizziness, palpitation, anxiety make it impossible for her to concentrate enough to learn new language and retain new information. The combination of extreme fatigue, syn- copal tendencies, back and leg pain with impaired mobility and inability to concentrate prevents her from leaving home by herself to attend English and Civics classes. Her over- all health is very fragile and she is constantly tired. It is not recommended that Ms. Espinosa exert herself physically or mentally if it would caused stress. Given her fragile condition, attempting to learn English and Civics would greatly increased the risk of another heart attack. Moreover, her attempts to learn English and CIvics has been unsucc- essful because she is often delusional and is unable to concentrate on the task at hand. She cannot retain the information for very long before scrambling it with other thoughts. In conclusion, I believe that it would be impossible for Ms. Espinosa to complete the study necessary to learn English or U.S. History and Civics for naturalization. Ms. Espinosa should be receive the full disability waive Signature: Date: 10-18.99 Civil Surgeon: TIEP KIM NGUYEN, M.D. California License: A 39091"
}
