{
  "anumber": "A92050561",
  "id": "A92050561_0095",
  "page_index": 95,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92050561_0095/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "hombre"
    },
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificado de Nacimientos, 16220692"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 No 1606963 SAUADOR EN ADE LITTLE 1979 1979 DE EL 640 25 SECURITY SECURITY CORIE CUENTIS CUARENTA CENTAVOS DE T.R. 1620692 1 EL INFRASCRITO ALCALDE MUNICIPAL, 2 CERTIFICA: que 8 fólio uno vuelto del Libro del Registro Civil- 3 de Nacimientos que esta Alcaldía llevó durante el año de mil nove- 4 cientos quince, se encuentra la Fartida que literalmente dice.\" 5 Enero 13.- P.No. 2.-MARIA LEONOR 6 AYALA, hembra, ladina, Salvadoreña, nació viva y única en el Cen- 7 tro de esta población, hija legítima de Valentín Ayala y María Ze- peda de este orígen y domicilio. - -Déndolos estos datos el seor Ma - 8 riano Zepeda quien no firma por no saber y le hace a su ruego el 9 que aparece.-Alcaldia Municipal: Mercedes La Ceiba, a las cuatro 10 dela tarde del día trece de Enero de mil novecientos quince.-Rose- 11 Molins.- Nemecio Montoya.- Valerio C.Marín-Srio. 12 RUBRICADAS. - 13 14 ES CONFORME CON SU ORIGINAL CON EL CUAL SE CONFRONTO, y para los 15 efectos legales consiguientes se le expide la presente en la Alcal 16 día Municipal de Mercedes La Ceiba, a veintisiete de Marzo de mil- 17 novecientos ochenta.- \"nmendados -INFRASCRITO--veintisiete-Valen.- 18 Victorian THatine Victoriano Martinez, 19 Alcalde Municipal.- 20 Dagoberto Molina Cortez, four 3 21 I Certify that 1 have compared Secretario Municipal.- 22 it is a_true 23 Marshall Law 3/11/87 24 5757 Angeles, CA 90045 Admitted to Practice in California"
}