{
	"anumber": "A92050561",
	"id": "A92050561_0091",
	"page_index": 91,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92050561_0091/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "YAL MARIA L DISCHARGE RECO, 2"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "YSICIAN'S DISCHARGE RECC NDATIONS DISCH Screened by NARA 7/13/2023 AMBULATION: Fully Ambulatory Progressive Ambulation Cannot Climb Stairs Needs Bed Care Medical Restriction: Cart on K arm WORKING ABILITY: May Patient Return to Usual Occupation? Yes No Length of Disability 8 weeks If Disability Permanent, Does Patient Have Rehabilitative Potential? Yes No DIET: Regilar DRESSINGS, APPLIANCES, as Tolarted OR TREATMENTS. Calories: Sodium Content: MEDICATIONS, Give Directions. FOR NURSING Indicate items given. @arm cost Presuptions for - + Certify that + have compared this copy with its original and that Coluce Tylend # 3 it is a True and complete copy. Marshall Signed Date 8/11/87 Delestin, Attorney at Law 5757 W. Century Blvd. #700, Los Angeles, CA 90045 Admitted to Practice in California SIGNATURE: RECOMMENDED CLINIC APPOINTMENTS: Make applies for (SPECIFY APPOINTMENT DATE) CLINIC & INIT 20 Dr Shanfield or tho Cline Friday 10/38 @ 1200 Medicine Clime heat week as suggested Medium 12-2-2 y Dr Mendel (cardiology consultant) @ 12 00 NOON 4P1. go 10/22/81 SIGNATURE: Jonalue DISCHARGE PATIENT ON: DATE DISCHARGE PATIENT TO: Nursing Home: Closed Open Duration Own Home Another Hospital Board & Care Home: Closed Open Duration Other Penn / Shu fuld 10/22/81 SIGNATURE OF RESIDENT IN CHARGE OF CASE IGNATURE OF PHYSICIAN COMPLETING REPORT DATE STATUS OF PATIENT (To Be Completed by Nursing Staff) 10-22-81 Date: Follow Simple Instructions: Yes No Patient's Behavior Corperature Speaks English Yes No Spanish Yes No Other Speech: Normal Other Vision: Normal Glasses Contact Lenses Glass Eye Other: Hearing: Normal Hearing Aid Control Bladder & Bowels: Incontinent: Urine Feces Retention Catheter Ostomy: No Yes Specify Feed Self: Yes No Bathe Self: Yes No Dress Self: Yes No Dentures: Upper Lower None Walk Alone: Yes No Uses: Cane Crutches Walker Aid Prothesis Wheelchair: Yes No Pushes Self Transfers Self Nails (hand & feet) Clean: Yes No Hair Combed & Clean: Yes No Condition of Skin for Allergies: No Yes, (Specify) Decubiti: No Yes, (describe) Unhealed Wounds: No Yes, (describe) Instructed & Understands Diet Yes No Activity: Yes No / Limitations Yes wen stay, a Remarks, They he cline gift LUE (NURSE'S SIGNATURE) laws Patient's Discharge Address: IDENTIFYING DATA: 4307 Garden Homes ave il Serino L'A 90032 for 223-4628 (NUMBER) home (STREET) (CITY) (STATE) (PHONE) (NAME OF INSTITUTION) AID: No 567.889520 Yes Bepti NAME State I.D. No. Social Sec. No. Dina Religion: Person to Notify daing RELATIONSHIP sance as pt P.F. AYALA MARIA L PHONE ADDRESS 31 15 F 2 10-22-31 642 92 42 SP DISCHARGE DATE: WARD OR CLINIC o PATIENTIC papy 54741-1"
}
