{
	"anumber": "A92050561",
	"id": "A92050561_0025",
	"page_index": 25,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92050561_0025/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 2019, 1998, 1915]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 955 Immigration and Naturalization U 213/777-789 OMB #1115-0009 Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Part 1. Information about you. Returned Receipt Family Given Middle Name AYALA Name MARIA Initial Y U.S. Mailing Address - Care of Resubmitted Street Number 151 W. 95th ST. Apt. and Name # City County Los Angeles State Los Angeles ZIP CALIFORNIA Reloc Sent Code 90003 Date of Birth 1/13/1915 Country (month/day/year) of Birth Salvadou Social A Security # 572-99-1857 # A- 092050561 Reluc Rec'd 02/25/95 11:27 Part 2. Basis for Eligibility (check one). 400 a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant C. I am a permanent resident child of United States citizen parent(s) Interviewed d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. 2019 and have attached completed Forms N-426 and G-325B c. Other. (Please specify section of law) At interview request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent 2 Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 05-06-89 W/6 LOS 31 6(a) Citizenship E/ SAlvAdoR Name on alien registration card (if different than in Part 1) AYALA- BARAHONA, MARIA Other names used since you became a permanent resident (including maiden name) MARIA LEONOR AYALA Sex Male Height Marital Status: Single Divorced Female 5-00 Married Widowed Can you speak, read and write English No Yes. Action Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes. MAR 1 3 1998 N-youdening If you answered \"Yes\" . complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate Does not speak paper. on understand Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip English. 2-8-93 2-17-93 Yes No ISRAE/ Relicious 2-10-94 2-10-94 Yes No Shopping To Be Completed by TIJUANAL Attorney or Representative, if any 11-20-93 11-20-93 Yes No Shopping Fill in box if G-28 is attached to represent the applicant 7-2-94 7-30-94 Yes No El Salvador VACATION VOLAG# Yes No Yes No ATTY State License H Form N-400 (Rev. 07/17/91)N Continued on back."
}
