{
	"anumber": "A92037324",
	"id": "A92037324_0041",
	"page_index": 41,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92037324_0041/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "San Fernando Valley Neurologic Medical Group, Inc."
		},
		"years": {
			"ms_years_nlp_v1": [1997]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "San Fernando Valley Neurologic Medical Group, Inc. Neurology - Electromyography - Electroencephalography - Evoked Response 18370 Burbank Boulevard, Suite 107 SHELDON A. MICHEL, M.D. Tarzana, California 91356 (818) 996-3880 DIPLOMATE IN NEUROLOGY AMERICAN BOARD OF PSYCHIATRY AND NEUROLOGY FAX (818) 996-1679 MICHAEL A. WIENIR, M.D. DIPLOMATE IN NEUROLOGY AMERICAN BOARD OF PSYCHIATRY AND NEUROLOGY ADDED QUALIFICATIONS IN CLINICAL INEUROPHYSIOLOGY GEORGE CHOW, M.D. DIPLOMATE IN NEUROLOGY AMERICAN BOARD OF PSYCHIATRY AND NEUROLOGY August 17, 1997 Cande Espinoza Dear Mrs. Espinoza: I just returned from San Francisco. Your neck x-rays (cervical spine) show plenty of arthritic changes producing pinching of the nerves. Your brain MRI scan shows no brain tumor, but there are some small little mini-strokes. Your MR angiogram of the blood vessels that feed the brain indicate \"tortuosity\" and \"irregularity\" of the carotid artery, but this is unlikely to be clinically significant. The blood tests reveal an elevated blood sugar of 133. Your cholesterol is somewhat high at 212, but, more importantly, your \"bad cholesterol\" is definitely elevated, and this places you at risk for heart attacks and stroke. Your thyroid levels are, fortunately, good, but your vitamin B-12 level is in the low- normal range, and you may benefit from some vitamin B-12 supplementation. In any case, you should, per my instructions, be scheduled for a follow-up visit. I look forward to seeing you soon. Cordially yours, Sales George Chow, M.D. GC:rgm/dt"
}
