{
	"anumber": "A92050561",
	"id": "A92050561_0096",
	"page_index": 96,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92050561_0096/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Certificate of Birth, 1606963"
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1979]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 # 1606963 T. R. 1620692 THE UNDERSIGNED MUNICIPAL MAYOR, CERTIFIES: that on page one, reverse, of the Book of Births of the Civil Registry that this Mayoral Jurisdiction kept during the year nineteen hundred fifteen, is found the Certificate which literally says: January 13. - P. # 2.-MARIA LEONOR AYALA, female, mixed, Salvadorean, was born alive and of a single birth in the Center of this populace, legitimate daughter of Valentin Ayala and Maria Zepeda of this origin and address. These facts were given by Mr. Mariano Zepeda who does not sign because he does not how and it is done, by his request, by the appearant.- - Municipal Mayoral Jurisdiction: Mercedes La Ceiba, at 4:00 P.M on the thirteenth of January nineteen hundred fifteen. Rosa Molina. Nemecio Montoya. Valerio C. Marin - Sec. SIGNATURES. IT IS IN CONFORMITY WITH ITS ORIGINAL WITH WHICH IT WAS VERIFIED and for the appropriate legal uses that this certificate is issued in the Municipal Mayoral Jurisdiction of Mercedes La Ceiba, on the twenty seventh day of March, nineteen hundred eighty. Corrections to the words: INFRASCRITO - veintisiete - Valen. [Signature] Victoriano Martinez MUNICIPAL MAYOR [Signature] Dagoberto Molina Cortez Muncipal Secretary Margin markings (Top to bottom): 1) Seal of the Republic of E1 Salvador, Court of Accounts. 2) Seal of the Republic of El Salvador, 1979, Forty cents. 3) Twenty five cent fiscal stamp, Republic of E1 Salvador. 4)Seal of the Muncipal Mayoral Jurisdiction, Mercedes La Ceiba, Dept. La Paz, C. A. 5) Seal of the Municipal Secretary, Mercedes La Ceiba, Dept. La Paz, C.A. I Certify that I have compared this copy with its original and that it is a true and amplete.copy Signed M.J.Cellester Celestin, Jr. Attorney at Date Law 8/11/87 Marshall J. 5757 W. Century Blvd., #700, Los Angeles, CA 90045 Admitted to Practice in California"
}
