{
  "anumber": "A92037324",
  "id": "A92037324_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92037324_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization or Adjustment of Status, Form N-648 (06/24/97 Page 4"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "4. Dld the applicant's disability or airment result from the illegal use of ? If the applicant is developmentally disabled, did this condition first manifest itself before age 22? Please explain. The applicant's disability and imapirment did not result from the illegal use of drugs 5. What is the duration of the applicant's disability or impairment? Is it temporary (less than 12 months) or permanent? Explain. The patient's medical conditions are permanent. Hypertension in elderly patient has tendency to run an uncertain course. Serious complications, such as cogestive heart failure, heart attack and stroke are unpredictable and not uncommon. In fact she already had one heart attack. Her lymphoma is a cancer of the lymphatic tissue which usually is malignant. The prognosis is guarded. 6. Please provide your medical speciality. If you are not specialized, provide your medical experience and other qualifications that permit you to make this assessment. Has been practicing General, Family and Industrial Medicine for over twenty years in the U.S. INS designated Civil Surgeon since 1985 I certify under penalty of perjury under the laws of the United States of America, that the information on the form and any evidence submitted with it is all true and correct. I agree to release this applicant's relevant medical records upon request from the U.S. Immigration and Naturalization Service. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. Signature awDate 10-18-99 Please Type or Print Last Name First Name Middle Name NGUYEN TIEP KIM Business Address City, State, ZIP Code Telephone 12650 Sherman Way, Suite 3 No. Hollywood, CA. 91605 (818) 764-5775 License Number Licensing State A 39091 California U.S. 0:1997-417-729/65633 Form N-648 (06/24/97) Page 4"
}