{
	"anumber": "A92050561",
	"id": "A92050561_0001",
	"page_index": 1,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92050561_0001/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2005, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 7/13/2023 our U.S. Department of Justice OMB No. 1115-0009 Immigration and Naturalization Service Application for Naturalization Print clearly or type your answers using CAPITAL letters. Failure to print clearly may delay your application. Use black or blue ink. Part 1. Your Name (The Person Applying for Naturalization) Write your INS \"A\"- number here: A 092 050 561 A. Your current legal name. Family Name (Last Name) FOR INS USE ONLY AYALA Bar Code Date Stamp Given Name (First Name) Full Middle Name (If applicable) MARIA LEONOR B. Your name exactly as it appears on your Permanent Resident Card. APR 25 2005 Family Name (Last Name) Remarks AYALA BARAHONA 316 Given Name (First Name) Full Middle Name (If applicable) MARIA LEONOR C. If you have ever used other names, provide them below. Family Name (Last Name) Given Name (First Name) Middle Name D. Name change (optional) Please read the Instructions before you decide whether to change your name. 1. Would you like to legally change your name? Yes No 2. If \"Yes,\" print the new name you would like to use. Do not use initials or abbreviations when writing your new name. Action Family Name (Last Name) APPROVED MLS. DISTRICT DIRECTOR Given Name (First Name) Full Middle Name CenterCal APA Part 2. Information About Your Eligibility (Check Only One) LOS 12219 I am at least 18 years old AND A I have been a Lawful Permanent Resident of the United States for at least 5 years. B. I have been a Lawful Permanent Resident of the United States for at least 3 years, AND I have been married to and living with the same U.S. citizen for the last 3 years, AND my spouse has been a U.S. citizen for the last 3 years. C. I am applying on the basis of qualifying military service. D. Other (Please explain) Form N-400 (Rev. 05/31/01)N"
}
