{
  "anumber": "A92037324",
  "id": "A92037324_0065",
  "page_index": 65,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92037324_0065/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Application for Naturalization, N-4 (000"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice 250 OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name ESPINOZA Name CANDELARIA Initial U.S. Mailing Address - Care of 17928 INGOMAR ST. Resubmitted Street Number Apt. and Name 17928 INGOMAR ST. # City County RESEDA LOS ANGELES State ZIP Reloc Sent CALIFORNIA Code 91335 Date of Birth Country (month/day/year) 02/02/14 of Birth EL SALVADOR Social A Security # 555-99-8541 # 092037324 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. X I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service III the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview c. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an unmmigrant visa or INS Office resident (month/day/year) where granted adjustment of status. 08/02/1989 LOS Citizenship EL SALVADOR Name on alien registration card (if different than in Part 1) ANGEL DE ESPINOZA, CANDELARIA Other names used since you became a permanent resident (including maiden name) CANDELARIA ESPINOZA Sex Male Height Marital Status: Single Divorced Married (Widowed THE BACK OF THIS DOCUMENT CONTAINS AN ARTIFICIAL WATERMARK HOLD AT AN ANGLE TO VIEW MONEY ORDER Action 02-841692431 AGENT 715667 DATE 101899 82-40/1021 TIME 0950 N 028416924317 LOCATION 000001 25000 PAY EXACTLY ** PAY EXACTLY TWO HUNDRED FIFTY DOLLARS AND NO CENTS ****** NOT GOOD DVER/$599 PAY TO CHE ORDER OF 19928 Immigration atapization Service Candelana DRO ASER'S pleseda, CA 91335 PURCHASER BY KPatmore THE To Be Completed by Attorney or Representative, if any AUTHORIZED REPRESENTATIVE Fill in box if G-28 is attached to represent Issued by Integrated Payment Systems Inc. / Payable at Norwest Bank Grand Junction Downtown N.A., Grand Junction Colorado the applicant OLAG# ⑆102100400⑆ 40028416924317⑈ A092037324 Yes ATTY State License # 1 Form N-400 (Rev 07/17/91)N Continued on back."
}