{
	"anumber": "A92141101",
	"id": "A92141101_0022",
	"page_index": 22,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0022/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Quick and Pleasant Interview Process for Family Members and Friends, GPO-1996-780-589"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States"]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "As part of our effort to provide a quick and pleasant interview process, we ask that you PLEASE DO NOT BRING ANY CHILDREN OR OTHER FAMILY MEMBERS, and PLEASE ARRIVE NO EARLIER THAN 30 MINUTES BEFORE YOUR APPOINTMENT. You may bring your attorney and/or interpreter (if exempt from the English literacy requirements); however, FAMILY AND FRIENDS WILL NOT BE ADMITTED. Please bring your Alien Registration Card (\"Green Card\"), and your state driver's license or identification card. Also, to speed your interview process, we ask that you complete the following questionnaire before arriving at your interview. Please check all that apply, and bring all requested items to your interview: I have passed a standardized naturalization test. Please bring your original test score notice. I do not speak english. You must be at least 55 years of age with 15 years of lawful permanent residence in the U.S., or be at least 50 years of age with 20 years of lawful permanent residence. Please bring an interpreter. I am not willing to take the full oath of allegiance. Please bring a letter from your church explaining how your religious beliefs prevent you from taking the full oath. I have been delinquent on paying income taxes, or have filed an income tax return as a non-resident. Please bring copies of any correspondence relating to payment arrangements, and copies of any returns for which you claimed to be a non-resident. I have not resided lawfully in the United States for at least 5 years. If applying on the basis of your marriage to a U.S. citizen, please bring a copy of your marriage certificate, and evidence that all prior marriages have been terminated (such as divorce decrees or death certificates). Also bring evidence of the viability of your marriage (such as joint bank statements, deeds to jointly held property, birth certificates of children, etc.). If applying on the basis of military service, please bring a copy of your discharge certificate, Form DD-214. I have failed to pay required alimony or child support within the last 5 years. Please bring copies of canceled checks, money order receipts and bank drafts showing your payment record, along with copies of any court or government orders relating to the required payment. I have been arrested within the last 5 years, or I have been arrested and charged with a felony at any time. Please bring a certified court copy of the final disposition of each arrest. I am male and between the ages of 18 and 31. Please bring proof you registered with the Selective Service between the ages of 18 and 26. I have been outside the United States for a total of 12 months or longer since I became a permanent resident. Please bring your passport and a listing of any trips not included in your application. Include the dates you left and the duration of each trip. 5/17/96 *U.S.GPO:1996-780-589"
}
