{
  "anumber": "A92141101",
  "id": "A92141101_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization, N-4 (00"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department or JUSTICE Immigration and Naturalization Se Application for Naturalization START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Given Middle Family Name Ordonez 2 Name Felicita Initial U.S. Mailing Address - Care of Resubmitted Street Number and 6058 Hazd hurst PL. 8 City County Worth Holywood Los Angeles ZIP State 0421 001 R Rétóc Sent 11/29/96 8:49 California 91606 N400 95.00 Date of Birth Country (month/day/yeat02-21-14 of BEI Salvador Social A Security 604-07-8717 92141101 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a FP United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) 11-25-96 d. I am applying on the basis of qualifying military service III the Armed Forces of the U.S. 9/8/98 and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an imminigrant visa or INS Office resident (month/day/year) where 03-29-89 granted adjustment of N16 Applicant UVE - LA LOS Did not understand anything Citizenship Salvaderian in Salundor but was \"playing the game Name on alien registration card (if different than in Part 1) through 7+8 - couldn't Same- Write or read Other names used since you became a permanent resident (including maiden name) None History + civing Sex Male Height Marital Status: Single Divorced Female 5-0E Married Widowed Can you speak, read and write English ? No Yes. Absences from the U.S.: Have you been absent from the U.S. since becoming a permanent resident? No Yes Action avenue qup If you answered \"Yes\" complete the following Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last Date left U.S. Date returned 6 months or more? Destination Reason for trip 7-21-92 8-12-92 Yes No El Salvador Vacation To Be Completed by 8-16-91 9-1-91 Yes No is ^ Attorney or Representative if any 9-3-88 9-16-88 Yes No a 1) Fill in box if G-28 is attached to represent the applicant No OTHORS Yes No VOLAG# Yes No Yes No ATTY State License # Form N.400 (Rev 07/17/91)N Continued on back."
}