{
	"anumber": "A92141101",
	"id": "A92141101_0003",
	"page_index": 3,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0003/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "male"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Naturalization, N-4 (000"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "El Salvador"]
		},
		"years": {
			"ms_years_nlp_v1": [1999]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice OMB #1115-0009 immigration and Naturalization Se Application for Naturalization CO START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part 1. Information about you. Family Given Middle Name Ordonez NameFelicita Initial U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 6058 Hazelhurst Place # 8 City County North Hollywood Los Angeles, State ZIP Reloc Sent California Code 91606 Date of Birth Country (month/day/year) 02-21-14 of Birth El Salvador Social Security # 604-07-8717 92141101 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years b. I have been a permanent resident for at least three (3) years and have been married to a United States Citizen for those three years. Applicant Interviewed C. I am a permanent resident child of United States citizen parent(s) d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. NOV 12 1999 and have attached completed Forms N-426 and G-325B At interview los e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Remarks Date you became a permanent Port admitted with an immmigrant visa or INS Office resident (month/day/year) where granted adjustment of status 03-29-89 Los Angeles WILE 31699, Citizenship El Salvador Name on alien registration card (if different than in Part 1) N/a Other names used since you became a permanent resident (including maiden name) N/A Sex Male Height Marital Status: Single Divorced Female Married Widowed 5-02 Can you speak, read and write English ? No Yes. Action APPROVED Absences from the U.S.: INS DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you need more room to explain the reason for an absence or to list more trips, continue on separate DEC 3 0 1999 paper. Did absence last Recommended by: Don Suter Date left U.S. Date returned 6 months or more? Destination Reason for trip LOS 8531 Yes No 8/16/91 9/1/91 El Salvador vacation 7/27/92 8/12/92 Yes No To Be Completed by El Salvador to a funeral Attorney or Representative, if any Yes No Fill in box if G-28 is attached to represent the applicant Yes No VOLAG# Yes No yllo Yes No ATTY State License # Form N-400 (Rev. 07/17/91)N Continued on back."
}
