{
  "anumber": "A92141101",
  "id": "A92141101_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0009/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Medical Certification for Disability Exceptions, Form N-468"
    },
    "years": {
      "ms_years_nlp_v1": [
        2019
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Immigration and Naturalization Service Medical Certification for Disability Exceptions Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please or type information) Las: Name First time Middle have Social Security Number ORDONEZ FELICITA 604-07-8717 Address Alien Number 6058 HAZELHURST PL. APT. # 8 A92141101 City Sus Zip Code NORTH HOLLYWOOD CA 91606 Telephone Number Dis of Birth Sex (818)761-9898 02/21/14 FEMALE I, FELICITA ORDONE authorize DR ASHER (AAn (Applicant's Name) (Licensed medical doctor or Licensed clinical psychologis:) to release all relevant physical and mental health information related to my medical status to the INS for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information OD the form and any evidence submitted with it is all true and correct. I am aware that the knowing placement of false information on the Form N-645 and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c Signature helicita Ordones Date 9-20-98 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U.S. history and cirics tests required of applicants for naturalization. The Immigration and Naturalization Service's regulations require that applicants for an exception based on disability submit this certification form, completed by a Licensed medical doctor or licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complete words and phrases. 1. Date of your most recent examination of the applicant 09/2019 98 2. Is this your first examination of the individual? Yes No XX If yes, who is the regular attending physician? 3. Based on your examination, describe any findings of 2 physical or mental disability or impairment which, in your professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English language and/or U.S. history and civics. Describe in detail. If applicant has 2 mental disability or impairment, please provide DSM diagnosis. 1. Hypertension for over 15 years requiring daily antihypertensive medications. 2, Long term ventricular ARRHTHMIA 3. Severe generalized osteoarthritis with pain and discomfort aggravated by daily physical activities -- it becomes worse progressively. 4. Fungal Dermatitis of upper and lower extremities. 5. History of pneumonia and acute bronchitis in the past. 6. Chronic VERTIGO for a long time. 7. Dementia since recent several months (DSM DX CODE 290.0). CURRENT MEDICATIONS: TENORMIN - VASOTEC - BENADRYL ATARAX - VOLTAREN"
}