{
	"anumber": "A92141101",
	"id": "A92141101_0010",
	"page_index": 10,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0010/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Medical Examination Form"
		},
		"years": {
			"ms_years_nlp_v1": [1966, 1964, 1973]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "condition first sanites: itself before age 22? Please expiai APPLICANT NEVER USED ILLEGAL DRUGS. NO DEVELOPMENTAL DISABILITIES. 5. What is the duration of the applicant's disability or impairment? Is it temporary (less than 12 months) or permanent Explain. IT IS THE OPINION OF THE EXAMINER THAT THE APPLICANT DISABILITIES ARE PERMANENT. SINCE THE APPLICANT IS SUFFERING FROM MULTIPLE PHYSICAL AS WELL AS MENTAL DISABLING CONDITIONS, AND SIDE EFFECTS OF MEDICATIONS THAT SHE MUST TAKE, THEREFORE, SHE IS UNABLE TO LEARN OR SIT FOR ANY KIND OF EXAMINATION. 6. Please provide your medical speciality. If you are not specialized, provide your medical experience and othe qualifications that permit you to make this assessment. I AM A PHYSICIAN AND SURGEON LICENSED BY THE MEDICAL BOARD OF THE STATE OF CALIFORNIA (LICENSE NO. A0 45553) GRADUATED FROM MEDICAL SCHOOL ON JUNE 30 1964, AND HAVE COMPLETED APPROVED RESIDENCY AND FELLOWSHIP TRAINING IN INTERNAL MEDICINE AND CARDIOLOGY AT NEW YORK HOSPITALS FROM JULY 1966 THROUGH 1973. I certify under penalty of perjury under the 12ws of the United States of America, that the information on the form a any evidence submitted with it is all true and correct. I agree to release this applicant's relevant medical records upo: request from the U.S. Immigration and Naturalization Service. I am aware that the knowing placement of fals information on the Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. Sectio: 1324c. Signature Ashee RounD Date 9 / 25198 Please Type or Print 25: N2-: Firs: N2-1 Middle N2-: RAM ASHER business Address City, State, ZIP Code Telephone 14547 VICTORY BLVD. VAN NUYS, CA 91411 (818)997-3232 icess Number Licensing State A0 45553 CALIFORNIA CENTRO MEDICO FAMILIAR 14547 Victory Blvd. Van Nuys, CA 91411 Tel (818) ) 997-3232 Fax (818) 997-7750"
}
