{
  "anumber": "A92141101",
  "id": "A92141101_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization ( (N-400), 9214/101, 3/31/97"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Immigration & Naturalization Service 9858 Artesia Boulevard, Bellflower, California 90706 Application for Naturalization (N-400) File No: A 93,14,101 The results of your examination are checked below Date: 3/31/97 RE-EXAM 14 You will be scheduled for a re-examination for the following reason: ( You have failed the following tests: ( ) History and Government Your ability to : ( ) Read ( ) Write, ( ) Speak, or Understand, English You will be notified by mail regarding the date and time of your reexamination. You have passed your examination, but cannot sign your certificate until you present the following document(s) You will be notified by mail within 120 days to appear with the documents. ( ) Arrest Report (and) (or) Court Disposition for NOTE: Final Court Disposition must include Conviction Status, Sentencing and Probation. ( ) Birth Certificate of . ( ) Marriage Certificate of . ( ) Interlocutory (and) (or) Final Divorce Decree of . ( ) Death Certificate of . ( ) Adoption Decree (and) (or) Court Order of Name Change . ( ) Proof of Spousal (and) (or) Child Support for . ( ) Proof of Selective Service Registration [Call (847) 688-6888] . NOTE: 1. If you failed to register with the Selective Service System before you resched age 26, you will be sent 2 Questionnaire form Answer the questions fully, Make A Copy, and return the form to the Selective Service 2. You will then receive an Advisory Letter from the Selective Service. 3. Bring the copy of the Questionnaire and the Advisory Letter with you to your next appointment with Immigration. ( ) Tax Clearance from I.R.S. for tax year(s) . ( ) Letter from Church regarding religious beliefs in Bearing Arms. ( ) Letter from Person(s) who gave Affidavit of Support at the time of your lawful entry into the United States. ( ) Letter from Department of Social Services (and) (or) Social Security Administration regarding your eligibility. ( ) Other : Disability Waiver. To establish your eligibility for exemption from the requirements of INA ยง 312, a certification from a Designated Civil Surgeon supporting your claim of disability is required. This certification shall be a letter-sized, one page document, signed and dated by the Civil Surgeon, attesting to the origin, nature, and extent of your medical condition as it relates to the disability exceptions. Civil Surgeon may consult with other qualified physicians and psychologists prior to providing a certification, and may rely upon evidence furnished by you from a medical specialist or psychologist. The additional evidence should not be attached to the Civil Surgeon's certification. PLEASE SUBMIT THE STATEMENT NO EARLIER THAN THIRTY DAYS FROM THE DATE OF THIS NOTICE TO THE CONTINUED UNIT LOCATED ON THE 8TH FLOOR IN ROOM 8010, 300 N. Los Angeles Street, Los Angeles, CA. CONTINUED FBI Fingerprint Report You have passed your examination, but your case is being held pending further review. Visa File Failure to appear with the requested documents will result in denial of your application. NOTE: All documents must be Original or Certified Copies. Any document in a foreign language must be accompanied by a certified English translation. 2 If you do not receive another appointment, WRITE to INS, 300 N. Los Angeles St., Los Angeles, CA 90012 Attention N-400 Continued Unit, Room 8010, to inquire about your case. RL Officer Wolwett"
}