{
  "anumber": "A92360662",
  "id": "A92360662_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0075/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Department of Justice Immigration and Naturalization Service Western Regional Processing Facility, A92360662"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 Agosto 8, 1988. Department of Justice Immigration and Naturalization Service Western Regional Processing Facility P.O. Box 30040 Laguna Niguel, CA 92677 Attn: Mr. Joseph L. Thomas Director Regional Processing Facility Caso No. A92360662 Estimado Director: En contestacion a su atenta carta fechada Julio 15, 1988, en la cual me solicita mas documentacion que ampare mi caso, como recibos de pagos, facturas, Income Taxes y/o cartas de empleadores, me permito hacerle la siguiente aclaracion. Cuando yo vine a este pais en compania de mi hija, procedente del pais de Nicaragua en Agosto 4, 1979, yo tenia en esa epoca 65 anos de edad. Yo no trabaje ni he trabajado durante esa fecha. Yo he sido una ama de casa, he trabajado si asi se puede decir cuidando a mi nieta y haciendo los oficios de casa ya que para ese entonces mi FOIA (b)(6) años y mi hija era la que trabajaba y soportaba todos mis gasos y como lo ha seguido haciendo hasta la fecha. Es por eso que yo solamente adjunte copias de los Income Taxes de mi hija donde yo aparezco como su depediente. Las cartas que yo estoy adjuntando son de las pocas amistades que me conocen a travez de amistad que han sostenido con mi hija y que ellas ya sea por medio de asistir a la Iglesia o bien por visitar nuestra casa saben del hecho que yo NO HE SALIDO del pais. Aunque pudiera no podria ir ya que mi hijo fue Militar y piloto personal del hijo del finado General Anastasic Somoza, mis sobrinos fueron militares de alto rango en dicho pais y mi propia hija con la cual yo vivo fue Secretaria del Ministro de Defensa y del mismo General Somoza por muchos anos. Adjunto a la presente estoy enviando Affidavits de Conocimiento de personas ciudadanas y residentes de este pais, que conocen bien el hecho de mi permanencia en este pais. Agradeciendo de antemano su atencion a la presente, me suscribo del senor Director Muy atentamente, Maria Matu Hunter MARIA MATUS HUNTER 1109 Oneonta Dr Los Angeles, CA 90065"
}