{
  "anumber": "A92360662",
  "id": "A92360662_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0035/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Cerrification For Disability Expections"
    },
    "years": {
      "ms_years_nlp_v1": [
        1995,
        1989,
        1993,
        2023,
        1997
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 U.S. Department of Justice Immigration and Naturalization Ser vice OMB # 1115-0205 Medical Cernaction For Disability Expections Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please print or type information) Last Name First Name Middle Name MATUS MARIA Social Security Number NONE 619-05-3689 Address 1109 ONEONTA DR. Alien Number A092360662 City State LOS ANGELES Zip Code CALIFORNIA 90065 Telephone Number Date of Birth Sex 11--12-14 FEMALE. I, MARIA MATUZ authorize BRUCE TORKAN M.D. (Applicant's Name) to release all relevant physical and mental health information related to my medical status to the INS for the of (Licensed medical doctor or licensed clinical psychologist) under applying for an exception from the English language and U.S. civics testing requirements for naturalization. purpose I penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information on the form and evidence certify submitted with it is all true and correct. I am aware that the knowing placement of false information on the any Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. Signature X Narra Matus Date 03-02-99 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U. S. history and civics applicants for an exception based on disability submit this certification form, completed by a licensed medical doctor or required of applicants for naturalization. The Immigration and Naturalization Service's regulations require tests that licensed clinical psychologist, along with a completed application for naturalization (Form N-400). and phrases. Please answer the following questions as clearly and completely as possible, using common terminology and complete words 1. Date of your most recent examination of the applicant. 03-02-99 19 2. Is this your first examination of the individual? Yes No If yes, who is the regular attending physician? 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, in and/or U.S. history and civics. Describe in detail. If applicant has a mental disability or impairment, please provide professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English language your DSM diagnosis. DIAGNOSIS OF MENTAL DISABILITY OR IMPAIRMENT: 1. Memory impairment due to: A. B. Dementia of the Alzheimer type with depressed mood DSM IV 290.21 Senility ICD code 794 C. Age related. cognitive decline DSM III 780.9 PHYSICAL DISABILITY OR IMPAIRMENT: 1. Osteoarthritis lower extremities both joints and lumbar since 1989 ICD code 714 2. Constante cephalgia for one year. ICD code 7840 3. Frecuent diarrhea for long time ICD code 0090 4. Hypercholesterolemia since 1997 ICD code 2720 5. Moderate vision loss bilaterally 20 750 ICD code 369.02 7. 6. Varicose veins both legas for 15 years ICD code 4540 Osteoporosis unknown date of onset, ICD code 733 8. 9. Moderate hearing loss both ears since 1993 ICD code 389 Left and right cataract ICD code 366.13 since 1993 fl: 10. Hysterectomy done 1995. Dizziness for 3 years. Osteoarthritis of lumbar vertebral and lower extremities joint limit the patient' ability to attend classes. Dementia and her multiple disability make her unable to learn new concepts. Therefore , I piysical recommend to waive Civics and English tests for him. Form N-648 (06/24/97) Page 3"
}