{
	"anumber": "A92360662",
	"id": "A92360662_0065",
	"page_index": 65,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0065/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Form I-690, Screeneded by NARA 6/29/2023"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [1989, 2023, 1933, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 18. Concerning the requirement of minimal understanding of ordinary English and a knowledge and understanding of the history and government of the United States: (Check appropriate block under Section A or B.) A. I will satisfy these requirements by; B. I have satisfied these requirements by; Examination at the time of interview for permanent Having satisfactorily pursued a course of study recognized residence. by the Attorney General (please attach appropriate Satisfactorily pursuing a course of study recognized by documentation). the Attorney General. Exemption, in that I am 65 years of age or older, under the age of 16, or I am physically unable to comply. (If physically unable to comply, explain and attach relevant documentation.) 19. Applicants for status as Permanent Residents must establish that they are not excludable from the United States under the following provisions of section 212 of the INA. An applicant who is excludable under a provision of section 212 (a) which may not be waived is ineligible for permanent resident status. An applicant who is excludable under a provision of section 212 (a) which may be waived may, if otherwise eligible, be granted permanent resident status, if an application for waiver on form I-690 is filed and approved. A. Grounds for exclusion which may not be waived: B. Grounds for exclusion which may be waived: Listed by paragraph number of section 212(a); (9) Aliens who have committed or who have been convicted of a crime Listed by paragraph number of section 212 (a); involving moral turpitude (does not include minor traffic violations). (1) Aliens who are mentally retarded. (10) Aliens who have been convicted of two or more offenses for which (2) Aliens who are insane. the aggregate sentences to confinement actually imposed were five years or more. (3) Aliens who have suffered one or more attacks of insanity. (15) Aliens likely to become a public charge. (23) Aliens who have been convicted of a violation of any law or (4) Aliens afflicted with psychopathic personality, sexual deviation, regulation relating to narcotic drugs or marihuana, or who have or a mental defect. been illicit traffickers in narcotic drugs or marihuana. (5) Aliens who are narcotic drug addicts or chronic alcoholics. (27) Aliens who intend to engage in activities prejudicial to the national interests or unlawful activities of a subversive nature. (6) Aliens who are afflicted with any dangerous contagious disease. (28) Aliens who are or at any time have been anarchists, or members of or affiliated with any Communist or other totalitarian party, (7) Aliens who have a physical defect, disease or disability affecting including any subdivision or affiliate thereof. their ability to earn a living. (29) Aliens who have advocated or taught, either by personal (8) Aliens who are paupers, professional beggars or vagrants. utterance, or by means of any written matter, or through affiliation with an organization: (11) Aliens who are polygamists or advocate polygamy. 1) Opposition to organized government; (12) Aliens who are prostitutes or former prostitutes, or who have 2) The overthrow of government by force or violence; 3) The assaulting or killing of government officials because of procured or attempted to procure or to import, prostitutes or their official character; persons for the purpose of prostitution or for any other immoral 4) The unlawful destruction of property; purpose, or aliens coming to the United States to engage in any other unlawful commercialized vice, whether or not related to 5) Sabotage, or; prostitution. 6) The doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States. (13) Aliens coming to the United States to engage in any immoral (33) Aliens who, during the period beginning on March 23, 1933, and sexual act. ending on May 8, 1945, under the direction of, and in association with: (16) Aliens who have been excluded from admission and deported and 1) The Nazi government in Germany; who again seek admission within one year from the date of such 2) Any government in any area occupied by the military forces deportation. of the Nazi government in Germany; (17) Aliens who have been arrested and deported and who reentered 3) Any government established with the assistance or the United States within five years from the date of deportation. cooperation of the Nazi government of Germany; 4) Any government which was an ally of the Nazi government (19) Aliens who have procured or have attempted to procure a visa or of Germany; other documentation by fraud, or by willfully misrepresenting a material fact. ordered, incited, assisted or otherwise participated in the persecution of any person because of race, religion, national (22) Aliens who have applied for exemption or discharge from training origin, or political opinion. or service in the Armed Forces of the United States on the ground Provisions of 212 (e): of alienage and who have been relieved or discharged from such Aliens who at any time were exchange visitors subject to the two- training or service. year foreign residence requirement unless the requirement has been satisfied or waived pursuant to the provisions of section 212 (31) Aliens who at any time shall have, knowingly and for gain, (e) of the Act. (Does not apply to the Extended Voluntary encouraged, induced, assisted, abetted, or aided any other alien to Departure (EVD) class of temporary resident aliens). enter or to try to enter the United States in violation of law. Do any of the above classes apply to you? Do any of the above classes apply to you? No Yes (If \"Yes\", attach an explanation, and any relevant documentation. No Yes (If \"Yes\", attach an explanation, and any relevant documentation and Place mark (X) on line before ground(s) of exclusion.) submit Form I-690. Place mark (X) on line before ground(s) of exclusion.) 20. If your native alphabet is other than Roman letters, write your name in your native alphabet. 21. Language of native alphabet none SPANISH 22. Signature of Applicant I CERTIFY, under penalty of perjury under the laws of the United States of 23. Date (Month/Day/Year) America that the foregoing is true and correct. I hereby consent and authorize the Service to verify the information provided, and to conduct record checks pertinent to this application. JUNE 27/1989 Maria Matur Hounter 24. Signature of person preparing form, if other than applicant. I DECLARE that this document was 25. Date (Month/Day/Year) prepared by me at the request of the applicant and is based on all information of which I have any knowledge. JUNE 27, 1989 26. Name and Address of person preparing form, if other than applicant (type or print). 27. Occupation SUYEN HUNTER/1109 Oneonta Dr, Los Angeles, CA 90065 NOTARY PUBLIC Page 2"
}
