{
	"anumber": "A92360662",
	"id": "A92360662_0086",
	"page_index": 86,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0086/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Application for Status as a Immigrant, I-687"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [1979, 1914, 2023, 1982]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 U.S. Department of Justice Application for Status as a Immigration and Naturalization Service (Under Section 245A of the Immig Please begin with item #1, after carefully reading the instructions. The block below is for Governmen A92360662 Name and Location (City or Town) of Qualified Designated Entity Fee 12 Stamp 09.87 41155 Fee Receipt No. (This application) Xem886506104 Principal Applicant's File No. A Qualified Designated Entity I.D. No. File No. (This applicant) A - 92360662 Applicant: Do not write above this line. See instructions before filling in application. If you need more space to answer fully any question on this form, use a separate sheet and identify each answer with the number of the corresponding question. Fill in with typewriter or print in block letters in ink. 1. I hereby apply for status as indicated by the block checked below (check block A or B). A Temporary Residence as an alien who illegally entered the U.S. prior to January 1, 1982. B Temporary Residence as an alien who entered the U.S. as a nonimmigrant prior to January 1. 1982 and whose authorized stay expired before such date or whose unlawful status was known to the Government as of January 1, 1982. 2. Family Name (Last Name in CAPITAL Letters) (First Name) (Middle Name) 3. Date of Birth (Month/Day/Year) Matasde HUNTER Maria Madgalena NOVEMBER 12, 1914 4. Other Names Used or Known by (Including maiden name, if married) 5. Telephone Numbers (Include Area Codes) Home: Maria Magdalena MATUS-GONZALEZ (maiden name) (213) 258-4569 Work: 6. Home Address in the U.S. (No. and Street) (Apt. No.) (City) (State) (ZIP Code) 90065 1857 Armadale Ave No.208 Los Angeles, CA 90042 1109 Omeota Drive ho angeles 7. Mailing Address in the U.S. (if different from #6.) (Apt. No.) (City) (State) (ZIP Code) (SAME AS No. 6) 8. Last Address outside the U.S. (City or Town) (County, Province or State) (Country) Managua, Nicaragua. 9. Sex 10. Race Male Asian or Pacific Islander Black, not of Hispanic origin Other (specify below) KX Female Hispanic White, not of Hispanic origin 11. Marital Status Never Married Divorced 12. Country of Citizenship Now Married Separated Widowed NICARAGUA 13. Place of Birth (City or Town) (County, Province or State) (Country) Jinotega, NICARAGUA 14. Have you previously applied for temporary residence as a legalization applicant? 15. Do you have any other record with I&NS? No Yes (if \"Yes\" give date, place of filing, and final disposition, if known) No Yes [If \"Yes\" give number(s)] A - Other 16. When did you last come to the U.S.? (Month/Day/Year) 17. Manner of Entry (Visitor, Student Crewman, etc.) With visa (visitor, student, etc.) specify B-2 AUGUST 4, 1979 Without visa 18. Place of Last Entry 19. List all Social Security Numbers used. Los U.S. Port of entry (City and State) Angeles, CA (1) (3) Border - Not through port (State) (2) NONE (4) 20. Mother's Name (Maiden) (Last) (First) Living 21. Father's Name (Last) (First) Living GONZALEZ, Esmeralda Deceased (year) MATUS, Manuel Deceased (year) Form I-687 (04/01/87) Page 1"
}
