{
	"anumber": "A92360662",
	"id": "A92360662_0097",
	"page_index": 97,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0097/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE JINOTEGA, Serie 'E' N° 1680863"
		},
		"years": {
			"ms_years_nlp_v1": [1914, 2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 SERIE \"E\" 4UT CUATRO CORDOBAS 400) No 1680863 1 RIVERA 2 REGISTRADOR DEL ESTADO CIVIL DE LAS PERSONAS DE JINOTEGA, 3 CERTIFICA: 4 Que en la pagina No. 22. Tomo I. Del Libro de Reposiciones de Partidas de 5 nacimientos que esta oficina a mi cargo lleva en el año de mil novecientos 6 ochenta y seis. Aparece el Acta que íntegra y literalmente dice: No. 44. z MARIA MAGDALENA GONZALEZ. En la ciudad de Jinotega, Departamento de Jino - 8 tega, a las ocho de la mañana del día once del mes Abril del año de mil no 9 vecientos ochenta y seis. Ante el infrascrito Registrador del Estado Civil 10 y Secretario que autoriza comparece: el Doctor Francisco Aviles Gutiérrez, 11 mayor de edad casado, abogado, de este domicilio y presenta para su ins 12 cripción la sentencia de Reposición de partida dictada por el señor Juez 13 de Distrito de los Civil de Jinotega, Doctor Mario Ubeda, a las nueve de 14 la mañana del día dos del mes de Abril de mil novecientos ochenta y seis: 15 en la que ordena reponer la partida de: MARIA MAGDALENA GONZALEZ, quien 16 nació en Jinotega, a las once de la mañana del día doce del mes de noviem- 17 bre de Mil novecientos catorce; siendo hija de Esmeralda González... Ver 18 libro de nacimientos de 1914, Tomo 1, folio 261. Yo, el Registrador doy 19 fé de haber tenido a la vista la sentencia de reposición habiéndose anotado 20 al margen del lugar que fué omitida. Las diligencias originales fueron - 21 archivadas en esta oficina, poniéndose constancia al pié de ella de la ins- 22 cripción con señalamiento del número y fecha de la partida y la página del 23 libro en que se asentó. Leída la presente se encuentra conforme, se apru- 24 eba, y firma. NARCISA VALLE R. JFAVILES, EAZUCENA HERRERA. SRIA. Esta par- 25 tida al márgen tiene una nota que dice: Por escritura pública de Reconoci- 26 miento de Hijo, el señor, Manuel Matus, reconoció a María Magdalena Gonzá- 27 lez como su hija para que goce de los derechos que la ley concede a los - 28 hijos ilegitimos reconocidos por escritura pública, ahora será: MARIA 29 MAGDALENA MATUS GONZALEZ. Ver libro correspondiente de este año, tomo 2, 80 Jinotega, 6/5/86. Narcisa Valle Rivera. Es conforme con su original con la"
}
