{
  "anumber": "A92360662",
  "id": "A92360662_0082",
  "page_index": 82,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0082/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Decision, A92360662"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1982,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 6/29/2023 Department of Justice Immigration and Naturalization Service Western Regional Processing Facility P.O. Box 30040 Laguna Niguel, CA 92677 Matus Hunter, Maria Notice of Decision 1109 Oneota Drive Refer to File No: Los Angeles, CA 90065 A92360662 Date: July15,1988 Upon review of your application for temporary resident status under the provision of Section 245A of the Immigration and Nationality Act, as amended by the Immigration Reform and Control Act of 1986, it has been determined that additional information is required prior to a decision being rendered in your case. Please submit the following information by mail to the address noted above within thirty (30) days. **IMPORTANT - PLEASE RETURN THE REQUESTED DOCUMENTS WITH THIS LETTER ATTACHED ON TOP*** Additional documentation is needed to show that you have maintained your residence in the United States from prior to 1982 to 1986. This new documentation may include, but is not limited to: insurance records, automobile records, banking or credit records, school records, utility bills, rent receipts, employers records, W-2 Wage and Tax Statements, affidavits from previous employers specifying the dates of employment, or letters of correspondence (with legible postmarks) Do not resubmit documentation that had been submitted at time of your application, interview, or because of previous requests. Also, do not send original documents that you would like to be returned to you. If it is not possible to send original documentation, certified or notarized copies may be submitted in their place. Failure to submit the requested information will result in a decision based on the evidence of record. Sincerely, Director Regional Processing Facility b:CT07148.9/WPDOCS1/CT/EX40 Page 1"
}