{
  "anumber": "A92360662",
  "id": "A92360662_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0022/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Application for Naturalization, N-4 (07/19/IN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1999,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 OMB 1115-0009 U.S. Department of Justice Application for Naturalization Immigration and Naturalization Service START HERE - Please Type or Print FOR INS USE ONLY Returned Receipt Part3 1. Information about you. 2 Family DE 4 Given Middle Name HUNTER Name MARIA Initial MATUS U.S. Mailing Address - Care of Resubmitted Street Number Apt. and Name 1109 ONEONTA DR # City County L.A. LOS ANGELES State ZIP Reloc Sent CA Code 90065 0034 001 003 11/24/95 14:20 Date of Birth Country of Birth ICARAGUA N400 95 00 (month/day/year) 11/12/14 Social A Security 619-05-3689 # 92-360-662 Reloc Rec'd Part 2. Basis for Eligibility (check one). a. I have been a permanent resident for at least five (5) years. b. I have been a permanent resident for at least three (3) years and have been married to a Applicant United States Citizen for those three years. Interviewed C. I am a permanent resident child of United States citizen parent(s). APR 27 1999 d. I am applying on the basis of qualifying military service in the Armed Forces of the U.S. and have attached completed Forms N-426 and G-325B At interview e. Other. (Please specify section of law) request naturalization ceremony at court Part 3. Additional information about you. Port admitted with an immigrant visa or INS Office ( Date you became a permanent Remarks 316 (a) resident (month/day/year) where granted adjustment of status. 11-20-89 LOS ANGELES, CALIFORNIA WIL LOS JAN 12 1996 APR 27 1999 N648 SUFFICIENT Citizenship NICARAGUAN 312 WAIVED - CIVICS on Name on alien registration card (if different than in Part 1) FILE ROV on MATUS DE HUNTER, MARIA Other names used since you became a permanent resident (including maiden name) GRANT NONE OTHER Sex Male Height Marital Status: Single Divorced Female 5'0\" Married Widowed Can you speak, read and write English? No Yes. Action z APPROVED Absences from the U.S.: INS DISTRICT DIRECTOR Have you been absent from the U.S. since becoming a permanent resident? No Yes. If you answered \"Yes\" complete the following, Begin with your most recent absence. If you APR 27 need more room to explain the reason for an absence or to list more trips, continue on separate paper. Did absence last LOS 4692 Date left U.S. Date returned 6 months or more? Destination Reason for trip 3 NONET Yes No FOIA (b)(6) To Be Completed by Attorney or Representative, if any FOIA (b)(6) Yes No Fill in box if G-28 is attached to represent Yes No the applicant VOLAG# Yes No Yes No ATTY State License # Yes No Form N-400 (Rev 07/17/91)N Continued on back."
}