{
	"anumber": "A92360662",
	"id": "A92360662_0114",
	"page_index": 114,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0114/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "FFIDAVIT OF SUPPORT, A38-853-413"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Nicaragua"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1991, 1987, 1948]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 FFIDAVIT OF SUPPORT State of California SS County of Los Angeles I, SUYEN HUNTER. residing at 1357 Armadale Ave No. 208 Los Angeles, CA 90042. BEING FIRST DULY SWORN, DEPOSE AND SAY That I am a citizen of NICARAGUA born at February 2, 1948 In Managua, NICARAGUA. That I am 39 years of age and have resided in the United States since August 4, 1987 THAT it is my intention and desire to have the following person(s) at present residing at 1357 Armadale Ave No. 208, Los Angeles, CA 90042 come to the United States: Country Relationship Name Sex Age of birth to deponent Maria Magdalena Female 73 NICARAGUA MOTHER THAT I am employed or engaged in the business of Professional Occupations/Notary Public with SELF EMPLOYED. at 628 N. Vermont Ave No. 12, Los Angeles, CA 90004. and derive a net annual Income of $50,000.00. THAT I have deposits in Banks in this country $ 75,785.00 . THAT I own Real Estate at -0- valued at $ -O- with mortgages or other encumbrances amounting $ -O- THAT I have other personal property with a reasonable value of $ -0- with encum- brances amounting $ -0- . THAT I have Life Insurance in the sum of $ -0- with cash surrender value of $ -0- . THAT the following persons are dependents upon me for support: FOIA (b) (6) THAT I am willing and able to receive, maintain and support the prospective immigrants listed above. That I am ready and willing to place a bond, if necessary, with the United States Immigration authorities to guarantee that such prospective immigrants will not become a public charge during their stay in the United States. That this affidavit is made by me for the purpose of assuring the Immigration and Naturalization Service that the above-named persons will not become public charges in the United States. THAT I have previously submitted Affidavit of Support in behalf of none I am conscious of the responsibility assumed by this Affidavit of Support and well able and willing to undertake it. Subscribed and sworn to before me this the day of NOV, 1987 in and for said County and State bright SUYEN HUNTER Notary Public LEGAL RESIDENCE No.A38-853-413 OFFICIAL SEAL SERGIO GALINDO NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY My comm. expires SEP 27, 1991"
}
