{
  "anumber": "A92402041",
  "id": "A92402041_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92402041_0042/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION & NATURALIZATION SERVICE, Form N-14B.2"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA. 8/11/2023 U. S. DEPARTMENT OF JUSTICE a IMMIGR ION & NATURALIZATION SERVI 30 NORTH LOS ANGELES STREET LOS ANGELES, CALIFORNIA 90012 File A 92 402 04/ Date 01/04/96 CARMEN LOPEZ Applicant for Naturalization The results of your examination are checked below: ( Your case has been continued for a reexamination on: history and government, ability to read, write, speak, or understand English. You will be notified by mail regarding the date and time of your reexamination: ( ) You have passed your examination, but cannot sign your certificate until you present the document (s) requested below. You will be notified by mail within 120 days to appear with the documents. Failure to appear with the requested documents will result in denial of your application. NOTE: ALL DOCUMENT (s) MUST BE ORIGINAL/CERTIFIED COPIES. ( ) Please bring the document (s) listed below with you at the time of your reexamination. Arrest report and court disposition for (NOTE: FINAL COURT DISPOSITION MUST INCLUDE CONVICTION STATUS, SENTENCING, AND PROBATION) Birth certificate of Marriage certificate of Interlocutory and/or final divorce decree of Death certificate of Adoption decree and/or court order re: name change Proof of spousal and/or child support for Proof of Selective Service registration, (call 1-708-688-6888) NOTE: 1.If you failed to register with the Selective Service System before you reached age 26, you will be sent a QUESTIONAIRE form. Answer the questions fully, MAKE A COPY, and return the form to the Selective Service. 2. You will then receive an ADVISORY LETTER from the Selective Service. 3. Bring the copy of the QUESTIONAIRE and ADVISORY LETTER to your next appointment at this office. Tax Clearance from I.R.S. for tax year (s) Letter from church re: religious beliefs in bearing arms. Letter from person (s) who gave affidavit of support at time of your lawful entry to the United States. Letter from Dept. of Social Services and/or Social Security Administration re: eligibility. Other: P.Jan DAO Robertk Richard K. Rogers Form N-14B.2 District Director"
}