{
	"anumber": "A92402041",
	"id": "A92402041_0012",
	"page_index": 12,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92402041_0012/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Information about your residences and employment., NARA, 8/11/2023"
		},
		"years": {
			"ms_years_nlp_v1": [2023]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 8/11/2023 Part 4. Information about your residences and employment. A. more space, continue on separate paper: List your addresses during live (5) years you SQZ permanent resident, Begin with your address. If you the last or since became a whichever IS less. current need 15) Dates (month/day/ year) Street Number and Name, City, State, Country, and Zip Code 4216 W. 1ST ST. LOS B. List your employers during the or most recent none, write more continue on separate paper. GM last ANGELES, five (5) Street years. CA. Name List 90004 your and Employer's Number present no x Kdress City, State and employer ZIP Code first. Dates If From Employed \"None\" (month/day/year) To If you 10-83 need From Occupation/position space, PRESENT John Employer's Name . UNEMPLOYED SSIRAME 09-16-90 PRESENT RETIRED ADPROX $650/00 BAED HOW we Min Part 5. Information about your marital history. A. Total number of times you have been married NONE If you are now married, complete the following regarding your husband or wife. Family name Address Date of birth to Given name Middle initial (month/day/year) Country of birth new Citizenship Social A# (if applicable) Immigration status Security# (If not a U.S. citizen) Naturalization (If applicable) (month/day/year) Place (City. State) If you have ever previously been married or if your current spouse has been previously married, please provide the following on separate paper: Name of prior spouse, date of marriage, date marriage ended, how marriage ended and immigration status of prior spouse. Part 6. Information about your children. B. Total Number of Children NONE . Complete the following information for each of your children. If the child lives with you, state \"with me\" in the address column; otherwise give city/state/country of child's current residence. If deceased, write \"deceased\" in the address column. If you need more space, continue on separate paper. Full name of child Date of birth Country of birth Citizenship A Number Address B Form N-400 (Rev 07/17/91)N Continued on next page"
}
