{
  "anumber": "A92402041",
  "id": "A92402041_0064",
  "page_index": 64,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92402041_0064/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/11/2923, Form No. 4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1925,
        1987,
        2023,
        1915,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 TRANSLATION or is \"BIRDH KOREA 1. NAME: SEBASTIANA DEL CARMEN LOPEZ (first) (middle) (last) 2. BIRTH: - Place: MATAGALPA MATAGALPA NICARAGUA (city or town (state or province) (country) - Date : JANUARY / 20 / 1915 (month) (day) (year) 3. FATHER'S NAME: ABELINO LOPEZ-GUTIERREZ - (first) (maddle) (last) 4. MOTHER'S NAME: FRANCISCA RAMIREZ-ZELAYA (first) (muddle) (last 5. CERTIFICATE ISSUED: - Data: NOVEMBER /8 / 1978 (month) (day) (year) Place: MATAGALPA MATAGALPA NICARAGUA (city or town) (state or province) (country) Magistrate: LUZ QUEZADA DE MEDAL (full name) 6. CERTIFICATE FOUND: Archive or Register: Matagalpa Face 77 No. Book 40 of birth 7. NOTATIONS OF IMPORTANCE: Writing instrument of recognition register N4F23 of the book of recognition of illegitimate children by Mr. Abelino Lopez Gutierrez, Matagalpa April 27, 1925. J.S. Matus. CERTIFICATION OF TRANSLATOR'S COMPETENCE I, (*) FRITZ H. KREIMANN , hereby certify that the above is an accurate translation of the original \"birth certificate\" in (**) Spanish and that I am competent in both English and (**) Spanish to render such translation. Date December / 4 / 1987 FR (signature of translator) 1751 Armigton Ave. (address) Phone (818) 961-5415 Hacienda Heights, Ca. 91745 (city) (state) (zip) (*) Printed or typed, name of the translator in full. (\"*) Language of the original certificate -- Spanish, French, Chinese, German, etc. The original document, and copy of it if you wish original returned should be attached to this summary translation form and certification Title 8 of the CFR, Part 292.1 (a) (3) forbids private individuals to charge any fees for filling out this form."
}