{
	"anumber": "A94192315",
	"id": "A94192315_0020",
	"page_index": 20,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A94192315_0020/full/max/0/default.jpg"
	},
	"fields": {
		"doctype": {
			"ms_doctype_v1": "letter"
		},
		"form_title": {
			"ms_form_title_llm_v1": "Immigration and Nationality Act ( Form I-4"
		},
		"countries": {
			"ms_countries_nlp_v1": ["United States", "Marshall Islands"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1972]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "Screened by NARA, 6/29/2023 Eligibility GROUP A meaning of the International Organization Immunities Act. I have The current immigration laws and regulations permit certain classes of aliens certification from this sponsor and I have also attached my INS Form I- to work in the United States. If you are an alien described below, you do 20 ID copy. FEE REQUIRED not need to request that employment authorization be granted to you, but you (c) (4) - I am the dependent of an officer or employee of an international do need to request a document to show that you are able to work in the organization (G-1 or G-4). I have attached certification from the United States. For aliens in classes (a) (3) through (a) (11), NO FEE will be Department of State recommending employment. NO FEE. required for the original card or for extension cards. A FEE will be required if a replacement employment authorization document is needed. A FEE IS (c) (5) - I am the dependent of an exchange visitor and I have J-2 REQUIRED for aliens in item (a) (12) who are over the age of 14 years and nonimmigrant status. FEE REQUIRED. under the age of 65 years. (c) (6) - I am a vocational foreign student (M-1). I have attached certification from the designated school official recommending Place an X in the box next to the number which applies to you. employment for practical training. I have also attached my INS Form 1. 20ID Copy. FEE REQUIRED. (a) (3) - I have been admitted to the United States as a refugee. (c) (7) - I am the dependent of an individual classified as NATO-1 (a) (4) - I have been paroled into the United States as a refugee. through NATO-7. FEE REQUIRED. (a) (5) - My application for asylum has been granted. (c) (8) I have filed a non-frivolous application for asylum in the United (a) (6) - I am the fiancé(e) of a United States citizen and I have K-1 States and the application IS pending. FEE REQUIRED FOR REPLACEMENT ONLY. nonimmigrant status; OR I am the dependent of a fiancé(e) of a United States citizen and I have K-2 nonimmigrant status. (c) (9) - I have filed an application for adjustment of status to lawful (a) (7) - I have N-8 or N-9 nonimmigrant status in the United States. permanent resident status and the application IS pending. FEE REQUIRED. (a) (8) - I am a citizen of the Federated States of Micronesia or of the Marshall Islands. (c) (10) - I have filed an application for suspension of deporation and the application is still pending. FEE REQUIRED. (a) (10) - I have been granted withholding of deportation. (c) (11) - I have been paroled into the United States for emergent (a) (11) - I have been granted extended voluntary departure by the reasons or for reasons in the public interest. FEE REQUIRED. Attorney General. (c) (12) - I am a deportable alien and I have been granted voluntary (a) (12) - I am an alien who has been registered for Temporary departure either prior to or after my hearing before the immigration Protected Status (TPS) and I want an employment authorization judge. FEE REQUIRED. document. FEE REQUIRED. (c) (13) - I have been placed in exclusion or deportation proceedings. I have not received a final order of deportation or exclusion and I have GROUP C not been detained. I understand that I must show economic necessity and I will refer to the instructions concerning \"Basic The immigration law and regulations allow certain aliens to apply for Criteria to Establish Economic Necessity.\" FEE REQUIRED. employment authorization. If you are an alien described in one of the (c) (14) - I have been granted deferred action by INS as an act of classes below you may request employment authorization from the INS and, administrative convenience to the government. I understand that I if granted, you will receive an employment authorization document. The must show economic necessity and I will refer to the instruction FEE REQUIRED printed below refers to your initial document, instructions concerning \"Basic Criteria to Establish Economic replacement, and extension. Necessity.\" FEE REQUIRED. Place an X in the box next to the number which applies to you. (c) (16) - I entered the United States prior to January 1, 1972 and have been here since January 1, 1972. I have applied for registry as a (c) (1) - I am the dependent of a foreign government official (A-1 or A- lawful permanent resident alien and my application is pending. FEE REQUIRED. 2). I have attached certification from the Department of State recommending employment. NO FEE. (c) (17) (i) - I am a (B-1) visitor for business. I am and have been (c) (2) - I am the dependent of an employee of the Coordination Council (before coming to the United States) the domestic or personal servant of North American Affairs and I have E-1 nonimmigrant status. I have for my employer who IS temporarily in the United States. FEE REQUIRED. attached certification of my status from the American Institute of Taiwan. FEE REQUIRED (c) (17) (ii) I am a visitor for business (B.1) and am the employee of a (c) (3) (i) - I am a foreign student (F-1). I have attached certification foreign airline. I have B-1 nonimmigrant classification because I am from the designated school official recommending employment for unable to obtain visa classification as a treaty trader (E-1). FEE REQUIRED. economic necessity. I have also attached my INS Form I-20 ID copy. FEE REQUIRED. (c) (18) - I am a deportable alien who has been placed under (c) (3) (ii) - I am a foreign student (F-1). I have attached certification an order of supervision (OS). I Understand that I must from the designated school official recommending employment for show economic necessity and I will refer to the practical training. I have also attached my INS Form I-20 ID copy. instructions concerning \"Basic Criteria to Establish FEE REQUIRED. Economic Necessity.\" FEE REQUIRED. (c) (3) (iii) - I am a foreign student (F-1). I have attached certification (c) (19) - I am an alien who IS prima facie eligible for Temporary from my designated school official and I have been offered employment Protected Status (TPS) and (1) INS has not given me a reasonable under the sponsorship of an international organization within the chance to register during the first 30 days of the registration period [FEE REQUIRED|, or (2) INS has not made a final decison as to my eligibility for TPS. FEE REQUIRED. Page 3 FPI-PET"
}
