{
	"anumber": "A94192315",
	"id": "A94192315_0021",
	"page_index": 21,
	"resources": {
		"full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A94192315_0021/full/max/0/default.jpg"
	},
	"fields": {
		"sex": {
			"ms_sex_llm_v1": "female"
		},
		"doctype": {
			"ms_doctype_v1": "form"
		},
		"form_title": {
			"ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Eligibility Questionnaire"
		},
		"countries": {
			"ms_countries_nlp_v1": ["Germany", "United States"]
		},
		"years": {
			"ms_years_nlp_v1": [2023, 1933, 1991, 1945]
		}
	},
	"is_g325a": false,
	"is_cert_naturalization": false,
	"full_text": "U.S. Department of Justice Screened by NARA, 6/29/2023 Temporary Protected Status Immigration and Naturalization Service Eligibility Questionnaire OMB No. 1115-0170 1, Full name: (Family name in CAPS) (First) (Middle) 2. Date of birth (month/day/year): 3. A # 06-14-06 4. Country of nationality: ALVARENGA, MARIA JUANA EL SALVADOR 5. I have resided in and been continuously physically present in the United States since (month/day/year) 09-18-83 6. Applicants must establish that they are admissible to the United States. Except as otherwise provided by law, aliens within certain classes are not admissible to the United States under the provision of 8 U.S. C. 1182 and as provided by 8 U.S. C. 1253(hx2). Allens who fall within any of the following classes are subject to exclusion from the United States: Have committed or have been convicted of any crime or violation of Have been associated in any way with the Nazi Government in law of a state, the United States, or any foreign state: Germany during the period beginning March 23, 1933 and ending on May 8, 1945; Have engaged in, or who intend to engage in any commercialized sexual activity; Are paupers. professional beggars, or vagrants; Have for gain, encouraged or assisted any other alien to enter the Have ever arrived in the United States as a stowaway; United States in violation of law; Have ever asserted immunity from criminal jurisdiction with Are mentally retarded, insane, suffered one or more attacks of respect to prosecution for a criminal offense committed in the United insanity, afflicted with a psychopathic personality, sexual States and as a consequence departed from the United States; deviation, mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; Are, or have at any time been, an anarchist, member of or affiliated with any communist or other totalitarian party, including any Are a polygamist or who advocate polygamy; subdivision or affiliate thereof; Have been excluded and deported from the United States within the Have advocated or taught, either by personal utterance, or by means past year. or have been deported from the United States or removed of any written or printed matter, or through affiliation with an from the United States at government expense within the past 5 organization. opposition to organized government, overthrow of a years; government by force or violence, sabotage, the unlawful destruction of property, the assaulting or killing of government officials because Have procured or attempted to procure a visa, other of their official character, or the doctrines of world communism or documentation, entry into the United States or any other the establishment of a totalitarian diotatorship in the United Immigration benefit by fraud or misrepresentation; States; Have applied for exemption or discharge from training or service in Intend to engage in activities prejudicial to the national interests or the Armed Forces of the United States on the ground of allanage, or unlawful activities of a subversive nature; have been relieved or discharged from that training or service, or have left the United States to avoid military service in time of war or national emergency; Do any of the above statements apply to you? Yes (If yes. explain 00 reverse or on a separate sheet of paper and attach to this form) No 7. Have you over ordered, assisted, or otherwise participated in the persecution of any person because of race, religion, Yes No nationality, membership in a particular social group, or political opinion (as provided by 8 U.S. C. 1253(hx2))? I understand all the above questions, having asked for and obtained a translation or explanation of every point which was not understood or clear to me; and I certify that none of these categories apply to me except as listed on the reverse or on the attached explanation. illiterate (Signature of Applicant) (Signature of Interpreter, if used) DO NOT WRITE IN THIS BLOCK FOR INS USE ONLY Subacribed and sworn to (Affirmed) by the above named applicant before me this 18th day of DUG 1991 at LOS Chuens FFO . (Signature of Officer) (Title) Reporture barden Public reporting burden for this collection of information is estimated to available 13 minutes per response, INCIDEING the time for reviewing instructions, maryhine existing data sources. and maintaining the date needed. and completing and reviewing the collection of information Bend comments reg this burden estimate or any other aspect or this collaous of information including suggestions for reducing this burden to: U.S. Department of Justice, Immigration and Natoralization Service (Room (304), Washington D.C. 20038 and to the Office of Management and Budget. Paperwork Reduction Proyect OMB No. 1115-0170. Washington D.C. 20503 Form I-821 (12-27-90)"
}
