{
  "anumber": "A94192315",
  "id": "A94192315_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A94192315_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ORDER TO SHOW CAUSE AND NOTICE OF HEARING"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 6/29/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service ORDER TO SHOW CAUSE and NOTICE OF HEARING In Deportation Proceedings under Section 242 of the Immigration and Nationality Act UNITED STATES OF AMERICA: File No. 94 192 315 In the Matter of MS. MAMA JUANA ALVANENGA Respondent. Address 3951 DWIGGINS ZIP STREET code) los ANGELES CAL,FORNIA 90063 (number. street. City. state. and UPON inquiry conducted by the Immigration and Naturalization Service. it is alleged that: 1. You are not a citizen or national of the United States: 2. You are a native of EL SALVADOR and a citizen of EL SALVADOR 3. You entered the United States at or near San Ysidro, California or about SEPTEMBER 18,1983 on (date) 4. You were not then inspected by an immigration officer. AND on the basis of the foregoing allegations. it is charged that you are subject to deportation pursuant to the following provision(s) of law: Act, that you entered the United States without inspection Section in 241 (a) (1) (B) of the Immigration and Nationality WHEREFORE, YOU ARE ORDERED to appear for hearing before an Immigration Judge of the Immigration and Naturalization Service of the United States Department of Justice at on March 31, Office of the Immigration Judge, 300 North Los Angeles Street 1993 at 10:00 a m. and show cause why you should not be deported from the United States on the charge(s) set forth above. Dated: 05/11/92 DEPUTY ASSISTANT DISTRICT DIRECTOR (signature and title of issuing officer) LOS ANGELES CALIFORNIA (City and State)"
}