[
  {
    "anumber": "A90414760",
    "id": "A90414760_0003",
    "page_index": 3,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A90414760_0003/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1906,
          2023,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "MIAI, FLORIDA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/13/2023 No. 23066701 CANNE OB ANNOR DIZNMON Personal description of holder INS RegistrationNo. A090414760 as of date of naturalization: Date of birth: SEPTEMBER 19, 1906 hereto is a likeness of me. I certify that the description given is true, and that the photograph affixed Sex: FEMALE Height: 5 feet 0 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: MIAMI, FLORIDA NICARAGUA The Attorney General having found that: ELIDA BOLANOS then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. IMMIGRATION & NATURALIZATION SERVICE at: MIAMI BEACH, FLORIDA on: APR 13 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE, Dais WITHOUT LAWFUL AUTHORITY. Commissioner of alization Meisonic XIZ FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A17181791",
    "id": "A17181791_0004",
    "page_index": 4,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17181791_0004/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, Form N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1976
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Divorced"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1976
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "720 South San Rafael Avenue, Pasadena, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "SIGNATURE OF HOLDER IS NOT REQUIRED ON THIS DUPLICATE STUB DUPLICATE DO NOT DETACH TO BE FORWARDED TO No. 10533276 IMMIGRATION AND NATURALIZATION SERVICE CERTIFIED CATE 0 Pelition No! 374025 Alien Registration Ro A17 181 791 DUPLICATE Personal description of holderas, of datesfnaturalization. Date of birth October 27, 1914 sex Female ; complexion Medium colorobeyes Brown colorofhair Gray height 5 feel 0 inches; weight 139 pounds; visible distinctive marks None Maritalstatus Divorced Country of formernationality China certify that the description, above given is true, andMhadthephotographaffived hereto is a likeness ofm Betty Peting Mae Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that at a termolthe District Court,of The United States heldpursuants to law al Los Angeles on September 17, 1976 the Court havingfoundshal *** BETTY PEI-ING MAO then residing at 720 South San Rafael Avenue, Pasadena, California inlends loreside permanently in the United. States when sorequired by the Naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions of ruch naturalization laws, and was entilled to be Seal admitted socilixenship. thereupon ordered that such person be and shewas admilled as a citizen of the United States of America, Intestimony whereof thesealof the courtis hereunto, affixed this 17th day of September in the year of our Lord nineleen hundred and Seventy-six EDWARD M. KRITZMAN Clerk of the U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S. Clay Deputy Clerk."
  },
  {
    "anumber": "A20550522",
    "id": "A20550522_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20550522_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11574244"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Pakistan",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1983,
          1913
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1983
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1619 S. Westmoreland Ave., Los Angeles, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/18/2023 a TO BE FORWARDED TO No. 11574244 IMMIGRATION AND NATURALIZATION SERVICE 1 Pelilion No. 479681 DUPLICATE AlienRegistration Re A20 550 522 Personal description FATH of holdera of date of DARK naturalizations Date of birth JULY 13, 1913 sex MALE complexione colorobeyes BROWN NONE color of hair GREY height 5 feet I inches; weight MARRIED visible distinctive marks Maritalstatus Country of formernationality PAKISTAN I certify that the description above givents true, and that the photograph, afficed hereto is a likeness of me. Huauand Tolavious Guhajam / Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States 18, 1983 Los Angeles ONHIRANAND TOL ARAM GULRAJANI the Court having, found that then residing at 1619 S. WESTMORELAND AVE. 9 LOS ANGELES, CA. inlends loreside permanently in the United. States when so required by the Naturalization Laws of the United. States), had in all other respects, complied with the applica ble provisions, of such naturalization laws, and was entilled to be Seal admitted locitisenships thereupon ordered that such person be and (s)he was admilled as a citizen of the United States of America. In whereoft the sealof the courtis hereunto, afficed this 18 TH day of MARCH EIGHTY-THREE in the year of our. Lord nineteen hundred and LEONARD A. BROSNAN Clerk of the U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Elemnor allow Deputy Clerk."
  },
  {
    "anumber": "A10430675",
    "id": "A10430675_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10430675_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate,, 11283"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1904,
          1959
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1959
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "322 Sunset Drive, Pullman, Washington"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "CA DUPLICATE TO BE FORWARDED TO No. 7683675 IMMIGRATION AND NATURALIZATION SERVICE ONE Petition No. 11283 Personal description, of holders of date cofnaturalization: Date of birth April 13, 1904 sex male ; complexion dark coloroleyes brown color of hair gray-black height 5 feel 8 inches; weight 142 pounds; visible distinctive marks none Maritalstatus married formernationality China I certify that the description, above given is have, and that thepholograph, afficed hereto is a likeness of me. have sign mailing Complete and true of Line holder) signature United States of America SS. Eastern District of Washington Beitknown, that at a term of the District the United States, Eastern District of Washington Court of held pursuantle lawal Spokane on April 3, 1959 the Court havingfoundshal MAOLING LIU then residing at 322 Sunset Drive, Pullman, Washington intends loreside permanently in the United. States when so required by the Naturalization. Laws of the United. States), had in allother respects, complied with the applicable provisions of such naturalization laws, and was entitled to be Seal admitted docilizenship thereupon ordered that such person be and(s)hewas admitted as a citizen of the United States of America. Intestimony whereof thesealof the courtis hereunto afficed this third day of April fifty-nine in the year of our Lord nineteen hundred and and of our Independence the one hundred and eighty-third. Dorotly Moulton Hisaviolation of the u L. Code land Acting Clerk of the U. s/o District Court. punishable as such) to copy. print, photograph. or otherwise illegally use this certificate. By Deputy Clerk."
  },
  {
    "anumber": "A17195429",
    "id": "A17195429_0061",
    "page_index": 61,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17195429_0061/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "DUPLICATE OF NATURALIZATION CERTIFICATE, FORM N-550 ( (REV. 11-1-87)Y"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1989,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1989
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1963 ROSE VILLA ST., PASADENA, CA.91107"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/21/2023 FORM N-550 U.S. DEPARTMENT OF JUSTICE No. 13966070 IMMIGRATION AND NATURALIZATION SERVICE (REV. 11-1-87)Y Name NUI CHAN residing at 1963 ROSE VILLA ST. , PASADENA, CA. 91107 SIGNATURE OF HOLDER Date of birth 03/06/15 Date of order of admission 08/21/89 IS NOT REQUIRED ON THIS DUPLICATE STUB Date certificate issued AUGUST 21, 1989 by the DUPLICATE U, S. District Court at Los Angeles, California DO NOT DETACH Petition No. 00785611 INS Registration No. A17 195 429 TO BE FORWARDED TO No. 13966070 IMMIGRATION AND NATURALIZATION SERVICE CANEL O Pelilion No. 00785611 DUPLICATE INS. Registration ne A17 195 429 Personal description of holderas effection Date of birth MARCH 06, 1915 sex FEMALE ; complexion MEDIUM coloroleyes BROWN weight 110 pounds, visible distinctive/marks color of hair BLACK height 05 feel 05 inches; NONE Maritalstakes MARRIED Country of formernationality CHINA MAINLAND certify that the breen and thatther photograph a likeness of me. New chrom / Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beilknown, that ala termof the District Court of The United States Los Angeles AUGUST 21, 1989 on NUI CHAN the Gourheavingfoundshak then/residing, at 1963 ROSE VILLA STREET, PASADENA, CA. inlandstoreside, permanentlyin, the United States when sorequired by the Naturalization Laws oft the United. States), had in all other respects, complied with the applicable, provisions, of such naturalization laws, and was entilled lobe Seal admilled docilisenship.MhereuponorderedMhalsuch herson, be and(s)hewas admilled as a citizen of the United States of America, Indestimony whereof the esealofthe,courtis, hereuntorafficed.,this 21TH day of AUGUST EIGHTY-NINE LEONARD A. BROSNAN Glerk of the U.S. District Court. By Deputy Glerk. FORM N-550 (REV. 11-1-87)Y"
  },
  {
    "anumber": "A92141101",
    "id": "A92141101_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92141101_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, Form N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2000
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 2000
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Pomona, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 25511505 ( Personal description of holder INSRegistrationNo. A 92 141 101 as of date of natur ralization: I certify that the description given is true, and that the photograph affixed Date of birth: FEBRUARY 21, 1914 hereto is a likeness ofme. Sex: FEMALE Height: 5 feet 2 inches Complete and true signature of holder) Marital status: SINGLE Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA EL SALVADOR The Attorney General having found that: FELICITA ORDONEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: POMONA, CA on: FEBRUARY 23, 2000 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, Dairs meissae PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization 4.2 FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A92360662",
    "id": "A92360662_0003",
    "page_index": 3,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92360662_0003/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 24890838 D Personal description of holder INS RegistrationNo. A 92 360 662 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: NOVEMBER 12, 1914 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 0 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA NICARAGUA The Attorney General having found that: MARIA MAGDALENA MATUS DE HUNTER then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: JULY 27. 1999 that such person is admitted as a citizen of the United States of (merica. !T IS PUNISHABLE BY U.S. LAW TO COPY. Daris Micisian PRINT OR PHOTOGRAPH THIS CERTIFICATE. WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A28621564",
    "id": "A28621564_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28621564_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, FORM N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1990,
          2023,
          1909
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1998
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Miami Beach, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/28/2023 No. 23024261 CANNER ODB VEN NATON Personal description of holder INS RegistrationNo. A028621564 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: OCTOBER 17, 1909 hereto is a likeness of me. Sex: MALE Height: 5 feet 7 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: MIAMI, FLORIDA NICARAGUA The Attorney General having found that: JOSE ROMAN then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. IMMIGRATION & NATURALIZATION SERVICE at: MIAMI BEACH, FLORIDA on: DEC 10 1990 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE Darcs meissaee WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization USTICE FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A71829679",
    "id": "A71829679_0007",
    "page_index": 7,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71829679_0007/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2005,
          1912,
          2023
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 2005
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Los Angeles, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/25/2023 No. 28524961 ERRIT ZANON Personal description of holder CFS Registration No. A071829679 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: MAY 22, 1912 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 0 inches (Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Secretary of Country of former nationality: Homeland Security at: LOS ANGELES, CALIFORNIA NICARAGUA The Secretary having found that: JULIA AMELIA LOPEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the US DISTRICT COURT CENTRAL DISTRICT at: LOS ANGELES, CALIFORNIA on: MAY 19, 2005 that such person is admitted as a Citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Director; U.J. Citizenship and Immigration Services OF HOMELAND SEURITYI FORM N-550 REV. 4/04"
  },
  {
    "anumber": "A34190657",
    "id": "A34190657_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "U.S. Naturalization Certificate, FORM N-550 ( (REV. 11-1-87)Y"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1911,
          1991
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1991
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "THOUSAND OAKS, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "FORM N-550 Screened by NARA, 9/25/2023 No. 14732274 U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (REV. 11-1-87)Y Name SHU-TUNG CHIANG residing at 3910. VIA VERDE THOUSAND OAKS, CA. 91360 SIGNATURE OF HOLDER Date of birth 8/17/11 Date of order of admission 10/10/91 IS NOT REQUIRED ON THIS DUPLICATE STUB Date certificate issued OCTOBER 10TH, 1991 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH Petition No. 00.883844 INS Registration No. A34. 190. : E. 8.50 Chiang TO BE FORWARDED TO No. 14732274 IMMIGRATION AND INATURALIZATION SERVICE 0 Petition No. 00883844 DUPLICATE INS Registration Re A34 190 657 Personal description, of holderus, Date of birth AUGUST 17, 1911 isea MALE ; complexion MEDIUM coloropeyes BROWN color of hair GRAY height 5 feet 5 inches; weight 110 pounds, visible edistendive marks NONE Maritalstatus MARRIED Country of formernationality CHINA, MAINLAND I certify that the description, above givenis, drive, heretois, a likeness of me. Shoe Chiang / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that alatermofthe District Court,of The United States held hursuantto, lawal Los Angeles on OCTOBER 10TH, 1991 SHU-TUNG CHIANG themresidingal 3910 VIA VERDE, THOUSAND OAKS, CA inlends loreside permanonWlyin, the United States when so required bythe Naturalization Laws ofthe United States), had in all otherrespects, complied with the applicant all provisions, of such naturalization laws, and was entilled lobe Seal admilledNoxilizenshe ih thereupon ordered that such person be and(s)howas admilled as a cilixen of the United States of America. Intestimony whereof thesealos, the courtis, 10TH day of OCTOBER menedeen/hundred.and NINETY-ONE LEONARD A. BROSNAN Clerk of the U.S. District Court. By Martha Solid Deputy Clerk. FORM N-550 (REV. 11-1-87)Y"
  },
  {
    "anumber": "A12994632",
    "id": "A12994632_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12994632_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2023,
          1987
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1987
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "3379 DESCANSO DR. LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "FORM N-550 Screened by NARA, 9/18/2023 U. S. DEPARTMENT OF JUSTICE No. 12945207 IMMIGRATION AND NATURALIZATION SERVICE (REV. 5-1-841Y Name CHU, WAI MAN residing at 3379 DESCANSO DR. SIGNATURE OF HOLDER Date of birth LOS ANGELES Date of or andreamission IS NOT REQUIRED ON THIS 5/27/14 7/ 9/87 DUPLICATE STUB Date certificate issued JULY 9TH, 1987 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH Petition No. 00678033 INS Registration No. A12 994 632 12 PM Was Marce who ( TO BE FORWARDED TO No. 12945207 IMMIGRATION AND NATURALIZATION SERVICE OBRRUOBU ONE 0 Pelilion No. 00678033 INS. Registration No A12 994 632 DUPLICATE Personal description, of holder as Date of birth MAY 27, 1914 sex MALE ; complexion MEDIUM colorobeyes BROWN color hair GRAY height 5 feel 6 inches; weight 158/hounds; visible distinctive marks MOLE RT SIDE LIP Maritalstatus MARRIED Country of formernationality CHINA I certify that the description, above given is true, and thank a likeness of me. Was Illant who ( Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that ala termofthe District Court of The United States held pursuantle, lawal Los Angeles on JULY 9TH, 1987 the Court havingfoundsh thenresuting it WAI MAN CHU inlends loreside 3379 DESCANSO United DR States bythe Naturalization Laws ofthe United. States), hadin allotherrespects, complied with the applicable, provisions of such naturalization laws, and was entilled tobe Seal admitted docitivenship, thereupon ordered/that such person be and(s)hewas admilled as a citizen of the United States of America. Intestimony where eof this day of mineleen hundred ord JULY UST. CALIFORNIA EIGHTY-SEVEN OF LEONARD A BROSNAN IT IS PUNISHABLE BY U. S. LAW TO COPY, Glerk of the U.S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By frank Galvan Deputy Clerk."
  },
  {
    "anumber": "A46916529",
    "id": "A46916529_0075",
    "page_index": 75,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A46916529_0075/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "form"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP, No. 23500199"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1940
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1940
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Baltimore, Maryland"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 23500199 Personal description of holder INSRegistration No. FOIA (b)(6) as of date of naturalization: April 11, 1940 I certify that the description given is true, and that the photograph affixed Date of birth: hereto is a likeness of me. Sex: Male Vicurte Anibal Eoleds Height: 5 feet 6 inches Complete and true signature of holder) Marital status: Married Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: Baltimore, Maryland El Salvador The Attorney General having found that: Vicente Anibal Toledo then residing in the United States, intends to reside in the United States when so required by the Naturalization laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was. entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the at: U.S. Immigration & Naturalization Service on: NOV 19 19 Baltimore, Maryland that such person is admitted as a citizen of the United States of America. IT IS PUNISHAELE BY U. S LAW TO COPY, Daic meisering PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization Pike"
  },
  {
    "anumber": "A43194558",
    "id": "A43194558_0071",
    "page_index": 71,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43194558_0071/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550-C ( (REV. 11-1-87)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1956,
          1990
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Divorced"
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Atlanta, Georgia"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 14437753 CAVADI Petition No. 28626 ORIGINAL. INS PRegistration No. 22188899 Personal description, of holder as of date of naturalization: Date of birth SEPTEMBER 20, 1956 sex MALE complacion MEDIUM coloroboyes BROWN color of hair BLACK height 5 feel 8 inches; weight 145 pounds; visible distinctive marks NONE Maritalstatus DIVORCED Country of formerationality EL SALVADOR I certify that the description above givenis true, and that the photograph affired Heretor is a likeness of me. Gear Orlando Zepeda (Complete and true signature of holder) UNITED STATES OF AMERICA SS: NORTHERN DISTRICT OF GA Beit known, that ala termofthe U. S. DISTRICT Court of THE NORTHERN DISTRICT OF GEORGIA held pursuant lawal ATLANTA, GEORGIA on SEPTEMBER 21, 1990 the Court having found that CESAR ORLANDO ZEPEDA then/residing at ATLANTA, GEORGIA intends loreside permanenting in the United. States when so required by the Naturalization Lawsoft the United States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entitled to be Teal admitted decilisenship thereupon ordered that such person be and(s)hewas admitted as a citizen the United States of America. In elestimony whereofthe usealoft the courtis this 21ST day of SEPTEMBER nineteen hundred and NINETY LUTHER D. THOMAS Glerk of the U.S. DISTRICT Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. By Alwae Randstide Clerk. Deputy FORM N-550-C (REV. 11-1-87)"
  },
  {
    "anumber": "A21206025",
    "id": "A21206025_0001",
    "page_index": 1,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0001/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF NATURALIZATION, N-570 ( (REV. 11-1-87)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1999,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Widowed"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Aristotle, Simi Valley, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/28/2023 THE NMR No. 22557374 NRC copy INP. Registration No A21 206 025 Personaldescription of holderas of date ofissuanceoff this certificate; Date of birth June 21, 1915 sex Female ; complexion Fair coloroberges Brown colorofhair Black height 5 feel 00 inches: weight 107 pounds; visible distindive marks None Marital,states Widowed ;Country Vietnam / Complete and true signature of holder) Beitknown that THIN THI LE , residing as 202 Aristotle, Simi Valley, California , havingapplied by the Commissioner of Immigration and Naturalization for a Certificate of naturalization, and having proved the satisfaction ofthe Commissionerthal whe was naturalized by the United States District Court of California at Buena Park, California on January 22, 1999. Seal nom Therefore, inpursuance of theauthority containeding Section 343101 of the Immigration, and nationality Rob this Certificate of naturalization is issued this Twenty-Fourth day of May mineleon/hundred/ and Ninety-Nine and/shepealofshe Department IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. WITHOUT LAWFUL AUTHORITY. Daris Meinine 590675 COMMISSIONER OF IMMIGRATION AND INATURALIZATION FORM N-570 (REV. 11-1-87)"
  },
  {
    "anumber": "A21206025",
    "id": "A21206025_0006",
    "page_index": 6,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21206025_0006/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1999,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/28/2023 No. 22557374 Personal description of holder INS RegistrationNo. A21 206 025 as of date ofnatur ralization: I certify that the description given is true, and that the photograph affixced Date of birth: JUNE 21, 1915 hereto is a likeness ofme. Sexo: FEMALE Height: 5 feet 00 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA VIETNAM The Attorney General having found that: THIN THI LE then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: JANUARY 22, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.S. LAW TO COPY, Daris mission PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A91807746",
    "id": "A91807746_0004",
    "page_index": 4,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A91807746_0004/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1912,
          2023,
          1998
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1998
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA 7/13/2023 R CA No. 23121661 Personal description of holder INS RegistrationNo. A 91 807 746 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: FEBRUARY 13, 1912 hereto is a likeness of me. Sex: FEMALE Height: 4 feet 11 inches Complete and true signature of holder) Marital status: SINGLE Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA NICARAGUA The Attorney General having found. that: MARIA BRAVO REYES then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony condacted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: DECEMBER 17, 1998 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, Daris mechine PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A92402041",
    "id": "A92402041_0010",
    "page_index": 10,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92402041_0010/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1999,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/11/2023 No. 22556539 Personal description of holder INS RegistrationNo: A 92 402 041 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: JANUARY 20, 1915 hereto is a likeness ofme. Sex: FEMALE Height: 5 feet 0 inches Complete and true signature of holder) Marial status: SINGLE Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA NICARAGUA The Attorney General having found that: Y SEBATIANA CARMEN LOPEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such natur ralization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA (A AS TO VER at: LOS ANGELES, CA on: FEBRUARY 23, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.'S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE Daris mission WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization JUSTICE FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A34038282",
    "id": "A34038282_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34038282_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11 902882"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Mexico",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1985,
          1913
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "P.O. Box 312, Ignacio, Colorado 81137"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE TO BE FORWARDED TO No. 11902882 IMMIGRATION AND NATURALIZATION SERVICE CATE Pelilion No. 511 DUPLICATE AlienRegistration No. A34-038-282 Personal description of holderas of Date of birth June 25, 1913 sex Male complexion Fair colorobeyes Hazel color of hair Black height 6 feet 3 inches; weight 170 pounds; visible distendive marks Mole on chin; scar from medical surgery on right Maritalstatus Single Country of formernationality. Mexico I certify that the description above given is hue, and that thepholograph efficed hereto is a likeness of me. Juan Rain Sanches ( Complete and true signature of holder) STATE OF COLORADO COUNTY OF LA PLATA } SS: Beitknown that at term of the District La Plata County, , Colorado, Court of heldpursuanttolowal Durango, Colorado, on October 7, 1985, Juan Quintana Sanchez, the Court havingfour then residing at P. O. Box 312, Ignacio, Colorado 81137, intends loreside permanently in the United. States when sorequired by the Naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled tobe Seal admitted to citizenships thereupon ordered that such person be and(s)hewas admitted as a citizen of the United States of America, In destimony whereof thesealofthe, courtis hereunto,affaced this 7th day of October in the year ofour. Lord mineteen, hundred and eighty-five. Dorathy Culp Clerk of the District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk. EJSIVCE"
  },
  {
    "anumber": "A17182973",
    "id": "A17182973_0005",
    "page_index": 5,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17182973_0005/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2023,
          1974
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1974
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "3426 Vinton Ave, #3, Los Angeles, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/18/2023 a TO BE FORWARDED TO No. 9881268 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Delilion No. 358012 AlienRegistration No A17 182 973 DUPLICATE Personal,description of holder's of date of naturalization: Date of birth January 9, 1914 isea Me le ; complexion Medi colorobeyes Brown color of hair Black height 5 feel 6 inches; weight 125 pounds; visibledistinclivemarks None. Maritalstatus Marr led Country of formernationality. China. I certify that the description, above given is hue, and hereto, is a likeness of m HanLee Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that ala termofthe District Court,of The United States held pursuant to lawal Los Angeles on December 20, 1974 the Gourthaving foundshal ***YOH HAN LEE*** ther/residing at 3426 Vinton Ave. #3, Los Angeles, California inlandstoreside, permanonlyying the United. States when sorequired by the Naturalization Laws ofthe United. States), had in other respects, complied with the applicable provisions of such naturalization laws, and was entilled lobe Seal admitted socitisenships thereupon ordered that such person be and (s)hewas admilled as a cilixen a the United States of America. Intestimony whereof thesealof, the courtis hereunto affixed this 20th in day of December in the year of our. Lord nineleen hundred and Seventy-four EDWARD M. KRITZMAN IT IS PUNISHABLE BY U. S. LAW TO COPY, Glerkofthe U.S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S. C 1mg Deputy Clerk."
  },
  {
    "anumber": "A34140438",
    "id": "A34140438_0009",
    "page_index": 9,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34140438_0009/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 112207544"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1981,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1981
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "P.O. Box 731, 916 7th Street, Parker, Arizona"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 THE TO BE FORWARDED TO No. 11220754 IMMIGRATION AND NATURALIZATION SERVICE CATE 0 Pelition No. 18202 DUPLICATE AlienRegistration Ro A34 140 438 Personal description, of holder,as, of date of naturalization Date of birth August 25, 1915 sex male ; complexion medium colorobeyes brown color of hair black height 5 feel 3 inches; weight 122 pounds; visible edistinctive marks none Maritalstatus married Country of hormernationality China I certify that the description, above givenis brue affixed hereto is a likeness of me. man Tang / Complete and true signature of holder) UNITED STATES OF AMERICA DISTRICT OF ARIZONA } SS: Beit known, that at a termofthe United States District Court,of District of Arizona held pursuant to lawal Phoenix, Arizona on August 21, 1981 the Gourthavingfoundshab MAN TANG then residing at P.O. Box 731, 916 7th Street Parker Arizona inlends loreside permanentlyin, the United States when sorequired by the 12.9 Naturalization Laws of the United. States), had in all other respects, complied with the applicant ble provisions, of such naturalisation laws, and was entitled lobe Seal admilled docilisenship. such/personbe and(s)hewas admilled as a citizen of the United States of America. Investimony hereunto officed.,shis 21st day of August in Lordnineleenhundred and Eighty One Wd. FURSTENAU IT IS PUNISHABLE BY U.S. LAW TO COPY, By had il. Court. Clerk. Clock of the U.S DISTRICT PRINT OR PHOTOGRAPH THIS CERTIFICATE. Rodney If Browen"
  },
  {
    "anumber": "A21201155",
    "id": "A21201155_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201155_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate of Alien, 1157458"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1985,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "2433 W. Flora Street, Santa Ana, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "e by NARA, 0 THE CA TO BE FORWARDED TO No. 11574758 IMMIGRATION AND NATURALIZATION SERVICE 0 Pelilion No. 481639 DUPLICATE AlienRegistration Ro A21 201 155 Personal description of holder's of Date of birth JANUARY 3, 1915 sex FEMALE ; complexion MEDIUM coloroleyes BROWN color of hair BLACK height 5 feet 1 inches; weight 100 pounds; NONE Maritalstatus MARRIED Country of formernationality VIETNAM I certify that the description, above givenis, New and herelois a likeness of me. childrence / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: of Beit known, that at a termof the District Court of The United States held/pursuant to lawal Los Angeles on JULY 31, 1985 the Gourhavingfoundshal CHI THI LE then residing, at 2433 W. FLORA STREET, SANTA ANA, CA inlends, loreside, hermanenMying the United States when sorequired bythe Naturalization Laws of the United. States), hadin all other respects, complied with the applicable provisions of such naturalization laws, and was entilled do be Seal admilled socilisenship. thereupon nordered that such person be and(s)hewas admilled as a cilixen of the United States of America, Investimony whereofthesealofthe courtis, hereunto, affixced this 31ST day of JULY in theyearsfour Lord EIGHTY-FIVE . LEONARD A. BROSNAN Glerk of the U.S S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Frank Galvan Deputy Clerk."
  },
  {
    "anumber": "A42733525",
    "id": "A42733525_0065",
    "page_index": 65,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A42733525_0065/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550-C ( (REV. 11-1-87)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1990,
          2023,
          1935
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1990
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "San Francisco, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/26/2023 THE No. 14556161 Petition No. 400568 ORIGINAL INS Registration he FOIA (b)(6) Personal,description, of holders Date of birth JUNE 3, 1935 sex FEMALE complexion MEDIUM coloraboyes BROWN color frair BLACK height 5 feel 6 inches; weight 128 pounds; visibledishindivemark NONE Maritalstatus MARRIED Country of hormerpationality CHINA F certify that the description above givenis, Area and heretois, a likeness of m the / Complete-and true signature of holder) Pan UNITED STATES OF AMERICA SS: NORTHERN DIST. OF CALIF Beilknown,that ala formofthe DISTRICT Court of THE UNITED STATES SAN FRANCISCO on MAY 29, 1990 the Gouthavingfoundshal JING PAN them residing at SAN FRANCISCO, CALIFORNIA intends Moreside permanently in the United so required bythe Naturalization Laws of he United States), in allotherrespools, complied with had States when heapplicable provisions, of such naturalization laws, and was entitled lobe Seal admitted admilled as a cilixen of the United States of America, Intestimony whereof theseales,the court,'s herountoufficed 29TH day of MAY mineteen hundred,and NINETY Pachard W. Wishing Clerk of the U.S. DISTRICT Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. By Deputy Glerk. FJOSIUCCE FORM N-550-C (REV. 11-1-87)"
  },
  {
    "anumber": "A12491240",
    "id": "A12491240_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12491240_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The Naturalization Certificate, 10657327"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Cuba",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1977,
          1905
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1977
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Sweetwater, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE TO BE FORWARDED TO No. 10657327 IMMIGRATION AND NATURALIZATION SERVICE 0 Delilion No. 128174 DUPLICATE Alien Registration no. A12 491 240 Personal description of holderas of date of naturalization: Date of birth September 26, 1905 sex male ; complexion medium colorobeyes green color of hair gray height 5 feet 6 inches; weight 50 pounds; visible distinctive marks none Maritalstatus married Country of formernationality Cuba I certify that the description, above given is brue, hereto, is a likeness of me. Desiderio Bangel ( Complete and true signature of holder) UNITED STATES OF AMERICA SS: SOUTHERN DISTRICT OF FLORIDA Beitknown that at a termofthe District Court of The United States held pursuant, to lawal Miami, Florida on May 24, 1977 the Court havingfoundshai DESIDERIO RANGEL then residing at Sweetwater, Florida inlends loreside permanently in the United States when sorequired by the Naturalization Laws of the United States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entitled to be Seal admitted to acitizenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. In destimony whereofthesealofthe courtis hereunto,afficed, this 24th day of May in the year four Lord nineleen hundred and seventy-seven JOSEPH .I. BOGART IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Pilor Tee Deputy Clerk."
  },
  {
    "anumber": "A21203763",
    "id": "A21203763_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203763_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF IMMIGRATION AND NATURALIZATION SERVICE, 11286101"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1981,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1981
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "817 S. Burlington Ave. 302, Los Angeles, Ca"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/21/2023 TO BE FORWARDED TO No. 11286101 IMMIGRATION AND NATURALIZATION SERVICE CATE Pelilion No. 452712 DUPLICATE AlienRegistration no A21 203 763 Personal, description, of holderas of date of naturalezations Date of birth January 1. 1915 :see_Male ; complexion Medium coloropeyes Brown color of hair Grey weight 138 pounds; visible distinctive marks None height 5 feel 7 inches; Maritalstatus Married Country of formernationality. Vietnam I certify that the description above given is true, and that thophotographiafford heretor is a likeness of me. Boushow / Complete and true signature of holder) UNITED STATES OF AMERICA }ss SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States Esea held pursuant to lawal Los Angeles on June 22, 1981 the bourhavingfoundsha BEN SHAW then residing at 817 S. Burlington Ave. 302, Los Angeles, Ca. inlends loreside hermanently in the United. States when sorequired by the O Naturalization Laws of the United States), had in all other respects, complied with the applicable provisions, of such naturalization laws, and was entitled be Seal admitted docilisenships thereupon ordered that such person be and(s)hewas admitted as a citizen of the United States of America. Intestimony whereof thesealoft the courtis hereunto, affixed this 22nd day of June in the year of our Lord nineleen hundred and Eighty-One EDWARD M. KRITZMAN Clerk of the U. S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Maru ziledon Deputy Clerk."
  },
  {
    "anumber": "A71807696",
    "id": "A71807696_0006",
    "page_index": 6,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807696_0006/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, FORM N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1999,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/21/2023 No. 24723192 Personal description of holder INS RegistrationNo.,A 71807696 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: MAY 5, 1915 hereto is a likeness of me. Sex: FEMALE Height: 5 feel 0 inches Complete and true signature of holder) Marital status: SINGLE Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA EL SALVADOR The Attorney General having found that: MARIA EMILIA AGUILAR GONZALEZ their residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: MAY 26, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE. Daris missioner WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization Ba FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A71807696",
    "id": "A71807696_0058",
    "page_index": 58,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71807696_0058/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 4 1288373"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1937,
          2023,
          1981
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1981
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "3142 Vera Ave., Los Angeles, CA."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/21/2023 THE No. 11288373 CAREOO ON Pesition No. 453464 ORIGINAL. AlienRegistration Ra FOIA (b)(6) Personal description of holderas, of date of naturalization: Date of birth May 5, 1937 isex Female ; complexion Medim colorofeyes Brown color of hair Brown height 5 feet 5 inches; weight 160 pounds; visible distinctive marks None Maritalstatus Married Country of formernationality El Salvador I certify that the description, above given is breasand thatshopholograph, affired hereto, is alikeness of mo / Maria Isobel Castro / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that ala dermofthe District Court of The United States held pursuant lawal Los Angeles on June 22, 1981 the Gourthavingfoundshad MARIA ISABEL CASTRO then residing at 3142 Vera AVe., / Los Angeles, CA. inlends, loreside permanentlying the United States whensorequired, brythe naturalization laws of the United States), had in with the applicable provisions, of such naturalization, laws and was entilled lobe Seal admilled docilisenship such personbe and (s)hewas admitted as a cilixen all the United States of America, Indestimony whereof thesealofthe courtis, horountorafficed this 22nd day of June in Lord nineteen hundred and Eighty-One EDWARD M. KRITZMAN Glerkof the U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE By Maru Zelidons Glerk."
  },
  {
    "anumber": "A21201153",
    "id": "A21201153_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21201153_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 11207"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1982,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1982
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Westminster, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/21/2023 THE a TO BE FORWARDED TO No. 11162931 IMMIGRATION AND NATURALIZATION SERVICE ONE 1 Pelilion No. 19207 DUPLICATE AlienRegistration Ro A21 201 153 Personal description of holderas of date of naturalization: Date of birth August 1, 1915 sex Male ? complexion Medium colorofeyes Black colorof hair Black height 5 feel 4 inches; weight 98 pounds; visible distinctive marks Black mark, left cheek Maritalstatus Married Country of formernationality Vietnam I certify that the description, above given is hue, and that thephotograph.off hereto is a likeness of me. Jimmy Kay Phan Complete and true signature of holder) State of California } SS: County of Orange Beit known that ala term of the Superior Court of the State of California in and for the County of Orange held pursuants to lawal Santa Ana, California on April 14, 1982 the Court havingfoundshab JIMMY KAY PHAM then residing at 7172 Main Street, Westminster, California intends loreside permanently in the United States when sorequired by the Naturalization Laws of the United. States), had in all other respects complied with the applicable, provisions of such naturalization laws, and was entitled to be Seal admitted decilizenship thereupon order red that such person be and (s)hewas admilled as a citizen of the United States of America. In testimony whereof thesealof the courtis hereunto affired this 14th day of April in the year of our. Lord nineteen hundred and eighty-two STATISTICS LEE A. BRANCH IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By player Glerk of the Muldanto Superior Deputy Court. Glerk."
  },
  {
    "anumber": "A21431061",
    "id": "A21431061_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21431061_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate of Alien,, N-550 Rev. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1996,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1996
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 CA No. 22852085 0 Personal description of holder INS RegistrationNo. A21 431 061 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: DECEMBER 31, 1915 hereto is a likeness ofme. Sex: MALE Height: 5 feet 08 inches Complete and true signature of holder) Marital status: MARRIED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA VIETNAM The Attorney General having found that: NGA QUANG BUI then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: JUNE 26, 1996 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, Daris micious PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization CE FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A44052464",
    "id": "A44052464_0041",
    "page_index": 41,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44052464_0041/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 9711624"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "India"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1973,
          2023,
          1940
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1973
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Rockville, Maryland"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/17/2023 No. 9711624 Pelition no. 4402 AlienRegistration has FOIA (b)(6) ORIGINAL. Personal,description mofholdera Date of birth January 8, 1940 sean male i complexion fair coloroleyes hazel colorofhair black theight 5 feet 7 inches; weight 148 pounds, none Maritalstadus married Country of formermationaline India description influent heretois, whikeness ofime. Ferm Complete and true signature of holder) State of Maryland Montgomery County } SS: Beilknoun, that ala termofthe Circuit Court of Montgomery County Rockville, Maryland on October 19, 1973 the Drupad Batuklal Desai then residing and 1708 Shilling Lane, Wheaton, Maryland 20906 intendstoreside, ermanonthyinthe United States when so required by the Naturalizeation Laws of he United. States) hadinallythorneheads complied with sheapplicable provisions, of such naturalization laws, and was entilled/tobe Teal admitted stocilisenship suchper sombeandlshewas admilled as acilizen the United States of America. 19th with Indestimony where hereunto affered.,his dayof October in the year of own Lordnineleenhundredand seventy-three Haward m. Smith Clerk of the Circuit Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
  },
  {
    "anumber": "A13559853",
    "id": "A13559853_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13559853_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 9502198"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2023,
          1972
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1972
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "854 N. Crescent Heights Blvd., Los Angeles, Calif."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/24/2023 TO BE FORWARDED TO No. 9502198 IMMIGRATION AND NATURALIZATION SERVICE CERTIFIED 0 Pesition No. 330160 DUPLICATE AlienRegistration No A13 559 853 Personal description, pol holders as Date of birth August 22, 1914 isea Male ; complexion Medium coloroperies Brown color of hair Black height 5 feel 5 inches; weight 130 pounds; visible edistinctive marks Scar on 2nd finger of left hand Maritalstatus Married Country of formermationality. China I certify that the description above givenis, afficed herelor is a likeness ofine / Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that kakatermofthe District Court,of The United States / Los Angeles on February 18, 1972 the ***MAN GET WONG*** themresidingal 854 N. Crescent Heights Blvd., Los Angeles, Calif, inlends loreside permanentlyin, the United States when sorequired, bythe Naturalization, Laws of the United States), had in all her respects, complied,with the applicable, provisions, of such naturalization laws, and was entilled obe Seal admilled Mociliscenship such person be and (s)hewas admilled as a cilizen of he United States of America. Intestimony whereofsherealofthe courtis, hereunto afficed 18th day of February in the year) of our. Lord,memekeen/hundred, and Seventy-Two EMORY G. HATCHER IT IS PUNISHABLE BY U. S. LAW TO COPY, Glerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S. C. 1mg Deputy Clerk."
  },
  {
    "anumber": "A21207655",
    "id": "A21207655_0040",
    "page_index": 40,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21207655_0040/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11319598"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1915,
          1983
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1983
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "San Bernardino, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/21/2023 a TO BE FORWARDED TO No. 11319598 IMMIGRATION AND NATURALIZATION SERVICE CERTIFIED CATE 0 Delilion No. 480603 DUPLICATE AlienRegistration Na A21 207 655 Personala description of holderas, of date not naturalization: Date of birth OCTOBER 28, 1915 sex FEMALE complexion MEDIUM coloropeyes BROWN color of hair GRAY :height 5 feel 2 inches; weight120 pounds; visible distinctive marks NONE Maritalstatus MARRIED Country of formernationality VIETNAM I certify that the description, above given is true, and that the photograph hafficed hereto, is a likeness of me. / Bach Chu Tran / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA }ss SS: Beitknown, that al a termofthe District Court of The United States held pursuant to lauzal Los Angeles on APRIL 22, 1983 BACH-CHI TRAN the Court havingfound that then residing at 5028 COYOTE LANE, SAN BERNARDINO, CA intends loreside permanently in the United. States when sorequired by the Naturalization Laws of the United States), hadin all other respects, complied with the applicable provisions of such naturalization laws, and was entilled to be Seal admitted docilizenship, thereupon ordered that such person be and(s)hewas admilled as a citizen of the United States of America. Intestimony whereof thesealoft the courtis hereunto,affixed this 22 ND day of APRIL in the year your Lord nineteen hundred and EIGHTY-THREE EDWARD M. KRITZMAN Clerk of the U. S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Patridoa Keyed Deputy Clerk."
  },
  {
    "anumber": "A41623672",
    "id": "A41623672_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41623672_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1910,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "9 No. 22588834 Personal description of holder INS RegistrationNo. A 41 1 623 672 as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: DECEMBER 14, 1910 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 0 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA EL SALVADOR The Attorney General having found that: OLAYA MERCEDES SANTOS then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: MARCH 9, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.S. LAW TO COPY. Daris minimum PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization XIZ FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A17180748",
    "id": "A17180748_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17180748_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1910,
          1975
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1975
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "601 S. Detroit Street, Los Angeles, Calif."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "DUPLICATE STUB DUPLICATE DO NOT DETACH TO BE FORWARDED TO No. 10117818 IMMIGRATION AND NATURALIZATION SERVICE CERTIFUL 0 Pelilion No. 363939 AlienRegistration No A17 180 748 DUPLICATE Personal description, of holderas of Date of birth December 25, 1910 Male sex complexion Medium colorsheyes Brown color of hair Black height feet 9 inches; weight 160/pounds; None. Maritalstatus Married Country of formernationality China. I certify that the description thepholographieffords herelois, a likeness of me you / and Sing true signature go of holder) UNITED STATES OF AMERICA SS: CENTRAL DIST. OF CALIFORNIA Beit known, that lakatermofthe District Court of The United States held/pursuamblo lawal Los Angeles on September 19, 1975 the ***YUNG SING LO them residing at 601 S. Detroit Street, Los Angeles, Calif. inlends loreside, permanentlyin, the United. States when sorequired bythe naturalization Laws of he United States), had in all other respects, complied with the applicable, provisions, of such naturalization laws, and was entitled to be Seal admitted socilisenship, thereupon ordered that suchper son be and(s)hewas admilled as a citizen the United States of America. Investimony whereoy thesealofthe, courtis hereunto affixed, this 19th day of September in the year of our. and Seventy-five. EDWARD M. KRITZMAN Clerk of the U. S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S. 1.7mg Deputy Glerk."
  },
  {
    "anumber": "A19055851",
    "id": "A19055851_0004",
    "page_index": 4,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0004/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Alien Registration Form, A19 055 851"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1976
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1976
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "100532706"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "TO BE FORWARDED TO No. 10532706 IMMIGRATION AND NATURALIZATION SERVICE 0 Polition No: 373205 DUPLICATE AlienRegistration No A19 055 851 Personal,description of holderas of birth December 11, 1909 sex Male ; complaxion Fair colorsforge's Blue colorefhair Gray height 5 feet 11 1/2 inches; weight 195, ounds; None Marital Married Country of formorationality. So. Africa I certify shound the description, above givenis is wilikeness of ma Spi Complete and true signature of holder) UNITED STATES OF AMERICA SS: CENTRALADIST OF CALIFORNIA Beitknown,Male ala clermofthe, District The United States Court,of Los Angeles on August 6, 1976 the Sourthavingfoundshan *** GEORGE FREDRICK WOLFSON *** thenresidingal 100 So. Dohney St Los Angeles, Cali fornia inlands, to reside hermanently in the United States Naturalization Laws of the United States), hadin, callother respects, complied.with the applicable provisions, of such naturalization, laws, and was, entitled.labe Seal admitted socidiseenship admilled as hellnited States of America the bearh, the courtis 6th dayof August inthoyeur of our Seventy-six EDWARD M. KRITZMAN Glerk of the U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By 50 mg Deputy Clerk."
  },
  {
    "anumber": "A17212360",
    "id": "A17212360_0015",
    "page_index": 15,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17212360_0015/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 9564496"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1973,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1973
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1027 Moraga Dr., Los Angeles, Ca."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "TO BE FORWARDED TO No. 9564496 IMMIGRATION AND NATURALIZATION SERVICE ORROR 0 Petition No. 343688 DUPLICATE AlienRegistration no A17 212 360 Personal,description of holder as Date of birth June 9, 1915 sex Female ; complexion Medium colorsferies Brown ;color of hair Black height 5 feel 2 inches; weight.40 pounds; None Maritalstatus Single Country of formernationality China I certify that the description, above givenis, herelois, a likeness of me yuk and wing ( Complete true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that ala termof the District Court,of The United States held pursuant, to law al Los Angeles on Occober 26, 1973 the ***YUK WONG*** them residing at 1027 Moraga Dr., Los Angeles, Ca. inlondstoresidepermanentlyin the United States when sosequired bythe naturalizeation Laws of the United. States), complied with the applicable, provisions, of such nahiralization laws, and was entitled tobe Seal admilled docilizenship thereupon ordered that such pe sombe and(s)hewas admilled as acilizen the United States of America, 26th day of October in the year of our Lord mineteen hundred and Seventy three . EDWARD M. KRITZMAN IT IS PUNISHABLE BY U.S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By S.C. Tm Deputy Clerk."
  },
  {
    "anumber": "A34261850",
    "id": "A34261850_0034",
    "page_index": 34,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34261850_0034/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1912,
          2023,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 4/3/2023 No. 24819827 Personal description of holder INS Registration No. A 34 261 850 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: FEBRUARY 17, 1912 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 3 inches Complete and true signature of holder) Marital. status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA MEXICO The Attorney General having found that: TRINIDAD GOMEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: JULY 27, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.S. LAW TO COPY. Daris meissues PRINT OR PHOTOGRAPH THIS CERTIFICATE. WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization JUSTICE FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A11979216",
    "id": "A11979216_0004",
    "page_index": 4,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11979216_0004/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate,, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1915,
          2023,
          1987
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1987
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "San Gabriel, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "FORM N-550 Screened by NARA, 6/29/2023 U. S. DEPARTMENT OF JUSTICE No. 12952627 IMMIGRATION AND NATURALIZATION SERVICE (REV. 5-1-841Y Name DELGADO, DELIA ISABEL residing at 513 W SAXON AVE SIGNATURE OF HOLDER SAN GABRIEL, CA 91776 Date of birth Date of order of admission IS NOT REQUIRED ON THIS 4/28/15 DUPLICATE STUB Date certificate issued JULY 29, 1987 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH 00685947 All 979 216 Petition No. INS Registration No. 8AM Delia Huntel Deligado ( D TO BE FORWARDED TO No. 12952627 IMMIGRATION AND NATURALIZATION SERVICE CAVIE Pelition No. 00685947 INP Registration No. All 979 216 DUPLICATE Personal description of holder as ofdate of naturalization: Date of birth APRIL 28, 1915 FEMALE sex complexing 147 FAIR colorologes BROWN color of hair BLACK height 5 feet 7 inches; weight pounds virible distinctive marks NONE Marital. status SINGLE Country of formernationality NICARAGUA I certify that the description above givenis true, and that the photograph, affixed hereto is a likeness of me. Delia Isafel Dugodo / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known that at a lermof the District Court of The United States held pursuant to law at Los Angeles on JULY 29, 1987 the Court having foundthal DELIA ISABEL DELGADO then/residing at 513 W SAXON AVE, SAN GABRIEL, CA intends loreside permanently in the United. States when sorequired by the Naturalization Lawsoft the United States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entilled to be Seal admitted locitisenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. Intestimony whereof thesealoft the courtis hereunto, reffixed this 29 th day of JULY nineteen hundred and EIGHTY-SEVEN DIST. OF LEONARD A. BROSNAN Clerkofthe U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
  },
  {
    "anumber": "A12495368",
    "id": "A12495368_0008",
    "page_index": 8,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12495368_0008/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "U.S. Naturalization Certificate,, 92264028"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Cuba",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1903,
          1970
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1970
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Miami, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "CA TO BE FORWARDED TO No. 9264028 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Pelition No. 46,641 DUPLICATE AlienRegistration No. A-12 495 368 Personal description, of holder's of date f naturalization: Date of birth December 26, 1903 sex female ; complexion fair coloroferies brown color of hair brown ;height 5 feel 7 inches; weight 170 pounds; visibledistinclivemarks none Maritalstatus married Country of formernationality Cuba I certify that the description, above givenis true, and that a likeness of me. < Haur Hn Cumll ( Complete and true signature of holder) THE UNITED STATES OF AMERICA SOUTHERN DI STRICT OF FLORIDA } SS: Beit known, that at termofthe District the United States Court of held pursuantly lawal Miami, Florida on February 3, 1970 the Courthaving foundshak MARIA ANA CUNILL then residing at Miami, Florida intends loreside permanentlying the United. States when sorequired bythe naturalization Laws of he United. States), had in all other respects, complied with the applicable, provisions of such naturalization laws, and was entitled lobe Seal admilled sociliseenship, thereupon ordered that such person be and(s)hewas admilled as a cilizen a the United States of America. Investimony whereof thesealos, the courtis hereunto affixed this 3r d day of February in theyyourshours Lord mineteen hundred and seventy Joseph I. Bogart Clerk of the U.S. District Court. IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. By John L. Taille Deputy Clerk."
  },
  {
    "anumber": "A21348654",
    "id": "A21348654_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21348654_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF IMMIGRATION AND NATURALIZATION, No. 11315598"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1984,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "widowed"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1984
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Los Angeles"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 JU:OF TO BE FORWARDED TO No. 11315598 IMMIGRATION AND NATURALIZATION SERVICE OBRRJOBD CATE 0 Pelilion No. 476970 DUPLICATE AlienRegistration Ra A21 348 654 Personal, description, of holders of date of naturalization: Date of birth JANUARY 1, 1915 FEMALE sex complexion MEDIUM BROWN ; colorobeyes colorof hair BLACK height 5 feet 0 inches; weight 95 pounds; visible NONE Maritalstatus WIDOWED Country of formernationality. VIETNAM I certify that the description, above given is Area and thatshephotograph effixed hereto is a likeness of me / Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that Lakatermolt the District The United States Court of held bursuant to law al Los Angeles on SEPTEMBER 12, 1984 the HUONG THI NGUYEN then residing at 506 1/2 S BURLINGTON AV . LOS ANGELES, CA inlends loreside permanentlyin, the United. States when sorequired bythe naturalization. Laws of the United States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled lobe Seal admitted docilisenship, thereupon ordered that such person be and (s)hewas admitted as a citizen of the United States of America. Indestimony whoreof Ethosealofthe,countis, hereunto affixed this 12TH dayof SEPTEMBER in the year of our. Lord nineteen hundred and EIGHTY-FOUR LEONARD A. BROSNAN STATISTICS Glerhofthe U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Latherns Jones Deputy Clerk."
  },
  {
    "anumber": "A43136069",
    "id": "A43136069_0001",
    "page_index": 1,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43136069_0001/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "a No. 25187139 Personal description of holder INSRegistration No-A 43 3 136 069 as of date of naturalization: I certify that the description/given is true, and that the photograph affixed Date of birth: MAY 14, 1914 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 4 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LO$ ANGELES, CA NICARAGUA The Auforney General having found that: GREGORIANA LVAREZ GONZALEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to tizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: OCTOBER 28, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U S LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE. Davis WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A43136069",
    "id": "A43136069_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A43136069_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550 REV. 8-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "by NAME, THE R CA No. 24849969 Personal description of holder INS Registration No. A 43 136 069 as of date of natur ralization: I certify that the description given is true, and that the photograph affixced Date of birth: MAY 14, 1914 hereto is a likeness ofme. Sex: FEMALE Height: 5 feet 4 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at LOS ANGELES, CA NICARAGUA The Attorney General having found that: GREGORIANA ALVAREZ-GONZALEZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony reducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: AUGUST 26, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPHITHIS CERTIFICATE, Rais Meissay WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization XXX SOOSUCE FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A72044315",
    "id": "A72044315_0034",
    "page_index": 34,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72044315_0034/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Screened by NARA, 8/11/2023, 9310690"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Haiti",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1943
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1970
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "15157 Beckner Street, La Fuente, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/11/2023 TUHOE No. 9310690 Pelilion No! 312122 AlienRegistration Nov FOIA (b)(6) ORIGINAL of Date of birth November 19, 1943 sea Female i complexion Dark colorofeyes Brown color of hair Brown height 5 feet 412 inches; weight 325 hounds, None Maritalstatus Married Country of formermationality Haiti. I certify that the description above givenis true and that heretor of me. Sharabeth Selva ( Gomplete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beilknown,thai, aladermofthe District Court of The United States held pursugue alawal Los Angeles NOV 201970 on * * ELIZABETH DELVA * * * the Courthavingfoundshal then residing at 15157 Beckner Street, La Puente, California inlands, loreside permanonilying the United States when sorequired bythe naturalization Laws ofthe United States), had in allotherrespects complied with the applicable provisions, of such naturalization laws, and was onlilled lobe Seal admilled stociliscenships thereupon ordered that such personbe and shhwas admilled as a cilixen of Re United States of America Indestimony hereunto afficed.shis 20th day of November in the year of our Lord nineteen hundred and Seventy EMORY G. HATCHER Glerk of the U.S. District Court. IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. By S.C. 10mg Deputy Clerk."
  },
  {
    "anumber": "A20535147",
    "id": "A20535147_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20535147_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, A20 535 147"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1980,
          1914
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1980
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Rowland Heights, Ca."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "K AUTOE R CA a TO BE FORWARDED TO No. 11027991 IMMIGRATION AND NATURALIZATION SERVICE CARE Pelition No. 434163 DUPLICATE AlienRegalration ne A20 535 147 Personal description of holdoras, of date of naturalization: Date of birth December 25, 1914 sex Male ; complexion Medium coloropoyies Brown colorof hair Black height 5 feel 5 inches; weight 135 pounds; visible distinctive marks None Maritalstatus Married Country of formernationality China I certify that the description above given is true, and that thopholograph affixed hereto, is a likeness of me. Leo Kno Han Ying / Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known that at a termofthe District The United States Court of held pursuant to law al Los Angeles on July 18, 1980 the Court having foundthal LEO KUO-HAN YING then residing al 2221 S. Annadel Ave. Rowland Heights, Ca. intends loreside permanently in the United States when sorequired bythe Naturalization Laws ofthe United States), had in all other respects complied with the applicable provisions of such naturalization laws, and was onlilled lobe Seal admitted locitizenshiff thereupon ordered that such person be and (s)hewas admitted as a citizen of the United States of America. Indestimony whereof thesealof the courtis hereunto affixed this 18th day of July in the year ofour. Lord nineleen hundred and Eighty EDWARD M. KRITZMAN U. S. District IT IS PUNISHABLE BY U. S. LAW TO COPY, Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Glerk. DNSSIUCCE"
  },
  {
    "anumber": "A12797485",
    "id": "A12797485_0001",
    "page_index": 1,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0001/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Dominican Republic"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1901
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1901
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "San Francisco, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 25590234 Personal description of holder VSRegistration No. A012797485 as of date of naturalization: Date of birth. MARCH 04, 1901 I certify that the description given is true, and that the photograph affixed hereto is a likeness of me. Sex: FEMALE NOSH Height: 5 feel 2 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: SAN FRANCISCO, CALIFORNIA DOMINICAN REPUBLIC The Attorney General 1002 SI HVW having found that: ANA MORONTA then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the US DISTRICT COURT OF NORTHERN CALIFORNIA at: SAN FRANCISCO, CALIFORNIA on: that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Commissioner OrayJun Immigration Naturalization and FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A12797485",
    "id": "A12797485_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12797485_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, FORM N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Dominican Republic"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1901
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1991
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "San Francisco, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "( R CA No. 26424713 Personal description of holder INS RegistrationNo. A012797485 as of date of naturalization: Date of birth: MARCH 04, 1901 I certify that the description given is true, and that the photograph affixed hereto is a likeness of me. Sex: FEMALE Height: 5 feet 2 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: SAN FRANCISCO, CALIFORNIA DOMINICAN REPUBLIC The Attorney General having found that: ANA MORONTA then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the US DISTRICT COURT OF NORTHERN CALIFORNIA at: SAN FRANCISCO, CALIFORNIA on: that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Commissioner Orangine Immigration and such Naturalization iss FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A34109816",
    "id": "A34109816_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34109816_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, A34 109 816"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Monterey Park"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 TO BE FORWARDED TO No. 12162209 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Delilion No. 577076 DUPLICATE AlienRegistration Ro A34 109 816 Personal,description of holder as Date of birth JUNE 9, 1915 sex FEMALE ; complexion MEDIUM colorsheyes BROWN color of hair BLACK height 5 feel 0 inches; weight 103 pounds; NONE Maritalstakus MARRIED Country of formernationality CHINA I certify that the description above given is, breen and that thopholographiaffands herelois a likeness of me 1 Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known that ala termof the District Courtrof The United States held/pursuantlo, lawal Los Angeles on the Gourh, HO-LIN CHANG then/residing at 233 NO. ORANGE AVE. APT. A123, MONTEREY PARK inlandstoreside permanentlyin the United States when sorequired bythe naturaliseation Laws of he United States), complied with the applicable, provisions of such naturalization laws, and was entitled wobe Seal admilled Lociliscenship. thereupon ordered that such person be and us)hewas admilled as a cilixen of the United States of America, Intestimony hereunto afficed this 5TH day of NOVEMBER in the year of our. Lord mineteen hundred EIGHTY-FIVE LEONARD A. BROSNAN IT.,S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
  },
  {
    "anumber": "A41624049",
    "id": "A41624049_0025",
    "page_index": 25,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A41624049_0025/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, Form N-550 Rev. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "El Salvador"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2023,
          1999
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1999
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "POMONA, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 6/2/2023 No. 24836410 Personal description of holder INS RegistrationNo. 4 41 624 049 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: MARCH 4, 1914 hereto is a likeness of me. Sex: MALE Height: 5 feel 0 inches Complete and true signature of holder) Marital status: MARRIED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA EL SALVADOR The Attorney General having found that: ADRIAN HERRERA-PEREZ then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: POMONA, CA on: AUGUST 19, 1999 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE Daris missioner WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A21202116",
    "id": "A21202116_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202116_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 12 0624 452"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1984
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "752 S MARIPOSA #205, LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/28/2023 TOHOE R CA TO BE FORWARDED TO No. 12062452 IMMIGRATION AND NATURALIZATION SERVICE 0 Delilion No. 505082 AlienRegistration Ro A21 202 116 DUPLICATE Personaldesoriphionofholderas of date rofmaturalization: Date of birth JULY 14, 1915 sex MALE ; complexion MEDIUM colorofeeves BROWN color of hair BLACK height 5 feet 7 inches; weight 100/pounds; visible distinctive marks NONE Maritalstadus SINGLE Country of formernationality VIETNAM I certify that the description, above given is, Aree,and that herelois, a likeness of Chinh Don Eran ( Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that ala termofthe District Court of The United States Los Angeles ONCHINH VAN TRAN the 752 S MARIPOSA #205, LOS ANGELES, CA then residing at inlends, Moreside, hermanenMy in the United States when sorequired bythe naturalization. Laws ofthe United States), had in allotherrespects, complied with the applicable, provisions of such naturalisation laws, and was entilled lobe Seal admilled sociliscenship, thereupon ordered that such person be and(s)hewas admilled as a cilixen of the United States of America. 12TH In testimony veofthesealofthe courtis hereunton afficced this SEPTEMBER dayof EIGHTY-FOUR in and LEONARD A. BROSNAN Clerk of the U.S. District IT IS PUNISHABLE BY U. S. LAW TO COPY, STATISTICS Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Frank Galvan Deputy Clerk."
  },
  {
    "anumber": "A21519707",
    "id": "A21519707_0038",
    "page_index": 38,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21519707_0038/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, 11576361"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1983
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "930 S Champlain Circle, Anaheim, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 CA TO BE FORWARDED TO No. 11576361 IMMIGRATION AND NATURALIZATION SERVICE 0 Pelition No. 483036 DUPLICATE AlienRegistration No A21 519 707 Personal of holderas, of Date of birth BLACK JUNE 7, 1915 MALE seeo ; complexions colorsheyes NONE color of hair height 5 feel inches; weight pounders visible distindive/mark Maritalstatus Country of formernationality VIETNAM I certify that the description, above given is have, and is a likeness ofm / Iuang Duy payer Complete and true signature of holder, UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known that al a termof the District Court of The United States held bursuant to lawal Los Angeles AUGUST 19 933 QUANG DUY NGUYEN the 930 S CHAMPLAIN CIRCLE, ANAHEIM, CA them residing at inlands, loreside permanently in the United. States when sorequired by the naturalizeation Laws of he United States), had in all other prespects, complied with the applicable, provisions, of such naturalizeation laws, and was entilled lobe Seal admilled dociliseenships thereupon ordered that such person be and(s)hewas admilled as acilizen of the United States of America, Intestimony hereunton affixced this 19TH dayof AUGUST in the year of our. Lord/nineteen hundred and EIGHTY-THREE LEONARD A. BROSNAN STATISTICS Glerk of the U. S. District Patredark leyed Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
  },
  {
    "anumber": "A72890010",
    "id": "A72890010_0037",
    "page_index": 37,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A72890010_0037/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP, 11 302212"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Honduras",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1982,
          1943
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1982
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "511 E. Chevy Chase Dr., Glendale, Ca."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, I11/2023 SWIDE CA No. 11302212 V Polition No. 469325 ORIGINAL Alien Registration no. FOIA (b)(6) Personate \"description, of holder of detect Insturalization: Date of Birth August 12, 1943 we Female complexion Medium color of eyes Brown color of hair Black height 5 feel 2 inclier weight 120 pounds; visible distinctive marks None Marital's status Married Country of former nationality Honduras I certify that the description above given is true, and this the photographic officed hereto is 11 likeness of me. Enella Guide / ( Complete and true signature of holder) UNITED STATES OF AMERICA S.S: CENTRAL DIST. OF CALIFORNIA Beit known that at \" Jerney the District Court of The United States held pursuant to law al Los Angeles on September 17, 1982 the Courthaving, found that ENEIDA GUIDO then residing at 511 E. Chevy Chase Dr. Glendale, Ca. intends loreside permanently in the United. Hates when jo required by the naturalization Lawson the United. Hales), had in all other respects complied with the applicable provisions of such naturalization laws, and was entilled to be Teal admitted locilizenshiff thereupon write rest that such person for and(s)hewas admitted as a citizen of the Mnited States of America. In testimony whereof thesealoft the courhis hereuntoufficed this 17th day of September in the year ofour Lord nineteen hundred and Eighty-two EDWARD M. KRITZMAN IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Key Patricia Citice of the U.S. District Court. Deputy Clerk"
  },
  {
    "anumber": "A21202301",
    "id": "A21202301_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21202301_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11 587683"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1984
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "3820 W. Clark Avenue, Burbank, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/22/2023 CA TO BE FORWARDED TO No. 11587683 IMMIGRATION AND NATURALIZATION SERVICE OBRNORU CATE is Pelition No. 493371 DUPLICATE AlienRegistration ne A21 202 301 Personal description of holders of date of naturalization: Date of birth MAY 22, 1915 sex MALE ; complexion MEDI UM coloroloues BROWN color of hair GREY :height 5 feet 5 inches; weight 100 pounds; visible distinctive marks NONE Manitalstatus MARRIED Country of former nationality VIETNAM I certify that the description above given is brue, and that the photograph affixed hereto, is a likeness of me. Noai Dinh Do / Complete and true signature of holder) UNITED STATES OF AMERICA SS: CENTRAL DIST. OF CALIFORNIA Beit known, that at a term of the District Court of The United States rew Royan Los Angeles on the Court havingfoundshal TOAI DINH DO then residing at 3820 W. CLARK AVENUE, , BURBANK, CA inlends loreside permanently in the United States when so required by the Naturalization Laws of the United States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled to be Seal admitted locitisenship, thereupon ordered that such person be and(s)hewas admitted as a citizen of the United States of America, 16TH Indestineous MARCH whereof thesealof the courtis hereunto, affixed this dayable EIGHTY-FOUR in the year of our. Lord nineleen hundred and C STATISTICS LEONARD A. BROSNAN Clerk of the U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Catherine Jeanes Deputy Clerk."
  },
  {
    "anumber": "A21637344",
    "id": "A21637344_0033",
    "page_index": 33,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21637344_0033/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate,, 122272257"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "India"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1907,
          2023
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Anahiem, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/26/2023 IN:OR 3 TO BE FORWARDED TO No. 12272257 IMMIGRATION AND INATURALIZATION SERVICE CANED 0 Pelition No. 538100 INS Registration no. A21 637 344 DUPLICATE Personal description, of holder as of Dale of birth NOVEMBER 2, 1907 sex MALE ; complexion DARK colorofoyer BROWN color of hair GREY height 5 feel 4 inches; weight 125 pounds; visible distinctive marks NONE Maritalstatus WIDOWED Country of formernationality INDIA I certify that the description above given is true, and that he photograph affired hereto is a likeness of me. Doen Jamestraws. Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beitknown that at a tormof the District Court of The United States held bursuamLdo AUGUST 1, lawal 1985 Los Angeles on the DORAI JAMES DAVID then residing at 2040 SPRAGUE LN #3, ANAHEIM, CA inlends loreside hormanently, in the United. States when sorequired by the Naturalization Laws of the United. States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entilled to be Seal admitted docilizenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. Intestimony whereoft thesealoft the courtis hereuntouffixed this 1ST dayol AUGUST nineleen hundred and EIGHTY-FIVE LEONARD A. BROSNAN IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Clerk."
  },
  {
    "anumber": "A75424782",
    "id": "A75424782_0012",
    "page_index": 12,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75424782_0012/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Haiti",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1994,
          2023,
          1933
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "DIVORCED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1994
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Miami, FL"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA 8/7/2023 1 No. 21439503 (C) x Personal description of holder INS Registration No. FOIA (b)(6) as of date of naturalization: I certify that the description given is true, and that the photograph affixed Date of birth: AUGUST 13, 1933 hereto is a likeness of me. Sex: FEMALE Louisa Buce Height: 5 feet 02 inches Complete and true signature of holder) Marital status: DIVORCED Be it known that, pursuant to an application filed with the Attorney General MIAMI, FL Country of former nationality: at: HAITI The Attorney General having found that: LOUISA BRICE then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. IMMIGRATION & NATURALIZATION SERVICE MIAMI, FL OCTOBER 21ST, 1994 at: on: that such person is admitted us a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY. Davis missuer PRINT OR PHOTOGRAPH THIS CERTIFICATE WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Natural cution FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A10017891",
    "id": "A10017891_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10017891_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 10 017 891"
      },
      "years": {
        "ms_years_nlp_v1": [
          1910,
          2023,
          1976
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1976
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "34D Paul Place, Boston, Mass. 02118"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/6/2023 JUICE CA TO BE FORWARDED TO No. 10503082 IMMIGRATION AND NATURALIZATION SERVICE CATE 0 Pelilion No. 395297 DUPLICATE AlienRegistration Na 10 017 891 Personal description of holderas of date of naturalization: Date of birth September 20, 1910, sex female complexion medium coloroloyes brown weight 127 pounds; visible distinctive marks color of hair black height 5 feel 2 inches; none Maritalstatus married Country of formernationality Ghina I certify that the description above given is brue, and that the photography affixed hereto is a likeness of me. / Gina wong oi ( Complete and true signature of holder) UNITED STATES OF AMERICA DISTRICT OF MASSACHUSETTS } SS: Beitknown that at a termolthe District The United States Court of held pursuant, to law at Boston on July 5, 1976 Gina Wong oi the Court having found that then residing at 34D Paul Place, Boston, Mass. 02118 inlends loreside permanently in the United. States when sorrequired by the naturalization Laws of the United States), had in all other respects, complied with the applicable, provisions of such naturalization laws, and was entilled do be Seal admilled socilizenship, thereupon ordered that such person be and(s)hewas admilled as a cilixen of the United States of America. Intestimony whereoft thesealoft the courtis hereunto, affixed this 5th dayof July Seventy-six in the year of our. Lord nineleen hundred and GEORGE F. McGRATH IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Apna R. Collins Deputy Clerk. FOSUCE"
  },
  {
    "anumber": "A21204721",
    "id": "A21204721_0030",
    "page_index": 30,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21204721_0030/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1996,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1996
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Buena Park, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/25/2023 CA No. 23258873 0 VEN D Personal description of holder INS RegistrationNo. A21 204 721 as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: JANUARY 1, 1915 hereto is a likeness of me. Sex: FEMALE Height: 5 feet 00 inches Complete and true signature of holder) Maritalstatus: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA VIETNAM The Attorney General having found that: THAN THI DO then residing in the United States, intends to reside in the United States when so- required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of all giance in a ceremony conducted by the U.S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: BUENA PARK, CA on: OCTOBER 18, 1996 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE Daris missuer WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization USIVE FORM N 550 REV. 6.91"
  },
  {
    "anumber": "A92348892",
    "id": "A92348892_0016",
    "page_index": 16,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A92348892_0016/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Nicaragua"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1996,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1996
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "LOS ANGELES, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 21801408 0 Personal description of holder as of date of naturalization: INS RegistrationNo. A92 348 892 Date of birth: MAY 15, 1915 I certify that the description given is true, and that the photograph affixced hereto is a likeness ofme. Sex: FEMALE Height: 5 feet 06 inches Complete and true signature of holder) Marital status: WIDOWED Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: LOS ANGELES, CA NICARAGUA The Attorney General having found that: MARGARITA MONTIEL then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was in a ceremony conducted by the entitled to be admitted to citizenship, such person having taken the oath of allegiance U. S. DISTRICT COURT FOR THE CENTRAL DIST. OF CALIFORNIA at: LOS ANGELES, CA on: FEBRUARY 22ND, 1996 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, WITHOUT LAWFUL AUTHORITY. Daris Commissioner of Immigration and Naturalization FORM N-550 REV. 6-91"
  },
  {
    "anumber": "A18591348",
    "id": "A18591348_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18591348_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, FORM N-560 ( (REV 3.1.61)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1904,
          1916
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1916
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Bayonne, New Jersey"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "JUICE No. A-575896 OR application no. A18 591 ; 348 DUPLICATE Personaldescription of holderas of date cofissuance off this certificate; Sex female date of birth March 1, 1904 country of birth Russia complexion medim coloroleyes brown colorof hair brown-grey height 5 feel 4 inches; weight 130 pounds; visibledistindive mark none Maritalstatus married I certify that the description, above given is New and thatshephotograph affixed hereto is a likeness of me. Idea Wachaberg ( Complete and true signature of holder) Be known that IDA WACKSBERG , now residing al 128 West 32nd Street, Bayonne, New Jersey having appliedstophe Commissioner of Immigrationand, naturalizationfor cacertificated of Section 341 of the Immigration an dnationality thesalisfactionafthe Commission ofthe United States of America,became acclinenthereofon December 14, 1916 andisno United States: nom Therefore containedin Section 341 ofthe Immigration and nationality Act this certificat issued this 3rd Seal day/of September insheyearsfour Lordmindeen hundred and seventy , and theseal, of the Department of Justice IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY, PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Raymond F. Farrell COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 3-1-61)"
  },
  {
    "anumber": "A55742403",
    "id": "A55742403_0015",
    "page_index": 15,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A55742403_0015/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Haiti",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1996,
          1943
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "DIVORCED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1996
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Miami, FL"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "No. 21595346 (Check OF V nov 13101 Personal description of holder as of date of naturalization: INS Registration la FOIA (b)(6) Date of birth: JANUARY 31, 1943 hereto is a likeness of me. I certify that the description given is true. and that the photograph affixed Sex: FEMALE Height: 5 feel 07 inches Jrmi Priynal Complete and truk signature of holder} Harital status: DIVORCED Be it known that pursuant to an application filed with the Attorney General Country of former nationality: MIAMI, FL at: HAITI The Attorney General having found that: IRMA RAYNAL then residing in the United States, intends to reside in the United States when so required by the Naturalization Laws of the United States, and had in all other respects complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the U.S. IMMIGRATION & NATURALIZATION SERVICE al: MIAMI, FL on: JANUARY 22ND, 1996 that such person is admitted as a citizen of the United States of America. IT IS PUNISHABLE BY U.S. LAW TO COPY. PRINT OR PHOTOGRAPH THIS CERTIFICATE. Davis meeting WITHOUT LAWFUL AUTHORITY. Commissioner of Immigration and Naturalization FORM 1-550 REV. 5.91"
  },
  {
    "anumber": "A10179278",
    "id": "A10179278_0014",
    "page_index": 14,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10179278_0014/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1961,
          1901
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1961
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "446 W. Pierce Street, Maconb, Illinois"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "IS NOT REQUIRED ON THIS DUPLICATE STUB DUPLICATE DO NOT DETACH THE CA DUPLICATE TO BE FORWARDED TO No. 8125455 IMMIGRATION AND NATURALIZATION SERVICE CATE 1 Petition no. 6551 Personal description, of holderus, of date of naturalization: Date of birth March 16. 1901 sex Female ; complexion Medium colorobeyes Brown color of hair Grey height 5 feel 1 inches; weight 140 pounds; visible distinctive marks None Maritalstatus Married former pationality China I certify that the description above given is have and that hereto is a likeness of mi sign here you price king James yen Mei Ling Tuan / Complete and true signature of holder) United States of America SS: Sou.Dist of I11., Nor Division ala Termofthe U. S. District Court of the Southern District of Illinois, Northern Division held pursuant, to lawal Peoria, Illinois on September 12, 1961 the Gourthaving foundshad YEN MEI-LING TUAN then residing at 446 W. Pierce Street, Macomb, Illinois intends, loreside permanentlyin, the United. States when sorequired bythe naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions, of such naturalizeation laws, and was entilled lobe Seal admilled socilizenship, thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America, Indestimony whereof thesealofthe, courtis hereunto,affixed, this 12th day of September in the year of our Lord ninekeen hundred and Sixty-one and of our Independence the one hundred and Eighty-sixth. Hisaviolation of William Clerk U. S6 Thirtball District Court. of the punishable as such) to copy print, photograph. or otherwise illegally use this certificate. By"
  },
  {
    "anumber": "A10891711",
    "id": "A10891711_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891711_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 834796"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1962,
          1905
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1962
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Clearwater, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Copied at the National Archives at Kansas City CA TO BE FORWARDED TO No. 8348796 IMMIGRATION AND INATURALIZATION SERVICE Petition no. 17,982 DUPLICATE Personal description, of holder as of date of n aburalizations Date of birth October 28 1905 isea Male ; complexion Fair coloraleyes Brown color of hair Brown height 6 feel 2 inches; weight 185 pounds; visible distinctive marks Missing joints fingers Marital,status I certify that the description, above givenis, NAME and sharshephotograph h affixed hereto is alikeness of me. Married Country of hormernationality Engl and Kerbert fangel 1 Complete and true signature of holder) UNITED STATES OF AMERICA } SS: MIDDLE DISTRICT OF FLORIDA Be it known, that ala term of the DISTRICT Court,of THE UNITED STATES IN AND FOR THE MIDDLE DISTRICT OF FLORIDA held/pursuantso lawal TAMPA, FLORIDA on NOVEMBER 16, 1962 the Court havingfound.that HERBERT STANGEL then residence at CLEARWATER FLORIDA intends loveside permanentlyin the United States when so required by the naturalization Laws of the United States), had in allotherrespects, complied with the applicable, provisions, of such naturalization laws, and was entilled lobe Seal admilled Locitisenship thereupon ordered that such person be and(s)hewas admilled as a citizen of the United States of America. In testimony whereof thesealofthe, courtis hereunto, afficed this 16th day of NOVEMBER in theyearnfour Lord nineleen hundred and SIXTY-TWO JULIAN A. BLAKE Hisaviolation, of the U.S. Code and punishable as such) locopysprint, photograph. Clerk of the U. S. DISTRICT Court. or otherwise, illegally use, this certificate. By Betty Clerk. BUREAU ENGRAVING PRINTING LITHO."
  },
  {
    "anumber": "A13573268",
    "id": "A13573268_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13573268_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF NATURALIZATION, 922301440"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1969,
          1913
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1969
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Bakersfield, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "TO BE FORWARDED TO No. 9230140 IMMIGRATION AND NATURALIZATION SERVICE 0 ) Petition no 5579 DUPLICATE Personal description, of holders of Date of birth July 15, 1913 sex Female ; complexion Medium colorsteries Brown color of hair Black height 5 feel inches; weight 102 pounds; visible None Maritalstatus Married Country of formernationality China I certify that the description above givenis, New dographic afficed herelois a likeness of me. King chim Jue ( Complete and true signature of holder) STATE OF CALIFORNIA } SS: County of Kern Beilknown, that ala termofthe Superior Court,of Kern County Bakersfield, California on November 19, 1969 the Court havingfound.,hav KING CHUN JUE them residing, at 1323 K Street, Apt. C, Bakersfield, California inlends loreside permanentlyin, the United States when sorequired, by the naturalizeation Laws of he United States), had in callother respects, complied with the applicant all provisions, of such naturalization laws, and was entilled lobe Seal admilled docilisenships thereupon,ordered that suchpersonbeand(shewas admilled as a cilizen o helmiled States of America. Investimony whereof thesealofthe,courtis 19th day of November in the year of our Lordnineeerhundredand sixty-nine IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO Glerk of the Superior Court. COPY, PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. By Deputy Clerk. BURCAUOFENGRAVINGANDPRINTING,LITHO."
  },
  {
    "anumber": "A17190805",
    "id": "A17190805_0007",
    "page_index": 7,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17190805_0007/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11289552"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1981,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Single"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1981
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1013 5/ W. Kensington Road, Los Angeles, Ca."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 6/30/2023 THE TO BE FORWARDED TO No. 11289552 IMMIGRATION AND NATURALIZATION SERVICE 0 Pelition No. 454616 DUPLICATE AlienRegistration Ro A17 190 805 Personal description, of holder easoldate Date of birth March 17, 1915 sex Female complexion Med: ium Brown color of hair Black/Gray height 5 feel 2 inches; weight110 pounds, visible distinctive marks None Maritalstatus Single Country of formernationality China I certify that the description, above given is, New andWhalthepholographaffived hereto is a likeness of me So Loan than ( Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA SS: Beit known, that at a termof the District The United States Court of held pursuant to lawal Los Angeles on June 22, 1981 so LAAN CHAN the Courthavingfoundshal then residing at 1013 1/2 W. Kensington Road, Los Angeles, Ca. inlends loreside permanentlyin, the United States when sorequired bythe Naturalization Laws of the United States), had in all other respects, complied/with the applicable provisions, of such naturalization laws, and was entitled lobe Seal admilled dociliseenship, thereupon ordered that such herson be and(s)hewas admilled as a citizen of the United States of America, Indestimony this 22nd day of June in theyearsfours Lord mindeen hundred,und Eighty-one STATISTICS EDWARD M. KRITZMAN Clerk of the U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Frank Galvan Deputy Clerk."
  },
  {
    "anumber": "A75287434",
    "id": "A75287434_0011",
    "page_index": 11,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A75287434_0011/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, NARA"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Haiti",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1991,
          1935
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1991
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Brooklyn"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE No. 14479533 Pelilion Dies 1121084 ORIGINAL INS Registration M FOIA (b)(6) Personal' description of holder us of dateef industriation: Date of birth MAY 12, 1935 sea MALE complexion DARK colorofoyes BLACK color of hair BLACK height 5 feel 4 inches; weight 170 pounds. visible distinctive marks NONE Marital status MARRIED Country of former nationality HAITI I certify that the description above given is true, and that the photographi affired Tierelois, a likeness of me. JAMES WiLSON EliAciN Complete and true signature of holder) United States of America Eastern District of N. Y. ps. SS: Beit known, that at a Jermof the District Court of The United States held pursuant to lawal Brooklyn on FEBRUARY 8, 1991 the Court having foundthat JAMES WILSON ELIACIN thenresiding at BROCKLYN, NEW YORK intendi loreside permanently. in the United States when sorequired by the naturalization lawsof the United States), had in all other respects complied with the applicable provisions of such naturalization laws, and was entished to be Seal admitted thereupon ordered Mal such pers son be and (s)hewas admitted as a citizen of helmited States of America In testimony whereof the sealofthe courtis 8TH day of FEBRUARY mineteen hundred and NINETY-ONE Robert C. Heinemann TO PUNISHABLE Clerk of the U.S. DISTRICT Court OF PHOTOGR- WITHOUTLAVIFULATHRT By Deputy Clerk FORM N-550-C (REV. 11-1-87)"
  },
  {
    "anumber": "A20181518",
    "id": "A20181518_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20181518_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, FORM N-560 ( (REV 12-1-69)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1921,
          1901
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "widower"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1921
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Jacksonville, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "YOU No. A 1672508 application no. A20 181 518 DUPLICATE Personal description of holderas certificate.,Sex: Male date of birth July 4, 1901 country of birth Russia :complexion Medium ; coloroferies Blue colorsfhair Black ; height 5 feel 9 inches: weight 165 pounds; visibledishindivermarks Mole on center of right cheek. Maritals, Widower I certify that the description, above givenis, hereovis a likeness, of m + Joseful Complete Young and true signature of holder) Beit known, that JOSEPH YOUNG , now residing al Jacksonville, Florida having applied.lothe Commissioner of Section 341 ofthe Immigration candnationality Achhavingproved.lo thesalisfactionafthe States of America,became acclinenthereofion March 1, 1921 States: linin Therefore Section 341,ofthe Immigration undnationality Col. this certificaleofcilizenshihisissuedhis Twenty-fourth Seal day/of May intheyearofour Lordmineleen hundred and Seventy-four and/he/sealofthe Department of STATISTICS IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 12-1-69) BUREAU or ENGRAVING AND PRINTING."
  },
  {
    "anumber": "A21432711",
    "id": "A21432711_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21432711_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 11591673"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1984,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1984
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "15433 1/2 Mansel Ave., Lawndale, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 9/22/2023 THE a TO BE FORWARDED TO No. 11591673 IMMIGRATION AND INATURALIZATION SERVICE CATE 1 Pelilion No. 497074 DUPLICATE AlienRegistration no. A21 432 711 Personal description, of holderas of date of naturalization: Date of birth JANUARY 2, 1915 sex FEMALE complexion FAIR colorobeyes BROWN color of hair BLACK height 5 feet 0 inches; weight 100 pounds; visible distinctive marks NONE Maritalstatus WIDOWED Country of former nationality VIETNAM I certify that the description above given is true, and that the photograph, affixed, hereto, is a likeness of me. much the were wringen / Complete and true signature of holder) UNITED STATES OF AMERICA SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States held pursuant to lawal Los Angeles on JUNE 28, 1984 the Court having foundthat MINH THINGOC NGUYEN then residing at 1/2 , 15433 MANSEL AVE., LAWNDALE, CA inlends loreside permanently in the United. States when so required by the Naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled to be admitted socilixenship thereupon ordered that such person be and (s)hewas Teat admitted as a citizen of the United States of America. day of JUNE In destimony whereofthesealof in the the year court of our. is hereunto, Lord, nineken affixed this hundred 28 TH and EIGHTY-FOUR LEONARD A. BROSNAN STATISTICS Clerk of the U.S. District Court. IT IS PUNISHABLE BY U.S. LAW TO PRINT OR PHOTOGRAPH THIS CERTIFICATE. By nancy maldonads Deputy Clerk."
  },
  {
    "anumber": "A11138471",
    "id": "A11138471_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11138471_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "U.S. Naturalization Certificate, TR-64"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Canada",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1905,
          1963
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Widow"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1963
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "417 North 32nd Place, Phoenix, Arizona"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "TO BE FORWARDED TO No. 8510791 IMMIGRATION AND NATURALIZATION SERVICE CERTE Petition no. TR=64 DUPLICATE Personal description, of holderas of datesfnaturalization. Date of birth November 30, 1905 sex female ; complexion fair colorsheres blue-gray colorof hair blond height 5 feel 1} inches; weight 150 pounds; visible none Maritalstates widow Country of formernationality Canada I certify that the description, above givenis, have hereto, is a likeness of me. Flower Creaton Complete and true signature of holder) UNITED STATES OF AMERICA | SS: DISTRICT OF ARIZONA Beit known, that ad a termofthe United States District Court of District of Arizona held pursuant to lawal Phoenix, Arizona on January 21, 1963 the FLORENCE GRESTON then residing at 417 North 32nd Place, Phoenix, Arizona inlends Moreside permanentlyin, the United States when somequired by the naturalization Laws of the United. States), had in allother respects complied with the applicable provisions of such naturaliseation laws, and was entitled lobe Seal admitted socilixenship thereuponordered that such person be and(s)hewas admilled as acilizena the United States of America. Intestimony whereofshersealofthe courtis hereunto, affixced this 21st day of January in the year of our Lord nineteen hundred and sixty-three WM. H. LOV ELESS Hisaviolation of punishable as such) to copy print, photograph. Clerk of the U. S. District Court. or otherwise illegally use this certificate. By Jenna Libby Libboy Deputy Clerk. Jenner BUREAU"
  },
  {
    "anumber": "A13570214",
    "id": "A13570214_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13570214_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate,, 122158059"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2020,
          1910
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "WIDOWED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1910
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "568 OTERO COURT, CAMARILLO, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "by NARA, 9/ 11/2020 THE CA TO BE FORWARDED TO No. 12158059 IMMIGRATION AND INATURALIZATION SERVICE Pelilion No. 575660 AlienRegistration No A13 570 214 DUPLICATE Personal,description, of holder's of datesfnaturalization: Date of birth JANUARY 29, 1910 sex FEMALE ; complexion MDIUM coloroperies BROWN color phair BLACK height 5 feel 6 inches; weight 160 pounds, visible edistinctive,marks NONE Maritalstatus WIDOWED Country of formernationality CHINA I certify that the description, above givenis, hur, herelor is a likeness of me. you ( Complete and true signature of holder) UNITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Beit known, that al a termof the District Court of The United States held pursuant to lawal Los Angeles SAU GHAN CHAU the Gourthavingfoundshak with S same then residing at 568 OTERO COURT, CAMARILLO, CA inlends loreside ermanenMying the United States when sorequired bythe naturalization Laws of the United States), had in all otherrespects, complied with the applicable, provisions, of such naturalization laws, and was entilled tobe admilled socilisenship thereupon ordered that such person, be and(s)hewas admilled as a cilizen the United States of America. Indestimony whereofthesealof the courtis APPROL ANGELES day of and DIST. OF LEONARD A. BROSNAN IT IS PUNISHABLE BY U.S. LAW TO COPY, Glerkofthe U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By thank Galvan Deputy Glerk."
  },
  {
    "anumber": "A18961437",
    "id": "A18961437_0012",
    "page_index": 12,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A18961437_0012/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Mexico",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          2023,
          1987
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Divorced"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1987
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "408 BURLINGTON AVE. #216. LOS ANGELES. CA. 90057"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 6/1/2023 FORM N-550 U. S. DEPARTMENT OF JUSTICE No. 13501146 IMMIGRATION AND NATURALIZATION SERVICE (REV. 5-1-84)Y Name GONZALEZ, EDWINA ARIAS GONEAAEZ, EDUWIGIS (FORMERLY) residing at 408. RURLINGTON AVE., #216, LOS. ANGELES, CA 90057 SIGNATURE OF HOLDER Date of birth 10/6/14 Date of order of admission IS NOT REQUIRED ON THIS DUPLICATE STUB Date certificate issued SEPTEMBER 23. 1987 by the U.S. District DUPLICATE Court at Los Angeles, California DO NOT DETACH Petition No. 697692 INS Registration No. A18. 961. 437. (void# 13501005) Edwina ( JUICE TO BE FORWARDED TO No. 13501146 IMMIGRATION AND INATURALIZATION SERVICE 0 Petition No. 697692 INS Registration No A18 961 437 DUPLICATE Personal,description of holders of date of naturalization Date of birth OCTOBER 6, 1914 sex FEMAEE ; complexion MEDIUM colorobeyes BROWN colorof hair BLACK height 5 feel 4 inches; weight 145 pounds; visible distinctive marks SCAR ON LEFT SIDE OF CHEN Maritalstatus DIVORCED Country of formernationality MEXICO I certify that the description above givenis have, and that hereto, is a likeness of m Elmina Chine Sommuler ( Complete and true signature of holder) UNITED STATES OF AMERICA SS: CENTRAL DIST. OF CALIFORNIA Beit known, that alatermolthe District Court of The United States held pursuant, to law al Los Angeles on SEPTEMBER 23, 1987 the EDWINA ARIAS GONAZALEZ then residing at 408 BURLINGTON AVE., #216, LOS ANGELES, CA inlends, loreside permanentlyin, the United States when sorequired bythe Naturalization Laws of the United States), had in all other respects, complied with the aplicable provisions of such naturalizeation laws, and was entitled tobe Seal admitted to ecitizenship thereupon ordered that such person be and(s)hewas admilled as a citizen of the United States of America. Intestimony whereof thesealofthe, court is hereunto affired this 13RD day of SEPTEMBER nineleen hundred and EIGHTY-SEVEN LEONARD A. BROSNAN Glerk fthe U.S. District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Deputy Glerk."
  },
  {
    "anumber": "A10706964",
    "id": "A10706964_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10706964_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Alien Registration Form,, A10 706 964."
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Mexico",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1910,
          1987
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Widow"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1987
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "El Paso, Texas"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE CA TO BE FORWARDED TO No. 12016518 IMMIGRATION AND NATURALIZATION SERVICE Pedition No. 45575 DUPLICATE AlienRegistration No A10 706 964 of date of naturalization. Date of birth December 2, 1910 isea Female ; complexion Medium coloroleyes Brown color of hair Gray height 5 feel 1 inches; weight 135 pounds; None Maritalstatus Widow Country of formermationality Mexico I certify that the description above givenis, New and that herelois whikeness of me. mazin Fillman mate 1 Complete and tree signature of holder) UNITED STATES OF AMERICA SS: WESTERN DISTRICT OF TEXAS Beitknown, thalata termof the District Court,of the United States for the Western District of Texas held/pursuantholawal El Paso, Texas on June 26, 1987 the bounthavingfoundshal MARIA FILEMON MOTA thenresidingal El Paso Texas inlandstoreside, permanentlyin, the United States when sorequired by the naturalizeation Laws of he United. States), complied with the applicable provisions, of such naturalization laws, and was entitled lobe Seal admilled locitiseenship, thereuponordered that such personbe, and(s)hewas admilled as acilizer of the United States of America. Intestimony the courtis hereuntox affixced this 26th dayof June in the year of our. Lord/nineteen hundredand eighty-seven STATISTICS. CHARLES W. VAGNER IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U. S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By McZloses Deputy Clerk. BUREAU ENGRAVING"
  },
  {
    "anumber": "A11336118",
    "id": "A11336118_0015",
    "page_index": 15,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11336118_0015/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "U.S. Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Mexico",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1988,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1988
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "126 N. Hamilton Dr., Beverly Hills, CA 90211"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "FORM N-550 Screened by NARA, 5/10/2023 No. 13788916 U. S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE (REV. 11-1-87)Y Name BARRIO DE GOMEZ, JOSEFINA residing at 126 N. HAMILTON DR. BEVERLY HILLS, CA. 90211 SIGNATURE OF HOLDER Date of birth 4/18/15 Date of order of admission 8/10/88 IS NOT REQUIRED ON THIS DUPLICATE STUB Date certificate issued AUGUST 10TH, 1988 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH Petition No. 00732668 INS Registration No. A11 336 118 800 treeping Parsiod Jonny TO BE FORWARDED TO No. 13788916 IMMIGRATION AND INATURALIZATION SERVICE 0 Pelition No. 00732668 All 336 118 DUPLICATE Personal description, of holder's of datesfnaturalization: Date of birth APRIL 18, 1915 sex FEMALE complexion FAIR colorologes BROWN color of hair GRAY height 5 feel 4 inches; weight 140 pounds; visible distindive/marks NONE Maritalstatus MARRIED Country of hormernationality MEXICO I certify that the description, above givenis have and hereto is a likeness of me. Jampara Larris d Going 1 Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beitknown, that ala termofthe District Court of The United States held pursuant olavals Los Angeles on AUGUST 10TH, 1988 the Gourthavingfoundshal JOSEFINA BARRIO DE GOMEZ then/residing at 126 N. HAMILTON DR. / BEVERLY HILLS, CA inlendstoreside, permanentlyin, the United States when sorequired by the naturalization Laws of the United. States), had in all other respects, complied with the applicable provisions, of such naturalization laws, and was entilled tobe Seal admilled docilisenships thereupon ordered that such personbe and(s)hewas admilled as a cilixen of the United States of America. Indestimony hereunto affaced this 10TH day of AUGUST nineleen hundred and EIGHTY-EIGHT LEONARD A. BROSNAN Glerk of the U.S. District Court. frank Galoon By Deputy Clerk."
  },
  {
    "anumber": "A73780035",
    "id": "A73780035_0018",
    "page_index": 18,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73780035_0018/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Naturalization, 11 055186"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Haiti",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          2023,
          1983,
          1944
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1983
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Miami, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/7/2023 No. 11055186 Pedition No. 178879 ORIGINAL AlienRegistration has FOIA (b)(6) Personal,description of holdoris of date Date of birth November 29, 1944 sex female complexion dark coloropoyes brown colorofhair black height 5 feet inches; weight 130 pounds; visible distenctive,marks none Maritalstatus married Country of formermationality Haiti I certify that the drive, and thatthepholographaffued hereto is alikeness of me. Marie Clime Laorois Complete and true signature of holder) UNITED STATES OF AMERICA SOUTHERN DISTRICT OF FLORIDA } SS: Beilknown, that alatermofthe District The United States Court,of held pursuant, to lawal Miami, Florida on August 1, 1983 the Gourthavingfoundshal Marie Clenie Lacroix then/residing at Miami, Florida intends,loreside, hermanenMyin, the United States when sorequired byshe Naturalization Laws of the United States) had in allother respects, complied with sheapplicable provisions, of such naturalization, laws, and was entilled lobe Seal admilled docitiscenships such herson be and(s)hewas admilled as a cilixen the United States of America. Intestimony whereoft the courtis hereuntoufficed.,the 1st day of August inthenyeurofour Lordnineleenhundredana eighty-three Robert M. March IT IS PUNISHABLE BY U. S. LAW TO COPY, Glerk of the U. S: District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. Deputy Glerk."
  },
  {
    "anumber": "A21293871",
    "id": "A21293871_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21293871_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 12130827"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Vietnam",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1985,
          2023,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Divorce"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1802 E. Gelenoaks BLV. APT. C, GLendale, CA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 8/29/2023 TO BE FORWARDED TO No. 12130827 IMMIGRATION AND NATURALIZATION SERVICE , Pedition No. 531928 DUPLICATE. AlienRegistration No A21 293 871 Personal description, of holderus, of date of naturalization: Date of birth OCTOBER 10, 1915 complexion MEDIUM sexo FEMALE weight115 pounds; visible distructive marks NONE color of hair BLACK height 5 fees 2 inches; Maritalstatus DIVORCE Country of formernationality VI ETNAM I certify that the description above given is here, and that the photograph, affured hereby is AN likeness of me. L Tra / Complete and true signature of holder) SWITED STATES OF AMERICA CENTRAL DIST. OF CALIFORNIA } SS: Be it known that ala term of the District Court of The United States held pursuant to lawal Los Angeles onJUNE 20, 1985 TRAN BICH NGUYEN the Court havingfoundshal then residing ad 1802 E. GELENOAKS BLV. APT. #C, GLENDALE, CA inlends loreside permanently in the United States when sorequired bythe Naturalization Laws of the United States), hadin all other respects complied with the applicable provisions of such naturalization laws, and was entitled to be Seal admitted docilisenship. thereupon ordered that such person be and (s)hewas admilled as a cilixen of the United States of America. Intestimony whereof thesealof the courti's hereunto, afficed this 20 TH day of JUNE in the year of our Lord nineteen hundred and EIGHTY-FIVE ) / LEONARD A, BROSNAN IT IS PUNISHABLE BY U.S. LAW TO COPY, Glenk of the 1. S District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Frank Salodn Deputy Glerk."
  },
  {
    "anumber": "A17896323",
    "id": "A17896323_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Austria"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1892,
          1882
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Widower"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1962
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "N.A"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "JUICE No. A-502560 application no. A17 896 323 DUPLICATE Personal description of holder,as, of date ofissuance of this certificate; Sex Male date of birth January 23, 1882 country of birth Austria ; complexion Fair coloroleyes Brown colory hair Gray ; height 5 feel 12 inches; weight 110 pounds; visible edistinctive/marks None Maritalstatus Widower I certify that the description, above given is brue, and hereto, is a likeness, ofm J. loador Tiras ( Complete and true signature of holder) Beitknown,that ISADOR TIRAS , now residing al 3410 Norris Street, Houston, Texas having appliedstother Commissioner of Immigrationand, citizens shippursuamble Section 341 ofthe thesalisfactionafthe Commission or,What States of America,Became acclinenthereofion March 5, 1892 andismowinthelmiled States: nom Therefore Section 341 of the Immigration and nationality Act, this issued this Ninth Seal day/of June Lordmineleenhundred and Sixty-seven and/hesealofthe Department of IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY, PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Reynond COMMISSIONER OF IMMIGRATION y. Forrell AND NATURALIZATION FORM N-560 (REV 3-1-61) BUREAU O ENGRAVING AND PRINTING,LITHO. STATISTICS"
  },
  {
    "anumber": "A11799647",
    "id": "A11799647_0010",
    "page_index": 10,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A11799647_0010/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, N-550"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Mexico",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1988,
          2023
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "MARRIED"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1988
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "827 S. MARIPOSA"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 5/9/2023 FORM N-550 U. S. DEPARTMENT OF JUSTICE No. 13520608 IMMIGRATION AND NATURALIZATION SERVICE (REV. 5-1-84)Y Name ARANDA, SOCORRO FORMERLY ARANDA, MARIA DEL SOCORRO residing at 827 S. MARIPOSA SIGNATURE OF HOLDER Date of birthos ANGELES, Date CA of order 90005 of admission IS NOT REQUIRED ON THIS 10/22/14 5/24/88 DUPLICATE STUB Date certificate issued MAY 24TH, 1988 by the U.S. District Court at Los Angeles, California DUPLICATE DO NOT DETACH Petition No. 00708845 INS No. A11/799 647 THE D TO BE FORWARDED TO No. 13520608 IMMIGRATION AND NATURALIZATION SERVICE CANE Petition No. 00708845 INP. Registration No. All 799 647 DUPLICATE Personal description of holder as of date of naturalization: Date of birth OCTOBER 22, 1914 sex FEMALE complexion FAIR coloropeyes BROWN color of hair GRAY height 5 feet 0 inches; weight 118 pounds; visible distinctive marks NONE Marital, status MARRIED Country of formerantionality MEXICO I certify that the description above given is have, and that the photograph affixed hereto is a likeness of me. Soerns arinda Complete and true signature of holder) UNITED STATES OF AMERICA } SS: CENTRAL DIST. OF CALIFORNIA Beit known, that al a termofthe District Court of The United States held pursuant to law all Los Angeles on MAY 24TH, 1988 the Gourthaving foundshab SOCORRO ARANDA intends then residing loreside all permanentlyin 827 S MARIPOSA the United. LOS Plates ANGELES, when'sorequired, CA by the Naturalization. Laws of the United. States), had in all other respects, complied with the applicable provisions of such naturalization laws, and was entitled be Seal admitted socilixenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. In testimony whereoft thesealop the courtis hereunto affixed this day of nineteen hundred and 24TH MAY EIGHTY-EIGHT LEONARD A. BROSNAN Clerk of the U.S: District Court. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. By Martha Soled Deputy Clerk."
  },
  {
    "anumber": "A19918776",
    "id": "A19918776_0001",
    "page_index": 1,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19918776_0001/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP, FORM N-560 ( (REV 12-1-69)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Poland"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1910,
          1926
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "N.A"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1926
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "1112 South Atlantic Blvd, Alhambra, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "AUTE No. A628084 CATE los 0184 application No 119 918 776 DUPLICATE Personaldescription ofholderas, of date ofissuance of this certificate; Sex female date of birth December 29, 1910 country of birth Poland ; complexion fair coloroleyes b lue coloryfhair gray : height 5 feel 4 inches: weight 119 pounds; visible distinctive, arks none Maritalstatus wi dow I certify that the description, above given is brue, and hereto, is a likeness of me. Harriet Carol aetman / Complete and true signature of holder) Beil known that ****** HARRIET CAROL ALTMAN **** , now residingal 1121 South Atlantic Blvd. Alhambra, California huningappliedboshe Commissioner of Immigrationand, Section 341/ofthe Immigration handnationality Achhavingprovect.bo thesalisfactionaft he ofthe Uniled States of America.,became acclicenthereofion June 17, 1926 States: nom Therefore in pursuance Section 341,ofthe Immigration and nationality Act this certificate sixth Seal day/of July intheyearsfour Lordmineteenhundred and seventy-two and/heseulofthe Department of Justice affixed, the IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE. Reynond F Farmer ) COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 12-1-69)"
  },
  {
    "anumber": "A10891712",
    "id": "A10891712_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10891712_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "U.S. Naturalization Certificate"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1962,
          1905
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1962
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Clearwater, Florida"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "JUICE CA TO BE FORWARDED TO No. 8348797 IMMIGRATION AND NATURALIZATION SERVICE Petition no. 17,983 DUPLICATE Personal description, of holder's of date, Date of birth December 18, 1905 sex Female ; complexion Fair colorsferies Gray color of hair Lt. brown height 5 feel 6 inches; weight 165 pounds; visible distinctive/marks None Maritalstatus Married Country of formernationality England I certify that the description above given is brue, and that hereto is allikeness of me. Milada antonia Stangee Complete and true signature of holder) UNITED STATES OF AMERICA } SS: MIDDLE DISTRICT OF FLORIDA Beitknown that at a term of the DISTRICT Court,of THE UNITED STATES IN AND FOR THE MIDDLE DISTRICT OF FLORIDA held pursuamblo, lawal TAMPA, FLORIDA on NOVEMBER 16, 1962 the Court havingfoundshal MILADA ANTONIA STANGEL them residing, at CLEARWATER, FLORIDA inlends loveside permanentlyin, the United States when sorequired bythe naturalizeation Laws of he United States), had in all other respects, complied with the applicable provisions, of such naturalizeation laws, and was entitled tobe Seal admitted socilizenship thereupon ordered that such person be and (s)hewas admilled as a citizen of the United States of America. Investimony whereof thesealofthe, courtis hereunto, affixced this 16th day of NOVEMBER in the year of our Lord nineteen hundred and SIXTY-TWO JULZAN A. BLAKE Fisaviolation of the u.S. Code land punishable as such) to copy print, photograph. Gler's of the U. S. DISTRICT Court. or otherwise, illegally use this certificate. By Ketty Clerk. EJSUCE BUREAU ENGRAVING PRINTING.LITHO. 11 and it"
  },
  {
    "anumber": "A10001331",
    "id": "A10001331_0003",
    "page_index": 3,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10001331_0003/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 8050754"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia",
          "United States"
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1961
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "22 Forest Dr, Albany, New York"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Copied at the National Archives at Kansas City CA DUPLICATE TO BE FORWARDED TO No. 8050754 IMMIGRATION AND NATURALIZATION SERVICE Petition No. 17603 Personal description, of holderas, of dateofnaturalization: Date of birth April 23, 1878 sex M ; complexion fair colorsheyes grey color of hair grey height 5 feet 7 inches; weight Marital,status 163 pounds; married visible edistindive/marks wart corner former pationalist left eye ta te less formerly Russia I certify that the description above givenis, New and that hereto, is a likeness of me. here sign Wladmies Fedoworth Love Complete and true signature of holder) State of New York County of Albany } SS: Beik known, that lakatermofthe Supreme Court of New York, Albany County held/pursuantly, lawal Albany, New York on June 15, 1961 the Counthavingfoundshal Wladimir Fedorovich Livin then/residing at 22 Forest Dr Albany New York intends loveside permanenMlyn the United States when sorequired by the Naturalizeation Laws ofthe United States), had in all other respects complied with the applicable provisions of such mahiralization, laws, and was entilled to be Seal admilled socilizenship thereupon ordered that such person be and(s)hewas admilled as a cilizen the United States of America. Investimony the courtis hereunto, afficed this 15th day of June in the year of our Lord nineleen hundred and Sixty-one and of our Independence, the onehundred and Eighty-fifth Dineaded L. Linch Insaviolation of the U.S.Code land Clerk of the Supreme Court. punishable as such) to copy print, photograph, or otherwise illegally use this certificate. By Francle Deputy Clerk. BUREAU ENGRAVING AND PRINTING,LITE"
  },
  {
    "anumber": "A14366479",
    "id": "A14366479_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, FORM N-560 ( (REV 3-1-61)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1914,
          1899
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1965
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "330 West Jersey Street, Elizabeth, New Jersey"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE No. A-508859 application no. A14 366 479 DUPLICATE Personal description of holderas of date of issuanceofi this certificate; Lear male date of birth September 4, 1899. 00000 country of birth Russia ; complexion medim colorofewes brown colorof hair brown ; height 5 feel 8 inches; weight 170 pounds; visible edistindive marks none Maritalstatus married I certify that the description, above givenis brue and that thephotograph, affixed hereto is a likeness of me. Asidor Leonard Karan ( Complete and true signature of holder) Beit known,that ISIDOR LEONARD KARAN , now residing al 330 West Jersey Street, Elizabeth, New Jersey having appliedloshe Commissioner of Immigrationand naturalizationfor acertificateous citizenship Section341 ofthe Immigration andnationality thesalisfuctionofthe Commissioner,19 ofthe United States of America,Became accilizenthereofin September 1, 1914 andismowinthelmited States: dendorLeonard taran nom Therefore insursnance containedin Section 341 of the Immigration and nationality Rol, this certificate soficitizenshipis, issued this 25th Seal day of October instheyearsfour Lordnineleerhundred and sixty-five and/theseal ofthe Department of IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO Reymond 7. Forrell COPY, PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 3-1-61) BUREAU OF ENGRAVING AND PRINTING,LITHO."
  },
  {
    "anumber": "A14366479",
    "id": "A14366479_0016",
    "page_index": 16,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A14366479_0016/full/max/0/default.jpg"
    },
    "fields": {
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, 4 30718"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1011
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "N.A"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1914
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "96 Monroe St."
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "M 492887 Berman like forwarded to the International Washington INDEXED M. Petition Volume 125 Number 30716 Description y holder Ver 45 yours. height 5 feet 7 inches refer white complexion fair color of eyes. gray color of hair brown : visible distinguishing marks none lame age and place of residence of wife Ida (deceased) Names ages an A places of residence of minor children Ieidor 13 yrs. and Aaron 11 yrs. 96 Monros St. STATE OF NEW YORK S.S. famull koran Signature of holder COUNTY OF NEW YORK Mail SAVUEL KARAN / residing at number 96 Monros lind Insin firty of State NEW YORK Triminary of NEW YORK whopmeon naturalization was , subject of RUSSIA having applied lote admitted alizen of the United States of Minerica pursuant blaw and nia SPECIAL form of the SUPREME Court THE STATE OF NEW YORK helderl NEW YORK the let. day of September A in the year four ford nineteen hundred and Fourteen the court having found that the prilioner had insided 1011 timously within the United States for at lears five your and in State for 111 least on providing the / date of theffling his pelition, and thai seriol potitioner intends to want permanently in the United And \" all respects complied with the law in relation therelo, and that he was unlitted to 14 w admitted il was therefor ordered by the said court that he I'v admitted asa citizen of the United liats of Immorian illl the iral of and court \" horrante afford in Melot. day of an tember in the year 11/ em lord ninetirn hundred and Fourteen and of our Independence one hundred and Thirty-ninth. Clark WILLIAM F. SCHNEIDER drwin hwei"
  },
  {
    "anumber": "A10517306",
    "id": "A10517306_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10517306_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "The United States of America, 9352568"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "China",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1971,
          1907,
          2023
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1971
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Castle Court, Boston, Mass. 02118"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA28125/2023 Square TO BE FORWARDED TO No. 9352568 IMMIGRATION AND NATURALIZATION SERVICE 0 a Pelilion No. 378393 AlienRegistration No 306 10 517 DUPLICATE Personal description of holderas, of date of naturalization. Date of birth Feb. 24, 1907 male complexion, medium coloropowes brown color of hair grey height 5 feel see inches; ; weight 130 pounds; visible distinctive marks none Maritalstatus married Country of formernationality China I certify that the description, above given istrueandMhalthephotographaffived hereto is a likeness of me. Tak / Choonp see Complete and true signature of holder) UNITED STATES OF AMERICA SS: DISTRICT OF MASSACHUSETTS Beit known, that al a termofthe District Court of The United States held pursuant, to law al Boston on April 12, 1971 the Gourthaving foundshal Tak Cheong Lee then residing at 10-C Castle Court, Boston, Mass. 02118 inlands loreside permanently in the United States when sorequired by the Naturalization, Laws of he United. States), had in her respects, complied with the applicable provisions of such naturalization laws, and was entitled to be Seal admilled locitisenships thereuponordered that such person be and (s)hewas admilled as a citizen of the United States of America. Indestignonywhere of thesealofthe courtis hereunto affixed this 12th day of April Seventy-one in the year of our. Lord nineleen hundred and . RUSSELL H. PECK IT IS PUNISHABLE BY U. S. LAW TO COPY, Clerk of the U.S. District Court. PRINT OR PHOTOGRAPH THIS CERTIFICATE. By San Jeanner Deputy Clerk."
  },
  {
    "anumber": "A10139321",
    "id": "A10139321_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10139321_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, Form N-560 ( (REV. 5-25-55)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States",
          "Lithuania"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1904
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1915
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Newark, New Jersey"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Form N-560 (REV. 5-25-55) CA No. A-356417 application no. A10 139 321 DUPLICATE Personaldesoviption of holderas, of date cofissuanceof his, certificate; Sex female date of birth October 17,1904 country of birth Lithuania ; complexion dark coloroleyes brown colorofhair gray-brown, height 5 feel 2 . inches; weight 150 pounds; visibledistinclivearks pock mark on right side of chin Maritalstatus married I certify that the description, above given is brue and that hereto, is a likeness of me Gune Sreener Freedlander ( Complete and true signature of holder) Peinknown, that ANNE WIENER FRIEDLANDER , now residingial 35 Eckert Avenue, Newark, New Jersey having applied.loshe Commissioner of Immigration,and Section 341 ofthe Immigration, and nationality Achhavingproved.lo Commissioner,Health helmited States of America.,became July 7, 1915 andismowinthel United States: nom Therefore Section 341,of the Immigration and nationality Act, this certificate 8th Seal day/of March in the year) of our . and fifty-seven ,and of our Independence,the onehundrechand eighty-first , and/shesealopshe Department IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. COMMISSIONER OF IMMIGRATION AND NATURALIZATION DEPA BUREAU OF ENCRAYING AND PRINTING,LITHO."
  },
  {
    "anumber": "A73919171",
    "id": "A73919171_0017",
    "page_index": 17,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A73919171_0017/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Naturalization Certificate, FORM N-550 REV. 6-91"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1993,
          2023,
          1939
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "N.A"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1993
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Phoenix, Arizona"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Screened by NARA, 7/7/2023 R No. 20349878 Personal description of holder NS RegistrationNo. FOIA (b)(6) as of date of naturalization: I certify that the description given is true, and that the photograph affixced Date of birth: October 11, , 1939 hereto is a likeness of me. Sex: Male Lecis a alber to Illegion a Roncero Height: 5 feet 07 inches Complete and true signature of holder) Marital status: Married Be it known that, pursuant to an application filed with the Attorney General Country of former nationality: at: PHOENIX , ARIZONA E1 Salvador The Attorney General having found that: Luis Alberto Mejia Romero then residing in the United States, intends to reside in the United States when so by the Naturalization Laws of the United States, and had in all other complied with the applicable provisions of such naturalization laws and was entitled to be admitted to citizenship, such person having taken the oath of allegiance in a ceremony conducted by the IMMIGRATION & NATURALIZATION SERVICE . at: PHOENIX , ARIZONA on: FEBRUARY 05 , 1993 that such person is admitt ed as a citizen of the United States of America. IT IS PUNISHABLE BY U. S. LAW TO COPY, PRINT OR PHOTOGRAPH THIS CERTIFICATE, bitt Ame Wyam WITHOUT LAWFUL AUTHORITY. FOR THE Commissioner of Immigration and Naturalization FORM N.550 REV. 6-91"
  },
  {
    "anumber": "A12596514",
    "id": "A12596514_0003",
    "page_index": 3,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12596514_0003/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, Form N-560 ( (REV. 10-1-56)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Lithuania"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1895,
          1918
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Divorced"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1918
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Hatteras Street, North Hollywood, California"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Form N-560 (REV. 10-1-56) THE No. A-383614 CATE OR application no. 198-7 A12 596 514 DUPLICATE Personal/description of holderas of date refissuance of this certificate; Lex Female date of birth December 20, 1895 country of birth Lithuania complexion Medium coloroleyes Brown colorof hair Grey ; height 5 feel 5 inches; weight 160 pounds; visibledisinctivemarks None Maritalstatus Divorced I certify that the description above given is brue, and that hephotography affixed hereto is a likeness of me. hose Flutman ( Complete and true signature of holder) Beit known that ROSE FLEETMAN now residingal 11227 Hatteras Street, North Hollywood, California having applieds the Commissioner of cilizenship pursuantio Section. 341/of the Immigration and nationality Ochavingproved.lo thesalisfactionalshe Commissioner,that cacilizen ofthe United States of America,became acclinenthereofin May 10, 1918 andisnewinthelmiled States: nom Therefore Section 341,ofthe Immigration and nationality Act, this certificate Seventh Seal day/of June in the year,of our Londnineleonhundred and Sixty-one ,and of our Independence the onehundredsand Eighty-fifth and thesealofthe Department STATISTICS of Justice,affixed IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. COMMISSIONER tedury"
  },
  {
    "anumber": "A12468555",
    "id": "A12468555_0002",
    "page_index": 2,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12468555_0002/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, Form N-560 ( (REV. 10-1-56)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Canada"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1904
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "medium"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1985
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "2224 S.E. 42nd Avenue, Portland, Oregon"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "Form N-560 (REV. 10-1-56) No. AA-144479 CATE SHOOP application No. A-12 468 555 DUPLICATE Personal description of holder as of date Poofissuanceoff this certificate: Lex Female date of birthmarch 5, 1904 ; country of birth Canada complexion Medium coloroloyes Brown Black-Gray height 5 feet 2 inches; weight 118 pounds; visible distinctive marks None Maritalstatus Married I certify that the description, above given is drue, and that photograph, affixed hereto is a likeness of me. Margari ( Complete Procenture and true signature of holder) Beil known. that -MARGARET PIACENTINI- , now residingal 2224 S.E. 42nd Avenue, Portland, Oregon having appliedstophe Commissioners of cilizenship pursuantios Section 341 ofthe Immigration, an ednationality Achhavingproved.be thesatisfactionalthe deisnow,accitizen, States of America.,became March 5, 1904 States: Now Therefore infursuance Section 341 ofthe Immigration and nationality Col, this certificate tedthis Fifth Seal day/of June in the yearofour and Sixty-one and of our Independence.the onehundredcand Eighty-fif th and theseal of the Department of Justice afficed hursuantle statute. IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Insuring COMMISSIONER DECSUCE"
  },
  {
    "anumber": "A13995582",
    "id": "A13995582_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13995582_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "Certificate of Citizenship, FORM N-560 ( (REV 3-1-61)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1903,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "dark"
        },
        "marital_status": {
          "marital_status_llm_v1": "married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1915
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "Philadelphia, Pennsylvania"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE CA No. A-499125 application no. A13 3 995 582 DUPLICATE Personaldescription of holderas, of date ofissuance of this certificate; Lex male date of birth June 3, 1903 ; country of birth Russia complexion dark colorobeyes brown grey height 5 feel 8 ; inches: weight 210 pounds; visibledisinclivemark none Maritalstatus married I certify that the description above given is brue. and that the ephotograph h affixed hereto is a likeness of Herman Set / Complete and true signature of holder) Beitknown that HERMAN GETZ now residing, 1429 E. Eleanor Street, Philadelphia, Pennsy Ivania , having applied.othe Commissioner of Immigrationand, naturalizationform acertificateof cilizens hippursuantic Section. 341/ofthe Immigration an ednationality Achhavingproved.lo thesalis of helmiled States of America.,Became acilizenthereofion --April 27, 1915-- andismovintholmiled States: Now Therefore infoursuana ofthe eauthorihy, containedin Section 341 of the Immigration and nationality Act this certificate esoficilizenshipis, iss needthis 10th day of November Seal in theyearofour Lordmineteen hundred and sixty-four and/hesealofthe Department of statute. I IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY, PRINT. PHOTOGRAPH, OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Rayound F. Farrell COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 3-1-61)"
  },
  {
    "anumber": "A12315057",
    "id": "A12315057_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12315057_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "female"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1906,
          1915
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1915
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "82 Paulison Ave, Passaic, New Jersey"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "TOTO CA No. A-414834 application No. A12 315 057 DUPLICATE Personaldescription of holder's of date refissuance of this certificate; Lex Female date of birthSeptember 23, 1906 country of birth Russia complexion Fair colorofeyes Blue :colorxfhair Grey ; height 5 feel 0 inches; weight 150 pounds; visible edistinctive marks None Maritalstatus Marri ed I certify that the description, above given is brue, and that the photograph affixed heretois a likeness of me. Eva Miller Complete and true signature of holder) Beit known,that EVA MILLER*** , now residingal 82 Paulison Ave. , Passaic, New Jersey having cappliedson he Commissioner of Immigrationandnaturaluzation for vacertificated cilizenship Section 341 ofthe Immigration an dnationality Commission or,What ofthe United States of America.,Became acilizer Whereofon November 17, 1915 andismowinthe United States: Era miller nom Therefore in Section 341 of the Immigration and nationality Act, this certificate 1st Seal day/of August intheyearspour's Londmineleenhundred and Sixty One ,and of our Independencethe onehundredund Eighty Sixth , and theseal ofthe Department of IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 10-15-57)"
  },
  {
    "anumber": "A13490102",
    "id": "A13490102_0000",
    "page_index": 0,
    "resources": {
      "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13490102_0000/full/max/0/default.jpg"
    },
    "fields": {
      "sex": {
        "ms_sex_llm_v1": "male"
      },
      "doctype": {
        "ms_doctype_v1": "letter"
      },
      "form_title": {
        "ms_form_title_llm_v1": "CERTIFICATE OF CITIZENSHIP, FORM N-560 ( (REV 10-15-57)"
      },
      "countries": {
        "ms_countries_nlp_v1": [
          "Russia",
          "United States"
        ]
      },
      "years": {
        "ms_years_nlp_v1": [
          1913,
          1900
        ]
      },
      "certificate_naturalization": {
        "complexion": {
          "complexion_llm_v1": "fair"
        },
        "marital_status": {
          "marital_status_llm_v1": "Married"
        },
        "year_naturalization": {
          "year_naturalization_llm_v1": 1915
        },
        "residence_naturlization": {
          "residence_naturlization_llm_v1": "826 South 52nd St., Omaha, Nebraska"
        }
      }
    },
    "is_g325a": false,
    "is_cert_naturalization": true,
    "full_text": "THE CA No. A-398003 CANER Application No. 13 490 102 DUPLICATE Personaldescription ofholderas of date ofissuanceof his certificate: Lear male date of birth April 21, 1900 ; country of birth Russia ; complexion fair coloroleyes blue colorofhair grey ; height 5 feel 10 inches; weight 175 pounds; visibledistinctivemarks none Maritalstatus married I certify that the description above given is break and thatthe photography affixed hereto, is a likeness of me. Jack Meleher / Complete and true signature of holder) Beil known that JACK MELCHER , now residingal 826 South 52nd St., Omaha, Nebraska having appliedstophe Commissioner of Immigrationand', naturalization.for racertificateof Section 341/of the Immigration, candnationality Achhavingproved.lo thesalisfactionalshe Commissioner,that heisnow-unitizen, of the United States of America.,became acilizenthereofin Dec. 11, 1913 andismowinthe United States: note Therefore infursuance ofthe eauthority, containeding Section 341,of the Immigration and nationality Rol, this certificate 10th Seal day/of April insheyearofour Londmineteenhundred and Sixty four ,and ofour Independence.the onehundredund Eighty eighth and theseal ofthe Department of Justice afficed chursuant dostable. IT IS A VIOLATION OF THE U. S. CODE (AND PUNISHABLE AS SUCH) TO COPY. PRINT. PHOTOGRAPH. OR OTHERWISE ILLEGALLY USE THIS CERTIFICATE. Raymond F Forrell COMMISSIONER OF IMMIGRATION AND NATURALIZATION FORM N-560 (REV 10-15-57)"
  }
]